[
 {
  "text": "To study the influence of mechanical forces on gene expression by changing nuclear mechanics and epigenetics with applications in cancer, stem cells, and immune responses. To identify and to understand the niche factors that govern stem cells fate, and drive them towards osteoblastic and/or chondrogenic lineages for tissue repair. To study ion channels in reproductive, airway and bone health and diseases, and in particular the development of ion channels into molecular targets for biomedical engineering approaches in the diagnosis/treatment of related human diseases. To develop microscale and nanoscale technologies with the ultimate goal of generating tissue-engineered organs and controlling cell behaviors for addressing clinical problems. To develop nanoparticle based theranostics (therapeutic diagnostics) capable of imaging, drug delivery and monitoring the therapeutic responses in single platform, enabling targeted cancer therapy and stem cell tracking. \nFaculty members in this research area:\nDr Chunyi WEN\nDr Youhua TAN\nDr. Dexter Siu Hong WONG\nDr. Sharon Y.C. RUAN\nDr. Xin ZHAO\nProf Mo YANG",
  "url": "https://www.polyu.edu.hk/bme/research/research-themes/molecular-and-cellular-engineering"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \nResearch \nResearch Themes \nNeuromusculoskeletal Science and Engineering \nTheme Co-ordinator\nIr Prof Ming Zhang\nThis research area encompasses various underpinning clinical and engineering sciences related to the neuromusculoskeletal (NMS) system. The scope covers the molecular understanding of the pathologies associated with the NMS system and health protection against those disease and disabling processes; laboratory, imaging and functional assessment of the NMS system; acute and long-term therapeutics for NMS disorders; assistive technologies for rehabilitation and enablement. A major focus of this thematic area is to help develop healthcare technology that will support NMS health in the community.\nThe following BME centre is directly associated with this theme:\nJockey Club Rehabilitation Engineering Center\nThis research grouping has long-time collaboration with a number of world-class programmes overseas as well as with the two medical faculties in the universities of Hong Kong.\nFaculty members in this research area:\nDr Annie Yan WANG\nDr Christina Zong-Hao Ma\nDr Duo Wai-Chi WONG\nDr Man Sang Wong\nDr Monzurul Alam\nDr Toshiki Kobayashi\nDr Xiaoling Hu\nIr Prof Ming Zhang\nIr Prof Yong Ping Zheng\n",
  "url": "https://www.polyu.edu.hk/bme/research/research-themes/neuromusculoskeletal-science-and-engineering"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \nResearch \nResearch Themes \nProsthetics Orthotics and Rehabilitation Engineering \nTheme Co-ordinator \nDr. Man-sang WONG\nProsthetics and orthotics aim to improve the condition or function of people with disabilities, thus to enhance their quality of life. The scope covers design of prosthetic components and interfaces, control of prostheses, smart orthotic devices, management of foot problems, stroke, cerebral palsy, scoliosis and other spinal deformities, outcome measures of prosthetic and orthotic interventions, CAD-CAM application, evidence-based practice, and other engineering or clinical aspects of prosthetics and orthotics.\nRehabilitation engineering applies existing or emerging technologies for improving the independence and productivity of persons with disabilities. The Jockey Club Rehabilitation Engineering Centre has offered direct expert services to the disabled and rehabilitation communities since 1987. Many research projects have been developed, namely environmental control and monitoring systems, special seating and mobility devices, augmentative and alternative communication devices, therapeutic training systems and robotic devices.\nThis research team has long-term collaboration with local and international renowned research teams. \nFaculty members in this research area:\nDr Christina Zong-Hao MA\nDr Duo Wai-Chi WONG\nDr Man Sang WONG\nDr Monzurul ALAM\nDr Toshiki KOBAYASHI\nDr Xiaoling HU\nIr Prof Ming ZHANG\n",
  "url": "https://www.polyu.edu.hk/bme/research/research-themes/prosthetics-orthotics-and-rehabilitation-engineering"
 },
 {
  "text": "Home \nResearch \nImpactful Knowledge Transfer \nBased on BME innovative research and development, we have successfully transferred a number of technologies to industry for commercialization. Following are some examples. \n3D Ultrasound Imaging for Spine Scoliosis PolyU researchers developed a novel, radiation-free system for scoliosis evaluation. With this advanced 3D ultrasound imaging technology, 3D scan of the spine can be obtained as often as required. Timely intervention becomes possible and doctors can personalize treatment \nRehabilitation Sleeve A wearable Functional Electrical Stimulation robotic system for arm rehabilitation after stroke\nIntegrated iWheelchair System PolyU's applied research project ‘iWheelchair’ enables wheelchair users to be more independent in their daily activities and to enjoy a better quality of life.",
  "url": "https://www.polyu.edu.hk/bme/research/impactful-knowledge-transfer"
 },
 {
  "text": "Research \nResearch Laboratory and Facilities \nBiomedical Engineering Laboratories\nCell Biology & Physiology Laboratory (Y413, Y413a, Y414)\nLaboratory Facilities\nCombined Electrophysiology and Fluorometric Imaging System\nMolecular & Cellular Engineering Laboratory (Y503)\nLaboratory Facilitie\nAutoclave\nUltrapure Water Purification System\nGels and Western Blots Imaging and Analyzing System\nReal-Time PCR Detection System\nFluorescence Microscopy Imaging System\nBiological Cell Culture Laboratory (Y503a)\nLaboratory Facilities \nCell Culture Facilities: Class II \nBiological Safety Cabinet \nCO2 incubators\nCentrifuge\nMicorscope \nMechanobiology Laboratory (Y503b)\nLaboratory Facilities\nBruker Atomic Force Microscopy System (AFM)\nFluorescence Resonance Engery Transfer (FRET) \nMicroscopy Imaging System\nHarvard Peristaltic Pump-based Circulatory System \nTissue Engineering and Regenerative Medicine Laboratory (Y504)\nLaboratory Facilities\nLAZR ultrasound and photoacoustic micro-imaging for small animals\nLeica histology platform\nOLYMPUS BX51WI microscope \nSmall Animal Research Laboratory (Y505)\nLaboratory Facilities\nUltrasound Stimulation Platform (Olympus LIFU and Sonic Concepts HIFU transducer with 500 watt power amplifier).\nElectrophysiological Monitoring System (AM System amplifier and CED Data acquisition system).\nFaradays cage for in vivo study.\nBiosafety cabinet for in vitro study.\nGas machine for small animal anesthesia.\nStereotaxic frame and thermal pad for small animal surgery. \nBiomaterials Laboratory (Y506)\nSUNP CPD1 bioprinter\nNikon ECLIPSE Ts2R-FL fluorescence microscope\nMutli-collector electrospining platform\nIntegrated microfluidic system \nBiomechanics Laboratory (ST405)\nAMTI force platforms\nKistler force platform\n8-camera Vicon MX motion analysis system\nGalileo sports vibration platform\nFscan pressure measurement systems\nBodiTrak sitting pressure mapping system\nSoftware for computational model \nHuman Locomotion Laboratory (ST414)\nVicon 370 3-dimensional motion analysis system\nAMTI force plates for gait analysis\nBTS-TELEMG multichannel electro-myographic system \nBiomedical Ultrasound & Bioinstrumentation II & IV (S103 & S109)\nOLYMPUS Microscope\nHamamatsu sCMOS\nOptical Platform\nShumi Optogenetics toolkits\nMultichannel system MEA\nData Analysis workstation\nDigital Oscilloscope\nFunction Generator\nE&I Power amplifier\nStep Motor and Motion control\nDC Power supply\nSmall Animal Locator\nRWD Life Science 77001 Desktop Binocular Stereo Microscope\nLIFE TECHNOLOGIES PowerEase 300W electrophoresis power pack\nLIFE TECHNOLOGIES PowerEase Mini Gel Tank (x 2)\nKylin-Bell GL-150B Dry Thermostat heat block\nJenway 3510 pH meter\nNuaire CO2 incubator\nC. elegans refrigerated incubator\nLNB Instruments PGX-18A Light incubator\nHaier Biomedical pharmaceutical refrigerator\nHaier Biomedical deep freezer\nZenith Lab DHG-9070A Drying oven\nD&T ES500 analytical balance\nAdam Equipment NBL 214e Analytical Balance\nDynamica Velocity 13µ minifuge\nPingfan Instrument TDZ5-WS Low-speed swinging bucket centrifuge\nHermle Z 216 MK Refrigerated microcentrifuge\nDLAB MX-S Vortexer\nLabnet C1200 Microcentrifuge\nHERMLE Microcentrifuge\nFroilabo EM130 Magnetic hotplate stirrer\nKylin-Bell TS-200 Orbital Shaker \nTssue Biomechanics Testing Laboratory (S106)\nBiaxial testing machine (MTS, load cell: 5, 2.5 k, and 10 kN)\nUniaxial testing machine (Hounsfield, load cell: 100, 1 k, and 10 kN) \nMicro-device and Biosensor Laboratory (S106a)\nVersaSTAT3 electrochemical analyzer\nNikon FN1 multipatch upright focusing nosepiece microscope system\nHEKA Elektronik patch clamp amplifier\nHarrick PDC-32G-2 plasma cleaner\nClass 1000 clean hood\nMemmert heating oven \nNanobiotechnology Laboratory (S106b)\nAnalytical balance\nElectrochemical analyzer\nFume hood\nHeating mantle\nHot plate (with and without magnetic stirrer)\nMicrocentrifuge\nParticle size and zeta potential analyzer\npH meter\nRefrigerators and freezers\nThermomixer\nUltrasonic cleaner\nUV/visible spectrophotometer\nVortex mixer \nBiomedical Ultrasound & Bioinstrumentation III (S107)\nSupersonic ultrasound shear wave elastography\nNeuro monitoring system (TCD + EEG)\nIntegrated 3D TCD, finometer, and gas analyser system\nScolioscan system\nEUB-8500 (Hitachi)\n3D guidance electromagnetic tracking system(NDI)\nMulti-channel physiological signal acquisition and processing system (Chengdu Instrument Factory)\nHumac norm testing and rehabilitation system (Computer Sports Medicine)\nSoft tissue palpation ultrasound system (TPUS)\nNeurorehabilitation & Neural Engineering Laboratory (S107a)\nRehabilitation Sleeves\nIntention-driven robotic hands with functional electrical stimulation (FES-robots)\nIntention-driven robotic hands\nBrain training device\nEMG-driven multi-joint robotic rehabilitation system (PolyJbot)\nG.Tec EEG amplification system\nMagstim 200 transcranial magnetic stimulation system\nOxymon – Artinis Medical Systems for near-infrared spectroscopy\nDNI Nevada DS6100 patient simulator for ECG simulation\nBiomedical Ultrasound and Bioinstrumentation I (S108)\nS108-small-1 Laboratory Facilities\nVerasonics Ventage 128 Ultrasound System\nLinear translation motors and rotation motors (Newport)\nUltrasound intensity measurement system\nAQUAS water conditioner\nOptical coherence tomography (OCT) development platform\nOptical Table\nUltrasonix Touch (Analogic Corporation)\nUltrasonix RP (Analogic Corporation)\nApogee 1200 (SIUI)\nOscilloscope (Tektronix)\nFunction generator (Tektronix)\nMeasurement exciter (Brüel & Kjær)\nPower amplifier (Brüel & Kjær)\nUltrasound pulser receiver \nBiomedical Ultrasound & Bioinstrumentation I (S108)\nVerasonics Ventage 128 Ultrasound System\nLinear translation motors and rotation motors (Newport)\nUltrasound intensity measurement system\nAQUAS water conditioner\nOptical coherence tomography (OCT) development platform\nOptical Table\nUltrasonix Touch (Analogic Corporation)\nUltrasonix RP (Analogic Corporation)\nApogee 1200 (SIUI)\nOscilloscope (Tektronix)\nFunction generator (Tektronix)\nMeasurement exciter (Brüel & Kjær)\nPower amplifier (Brüel & Kjær)\nUltrasound pulser receiver \nBiophotonics Laboratory (S108a)\nBiomedical Engineering Teaching Laboratory (GH198)\nUltrasonic cleaner\nPowerLab systems (ADInstrument)\nTektronix oscilloscope\nSignal generator\nTopward DC power supply\nNI USB data acquisition card\nSoldering tools\nDesktop PC with software\nNI LabVIEW academic site license\nMATLAB teaching license\nMS Visual Studio\n8051 MCU development tool\nArdunio development tool\nAndroid development tool \nP&O Laboratories (GH041c, GH044, GH044a, GH046)\nProsthetic and Orthotic Scanner: Spectra™ Handheld Optical Scanner (Vorum)\nProsthetic and Orthotic Scanner: Structure Sensor (Occipital, Inc.)\nUltrasonix SonixTablet Ultrasound Machine (Providian Medical Equipment)\nGerontechnology Laboratory(S102)\niBalanx smart insole system to improve balance and prevent falls. ",
  "url": "https://www.polyu.edu.hk/bme/research/research-laboratory-and-facilities"
 },
 {
  "text": "Aim\nJockey Club Rehabilitation Engineering Clinic (JCREClinic) is one of the clinics available at The Hong Kong Polytechnic University. This clinic is able to draw on the University’s immense expertise and advanced facilities to address the needs of the client and the community. It aims to provide holistic clinical services for clients who need prostheses, orthoses (including custom-made orthopaedic insoles), functional electrical stimulation and robotic rehabilitation training, assistive technologies (including special seating and mobility, computer access, augmentative and alternative communication) and spinal deformity assessment (using Scolioscan: radiation-free 3D ultrasound scoliosis assessment system). The clinic also provides specialist consultation and information resources to the community. In addition, the clinic also offers education and training for biomedical engineering students of The Hong Kong Polytechnic University.\nService Team\nExperienced Prosthetist-Orthotists (P&O) and Biomedical / Rehabilitation Engineers will serve the clinic. The P&O are trained in the use of modern procedures, high-tech, space age components and clinical outcomes. The Biomedical / Rehabilitation Engineers are experienced in applying the latest rehabilitation engineering technology to solve a wide range of problems facing individuals with disability. The team is dedicated to provide high quality client-centered services.\nAppointment Arrangement\nAll consultations are by appointment only.\nPlease note that the waiting time for appointments for prosthetics and orthotics consultations and services is now about two weeks.\nAppointment can be made via phone, email and whatsapp message.\nService Hours\nDate\tTime\t\nTuesday to Friday\t10:00am – 1:00pm and 2:00pm – 6:00pm\t\nSaturday \t10:00am – 2:00pm \t\nMap and Address\nRoom GH041, The Hong Kong Polytechnic University, Hung Hom, Kowloon\nWebsite\nhttps://www.polyu.edu.hk/jcreclinic\nEnquiry / Appointment:",
  "url": "https://www.polyu.edu.hk/bme/services/jockey-club-rehabilitation-engineering-clinic"
 },
 {
  "text": "Services \nTo apply BME colleagues’ professional knowledge and innovative development to serve the community is one of the missions of BME. Service has been embedded into BME team since it was originated in Jockey Club Rehabilitation Engineering Centre (REC) in 1987. Currently, REC hosts two service units to serve clients in rehabilitation engineering and smart ageing technology:\nJockey Club Rehabilitation Engineering Clinic\nJockey Club Smart Ageing Hub\nIn addition to serving clients from the community, REC and its two service units have also been providing Service Learning opportunities to all PolyU students via the Service Learning Subject “BME3S02 Assistive Technologies: Service Learning towards the Elderly and Disabled”.\nJockey Club Rehabilitation Engineering Clinic\nJockey Club Smart Ageing Hub",
  "url": "https://www.polyu.edu.hk/bme/services"
 },
 {
  "text": "2023年度中国发明协会发明创业奖·创新奖公示\n2023年度中国发明协会发明创业奖·创新奖公示 一、项目名称 Scolioscan: 基于三维超声成像的无辐射脊柱侧弯评估系统 二、完成人 1.郑永平教授（香港理工大学） 2.张忠伟博士（香港理工大学） 3.李天昕博士（香港理工大学） 4.周光泉博士（香港理工大学） 5.姜娓娓博士（香港理工大学）… \nCongratulations to Prof. Mo Yang and Dr. Thomas Lee for winning Gold Medals at the 48th Geneva Inventions Expo\nWith the real thrill of acknowledgement, we would like to congratulate Prof. Mo Yang (Associate Head (Research) and Professor) and Dr. Thomas Lee (Associate Head (Academic), Associate… \nAnnouncing the 2022 winner of the President's Award for Outstanding Achievement\nIt is with great pride to announce Dr. Thomas Lee, the Associate Professor and Associate Head (Academic), as the recipient of the 2022 President’s Award for Excellent Performance and… \nAppointment of Chair Professor of Cell Engineering and ImmunoMedicine in the Department of Biomedical Engineering and Associate Vice President (Mainland Research Advancement)\nHKMDHIA Visit\nHong Kong Medical and Healthcare Device Industries Association (HKMDHIA) visited the Department on 31 March. During the visit, the participants have gained a deeper understanding of academic… \nCall for Nomination: Outstanding Alumni Award of PolyU Department of Biomedical Engineering 2023\nThe Department of Biomedical Engineering (BME) is now calling for nominations for the Outstanding Alumni Award of PolyU Department of Biomedical Engineering until 15 March 2023 (Wednesday)… \nThe President’s Awards for Outstanding Achievement 2022\nPolyU is committed to the enhancement of teaching and research, and values faculty members’ contributions and achievements in teaching and research. Every year the University pays tribute to… \nPolyU BME Alumni Homecoming Day 2022\n“PolyU BME Alumni Homecoming Day 2022”, the reunion for all BME alumni, was held on 19 November 2022(Saturday). More than 250 alumni, their family members, and friends joined and… \nThe HKIE Scholarship 201920\nMiss TONG Cheuk Ying (18058385D) was selected by the Donor to receive the above Scholarship. Here is the video to illustrate her involvement in the HKIE activities in the past year. \nSpeckle-Based Optical Cryptosystem and its Application for Human Face Recognition via Deep Learning from Dr. Puxiang Lai\nPublication information： Speckle-Based Optical Cryptosystem and its Application for Human Face Recognition via Deep Learning Qi Zhao, Huanhao Li, Zhipeng Yu, Chi Man Woo, Tianting Zhong…",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news"
 },
 {
  "text": "News and Events \nEvents \nUpcoming Events\n\t\t\nToday\nConference / Lecture\nCeremony\nShowcase\nOthers\nNo results have been found.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/events"
 },
 {
  "text": "Faculties, Schools & Department \nKeywords \nAnnouncing the 2022 winner of the President’s Award for Outstanding Achievement\n31 May, 2023\nDepartment of Biomedical Engineering \nLast day as your Student Editor\nMy goodbye message to all of you\n13 Jan, 2022\nDepartment of Biomedical Engineering \nProf Yongping Zheng shares the journey in BME\nMeruyert AMANGELDY (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering) and Aliya TUMANBAYEVA (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)\n28 Oct, 2021\nDepartment of Biomedical Engineering \nProsthetics and Orthotics department’s ins and outs by BME alumni Mr. Webber Choi\nCheck out new alumni interview with Mr.Webber Choi and obtain many insights about P&O field in real life settings! Mr. Choi has also shared his university and first work experience challenges, his… \n7 Jul, 2021\nDepartment of Biomedical Engineering \nAdapting and evolving as a sales and marketing manager\n“Learning agility and adaptability are very important. The society changes rapidly, and to a large extent. Many jobs have appeared and disappeared over a course of 5 years.” In this rapidly changing… \n22 Jun, 2021\nWhat is Biomedical Engineering and why you should apply to it?\nEmphasis on training practical skills among the students is one of the distinctive features of Biomedical Engineering at PolyU.Check out some of the freshman year activities aimed at… \n3 Jun, 2021\nThe Road to Becoming a Quality Assurance Manager\nAs a quality assurance manager, one must ensure that they are able to respond and resolve any product complaints as fast as they can. In this interview, we spoke with PolyU BME alumni Mr… \n18 May, 2021\nHow important are the “five things\" to do during university life?\nOne of the first things you hear about university are the five things to do during university life. However, why exactly are they so significant to our lives?\n7 Apr, 2021\nWhat does it mean to learn at PolyU BME? — An Interview with Dr Hin Chung LAU\nThrough conducting an interview with Dr. Hin Chung LAU, our Programme Leader (BSc in BME) here at PolyU BME, we learn how he envisions to nurture his students to transition from solely focusing… \n18 Feb, 2021\n2020 Outstanding Student Award of Department\nWe are glad to announce that our final year student, Mr. YOU Hengze has been awarded the “2020 Outstanding Student Award of Department” for his excellent academic and non-academic… \n10 Feb, 2021\nDepartment of Biomedical Engineering",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories"
 },
 {
  "text": "BME at PolyU\n\nStemmed from the “Biomedical Engineering Programme” within Jockey Club Rehabilitation Engineering Centre (JCREC) founded in 1987, the Department of Biomedical Engineering at The Hong Kong Polytechnic University (BME at PolyU) was established in 2012 with its vision to be world-class in the advancement of biomedical engineering education, research, and professional services for the betterment of human health.\nDeveloped from the original focus on prosthetics and orthotics, BME at PolyU now covers a convergence of diverse disciplines within biology, medicine, and engineering, including medical imaging, biosensing, molecular and cellular engineering, neuromusculoskeletal science, prosthetics and orthotics, and rehabilitation. Being the first-in-Hong Kong, the BME undergraduate programme has been accredited by the Hong Kong Institution of Engineers (HKIE) and by the International Society of Prosthetics and Orthotics (ISPO) for the P&O stream. In addition, the Department offers taught postgraduate programme (MSc) as well as research programmes (MPhil and PhD).",
  "url": "https://www.polyu.edu.hk/bme/about-bme/message-from-department"
 },
 {
  "text": "About BME \nVision and Mission \nMission & Objective\nThrough education, research, and professional services, the departmental mission is to\nNurture future leaders in prosthetics and orthotics, clinical engineering, medical instrumentation and sensors, and biological engineering by imparting interdisciplinary knowledge, innovative ideas, critical thinking and practical skills;\nAdvance knowledge in the prevention, diagnosis, monitoring, treatment, and rehabilitation of medical conditions and in promoting healthy and active aging through interdisciplinary research and technology transfer;\nEnhance the quality of life for people with impairment or special needs by offering user-focused services in assistive technology, rehabilitation engineering, prosthetics and orthotics, and smart ageing.",
  "url": "https://www.polyu.edu.hk/bme/about-bme/vision-and-mission"
 },
 {
  "text": "Announcing our new logo and look!\nBig news! We’re releasing a brand identity, which includes a new logo. You’ll see the new look anywhere we’re out in public, like our website and promotional materials. We believe the new look better matches what we’ve become since 2012 under the Faculty of Engineering: Biomedical Engineering, subsuming Prosthetic sand Orthotics (P&O) is integral facet of modern medicine, healthcare and engineering.\nThe Department of Biomedical Engineering under the Faculty of Engineering was established on 1 April 2012 (formerly named as Interdisciplinary Division of Biomedical Engineering before 1 October 2017). As an academic division/department in a fully-fledged university, BME exists to advance knowledge and nurture minds, for innovations that will benefit our community,both local and global, and for the development of BME and P&O professions.\nOur design goal was to better match how we look to our values. The concept behind the design is to link Engineering to Biomedicine.\nLetter B (Biology) is combined with a gear (Engineering)\nLetter M (Medicine) is in shape of a wrench (Engineering) with two snakes (Medicine) /DNA double helix (Biology).\nLetter E (Engineering) is in shape of a leaf (Life/Biology)\nWe hope you like this new look and feel for Department of Biomedical Engineering! Look out for more updates on our research development and study experiences.",
  "url": "https://www.polyu.edu.hk/bme/about-bme/our-logo"
 },
 {
  "text": "It is with great pride to announce Dr. Thomas Lee, the Associate Professor and Associate Head (Academic), as the recipient of the 2022 President’s Award for Excellent Performance and Achievement in Teaching. The Award was presented during the PolyU Appreciation Dinner on 25 April 2023.\nDr Lee has taught at PolyU for 17 years and places the learning experiences of students as his top priority. He has devoted great effort to student engagement. One example is his development of the Gongyeh e-platform to help students improve their presentation skills through peer feedback. He is the facilitator of the Community of Practice on Student-Staff Partnership from 2023 to 2025, and hopes that this initiative will enable colleagues to collaborate and learn from one another.\nPlease join me in celebrating the extraordinary efforts to Dr. Lee!",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/announcing-the-2022-winner-of-the-president-award-for-outstanding-achievement/"
 },
 {
  "text": "Our goals are to strengthen the valuable bonds between the department and its alumni, friends and donors, and to rally their support and secure resources for BME to achieve sustainable development and better serve the community.\nWe thank all our supporters, alumni, donors, and partners for appreciating our achievements. Your generous contributions and comments would enable BME to pursue academic and research excellence, and provide students with resources to enhance their learning environment and enrich their university life.",
  "url": "https://www.polyu.edu.hk/bme/support-us"
 },
 {
  "text": "Student Hengze YOU (Photo: second from the right) during his attachment at the Prosthetics & Orthotics Department in a local hospital. \nI would like to express my deepest gratitude to PolyU BME for providing me with this great environment to expand my knowledge and explore my interests. I would like to share my experience and gains over the past years in the following parts.\nSupportive professors \nAll teachers from BME had positive impacts on me from different aspects. For instance, my academic advisor Dr. Puxiang Lai provided counselling on my career plan; Dr Hin Chung Lau helped shape and train my creative thoughts in research & design; Dr Thomas Lee provided much support to my study and internship; my supervisor Dr Xin Zhao provided lots of instructions and help on my research work. I also self-initiated to join Dr. ZHAO’s biomaterial research group. During my work in her lab, I finally figured out biomaterial and tissue engineering is a direction I am willing to devote my effort to pursue.\nHappy moments \nBME courses have relatively small class size, so the connections between students and students, students and professors are very close. Professors can attend to every student during class, and students know each other very well. BME is like a big warm family. I felt very comfortable and happy to study in such an environment and enjoyed the time spent with my classmates and teachers.\n\nYear-1 ENG1003 Freshman Seminar group project (Photo: first from the right) \nMy future career\nI am eager to work in the biomedical field in the future. PolyU BME provides plentiful biomedical-related courses facilitating students to learn more about different domains of BME. At the same time, PolyU BME provides systematic training (e.g., PolyU’s Industrial Centre training, R&D group design project), sufficient exchange and internship opportunities to make students more competent in their future careers. I am going to pursue a postgraduate degree in BME. I would like to conduct R&D on biomaterials or biomedical devices for clinical use during my research degree. After getting my doctoral degree, I want to start my own business with my friends.\nAdvice for BME freshmen\nLearn about the different domains of BME from the first day you take the course BME11108 BME in Society, explore your interests, and prepare early.\nKeep in touch with your mentors, especially your academic advisor, whose advice could help you avoid many detours.\nActively participate in extracurricular activities to enrich your spare time and improve your interpersonal capabilities, which is also important for your future development.\nOnce again, I would like to thank BME for providing me with so many great opportunities, and my family, mentors, friends, and professors for continuous support throughout my university journey.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/2020-outstanding-student-award-of-department"
 },
 {
  "text": "The department of Biomedical Engineering at PolyU has evolved and improved dramatically from when it was established in 2012. In this article, we will dive in to the experience of one of our pioneers Ir Prof. Yong Ping Zheng to explore his life, interests, past, current, and future projects so that we can understand the history of BME and the future of this field.\nThe interest of Prof. Zheng in electronics takes its roots in his childhood. While studying in primary school he loved to assemble and disassemble things, such as clocks and radio machines. Upon going to university, he selected electronics as his major, which was called radio technology at that time. During the interview Prof. Zheng emphasized on repeated occasions about the concept of interest and vision:\n\"Interest is a very important aspect that drives and motivates us to continue to do something. Another aspect that I would like to mention is the vision. This is something that forms gradually as we grow and develop. Focusing only on interest may have some limitations, because sometimes even if we have an interest, there will be various matters that bother and discourage you. Therefore, I later found that vision is another important aspect towards achieving some goals. Vision is what we want to achieve and what we want to really do. Sometimes we encounter difficulties or even lose our interest, but if you want to achieve that vision we will overcome that.”\nNow undergraduate students rarely encounter Prof. Zheng in class, as with the increase of staff number in the BME Department he mostly focuses on administrative works and other projects. However, he actively participates in the development of new subjects, such as the CAR subject offered by our department called Skin-Care Technologies: Principles, Applications, and Safety.\nThe history behind the creation of this subject\n“I initiated this idea because one day I got a call from an officer of Hong Kong Customs and Excise Department, who encountered a case of misuse of cosmetic devices. They found that there were fake skincare devices. The device is called HIFU - high intensity focused ultrasound, which originally was used for medical purposes to kill and damage cancer cells with elevated temperature incuded by high intensity focused ultrasound. But in Hong Kong, if you search in Google, you will find out that it is commonly used as a cosmetic term and that almost every beauty salon has this device. Actually, with good control, it is safe because it only damages a specific layer under the face skin. However, there is a two-layer question, first - the device itself, second - its operation, both should be regulated but they are commonly not. Since HIFU has been very popular in Hong Kong, it is especially dangerous. Later on, I found that there are even two devices in the market for home use. There were reports about damages of customs' gland, skin and nerves. I realized that we must educate people. This is the reason why we established that subject. When we offer this topic as a subject, we also realize that BME is so important and such broad, well covering cosmetic device area.”\nJockey Club Smart Ageing Hub (JCSAH)\nAmong other positions, Prof.Zheng is also currently the Director of Jockey Club Smart Ageing Hub (JCSAH). Originally it was a place for mechanical workshops of BME, later Prof. Zheng together with BME colleagues established JCSAH at its place. JCSAH has been supported by Hong Kong Jockey Club Charitable Fund with HKD48M. This is a platform engaged in the development, promotion, and application of gerontechnology and increasing the awareness of the public about the existing technologies for the elderly.\nScolioscan\nProf. Zheng is one of the inventors of Scolioscan, the device which has already been clinically used in different countries all over the world, such as China, Poland, the Netherlands, Germany, Italy, Australia, etc. This device uses 3D ultrasound imaging to form coronal spinal images for the assessment of scoliosis for different purposes, including screening, diagnosis, follow-up, treatment outcome measurement, real-time feedback during measurement for scoliosis, which is the most common spinal disease among the kids, etc. Prof. Zheng shared that his team recently focus on a project for prediction of possible progression of scoliosis before it gets worse. The key significance of the project is that it allows the doctors to identify that 20% of the patients whose scoliosis may really progress in the future, unlike 80% of the patients who remain stable. This technology has been licensed to startup companies with its core members from BME graduates. Prof. Zheng’s aim is to develop a business from PolyU novel technology and medical devices that can be used by patients all over the world and recruit more graduate students.\nBesides, there are projects related to stroke, spinal cord, and traumatic brain injuries, that Prof.Zheng’s team has also been currently working on.\nEiling Technology Limited\nBeing the founder of the start-up “Eiling Technology Limited '', Professor Zheng was kind enough to share with us about what this company does. “Basically, this (company) is related to liver health” Dr. Zheng continues, “So, the liver actually can have a lot of potential problems, there are two major ones, fatty liver and liver fibrosis that will lead to liver cirrhosis, ultimately liver cancer. So, this way early diagnosis of fibrosis is very important.” Currently, the gold standard for diagnosis is generally to use biopsy, which is very harmful and invasive, and traditional ultrasound is quite inaccurate. Dr. Zheng continues “This technique is for elasticity imaging. Basically, they use ultrasound to measure the stiffness of tissue and that the procedure is to give the ultrasound probe a vibration and the vibration will propagate into the liver with certain speed, this speed actually is related to the elasticity of liver.” In order to perform this better, a special technique called ultra-fast ultrasound imaging is used. The reason it is called ultra-fast imaging is that it tracks around 3000 fps (frames per. second), as opposed to the normal ultrasound imaging devices which provide 30 fps. Now, when researching, weare monitoring the process of muscle contraction, using as high as 50,000 fps in order to see how the muscle can gradually contract from one place to another place and the overall procedure of the contraction. The current devices in the market are only able to obtain the stiffness values and cannot actually see the liver. Seeing the liver while conducting the measurement helps operators to select a region of the area easier and to avoid letting the vibration hit the vessel which induces measurement errors. This is because if the vibration hits the vessel, it will not propagate accurately. Furthermore, making it such a small device allows it to beaccessible anywhere, and people can even scan in comfort at their own homes. Why does PolyU BME have many connections?\nThere are several good reasons why our department has a well-established network of partners in local and overseas companies. The department has a long history, and therefore apart from working on building these relations over the years, a lot of graduates are out there, most of which have already developed into management level. Also, Prof. Zheng notes that PolyU students themselves build a reputation by being practical and well-equipped with solid skills.\nAdvice to students looking to commercialize their ideas\n”A student once asked me, now you are developing so many medical devices, and you keep claiming these devices are so good, then why hasn’t GPS (General Electric, Philips, Siemens) made it? '' Such companies have such large resources, talents, and technologies, how could you compete against them?” Professor Zheng actually discussed this matter with multiple companies in China. He mentioned that there is effectively no way that you can compete with GPS if you are making something they are making, as they have the accumulation of patents, meaning that they will sue if other people make them. Hence, Professor Zheng believes that “The first thing is to never think impossible.” Prof. Zheng continues “They (Large companies) will not be an expert in all areas, meaning that there are specific areas that they may not be too familiar with.” An example he gave was the reason for starting 3D ultrasound in 2003, whereby his first Ph.D. students developed many algorithms and methods, but at the time it was not known to be used for scoliosis, and they just did basic research. They focused on how to image better, scan better amongst other imaging and scanning techniques. Meanwhile, Prof Zheng has established a lot of collaborations with experts in orthopedics and orthotics, who are diagnosing scoliosis and making spinal braces for scoliosis patients, respectively. Over years of efforts and collaboration, ultimately Scolioscan was developed and commercialized, and the first patent in this area has been issued in China, the USA, Canada, Japan, Australia, Europe 12 countries. Dr. Zheng believes that another essential factor to have is vision. “For example, some students might just want to make something or just want to have a Hong Kong market, then everything ultimately will have a plateau. Therefore, I think it needs to have a longer and wider vision. Afterward, have patience, and take things slowly, step-by-step. In Chinese there is a phrase “天時地利人和”, meaning the right time, right place, right people, the right environment, and right opportunities are all critical factors in determining the success of an idea.\n“Hence,” he continues, “the only thing we can do is try our best and do not forget our vision and we need determination. As you start a start-up company, you will encounter all kinds of difficulties, some of which you have prepared, and some of which you have never prepared for. Therefore, you need to have the capacity to solve the problems that you are both interested and not interested in.”\nWhat do you think about the expression “go with the flow?”\n“In 2017, I remeber a reporter from PolyU also asked this question and I answered “do not follow the flow” and you need to have your own vision.” Said Prof. Zheng “What I mentioned was that the fashion or the flow can change because today the flow may be in this direction, but tomorrow it can be in another direction. If we keep following the flow then we may not have our own direction. Sometimes you will see if you do not follow the flow, you may need to take much more effort to overcome something. But you're actually preparing yourself because the flow will not always be against you. Ultimately, one day the flow will come in your direction and you will be much faster than others because you are well prepared, and you have already overcome those difficult times. Even for some period of time, you will feel difficulty or you will feel frustrated because the flow is always against you. So, there are a few good examples of this, I think one good example is technology development. At a certain stage, you will feel that technology is so difficult and there are not many applications. But suddenly, perhaps due to external factors, there’s a need for it. Therefore, as you have already prepared the technology for it and overcame the hardships of developing it, this opportunity is yours.”\nPast and current projects\n“I studied at the University of Science and Technology of China,” says Prof. Zheng, “so in my master's degree, I developed an ultrasound system. I love to develop devices. So I developed a system and then that is for very high-resolution speed of ultrasound measurement inside a material, which is a new type of superconductor.” In his second project, he made a device for his university colleagues to quantify the superconductor material. So they will cool down to a certain degree of temperature, and that material will ultimately become a superconductor. The next problem that Prof. Zheng faced was “How do we know it becomes a superconductor?”. One way is to have the power supply and to monitor but that method is not effective, because it will affect the material itself. To solve this, ultrasound can be used, we can measure that because there's a phase change, suddenly the speed of the material changes during the change of superconducting. So this is why we mentioned this.\nIn 1993. After graduation, Prof. Zheng came to Hong Kong. “When I came here then at that time, at the Jockey Club Rehabilitation Engineering Center, my supervisor Professor Arthur Mak said that there's a project related to tissue biomechanics, which requires ultrasound measurement, and at that time, the center did not have expertise in ultrasound. The whole study was about how to design a better socket for amputee patient, and my supervisor’s team used finite element analysis to simulate the interaction between amputee tissue and socket. To establish such a model for analysis, we need to have socket material and body tissue mechanical properties. Since we could not find quantitative in vivo soft tissue elasticity measurement device, we aimed to make a device. This was my task and later became my Ph.D. thesis, and I selected using ultrasound to help. After 4 years of study, I developed a device, named a tissue ultrasound palpation system (TUPS). This is my starting point of career on biomedical ultrasound.” continues Dr. Zheng “I'm currently working mainly on 3D ultrasound imaging, sonomyography (muscle dynamic imaging), elasticity imaging, etc. So, my advice, if we follow the question, I found that over the years, the most important thing is to do the best, I mean, make it the best in the field. Even if entering a field you may not be too interested in, you should still do your best, and then the opportunity will come one day.”\nTo let the students learn from your experience, could you tell us about the time you have made a mistake or experienced failure along your professional pathway and what you did to keep yourself motivated and to make it through that?\n“Yes, of course, I made mistakes, but I try to look at them from a positive perspective. Making a mistake and realizing, it was a gift to me. I can recall a few moments when I actually made a mistake. One of them was during my first year of my Master’s degree in 1990. At that time, I was working with my groupmates on the topic of using ultrasound to characterize superconductors. We have been using very expensive ultrasound devices imported from the United States. As I mentioned earlier, I am really into assembling and disassembling the equipment, so I was curious about the machine we just got from the US. I wanted to know how it works and what special components was inside of the machine to make its measurement results of sound speed so accurate. I opened the machine and then tried to assemble it back, but when I finished, it didn’t work. Because I did that in the past and had some experience of assembling the devices, I was confident in myself that I would be able to do the same that time. When the device didn’t turn on, I was so scared because I knew the device was new and it was very expensive. I spent several nights trying to solve the problem and understand why the machine was not working. Later on, I realized I made a mistake when I connected the wires in the wrong way. This accident was a really good experience for me, I learned a lot and now every time I start a new project or work on something, I am being very careful and take everything step by step, and for key steps, I will take photos to record. It benefits me a lot, by being careful I do things right from the first try, so that I don’t have to redo it again.”\nAs we know you and Dr. Xin Zhao went to the Geneva Inventions Expo to present your project and you won the silver medal for your “Liverscan: Palm-sized Real-time B-mode Ultrasound Imaging Guided System for Liver Fibrosis Assessment”, how did you decide to participate in EXPO and what insights have you gotten from this competition?\n“My team has participated in this exhibition many times. I am not particularly excited, as I have realized that getting medals is relatively easy, but the more challenging thing is to make these innovations useful one day. I perceive any award I got as just a little start for a long journey, no matter if it is a gold or silver medal. I am convinced that technologies and innovations are the future, especially for Hong Kong, I feel that we need to make our innovations lead the industry, so that we can develop an innovation-based economy and attract more talents working in the field and then to make more successful cases, thus to help Hong Kong to leave the current challenging status.”\nYou have achieved many personal and professional goals during your career path, could you please share your experience and some tips for young students to be more productive and how do you manage to maintain such a passion for your work? Because we often meet people and students who experience “burnout” and completely lose their interest in their work, have you ever experienced this and if yes how did you overcome this challenge?\n“As I mentioned previously, I would like to emphasize vision and interest, but this time I put vision before interest, as sometimes we need to do something not our interest, but we must overcome it before we can realize vision. For example, I am very good in technical aspects, so this is my real interest. When I took the position of BME head in 2012, BME was undergoing a very difficult situation, we separated from another department and moved into another faculty. We had a very limited budget because of our small number of students, with that budget we were able to afford only a limited number of staff. Spending a lot of efforts for increasing department budget was never in my interest, but as the Head I have the duty to do so. I feel that what I have done is beyond duty, I have set it as my vision. Similarly, I was not so good at communication before being the Head of Department or alone in my life, but with time and gaining more experience, I learned better ways to communicate with my colleagues, students, external working partners. I said to myself, I am now BME Head, not representing myself but the whole department. This motivates me a lot, and we may call it vision. Furthermore, even working as the Head of the BME department was not my original interest. Then after I became the Founding Head for BME, this definitely my duty, but I found what really drive me to make all the efforts to overcome all the challenges day to day to develop BME is my vision to make BME a strong department in PolyU. When the BME was just formed, it was called the Interdisciplinary Division of Biomedical Engineering, later on it became the BME department. We have gone through many difficult situations, in the beginning, our ranking was almost at the bottom, 8 years later now, BME is ranking higher than many departments at PolyU. To summarize this, I just want to say that if the vision is clear, everything is reachable.”\nWhat is your biggest dream/goal?\n“My dream is to set a model for innovations and technologies for Hong Kong, to set a protocol that others can follow. Recently, I have been putting a lot of effort into transferring technologies into business so that in the future we can provide a lot of job opportunities for fresh graduates, motivating them to work harder and use their talents and engineering skills to improve Hong Kong’s economy as well provide Hong Kong invented medical devices to serve patients all over the world.” \nCredit to: Orion KEUNG (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)& Meruyert AMANGELDY (Year 4 -Bachelor of Science (Honours) in Biomedical Engineering) and Aliya TUMANBAYEVA (Year 4 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/prof-yongping-zheng-shares-the-journey-in-bme"
 },
 {
  "text": "\"However, people nowadays may want a better working environment, or more of a work life balance.\" \nVital skills graduates should have when they work\nTo gain more insight on what skills Mr. Li perceives to be integral in working in this industry, he stated that “Learning agility, adaptability, learning are very important. The society changes rapidly, and to a large extent. Many jobs have appeared and disappeared over a course of 5 years. Furthermore, the content in the modules in university may not be able to keep up-to-date with the new technological advancement in the industry.” Mr. Li continues,\n“One has to always stay learning, and “evolve”. But how do you evolve? I think through doing projects, friendly rivalry with your peers, you will always be enticed to continue to learn. Traditional teaching and learning methods may not be wrong, but the difference in society is too alarming. Being a sales representative 10 years ago and being a sales representative now is completely different. For example, 10 years ago, we would not demonstrate our products through the use of videos or show mini-presentations through using electronic tablets. Maybe we would just bring a couple of catalogues on paper and discuss with the doctors and nurses. But now, it may only take 1-2 minutes to do a presentation. Thus, it is important to catch a key message. In the modern era of social media, people require information given to them in a fast and efficient manner. People may not have the attention span for a ten minute video, and you will have to catch their attention and talk about all your key points in a matter of 2-3 minutes.” Therefore, when looking to work in sales and marketing related jobs, the ability to evolve and adapt is vital to survive.\nDuties of a sales representative\nProviding more insight to what a sales and marketing would do on a daily basis, as a sales and marketing representative, the whole operation of the company is related to him. Li is responsible for profit and loss, which is quite similar to operating a small company. Imports, exports, how to sell, how to make a profit, all the expense are to be managed. Li states “In the sales department, we think about how to sell more products, which is done by managing my team to ensure that we provide a good service to the customers, thereby being able to attract more customers. In marketing it is more strategic, where we think of ideas to make more customers be intrigued to use more of our products through promotional and education events.” Ultimately, as an operation manager, your goal is to maximize the profits at the lowest cost.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/adapting-and-evolving-as-a-sales-and-marketing-manager"
 },
 {
  "text": "With the real thrill of acknowledgement, we would like to congratulate Prof. Mo Yang (Associate Head (Research) and Professor) and Dr. Thomas Lee (Associate Head (Academic), Associate Professor, and Co-Founder of Pocnat Limited (a PolyU academic-led startup)) who won the Gold Medals at the 48th International Exhibition of Inventions Geneva (Geneva Inventions Expo). Prof. Mo Yang's innovation is “High-throughput Microfluidic Platform for CTCs Detection in Cancer Precision Diagnostics” while Dr. Thomas Lee's innovation is “Gold-LAMP: A Portable Ultra-fast Nucleic Acid Testing System”.\nWidely regarded as among the most important annual global events devoted exclusively to inventions, many impactful innovations from PolyU have won a record-breaking number of accolades in this year’s Geneva Inventions Expo. The exceptional performance of PolyU teams in the Expo underlines the University’s aspiration to harness its excellence in education, research and knowledge transfer to drive PolyImpact – inventions and innovations by the PolyU community that create real-world impacts.\nThe 48th Geneva Inventions Expo attracted about 1,000 inventions from about 40 countries and regions. Thereamong, 28 PolyU innovations garnered 31 prizes – the highest number of prizes PolyU teams have ever received at this event. They include 3 Grand/Special Prizes, 5 Gold Medals with Congratulations of the Jury, 12 Gold Medals, 5 Silver Medals and 6 Bronze Medals.\nTo learn more about Prof. Mo’s and Dr. Lee’s impactful innovations, please refer to the following links from the website of Knowledge Transfer and Entrepreneurship Office (KTEO):\nHigh-throughput Microfluidic Platform for CTCs Detection in Cancer Precision Diagnostics: https://sc2.polyu.edu.hk//en/kteo/knowledge-transfer/innovations-and-technologies/award-winning-innovations/geneva2023#MicrofluidicPlatform\nGold-LAMP: A Portable Ultra-fast Nucleic Acid Testing System: \nhttps://sc2.polyu.edu.hk//en/kteo/knowledge-transfer/innovations-and-technologies/award-winning-innovations/geneva2023#GoldLAMP",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/prof-mo-yang-and-dr-thomas-lee-innovations-won-gold-award-at-geneva-inventions-expo"
 },
 {
  "text": "News and Events \nEvents \nOrganiser\nBME Student Association (BMESA)\nSummary\nBME Undergraduate sudents, Academic and Supporting staff came together to have a blast during the Annual Dinner on 12 May, the first face-to-face event organised by the former (29th) and current (30th) BME Student Association (BMESA). The evening was filled with joyous remembrance. The highlight of the event would be BME faculty members playing forfeits with students where participants have some fun punishment for losing a game.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/events/2023/5/bme-students-annual-dinner-on-12-may-2023"
 },
 {
  "text": "It is with great pride to announce Dr. Thomas Lee, the Associate Professor and Associate Head (Academic), as the recipient of the 2022 President’s Award for Excellent Performance and Achievement in Teaching. The Award was presented during the PolyU Appreciation Dinner on 25 April 2023. \nDr Lee has taught at PolyU for 17 years and places the learning experiences of students as his top priority. He has devoted great effort to student engagement. One example is his development of the Gongyeh e-platform to help students improve their presentation skills through peer feedback. He is the facilitator of the Community of Practice on Student-Staff Partnership from 2023 to 2025, and hopes that this initiative will enable colleagues to collaborate and learn from one another.\nPlease join me in celebrating the extraordinary efforts to Dr. Lee!",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/announcing-the-2022-winner-of-the-president-award-for-outstanding-achievement"
 },
 {
  "text": "It is pleased to announce the appointment of Professor DONG Cheng to the post of Chair Professor of Cell Engineering and ImmunoMedicine in the Department and concurrently as Associate Vice President (Mainland Research Advancement). Professor DONG has assumed duty on 15 May 2023.\nProfessor DONG obtained his Bachelor’s degree in Engineering Mechanics and Fluid Dynamics from Shanghai Jiao Tong University, China in 1982. He further received his higher degrees from Columbia University in the City of New York, USA, including Master’s degree in Civil Engineering and Engineering Mechanics in 1984, as well as Master of Philosophy degree in 1986 and Doctor of Philosophy degree in 1988, both in Bioengineering and Engineering Mechanics. Professor DONG joined the Pennsylvania State University (Penn State), USA, as Assistant Professor in 1992 and was promoted to Associate Professor and Professor in 1997 and 2003 respectively. He has been appointed Distinguished Professor of Biomedical Engineering since 2009 and also served as Head of Department of Biomedical Engineering at Penn State for 11 years since 2011.\nA major focus of Professor DONG’s research is to elucidate cellular functions in the circulatory system related to cell signaling-adhesion-migration, and study micro-hemodynamics, cellular biomechanics, inter-/intra-cellular signaling, cancer immunology and metastases. In particular, he investigates how fluid dynamics, adhesion kinetics and tumor microenvironment change leukocyte and endothelial immune functions which subsequently affect tumor cell extravasation and metastasis. In recent years, Professor DONG focused on adoptive immunotherapies using engineered immune cell mediated nanoparticle, drug, or miRNA deliveries that target either brain tumors across the blood-brain barrier or inflammatory responses in regenerative tissues.\nProfessor DONG is currently a Member of United States National Committee on Biomechanics and Fellow of various professional bodies, viz International Academy of Medical and Biological Engineering, American Institute for Medical and Biological Engineering, and Biomedical Engineering Society. He is also a Council Member of International Society of Biorheology. Besides, he is the Managing Editor ofFrontiers in Bioscienceand Associate Editor / Editorial Board Member for various prestigious journals. He received several prestigious awards in the past, such as Faculty Career Award from National Science Foundation, Faculty Research Award from the American Cancer Society, Y.C. Fung Investigator Award from the American Society of Mechanical Engineers (ASME), Melville Medal and Best Journal Paper Award from ASME, etc. \nPlease join me in welcoming Professor DONG to the PolyU BME family.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/appointment-of-chair-professor-of-cell-engineering-and-immunomedicine"
 },
 {
  "text": "Prof. Ming. Zhang, Head of Department, shared with the participants on the latest Academic and Research development of the Development\n1 / 3\nHong Kong Medical and Healthcare Device Industries Association (HKMDHIA) visited the Department on 31 March. During the visit, the participants have gained a deeper understanding of academic and research development of the Department and were able to witness firsthand about our technology transfer through the sharing of our Academic Staff about their startup companies. Our researchers also showed their dedication to improving healthcare through technology during the laboratory tour.\n",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/hkmdhia-visit"
 },
 {
  "text": "Chinese Name\nEnglish Name\nWork pattern\nPosition\nEmail \nOffice\n歐文婷\nAU Man Ting\nFull-time\nPostdoctoral Fellow\nmt1au@polyu.edu.hk\nS104\n陳天俊\nCHAN Tin Chun\nFull-time\nProject Assistant\ntim-tin-chun.chan@connect.polyu.hk \n陳子安\nCHAN Tsz On\nFull-time\nProject Associate\ntsz-on-jeffrey.chan@polyu.edu.hk\n陳婉雯\nCHAN Yuen Man\nFull-time\nResearch Assistant\nmandyym.chan@polyu.edu.hk\nU502\n陳俊江\nCHEN Junjiang\nPostdoctoral Fellow\njunjiang.chen@polyu.edu.hk\nR613\n陳林威\nCHEN Linwei\nPostdoctoral Fellow\ntony-l-w.chen@polyu.edu.hk\n鄭樂勤\nCHENG Lok Kan\nProject Assistant\nlk-connie.cheng@polyu.edu.hk\n張志邦\nCHEUNG Chi Pong\nResearch Assistant\nchi-pong-jame.cheung@polyu.edu.hk\n趙文偉\nCHIU Man Wai\nProject Associate\nhtmwchiu@polyu.edu.hk\nGH152\n朱國傑\nCHU Kwok Kit Jacky\nProject Assistant\nkkjchu@polyu.edu.hk\nS108\n冯姝瑞\nFENG Shurui\nResearch Assistant\nshurui.feng@polyu.edu.hk\nU502\n郭景慧\nGUO Jinghui\nResearch Fellow\njinghui.guo@polyu.edu.hk\n郭舒翼\nGUO Shu Yi Sean\nResearch Assistant\nsean234.guo@polyu.edu.hk\nHASSAN BEYGI Babak\nProject Associate\nbabak.b.hassanbeygi@polyu.edu.hk\nS104\n何敏\nHE Min\nPostdoctoral Fellow\nminscu.he@polyu.edu.hk\n賀堉仲\nHE Yuzhong\nyuzhong.he@polyu.edu.hk\n胡兵\nHU Bing\nbenny.hu@polyu.edu.hk\nM105\n扈培杰\nHU Peijie\npei-jie.hu@connect.polyu.hk\n黄琰欢\nHUANG Yanhuan\nyanhuan731.huang@polyu.edu.hk\nS107a\n黃英英\nHUANG Yingying\ndaisy.y-huang@polyu.edu.hk\nST412a\n黃子豪\nHUANG Zihao\nResearch Associate\nzihao.zh.huang@polyu.edu.hk\nU502\n許志豪\nHUI Chi Ho Joseph\nProject Associate\njoseph.c.hui@connect.polyu.hk \nU502\n孔志軒\nHUNG Chi Hin\ngordon.hung@polyu.edu.hk\n孔好添\nHUNG Ho Tim Percy\nProject Fellow\npercy.hung@polyu.edu.hk\nS104\n景佳宁\nJING Jianing\njijing@polyu.edu.hk\nPQ101\nKALA Shashwati\nResearch Associate\nshashwati.kala@polyu.edu.hk\n許健瑋\nKHAW Jien-vei\njien-vei.khaw@polyu.edu.hk\nS108\n高明慧\nKO Ming Wai\nProject Assistant\ndebbie121.ko@polyu.edu.hk\n關雄熹\nKWAN Hung Hei\nProject Fellow\nhhkwan@polyu.edu.hk\nGH043\n賴嘉莉\nLAI Ka Lee\nkllai@polyu.edu.hk\nS108\n林靜瑩\nLAM Ching Ying\nchingying-katherine.lam@polyu.edu.hk\n林進熙\nLAM Chun Hei\nroy-chun-hei.lam@polyu.edu.hk\n兰泓錦\nLAN Hong Jin\nResearch Associate\nhongjin.lan@polyu.edu.hk\n劉衍婷\nLAU Hin Ting\nhtlau@polyu.edu.hk\nS108\nLAUWERS Marianne Marie E.\nmarianne.lauwers@polyu.edu.hk\nS104\n李家成\nLEE Ka Shing\ni-ka-shing.lee@polyu.edu.hk\n李天昕\nLEE Tin Yan\ntimothy916bd.lee@polyu.edu.hk\n李傳奇\nLI Chuanqi\nchuanli@polyu.edu.hk\nM105\n劉訪琴\nLIU Fangqin\nfang-qin.liu@polyu.edu.hk\n劉華謙\nLIU Huaqian\nhuaqliu@polyu.edu.hk\nM105\n劉汕\nLIU Shan\necho.s.liu@polyu.edu.hk\nST412a\n文學森\nMAN Hok Sum\nhoksum.man@polyu.edu.hk\n文子盈\nMAN Tsz Ying\ntyman@polyu.edu.hk\nST412a\nMD. Akhlasur Rahman\nmd-akhlasur.rahman@polyu.edu.hk\nMURUGAPPAN Suresh Kanna\nsuresh.murugappan@polyu.edu.hk\n欧登格日乐\nOUDENG GERILE\ngerile-grace.oudeng@polyu.edu.hk\n錢津輝\nQIAN Jinhui\njinqian@polyu.edu.cn\nS102\n索迪\nSUO Di\ndi0220.suo@polyu.edu.hk\n田 丰\nTIAN Feng\nroger-feng.tian@polyu.edu.hk\n王天航\nWANG Tianhang\nkubert.wang@polyu.edu.hk\n王壹博\nWANG Yibo\nyibo112.wang@polyu.edu.hk\n黃貞睿\nWONG Ching Yui Ryta\nryta-ching-yui.wong@polyu.edu.hk\n王筠淇\nWONG Kwan Kei\nivy-kk.wong@polyu.edu.hk\n王幗婷\nWONG Kwok Ting\nkwok-ting.h.wong@polyu.edu.hk\nW002a\n黃莉甯\nWONG Lee Ning\nlyn.wong@polyu.edu.hk\n黃曜恆\nWONG Yiu Hang\nhenry.yh.wong@polyu.edu.hk\n胡子敏\nWOO Chi Man\ncmwoo@polyu.edu.hk\n吳勇\nWU Yong\nwu-yong.wu.wu@polyu.edu.hk\n楊碧波\nYANG Bibo\nlgtybb@polyu.edu.hk\nM105\n楊雨禾\nYANG Yuhe\nyuhe.yang@polyu.edu.hk\n楊凱盈\nYEUNG Hoi Ying\nhy5yeung@polyu.edu.hk\n殷伯翰\nYIN Bohan\nbohan.yin@polyu.edu.hk\nR613\n姚裕恒\nYIU Yu Hang\nbobby.yiu@polyu.edu.hk\n张雅超\nZHANG Yachao\nyachao.zhang@polyu.edu.hk\n趙心怡\nZHAO Xinyi\nxinyi.zhao@polyu.edu.hk\nPQ101\n周文君\nZHOU Wenjun\nwenjun.zhou@connect.polyu.hk\n叶富強\nYE Fuqiang\nPart-time \nResearch Associate\nfuqiang.ye@connect.polyu.hk\n曹菲\nCAO Fei\nPart-time \ndemi.cao@connect.polyu.hk\n張德文\nCHEUNG Tak Man\nPart-time \nSenior Research Fellow\ndrjason.cheung@polyu.edu.hk\nST405\n鍾啟倫\nCHUNG Kai Lun\nPart-time \nkailun.chung@connect.polyu.hk\n/\n凌欣圖\nLING Yan To\njane.yt.ling@connect.polyu.hk\n藍靜怡\nNAM Ching Yi\nnamchingyi.nam@connect.polyu.hk\nS107a\n譚耀秋\nTAM Yiu Chau\nandy-yiu-chau.tam@connect.polyu.hk\nPQ101\n谭启涛\nTAN Qitao\nmatthew.tan@connect.polyu.hk\nST405\n袁浩然\nYUEN Ho Yin\nho-yin-andy.yuen@polyu.edu.hk\n/\nChinese Name \n\t\nEnglish Name\n\t\nStudy mode\n\t\nMPhil / PhD student\n\t\nEmail \nRoom \n斐浩彬\nBEI Ho Pan\nMphil\nho-pan.bei@connect.polyu.hk\n/\n陳樂晉\nCHAN Lok Chun\nMphil\nlc-justin.chan@connect.polyu.hk\n/\n程雪淘\nCHING Karen\nMphil\nkaren.ching@connect.polyu.hk\n李科鳴\nLI Keming\nMphil\nkeminem20.li@connect.polyu.hk\nPQ101\n李彦龙\nLI Yanlong\nyanlong.li@connect.polyu.hk\nPALANISAMY Poornima\npoorni.palanisamy@connect.polyu.hk\n朴昀\nPIAO Yun\nwillie.piao@connect.polyu.hk\n宋雨晨\nSONG Yuchen\nyuchen.song@connect.polyu.hk\n譚耀秋\nTAM Yiu Chau\nandy-yiu-chau.tam@connect.polyu.hk\n王珺范\nWANG Junfan\njunfan.wang@connect.polyu.hk\n王建峯\nWONG Kin Fung\nderek-k-f.wong@connect.polyu.hk\nS103\n張曉天\nZHANG Xiaotian\nxtandy.zhang@connect.polyu.hk\n张雨琪\nZHANG Yuqi\nyuqizt.zhang@connect.polyu.hk\n朱堂龙\nZHU Tanglong\nringo-tanglong.zhu@connect.polyu.hk\nS102\n陳天俊\nCHAN Tin Chun\nPart-time\ntim-tin-chun.chan@connect.polyu.hk\n許健瑋\nKHAW Jien-Vei\nPart-time\njien-vei.khaw@polyu.edu.hk\n賴嘉莉\nLAI Ka Lee\nPart-time\nkelly.lai@polyu.edu.hk\n李家成\nLEE Ka Shing\nPart-time\nka-shing.v.lee@connect.polyu.hk\n梁嘉榮\nLEUNG Ka Wing\n李浩軒\nLI Ho Hin Toby\nho-hin-toby.li@connect.polyu.hk\n刘汕\nLIU Shan\nshan-echo.liu@connect.polyu.hk\nST412a\n姚裕恒\nYIU Yu Hang\nyuhang.yiu@connect.polyu.hk\n曹菲\nCAO Fei\nPhD\ndemi.cao@connect.polyu.hk\n陈飞\nCHEN Fei\nPhD\nshane.chen@connect.polyu.hk\nST405\n陈茜\nCHEN Xi\nPhD\nxi.cc.chen@connect.polyu.hk\n程圣福\nCHENG Shengfu\nPhD\nshengfu.cheng@connect.polyu.hk\n杜鵬宇\nDU Pengyu\npengyu.du@connect.polyu.hk\n范雅迪\nFAN Yadi\nyadi0731.fan@connect.polyu.hk\n顏超穎\nGAN Maria\nmaria.gan@connect.polyu.hk\n高呈飞\nGAO Chengfei\nchengfei.gao@connect.polyu.hk\n顾羽恬\nGU Yutian\nyutianix.gu@connect.polyu.hk\n郭子奇\nGUO Ziqi\ntank.guo@connect.polyu.hk\nS107a\n何冠希\nHO Kwun Hei Willis\nkwun-hei-willis.ho@connect.polyu.hk\ns104\n康東浩\nHONG Tung Ho\ntommythhong@connect.polyu.hk\nST405\n侯璇迪\nHOU Xuandi\nxuandi.hou@connect.polyu.hk\n胡明宇\nHU Mingyu\nmingyu.hu@connect.polyu.hk\nM106\n扈培杰\nHU Peijie\npei-jie.hu@connect.polyu.hk\nR613\n黄晓慧\nHUANG Xiaohui\nxiaohui5621925.huang@connect.polyu.hk\n黃夏子\nHUANG Xiazi\nsharon.huang@connect.polyu.hk\n江逸洲\nJIANG Yizhou\nyizhou.jiang@connect.polyu.hk\n雷婷\nLEI Ting\nting.lei@connect.polyu.hk\n李焕浩\nLI Huanhao\nhuanhao.li@connect.polyu.hk\n李乐宁\nLI Lening\n李寧\nLI Ning\n李帅\nLI Shuai\nsshuai.li@connect.polyu.hk\n凌欣圖\nLING Yan To\njane.yt.ling@connect.polyu.hk\n劉樂健\nLIU Lejian\nlejianlucy.liu@connect.polyu.hk\n罗笑荷\nLUO Xiaohe\nxiaohe.luo@connect.polyu.hk\n吕尚\nLYU Shang\nshang.lv@connect.polyu.hk\n麻希洋\nMA Xiyang\nxiyang.ma@connect.polyu.hk\nR613\n梅全静\nMEI Quanjing\nquanjing.mei@connect.polyu.hk\nM106\n孟建峰\nMENG Jianfeng\njianfeng.meng@connect.polyu.hk\n藍靜怡\nNAM Ching Yi\nnamchingyi.nam@connect.polyu.hk\nS107a\n倪郡国\nNI Junguo\njun-guo.ni@connect.polyu.hk\n彭迎虎\nPENG Yinghu\nyinghu.peng@connect.polyu.hk\n阙滟听\nQUE Yanting\nyanting.que@connect.polyu.hk\n饶竞东\nRAO Jingdong\njingdong.rao@connect.polyu.hk\n佘仲君\nSHEA Tsung Kwan\nqueenie.tk.shea@connect.polyu.hk\n苏敏\nSU Min\nmin-1.su@connect.polyu.hk\n谭启涛\nTAN Qitao\nmatthew.tan@connect.polyu.hk\n湯愷\nTANG Kai\nkai-vincent.tang@connect.polyu.hk\nTHARU Niraj Singh\nsingh.tharu@connect.polyu.hk\nVICTOROVA Maria\nmaria.victorova@connect.polyu.hk\n王施瑤\nWANG Shiyao\nyvette.wang@connect.polyu.hk\n吴洪练\nWU Honglian\nhonglian.wu@connect.polyu.hk\n冼銓香\nXIAN Quanxiang\nquanxiang.xian@connect.polyu.hk\n辛影\nXIN Ying\nying-xy.xin@connect.polyu.hk\n徐天鹏\nXU Tianpeng\ntianpeng.xu@connect.polyu.hk\n徐 智\nXU Zhi\n杨德\nYANG De\nde.de.yang@connect.polyu.hk\n叶富強\nYE Fuqiang\nfuqiang.ye@connect.polyu.hk\n余志鵬\nYU Zhipeng\neric-zhipeng.yu@connect.polyu.hk\n张存宇\nZHANG Cunyu\ncunyu.zhang@connect.polyu.hk\n張國新\nZHANG Guoxin\nguo-xin.zhang@connect.polyu.hk\n张家宁\nZHANG Jianing\njayce.zhang@connect.polyu.hk\n张强\nZHANG Qiang\nqiang666.zhang@connect.polyu.hk\n张琴\nZHANG Qin\nzhangqin.zhang@connect.polyu.hk\n張若琳\nZHANG Ruolin\nruolin0322.zhang@connect.polyu.hk\n赵梦娜\nZHAO Mengna\nmengna.zhao@connect.polyu.hk\n赵麒\nZHAO Qi\nzhaoqi.zhao@connect.polyu.hk\ns104\n仲天庭\nZHONG Tianting\ntianting-simon.zhong@connect.polyu.hk\n周颯\nZHOU Sa\nsa927.zhou@connect.polyu.hk\ns104\n周穎穎\nZHOU Yingying\ny.y.zhou@connect.polyu.hk\ns108a\n朱杰君\nZHU Jiejun\njiejun.zhu@connect.polyu.hk\n朱婷\nZHU Ting\nchristy.zhu@connect.polyu.hk\n邹舟\nZOU Zhou\nzzhou.zou@connect.polyu.hk\n左京京\nZUO Jingjing\nJenny.zuo@connect.polyu.hk\n許志豪\nHUI Chi Ho Joseph\njoseph.c.hui@connect.polyu.hk\n紀浩文\nKEE Ho Man\nho-man-alex.kee@connect.polyu.hk\n羅文菁\nLAW Man Ching\nmc-tess.law@connect.polyu.hk\n駱嘉希\nLOK Ka Hei\nkahei.lok@connect.polyu.hk\n吴会东\nWU Huidong\nh.d.wu@connect.polyu.hk",
  "url": "https://www.polyu.edu.hk/bme/people/research-personnel"
 },
 {
  "text": "People \nHonorary Staff \nHonorary Professors \nDr. Savio WOO\nProfessor\nDistinguished University Professor Emeritus and Director\nDepartment of Bioengineering\nSwanson School of Engineering\nProf. Roy Ronald AURELE\nProfessor\nChair of Mechanical Engineering and Associate Head of Department (research) in the Dept. of Engineering Science\nProf. Patrick YUNG\nAdjunct Professor\nProf. David Alan BOONE\nAdjunct Professor\nProf. Philip CHIU\nAdjunct Professor\nDr. SW LAW\nAdjunct Professor\nDr. Jason CHEUNG\nThe Department of Orthopaedics and Traumatology\nThe University of Hong Kong\nDr. Lewis CHAN\nAdjunct Associate Professor\nDr. Suk Tak Phoebe CHAN\nAdjunct Associate Professor\nInstructor, Radiology, Harvard Medical School\nIr Man Kit Bryan SO\nAdjunct Associate Professor\nIr Raymond POON\nAdjunct Associate Professor\nDr. Samuel LING\nAdjunct Assistant Professor\nDr. Jasper WONG\nAdjunct Assistant Professor",
  "url": "https://www.polyu.edu.hk/bme/people/honorary-staff"
 },
 {
  "text": "People \nAlumni \nOutstanding Alumni Award \nOutstanding Alumni Award of PolyU Department of Biomedical Engineering \nBME honours graduates for distinguished professional achievements and significant contributions to the University, the Department and the community. The following Alumnus has received the Outstanding Alumni Award in Professional Achievement of PolyU Department of Biomedical Engineering 2022.\nOutstanding Alumni Award in Professional Achievement \nMr Billy Wong Kai-yuen\nMaster of Science in Health Care (Healthcare Technology) / 2008 The Hong Kong Polytechnic University\nMr Wong is currently Principal Advisor (Medical Device) of Corp R&D Department in SGS HK Ltd. Over 19 years of experience in medical industrial field with rich knowledge and skill of medical devices; he specializes in the integration of different countries regulation requirements into quality management systems; and also he has gotten professional qualifications globally, including MDR (2017/745 Regulation) Auditor, ISO 13485 Auditor, and ASQ Certified Medical Device Auditor etc. In 2003, He was one of the founding members and the executive board member in Hong Kong Medical and Healthcare Device Industries Association (HKMHDIA). He enthusiastically contributes and shares his professional knowledge and experiences with the industries stakeholders through different activities in Hong Kong and China. He was also honorably entitled as HKMHDIA Life Member since 2008. Since 2021, he has been serving as BME undergraduate program committee’s industrial member and has been a visiting lecturer at PolyU BME.\nOutstanding Young Alumni Award in Professional Achievement \nIr Cristina Leung\nBachelor of Science in Biomedical Engineering / 2007 The Hong Kong Polytechnic University\nIr Leung is currently the Head of the Biomedical Engineering Department of Gleneagles Hospital Hong Kong. Over the past decade, she is devolved in the development of Biomedical Engineering in Hong Kong's private hospital sectors. She helped establish a graduate engineer training program from The Hong Kong Institution of Engineers (HKIE), i.e. HKIE Scheme “A” Training program, for the Biomedical Engineering department in different private hospitals, including Gleneagles Hospital Hong Kong, Hong Kong Adventist Hospital-Tsuen Wan and Hong Kong Adventist Hospital-Stubbs Road. With the heart of nurturing the next BME generation, she has also contributed to the undergraduate student placement program for her Alma Mater and other BME programs in Hong Kong. Besides, she has been the visiting lecturer for the BME undergraduate program in the area of clinical engineering and medical technologies since 2020. She also helped set up the hands-on workshop for the undergraduate BME program offered by The City University of Hong Kong.",
  "url": "https://www.polyu.edu.hk/bme/people/copy-of-alumni/outstanding-alumni"
 },
 {
  "text": "People \nAcademic Advisors and Advisory Committee \nDepartmental Academic Advisors \nProf. Song LI\nChancellor Professor\nChair, Department of Bioengineering\nProfessor, Department of Medicine\nUniversity of California, Los Angeles\nU.S.A.\n\nDepartmental Advisory Committee \nMr. Benjamin CHAN\nChairman\nManaging Director, MediConcepts Limited\nMs. Grace CHAN\nExternal Members\nDr. Moon Wah CHEUNG\nExternal Members\nVice-President (Elderly Services Development and Operation),Consolife Healthcare Limited.\nIr Kwok-ying Raymond POON\nExternal Members\nAssistant Director, Electrical & Mechanical Services Department, HKSAR Government (Electricity and Energy Efficiency Branch)\nMr. Clement CHAN\nExternal Members\nSenior Manager (Allied Health), Cluster Service Division, Head Office, Hospital Authority\nMr. Samson TSOI\nVice Director, Mekim Limited\nMr. Kelvin SZE\nScientific Officer (Medical), Department of Health, Medical Device Divisoin, Hong Kong\nProf. Raymond NG\nVice President, Dr. Kong Footcare Limited \nMr. Jamie CHAN\nPresident of Biomedical Engineering Alumni Association ",
  "url": "https://www.polyu.edu.hk/bme/people/academic-advisor-and-advisory-committee"
 },
 {
  "text": "Study \nWhy PolyU BME? \nWhy PolyU BME?\nUnique Features of PolyU BME programme:\nStudents have an opportunity to select BME with P&O stream if they prefer a more clinical-based career.\nsolid training for students in bioinstrumentation and sensors .\nstrong industrial links for student internship and technology transfer.\na team of colleagues dedicated for BME programme with related backgrounds.\na very active BME Alumni Association.\nPlease put at least one valid content allocate to this component.\nWhat can you gain? \nPlease put at least one valid content allocate to this component.\nJoin PolyU BME family! ",
  "url": "https://www.polyu.edu.hk/bme/study/why-polyu-bme_new"
 },
 {
  "text": "Prof. Ming Zhang is the head and professor at PolyU BME. His research mainly focuses on the biomechanics of the musculoskeletal system and body support. In this interview, we dove deeper into the topics such as his research interests and the unique advantages of studying BME.\nQ1: Having first studied in automation control engineering, then mechanical engineering, why did you switch over to learn more about biomedical engineering?\nAfter obtaining my MPhil degree in mechanical engineering, I worked as a lecturer at Beijing Institute of Technology. I read several papers related to human bones and joints. I felt it was interesting to apply engineering knowledge to human body. I also learnt that several Chinese researchers, like Yuan-Cheng Fung (馮元楨), Van C. Mow (毛昭憲), Ed Chao (趙以甦) and Savio Woo (胡流源), who were all very successful in applying their engineering knowledge to biomedical engineering research and education, bringing great benefits to the human race. At that time there were very few engineering programs in China. Hence, more people were needed to contribute to this area. Then I decided to select biomedical engineering for my Ph.D. study. Nowadays, Biomedical Engineering in Hong Kong and the mainland has greatly improved. I want to extend my warmest welcome to those who are interested in biomedical engineering to join us and meet new challenges.\nQ2: Having an esteemed career worldwide, how do you think BME will evolve in the future worldwide and locally? \nBME will become a more and more demanding discipline. It is an era of the appearance of new innovative technologies and people and government have paid more and more attention to human health, and ageing issue as well. As a bridge between engineering technology and health and medical care, BME should play an increasingly important role.\nQ3: Do you think the COVID-19 pandemic might have a positive effect on BME that highlights the importance of healthcare and safety?\nWe cannot say the Covid-19 pandemic has positive effects on BME. However, the unprecedented challenges to public health and social disruptions may make people think more on the solutions in prevention, diagnosis, treatment and rehabilitation. BME should play a more critical role in both research and education. Some staff working on virus detection have obtained more research grants recently. I believe BME will attract more attention in the future, becasue we are working along the direction to provide help for health and medical care by using innovative technologies.\nPhoto: Prof. Ming Zhang and his research team \nQ4: Having won multiple research awards, can you share more information about your research that you found the most fascinating?\nMy research focuses on biomechanics of the musculoskeletal system (骨骼肌肉系統生物力學) and body support design applied to the fields of orthopaedics, sports science, and rehabilitation engineering. In the past 20 years, my team has been mainly working on the development of biomechanical platform integrating experimental study with computational simulation for the understanding of human foot and its support effects. Our computational simulation using both musculoskeletal model and finite element model can give a clear picture of biomechanical performance of the foot and ankle and provide useful information for surgical intervention and shoe and orthosis design. We are also collaborating with Beihang University to apply the platform to investigate why woodpeckers can protect their heads under extremely high impact acceleration. These publications with fascinating findings attracted many media’s interests. We were glad to obtain a series of awards including the first-class Natural Science Award from the national Ministry of Education (國家教育部自然科學獎).\nQ5: How do you think PolyU could attract more students to study BME for MPhil or Ph.D.?\nIn my view, people choose PolyU BME for postgraduate study because of the reputation of both PolyU and BME. Our university strives for world-class excellence and to improve the ranking for recognition and reputation. BME staff together with all research staff and students will conduct impactful and cutting-edge research and promote our programmes.\nQ6: What are your biggest challenges and obstacles that you had to overcome in your personal life or professional career?\nMy research focuses on biomechanics of musculoskeletal system and body support design, applied to the fields of orthopaedics, sports science, and rehabilitation engineering, belonging to macro-level biomechanics. Biomechanics to support orthopaedics was a very hot topic 30 years ago. However, in the past 20 years, hot topics have shifted to micro-level or cellular level. Macro-topics no longer seemed to be cutting-edge research in some people’s view, and sometimes it is hard to get grants and to publish papers in high impact-factor journals. However, we have persisted in working in this direction because we believe our research is very useful for clinics and prosthetics and orthotics. Now, we have become one of world leading teams in biomechanics of musculoskeletal system.\nQ7: What are the unique advantages of PolyU BME in comparison to BME from other universities?\nPolyU BME can be dated back to Jockey Club Rehabilitation Engineering founded in 1987, originally focused on rehabilitation engineering. Our BME programme has evolved from Prosthetics and Orthotics (1995-1999), and Health Technology (2000-2012). It is the only program in Hong Kong integrating strong rehabilitation engineering and P&O elements in biomedical engineering, whereby we provide more clinically oriented BME programmes. We have a strong team of faculty members with expertise in smart ageing technology and assistant technology, besides the research strength in general biomedical engineering.\nCredit to: Orion KEUNG (Year 2 -Bachelor of Science (Honours) in Biomedical Engineering)/ Tsun Ming YAM(Year 3 - Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/interview-with-ming"
 },
 {
  "text": "Aims and Characteristics\nBiomedical engineering is recognised around the world as one of the fastest growing areas of innovation. It covers a wide spectrum of applications, such as devices used by health professionals in their diagnostic, therapeutic and rehabilitative practices; implants that are placed in patients for their health maintenance; prostheses, orthoses and assistive devices that are used by people with special needs to facilitate their daily activities; and healthcare products and exercise equipment for general health promotion.\nThis developing global field requires professionals who understand both the health issues that motivate these technologies and the engineering solutions that they offer. It needs individuals with a solid foundation in both health sciences and engineering technologies.\nOur BSc (Hons) in Biomedical Engineering curriculum prepares students for such a challenging career. They have opportunities to take subjects in both life sciences and engineering and to integrate these concepts into interdisciplinary applications to improve human health.\nIn addition to building foundational knowledge through classes on campus, students engage in practical learning through an industrial internship/clinical attachment (a 280 hour industrial internship for BME stream students and a 560 hour clinical attachment for BME with P&O stream students). These internships/attachments offer good opportunities for students to put what they have learned into practice and accumulate work experience for their future careers. The internships/attachments take place in industry settings and hospitals, and some of our students participate in overseas placements (e.g. in Canada, China, Czech Republic, Japan, Singapore, the UK and the USA).\nExchange opportunities are available with our overseas partner institutes:\nJonkoping University, Sweden (ju.se/en/study-at-ju/our-programmes/bachelor-programmes/prosthetics-and-orthotics);\nMetropolia University of Applied Sciences, Finland (www.metropolia.fi/en/academics/degree-programmes-in-finnish/prosthetics-and-orthotics);\nUniversity of Pennsylvania, USA (www.seas.upenn.edu/be);\nUniversity of Strathclyde, UK (www.strath.ac.uk/engineering/biomedicalengineering/); and\nWashington University in St Louis, USA (bme.wustl.edu).\nStudents also have opportunities to join the Faculty-level and University-level exchange programmes.",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions"
 },
 {
  "text": "Introduction\nProgram Overview\nCurriculum\nList of Subjects and Subject Description Forms\nWork-Integrated Education\nNon-local Learning Experience\nStudent Message\nPamphlet\nEntry Credit Transfer\nWhy PolyU BME?\nUnique Features of PolyU BME programme:\nStudents have an opportunity to select BME with P&O stream if they prefer a more clinical-based career.\nsolid training for students in bioinstrumentation and sensors .\nstrong industrial links for student internship and technology transfer.\na team of colleagues dedicated for BME programme with related backgrounds.\na very active BME Alumni Association.\nWhat you will learn?\nJunior Year\nYear 1 subjects provide students with foundation knowledge in engineering technology.\nYear 2 subjects further establish students’ foundation knowledge in related engineering areas and establish students’ foundation knowledge in health science areas such as anatomy and physiology.\nThe programme has two streams: Biomedical Engineering (BME) and Biomedical Engineering with Prosthetics and Orthotics (BME with P&O). Each student can select one stream according to their interests and strengths. The indication of the stream will be requested at the end of Year 2.\nSenior Year\nYear 3 subjects further strengthen students’ knowledge of biomedical engineering, give them the opportunity to combine biomedical and engineering aspects such as in laboratory and design, and develop their ability in critical inquiry and thinking. One unique feature of our programme is that students take the subject Biomedical Engineering Research and Design Studies for four consecutive semesters in Year 2 and Year 3, which gives them the opportunity to integrate biomedical science with engineering. Students can start to take BME and P&O Electives on different topics according to their streams.\nYear 4 includes advanced and applied biomedical engineering subjects and a Capstone Project. Students further take BME & P&O Electives according to their streams.\nBiomedical engineering industrial internship/clinical attachments are arranged during the summer semester to broaden students’ experience in the field.\nThis growing field requires professionals who understand the health issues that motivate technology developments and apply engineering solutions. Our students have opportunities to take subjects in both health sciences and engineering, and to integrate their learned knowledge into interdisciplinary applications to improve human health.\nGraduates will\npossess a solid foundation in both health/medical sciences and engineering technologies.\nunderstand the health/medical issues that motivate the technologies and engineering solutions that they offer.\nbe able to develop and apply engineering technologies in areas such as clinical engineering, medical instrumentation and sensors, and prosthetics and orthotics\nbecome leaders in the biomedical engineering professionals who are self-motivated inquirers, critical thinkers, innovative problem solvers, effective communicators, team players, lifelong learners, and ethical practitioners.\nbe able to improve the community health status by health promotion, disease prevention, diagnosis, treatment, monitoring, and rehabilitation",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/program-overview"
 },
 {
  "text": "Introduction\nProgram Overview\nCurriculum\nList of Subjects and Subject Description Forms\nWork-Integrated Education\nNon-local Learning Experience\nStudent Message\nPamphlet\nEntry Credit Transfer",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/curriculum"
 },
 {
  "text": "Subject List\nDSR Language Requirement Subjects\nSubject Code Subject \nCLC3241P\tProfessional Communication in Chinese\t\nELC3523\tScientific Writing for BME Students\t\nDSR Mathematics and Basic Science Subjects\nSubject Code Subject \nABCT1700\tIntroduction to Chemistry\t\nABCT1741\tGeneral Chemistry I\t\nABCT2331\tHuman Biology for Biomedical Engineering I\t\nABCT2332\tHuman Biology for Biomedical Engineering II\t\nAMA1110\tBasic Mathematics I – Calculus, Probability, and Statistics\t\nAMA1120\tBasic Mathematics II – Calculus and Linear Algebra\t\nAMA2511\tApplied Mathematics I\t\nAMA2512\tApplied Mathematics II\t\nAP10001\tIntroduction to Physics\t\nAP10005\tPhysics I\t\nAP10006\tPhysics II\t\nDSR Compulsory Engineering Subjects\nSubject Code Subject \nBME11108\tBiomedical Engineering in Society\t\nBME21148\tBiomedical Electronics (for students admitted in 2021 or after)\t\nBME21149\tBiomaterials Science and Engineering (for students admitted in 2021 or after)\t\nBME21151\tEngineering Design & Biomechatronics (for students admitted in 2021 or after)\nBME21153\tMedical Device Regulation (for students admitted in 2021 or after)\t\nBME31103\tApplied Electrophysiology\t\nBME31116\tBiosignal Processing\t\nBME31125\tBiomechanics\t\nBME31134\tRehabilitation Engineering and Assistive Technology\t\nBME31142\tBiomedical Engineering Research & Design Studies II - Engineer for the Community (for students admitted in 2020 or before)\nBME31147\tBiomedical Engineering Innovation for the Community (for students admitted in 2021 or after)\t\nBME31150\tMedical Instrumentation and Equipment \t\nBME41141\tMedical Technology Management and Regulation\t\nENG2002\tComputer Programming\t\nHSS2011\tHuman Anatomy (for students in BME with P&O stream admitted in 2021 or after)\t\nDSR Elective Subjects (For BME stream)\nSubject Code Subject \nBME32105\tBiomaterials Science and Engineering (for students admitted in 2020 or before)\t\nBME32115\tBiosensors: Theories and Biomedical Applications\t\nBME32138\tCellular Engineering\t\nBME32140\tClinical Engineering (for students admitted in 2020 or before)\t\nBME32152\tClinical Engineering and Medical Technology Management (for students admitted in 2021 or after)\t\nBME34143\tMedTech Innovation and Entrepreneurship (for students admitted in 2021 or after)\t\nBME34145\n\tAIDA for Health Care and Smart Ageing (for students admitted in 2021 or after)\t\nBME42113\tBiomedical Imaging\t\nBME42129\tNeuroengineering\t\nBME42154\tDigital Design and Fabrication for Healthcare Services (for students admitted in 2021 or after)\t\nBME44144\tAIDA for Biosignal Processing and Medical Imaging (for students admitted in 2021 or after)\t\nDSR Elective Subjects (For BME with P&O stream)\nBME32104\tBelow-Knee Prosthetics (for students admitted in 2020 or before)\t\nBME32131\tPedorthics, Foot and Ankle-Foot Orthotics (for students admitted in 2020 or before)\t\nBME32136\tUpper Limb Orthotics (for students admitted in 2020 or before)\t\nBME32155\tBelow-Knee Prosthetics (for students admitted in 2021 or after)\t\nBME32156\tPedorthics, Foot, and Ankle-Foot Orthotics (for students admitted in 2021 or after)\t\nBME32157\tUpper Limb Prosthetics (for students admitted in 2021 or after)\t\nBME42101\tAbove-Knee Prosthetics (for students admitted in 2020 or before)\t\nBME42124\tKnee and Above-Knee Orthotics (for students admitted in 2020 or before)\t\nBME42135\tSpinal Orthotics (for students admitted in 2020 or before)\t\nBME42137\tUpper Limb Prosthetics (for students admitted in 2020 or before)\t\nBME42158\tAbove-Knee Prosthetics (for students admitted in 2021 or after)\t\nBME42159\tKnee and Above-Knee Orthotics (for students admitted in 2021 or after)\t\nBME42160\tSpinal Orthotics (for students admitted in 2021 or after)\t\nBME42161\tUpper Limb Prosthetics (for students admitted in 2021 or after)\t\nDSR Capstone Project\nBME41118\tCapstone Project (for students admitted in 2020 or before)\t\nBME41118\tCapstone Project (for students admitted in 2021 or after)\t\nIndustrial Centre (IC) Training\nBME21301 / IC2135\tMaterial Processing and Technical Communication\t\nWork-Integrated Education (WIE) Training\nBME31210\tBiomedical Engineering Industrial Internship\t\nBME31206\tBiomedical Engineering Clinical Attachment I\t\nBME41207\tBiomedical Engineering Clinical Attachment II\t\nServicing Subjects offered to other Departments\nBME11101\tBionic Human and the Future of Being Human\t\nBME31125\tBiomechanics",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/list-of-subjects-and-subject-description-forms"
 },
 {
  "text": "Study \nUndergraduate programme \nWork-Integrated Education \nIn additional to traditional teaching and learning activities on campus, BME students will obtain a minimum of 8 weeks of practical learning through clinical / industrial internships within / outside Hong Kong. These internships offer a good opportunity for students to put what they have learned into practice and accumulate work experiences for their future career.\nHow does an internship help us grow?\nOver the summer, I was able to get a taster for what the working world of engineering is. Working at a start-up research and design company was a very eye-opening experience. In this article, I would like to share some of the insights I gained from participating in this… \nRead MoreHide\nWhy do we need an internship?\nSometimes we all ask ourselves why we need the internship. I tried to answer that question and learn something important out of my experience. I believe we need an internship, simply because it helps students immerse themselves in the workplace and gain practical experience. Read MoreHide",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/work-integrated-education"
 },
 {
  "text": "What are the aims of Academic Advising System?\nAcademic advising at PolyU aims to help students to make informed and intelligent academic decisions/choices about their study at PolyU that suit their intellectual, professional and personal goals. It is instrumental to promoting student success, and plays a vital role in enhancing students’ overall learning experience at PolyU.\nAcademic Advising System\nEach BME undergraduate student will be assigned to one academic staff who will act as his/her Academic Advisor throughout his/her course of study at PolyU. The Department will introduce the Academic Advising System and the academic advisors to new students in Year 1 orientation programme.\nThe student advisees are required to join the BME Departmental Academic Advising Day held before the commencement of semester 1 and semester 2 respectively to meet with their Academic Advisors.",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/academic-advising"
 },
 {
  "text": "Study \nUndergraduate programme \nGUR Subjects offered by BME \nCluster Area Requirements \nThe intention of PolyU’s undergraduate curriculum is to provide a balanced and all-rounded education experience for students. CAR subjects are general education subjects that aim to nurture students’ intellectual capacity, global outlook, communication and critical thinking skills from a multidisciplinary perspective.\nCluster Area Requirements (CAR) subjects offered by BME\nBME provides 4 CAR subjects for PolyU students to fulfill the cluster area D:\nBME1D01\tBionic Human and the Future of Being Human\t\nBME1D02\tWearable Healthcare and Fitness Devices for Everyone\t\nBME1D03\tTechnologies for Smart Ageing\t\nBME1D04\tSkin-Care Technologies: Principles, Applications and Safety\t",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/gur-subjects-offered-by-bme/cluster-area-requirements"
 },
 {
  "text": "Study \nUndergraduate programme \nGUR Subjects offered by BME \nService Learning \nService Learning aims to help student develop into a competent professional with a heart to serve others. This subject contains a significant service component which allows students to apply their skills and knowledge to deal with complex issues in social service, and develop a stronger empathy for people in need and a stronger sense of civic responsibility.\nService Learning (SL) subjects offered by BME\nBME provides 3 Service Learning subjects to PolyU students to fulfill the graduation requirement of Service Learning (3 credits).\nBME2S04\tReducing the Scientific Divide in Primary and Secondary Students through STEM Projects\nBME2S04S\tReducing the Scientific Divide in Primary and Secondary Students through STEM Projects\t\nBME3S02\tAssistive Technologies: Service Learning towards the Elderly and Disabled",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/gur-subjects-offered-by-bme/service-learning"
 },
 {
  "text": "Aims and Characteristics\nProgramme Aims\nThe programme has the following aims:\n(a) to nurture professionals and specialists with professional competence, strategic thinking and lifelong learning capability in the biomedical engineering field;\n(b) to provide students with the modern engineering knowledge and advanced technology tools necessary for biomedical engineering practice; and\n(c) to equip students with critical thinking and problem-solving skills in the biomedical engineering field through high-quality education.\nCharacteristics\nStudents have the flexibility to select combinations of subjects that allow them to graduate with a specialism award as follows:\nMaster of Science in Biomedical Engineering\nMaster of Science in Biomedical Engineering (Rehabilitation Engineering)\nMaster of Science in Biomedical Engineering (Digital Health)",
  "url": "https://www.polyu.edu.hk/bme/study/taught-postgraduate-programme/master-of-science-in-biomedical-engineering"
 },
 {
  "text": "Undergraduate programme \nCredit Transfer \nGuidelines on Credit Transfer\nGranting of credit transfer is mainly based on the subject contents and the learning outcomes attained. \nThe subject contents attained should be at least 75% similar to the PolyU subjects of a similar level, credits, and contact hours. \nThe subject grade/mark achieved should be B / 75% or above.\nEntry Credit Transfer",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/credit-transfer"
 },
 {
  "text": "Experience and Opportunities \nCareer Opportunities \nPlease put at least one valid content allocate to this component.\nMost of our BME graduates are working in BME-related fields: \nClinical Engineering\nEntrepreneurship\nProsthetics and Orthotics\nQuality Assurance & Regulatory Affairs\nSales and Marketing\nService Engineering",
  "url": "https://www.polyu.edu.hk/bme/experience-and-opportunities/career-opportunities_new"
 },
 {
  "text": "Experience and Opportunities \nStudent Exchange Programmes \nOutbound Exchange Programmes \nThe Department of Biomedical Engineering (BME) has established studentexchange programmes with a number of world renowned universities, including:\nUniversity of Pennsylvania (USA)\nWashington University in St.Louis (USA)\nJönköpingUniversity (Sweden)\nHelsinkiMetropolia University of Applied Sciences (Finland)\nUniversityof Strathclyde (UK)",
  "url": "https://www.polyu.edu.hk/bme/experience-and-opportunities/student-exchange-programme"
 },
 {
  "text": "The research activities are carried out in different laboratories, and we have identified four major research themes:\nMedical Imaging and Biosensing\nThis thematic research area aims to design and develop new biomedical imaging methods and devices, biosensors, screening methods, and treatment approaches. A key focus of this group is biomedical ultrasound instrumentation and application including 3D ultrasound imaging, ultrasound biomicroscopy, tissue elasticity imaging and measurement, photo-acoustic imaging, ultrasound tissue characterization, ultrasound stimulation, ultrasound assessment for heart, breast, liver, skin, tendon, muscle, cartilage, diabetic foot, etc. Another key focus of this group is biomedical sensing including development of nano- and micro- biosensors, microfluidic devices, nanoporous membrance for sensing, microchip, micro- and smart drug delivery devices. We also develop wearable sensors for healthcare for motion and vital sign monitoring.\nMolecular and Cellular Engineering\nThis thematic research area aims to apply engineering principles and tools to study the fundamental problems in cellular and molecular scales, enabling the understanding of cellular behavior from molecular-level interactions, elucidating of the cellular and molecular mechanisms underlying a broad spectrum of diseases, and tackling the human health-related challenges. We are dedicated to research fields involving cellular mechanics, cell micro-environment, cellular electrophysiology, biomaterials, nanotechnology for theranostics, imaging-guided stem cell therapy, and regenerative medicine.\nNeuromusculoskeletal Science and Engineering\nThis research area encompasses various underpinning clinical and engineering sciences related to the neuromusculoskeletal (NMS) system. The scope covers the molecular understanding of the pathologies associated with the NMS system and health protection against those disease and disabling processes; laboratory, imaging and functional assessment of the NMS system; acute and long-term therapeutics for NMS disorders; assistive technologies for rehabilitation and enablement. A major focus of this thematic area is to help develop healthcare technology that will support NMS health in the community.\nProsthetics, Orthotics, and Rehabilitation Engineering\nProsthetics and orthotics aim to improve the condition or function of people with disabilities, thus to enhance their quality of life. The scope covers design of prosthetic components and interfaces, control of prostheses, smart orthotic devices, management of foot problems, stroke, cerebral palsy, scoliosis and other spinal deformities, outcome measures of prosthetic and orthotic interventions, CAD-CAM application, evidence-based practice, and other engineering or clinical aspects of prosthetics and orthotics.\nRehabilitation engineering applies existing or emerging technologies for improving the independence and productivity of persons with disabilities. The Jockey Club Rehabilitation Engineering Centre has offered direct expert services to the disabled and rehabilitation communities since 1987. Many research projects have been developed, namely environmental control and monitoring systems, special seating and mobility devices, augmentative and alternative communication devices, therapeutic training systems and robotic devices.",
  "url": "https://www.polyu.edu.hk/bme/research/research-themes"
 },
 {
  "text": "Experience and Opportunities \nStudy Tours \nBME Study Tour \nBME Study Tour is a self-planned summer activity organized by BME Year-2 students and led by BME academic staff since the Year 2016.\nThe Study Tour not only allows students to gain first-hand experiences and to learn new knowledge by attending academic conferences and visiting overseas universities and museums, but is also an opportunity to promote the image of The Hong Kong Polytechnic University through students’ presentations and sharing during the visits.\nSixteen BME 2016 cohort students went to Czech Republic to participate the 2018 World Congress on Medical Physics and Biomedical Engineering (IUPESM 2018) and visited Charles University in Prague in June 2018. The students found the tour was very fruitful and memorable.\nYear 2018 - Czech Republic",
  "url": "https://www.polyu.edu.hk/bme/experience-and-opportunities/study-tours_new"
 },
 {
  "text": "Research Opportunities \nPlease put at least one valid content allocate to this component.",
  "url": "https://www.polyu.edu.hk/bme/research/research-opportunities"
 },
 {
  "text": "Research Themes \nMedical Imaging and Biosensing \nTheme Co-ordinator\nDr. Lei SUN\nThis thematic research area aims to design and develop new biomedical imaging methods and devices, biosensors, screening methods, and treatment approaches. A key focus of this group is biomedical ultrasound instrumentation and application including 3D ultrasound imaging, ultrasound biomicroscopy, tissue elasticity imaging and measurement, photo-acoustic imaging, ultrasound tissue characterization, ultrasound stimulation, ultrasound assessment for heart, breast, liver, skin, tendon, muscle, cartilage, diabetic foot, etc. Another key focus of this group is biomedical sensing including development of nano- and micro- biosensors, microfluidic devices, nanoporous membrance for sensing, microchip, micro- and smart drug delivery devices. We also develop wearable sensors for healthcare for motion and vital sign monitoring.\nFaculty members in this research area:\nDr Lei Sun\nDr Puxiang Lai\nDr Thomas Lee\nDr James Chung Wai CHEUNG\nIr Prof Yong Ping Zheng\nProf Mo Yang",
  "url": "https://www.polyu.edu.hk/bme/research/research-themes/medical-imaging-and-biosensing"
 },
 {
  "text": "The Department of Biomedical Engineering (BME) is now calling for nominations for the Outstanding Alumni Award of PolyU Department of Biomedical Engineering until 15 March 2023 (Wednesday). \nThe Outstanding PolyU Alumni Award (OPAA) is organised at three levels: Department level, Faculty/ School level and University level. The Departmental OPAA aims to give public recognition to outstanding BME graduates to recognise their diverse accomplishments and contributions. The departmental awardees will be nominated to the Faculty Award. All Faculty awardees will be considered for the University Award.\nAward Categories and Selection Criteria\nIn addition to honouring distinguished graduates for their distinction in their chosen fields, the Award recognises the alumni’s active support to their alma mater. Support and Contribution to PolyU is one of the key selection criteria at all levels.\nFour specific areas of achievement would be given recognition, they include Professional Achievement, Entrepreneurial Achievement, Scholarly Achievement and Community Service Achievement.\nOutstanding Young Alumni Award is introduced for alumni at/under the age of 40.\nAward Category\nDescription\nProfessional Achievement \nThis category recognises alumni who have attained distinguished achievements, demonstrated exemplary leadership, and made a strong impact on their profession/ industry/ society. \nEntrepreneurial Achievement\nThis category recognizes alumni who have demonstrated outstanding innovation and entrepreneurship, as well as founded or advanced business or technology ventures with impact. \nScholarly Achievement\nThis category recognises alumni scholars who have made notable scholarly or research contributions in their disciplines, with proven track record and excellent reputation in the field. \nCommunity Service Achievement\nThis category recognises alumni who have made impactful contributions to the communities, or demonstrated an extraordinary level of commitment, volunteerism and/or philanthropy for promoting the wellbeing of the communities.\nEligibility\nThe nominated candidate must be graduate who has successfully completed full-time or part-time programme offered by PolyU (or its forerunners: Hong Kong Government Trade School, Hong Kong Technical College, and Hong Kong Polytechnic) which led to academic award accredited by the respective Institution.\nThe proposer can be PolyU graduate, Honorary Graduate, University Fellow, PolyU staff, current PolyU Council and Court member and current Advisory Committee member. There is no limit to the number of nominations to be submitted by each proposer. However, the proposer cannot be the candidate himself/ herself or a direct relative of the candidate.\nNomination and Selection Schedule\nThe Department of Biomedical Engineering (BME) is now inviting nominations for the Outstanding Alumni Award of PolyU Department (BME). Please download the Nomination Form and return it to bme.info@polyu.edu.hk with all required supplementary documents on or before 15 March 2023. Selection for Department Award will be conducted in April 2023.\nSelection Committee\nSelection Committee of the University will examine the nominations and assess candidates’ qualifications and performance for the awards. \nConfidentiality \nAll information submitted on this nomination form will be kept strictly confidential and will only be used by the Selection Committee for the purpose of the selection process. The candidate will not be contacted by the OPAA Secretariat until he/she is selected as the awardee of the Outstanding PolyU Alumni Award.\nEnquiries\nDepartment of Biomedical Engineering\nThe Hong Kong Polytechnic University\nHung Hom, Kowloon\nEmail: bme.info@polyu.edu.hk \nTel: 3400 8893",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/call-for-nominations---outstanding-alumni-award-of-polyu-department-of-biomedical-engineering-2023"
 },
 {
  "text": "News and Events \nNews \n1 / 1\nPolyU is committed to the enhancement of teaching and research, and values faculty members’ contributions and achievements in teaching and research. Every year the University pays tribute to the staff who have demonstrated excellent teaching and research through the President's Awards.\nThis year, BME is pleased to announce that Dr Xin Zhao received President's Awards for Excellent Performance/Achievement in Research and Scholarly Activities (Outstanding Young Researcher).\nCongratulations Dr Zhao! ",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2022/the-president-awards-for-outstanding-achievement"
 },
 {
  "text": "2023年度中国发明协会发明创业奖·创新奖公示\n一、项目名称\nScolioscan: 基于三维超声成像的无辐射脊柱侧弯评估系统\n二、完成人 \n1.郑永平教授（香港理工大学） 2.张忠伟博士（香港理工大学）\n3.李天昕博士（香港理工大学） 4.周光泉博士（香港理工大学）\n5.姜娓娓博士（香港理工大学） 6.杨德博士（香港理工大学）\n三、提名者（提名专家）及推荐意见\n提名单位（专家）：香港理工大学\n提名意见：郑永平教授首创Scolioscan带来的三维超声无创无辐射的脊柱侧弯检测的相关技术已在多个国家申请专利与使用，可以促进脊柱侧弯大规模筛查、频繁随访监测、治疗结果测量和进展预测，推进脊柱侧弯早诊早治，大大减低手术治疗。郑教授团队在脊柱三维超声领域开创了多个世界第一。综上考量建议提名郑永平教授Scolioscan: 基于三维超声成像的无辐射脊柱侧弯评估系统为医药卫生一等奖。\n四、主要知识产权（专利情况）目录\n序号\n专利名称\n专利号\n专利权人\n发明人\n法律状态\n1\n用于评估脊柱侧凸的三维（3D）超声成像系统\nCN102497821A0\nUS8900146B2\nEP2459073B1\nAU2010278526B2\nJP5849048B2\nCA2769150C\n香港理工大学\n郑永平，詹姆士.忠伟.张\n授权\n2\n一种三维超声成像装置、系统和方法\nCN103417243A\n中慧医学成像有限公司\n郑永平，张忠伟\n授权\n3\n一种测量脊柱弯曲角度的方法\nCN105982674A\n中慧医学成像有限公司\n郑永平，周光泉\n授权\n4\n一种三维成像方法和系统\nCN107510466A\nUS10945693B2\nCA3027455C\nAU2017285943B2\n中慧医学成像有限公司\n郑永平\n授权\n5\n一种掌上式三维超声成像系统及方法\nCN109223030A\nUS11478219B2\nJP6964751B2\n中慧医学成像有限公司\n郑永平\n6\n一种三维超声成像检测脊柱变形的方法\nCN109223032A\n郑永平\n7\n一种成像方法和装置\nUS11410348B2\nCA3022157C\nAU2016404850B2\nJP6868040B2\n郑永平\n8\n一种三维成像超声波扫描方法\nAU2016299005B2\n9\n一种三维图像成像方法和系统\nAU2017285945B2\nCA3027437C\n10\n一种获得人体骨架的成像方法 \nUS11344279B2\nJP7055860B2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n* 中慧医学成像有限公司是郑永平教授作为联合创始人建立的初创公司，专注于这一技术的产业化。以上中慧医学成像有限公司作为专利权人的专利是通过赞助（50%-50%）香港创新科技署业界大学合作基金的项目而获得。",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2023/announcement-of-2023-china-invention-association-invention-and-entrepreneurship-award"
 },
 {
  "text": "“PolyU BME Alumni Homecoming Day 2022”, the reunion for all BME alumni, was held on 19 November 2022(Saturday). More than 250 alumni, their family members, and friends joined and spent an amazing weekend together on campus and online.\nThis is the first 10th BME, 35th REC anniversary celebration event which provided an opportunity for our alumni to connect with their alma mater and reminisce about the wonderful moments in their campus life. \nAt the ceremony, Prof. Zhang Ming, current head of department shared the latest development of the department. Ir Prof. H.C. Man, Dean of Faculty of Engineering delivered the welcoming remarks and warm greeting to us. Three former heads – Prof. John Evans, Prof. Zheng Yongping and Prof. Mak Arthur shared their message to the department. The outstanding alumni presentation was also conducted on the ceremony. It was followed by the homecoming lunch in Communal Staff Restaurant and laboratory visit in the afternoon.\nThe “PolyU BME Alumni Homecoming Day 2022” was truly a joyful and memorable event for all the participants.\nMore photos are here.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2022/polyu-bme-alumni-homecoming-day-2022"
 },
 {
  "text": "Publication information：\nSpeckle-Based Optical Cryptosystem and its Application for Human Face Recognition via Deep Learning\nQi Zhao, Huanhao Li, Zhipeng Yu, Chi Man Woo, Tianting Zhong, Shengfu Cheng, Yuanjin Zheng, Honglin Liu, Jie Tian*, Puxiang Lai*\nAdvanced Science\nDOI: 10.1002/advs.202202407\n香港理工大學賴溥祥課題組提出了一種基於光學散斑的加密系統，並展示了其在加密人臉識別中的應用：系統的加密部分使用毛玻璃作為物理密鑰（等效密鑰長度為17.2 Gigabit），以光速將人臉圖像加密為隨機光學散斑；系統的解密部分使用神經網絡，將散斑還原成人臉圖像後進行人臉識別。加密人臉識別準確度高達98%。\nDetails: https://mp.weixin.qq.com/s/T_XxXdClrqUqP8r4V6jZAg",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2022/research-news-paper-from-puxiang"
 },
 {
  "text": "Miss TONG Cheuk Ying (18058385D) was selected by the Donor to receive the above Scholarship. Here is the video to illustrate her involvement in the HKIE activities in the past year.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/news/2022/the-hkie-scholarship-201920"
 },
 {
  "text": "As my time as a student editor comes to a close, I would like to share a few words with everyone and recollect some of our moments in BME that we’ve shared together. In turn, I hoped that we have all learned more about what PolyU BME is all about.\nWhen I first started this job in the first semester of year 2, I was still quite puzzled as to what to promote in BME. At this stage, most of my learning was more conceptual and on paper. It consisted mainly of human biology, physics, and mathematics. To make matters worse, this learning was done at home due to the pandemic situation. \nIf you have followed the BME Instagram account @bme_polyu, you would probably have noticed that many of the stories in my student life, mainly only include the online labs and math concepts that were taught in class. These were all portrayed by simply taking a photo of my desk. Although, I would also argue that when studying BME be ready to sacrifice a significant portion of your time to studying at a desk. However, at that point, much like the content I showcased, it seemed quite bland, and I didn’t feel like it showed much of what the field of biomedical engineering is and the more hands-on technical aspects of engineering. \nAs time passed, this job allowed me to participate in greater opportunities. For example, I was able to interview different professors at our faculty, such as Ir Prof. Zheng Yong Ping and Dr. Lau Hin Chung to gain more of an insight on how biomedical engineering is structured and taught at PolyU. Next, I was also able to interview different alumni from PolyU BME who have gained a number of years of experience in the working field of BME to share with us some of their past stories and their view of the working field of BME in Hong Kong. Furthermore, I also took part in some promotional photo and video shooting for the year 1 biomedical engineering lab visits, which I unfortunately never experienced due to the COVID-19 situation. Hence, I hope through sharing these experiences together has made us all learn more about PolyU BME.\nAside from sharing about what I have learned in my time spent inside PolyU BME, I also shared some of the life lessons I have learned along the way reflected by my feature stories “How important are the 5 things to do in university?” and “My Internship Experience”. Through these stories, I hope that not only would people learn more about what it is like to study in HK and be part of an internship experience in HK, but also gain some feel good factors and motivation to carry on and truly learn and discover more about the world around us.\nLastly, I would like to end by saying that it has been an amazing experience to share my time as a student editor with all of you and I hope to see you around campus in the future!\nCredit by Orion KEUNG (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/last-day-as-your-student-editor"
 },
 {
  "text": "Mr. Webber Choi has graduated from The Hong Kong Polytechnic University (PolyU) in 2009. Currently, he is working in the position of team leader of the P&O Department in a public institution. In his interview, Mr. Webber Choi shared his first job experience, memories from PolyU, as well as, what motivated him to choose the path of P&O specialist.\nCan you describe yourself as a student when you were studying in university? Were you passionate about the P&O field at that time?\nEvery time I imagine that time again, I realize that it was such a happy period. I was very glad to join the Biomedical Engineering Students Association I don't know whether the name changed now. I held the position of publication secretary there. It was exciting to be a representative of the BME SS and to join such activity in PolyU.\nIn his interview, Mr. Webber Choi shared his first job experience, memories from PolyU, as well as, what motivated him to choose the path of P&O specialist.\nCan you describe yourself as a student when you were studying in university? Were you passionate about the P&O field at that time?\nAt that time I wouldn’t call myself very smart. But I loved what I learned in PolyU and now can apply that knowledge in the workplace. Of course, I had a passion for the P&O field, especially in fabrication. I used to like making toys, hair styling and creating other things using my hands. Before I got admitted to PolyU I didn't know my final result of the examination, thus I was not sure whether I can be a university student. So, I was thinking if I will not be able to go to the university, I might join a salon to be a hairstylist. I just wanted to make something with my hands, because it is my interest. Now I can do fabrication and can help the people in the medical field at the same time. It's so good to combine them together.\n“- I was thinking if I will not be able to go to the university, I might join a salon to be a hairstylist.”\nWhat is the P&O field like in real life? And can you tell us more about the field and your duties?\nAbout the field\nGenerally speaking, P&O is based on biomedical engineering/biomechanical knowledge and involves decision making, designing, and fabrication of the external device to allow the patients to restore their function and to provide protection to certain body parts.\nIn Hong Kong, to my best knowledge, most of the graduates work in the public hospital. However, some of them may also find jobs in private clinics and hospitals or can become the salesmen for the P&O services. Generally, most of them provide the frontline clinical service.\n*frontline refers to prosthetics and orthotics service to the patient\nDuties of Mr. Webber Choi\nCurrently, I'm a team leader in the department of P&O. Apart from providing the frontline service, I also do some administrative work, for example, managing staff, stock, and materials here. Also, one of my duties is to solve ad hoc problems, because every day we have some issues rising up and I have to make sure that the operation of the department is smooth.\nLimitation for the fabrication\nIn real life, different clinics and departments have their own limitations in working tools and machines, which disturb our decisions about what we can fabricate. Therefore, in real life, it is more practical. The design is based on the same biomechanical engineering knowledge. But fabrication in real life is constricted by the machine and the working tool’s limitations. So we need to consider them when designing the orthoses and prosthesis for the patient.\n“ - Fabrication in real life is constricted by the machine and the working tool’s limitations. We need to consider them when designing the orthoses and prosthesis for the patient.”\nIf you could go back in time, would you attend university again?\n100% - yes, of course. PolyU is so good. I think it really equipped us with practical skills needed for the workplace in the future. Also, it maintains good relationships with the graduates. And the school life in PolyU was so colorful for me. I've made a lot of friends there with whom we still keep in contact. So, of course, I would attend again, and if possible, I would want to go back to university now.\nDo you still remember the biggest transitional issue you encountered when you entered college?\nDuring secondary school, I was studying in my mother tongue, in Cantonese, which is why the first semester in university was a little bit difficult for me due to the English study environment. PolyU is very supportive in these terms. They give you several courses to train your English and the classmates were also so helpful. After the first semester, my English became better and I could enjoy studying.\nThe second issue is that in secondary school we used to have cramming education, it is when the teacher gives you questions and answers which you have to memorize. But in the university mainly you have to do projects. Moreover, there is no exact correct answer, you just have to create something or find the best possible answer. These are the two big transitional issues from secondary school to university.\nCould you, please, share how you decided to go to P&O stream and chose exactly this field?\nActually, it was not planned. When I graduated from school I knew very little about Biomedical Engineering and started to know more only during my freshman year. Thus in the first year, Dr. M.S. Wong conducted an introduction session about P&O. In addition, PolyU tried their best to provide us with field-related information by conducting career talks for example. \nAlso in my first year, we had some short attachments for around five days in the public hospital. I remember there was one case - one of my supervisor’s kids-patients could not walk. Later my supervisor prescribed him a pair of the ankle foot orthoses. I remember how happy the kid was when he tried those ankle foot orthoses on, and finally was able to walk fast. At that moment I realized that the job in the P&O field is very meaningful. I can do my interest – fabrication and also earn the money. Eventually, by the end of the first year, I finally decided to go to P&O stream. Luckily, it was a perfect path for me. \n“- I remember how happy the kid was when he tried those ankle foot orthoses on, and finally was able to walk fast. At that moment I realized that the job in the P&O field is very meaningful.”\nActually, I am lucky to be a team leader and I’m happy about it. As a frontline staff member who is only doing clinical work, sometimes I wanted changes, for example, “Can we purchase a device for a better orthoses fabrication?” or “Can we use a 3D printer for the fabrication of orthoses?”. Some frontline staff did not agree with me, but some of them wanted to bring changes too. And being a team leader, now I can try to buy or try to approach the advanced knowledge and the additional equipment. Therefore, as a team leader, I can try to make the department's operation go smoother. \nFor me, patients and their needs are my top priority, which is why I always try to have a little chat with all of my patients to see what kind of problem they have and what results they are expecting in the future. I am successful because I take my job seriously and I am very responsible. I usually make changes in our departmental work because I want it to operate better and more efficiently. My boss knows that and therefore he trusts and lets me be a team leader of our department.Do you feel that PolyU prepared you for the workforce and the real-world challenges?\nYes, I fully agree with that. Firstly, it is because PolyU BME has a lot of good connections with different BME and P&O related companies and organizations. During the summer we always had different attachments and placements in the hospital. At that time, it was challenging to apply all the knowledge we learned in the university into real-life settings. I used to discuss all the problems and struggles I had during these practices in the hospital with my university professors. I also would like to mention that PolyU BME is well-equipped with all the devices and tools so that each student can get enough practice and knowledge needed in the workplace.\nEven though we had a lot of practice on mannequin patient models, it is not the same as the real-life settings practice. When you work with real patients, you have to treat not only the medical issue but also know how to show psychological and mental support to the patient. \n“ - When you work with real patients, you have to treat not only the medical issue but also know how to show psychological and mental support to the patient.”\nWhat was the most challenging in building your career as a P&O student?\nI think it's the variation of the technical skill and knowledge required in the workplace. I remember the first time when I started working in a hospital, my supervisor and I had different points of view when it came to technical skills, many things that I learned in PolyU did not meet his expectations. So I think the most challenging part was to find out which technical skill is more suitable. \nAs freshly graduated students we don't have a lot of knowledge and experience to spot when our supervisor is right or wrong about certain things, so we have to try by ourselves and sometimes learn from our mistakes to understand what works for us.\nWhat advice would you give to current biomedical engineering students?\nOne main piece of advice is, communicate, discuss and talk more with your professor. Especially in PolyU, all the professors are nice, they love to discuss things with you. When I was in university, I was not close to my professors and regret it now. I think I could discuss more with Dr. M.S. Wong on the design of prostheses and orthoses for example.\nThe BME Editorial Board expresses its gratitude to Mr. Webber Choi for sharing his career stories and experience, intended to let the students explore various aspects of P&O field and see how knowledge and skills gained in university may be applied in the future career.\nWritten by Meruyert AMANGELDY (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering) and Aliya TUMANBAYEVA (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/patient-oriented-frontline-service-and-leading-the-department-of-prosthetics-and-orthotics"
 },
 {
  "text": "Freshman year group project: EMG controlled game \nChoice of the major university program is not the whole life-altering, but still quite a serious decision. It’s not uncommon for high school students to have ambivalent and uncertain thoughts about their future and the path they want to choose. With this article, you can start the journey of finding this path, as it will equip you with knowledge on biomedical engineering and some of my personal experience. \nWhile being a school student who has just received an admission offer from PolyU, I had certain expectations about Biomedical engineering. However, there was a mismatch between expectations and reality, mostly because of limited knowledge about this field before. I realized that although ‘medical’ might sound very appealing, the greater emphasis here should be put on ‘engineering’. Thus, although biomedical engineers’ activity closely relates to human health, they are primarily involved in technical processes. Thus, in the first year, I was actively involved in learning physics, acquiring basic engineering skills and gaining an understanding of what biomedical engineering is. \nVisit to Hong Kong Jockey Club Innovative Learning Centre for Medicine: development of SimMan patient simulator (on the picture) refers to biomedical engineering field \nGenerally, BME is a cutting-edge sector, which has no other way than flourishing in the nearest decades. It is an interesting fusion of biological, medical, IT and engineering concepts, which together form lots of sub-fields, such as bioinstrumentation, biomechanics, cellular, clinical and rehabilitation engineering, medical imaging, etc. All these sub-fields are covered in one or more courses during the bachelor’s program. I was quite interested in biosensors technologies, where among lots of things I familiarized myself with the COVID-19 testing principle, the working mechanism of glucose meters and pregnancy tests, the way smartwatches count our heartbeat. Meanwhile, in other classes, you get to know more about gene technologies, the mechanism behind the MRI, ultrasound, X-ray machines, at the same time working on your R&D project. Overall, it is a diverse and unique experience.\nDevelopment of robotic hand from scratch \nAs in any other field, in biomedical engineering practical knowledge is as important as theoretical. In these terms, our university provides us with many opportunities to get to know this field in real-life settings. There were organized visits to different hospitals in Hong Kong, where we observed the radiology department, department of prosthetics and orthotics, medical wards, etc. Also, we got a chance to interview current BME leaders to learn from their experience. \nField visit to Hong Kong Adventist Hospital, 2019 \nSince the biomedical engineering program gives a little bit of everything, it might seem too broad. To contribute as an engineer, one may need deeper knowledge in one particular area, such as programming or electrical and mechanical engineering. However, diversified education at the end of the day allows comparing and making a mindful choice of the area that attracts you the most. One of the ways to deepen the knowledge in a particular area, while still acquiring a degree, is by engaging in research assistant activity or getting an internship in the desired area. Lastly, BME knowledge is applicable and handy in other industries, such as MBA, sales & marketing, business analysis, sales operations, health economics & reimbursement. The example of such successful integration will be released on the PolyU BME website later on in the summer in the form of an interview with one of our alumni. So, stay tuned!\nWritten by Meruyert AMANGELDY (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/what-is-biomedical-engineering-and-why-you-should-apply-to-it"
 },
 {
  "text": "The art of patience and time-management\nWhen faced with an abundance of problems to be solved, numerous deadlines to be met, and constant pressure from co-workers and clients, it can be quite difficult and frustrating. When asked about the attributes he thinks are pivotal to finding success in his field of work, Fan stated that time management, patience, and communication skills are three of the most important assets to have in his field of work. He describes the high workload of having to write on average almost one to two reports every day, and having to also deal with complaints on a 24-hour basis, while also having to do auditing work. Hence, he believes that it is essential for graduates who are looking to work in this field to possess the ability to take on multiple tasks at once, and have proper time management such that they will be able to deal with the overwhelming workload. Moreover, working in a multi-national corporation, Fan would often have to set up and attend calls, with colleagues from different countries and continents to discuss the products. \nFurthermore, Fan stated that staying patient and calm with good communication skills is pivotal. This is due to the fact that a quality assurance worker would often have to deal with the sales representatives and the customers, who would often be quite distressed from the malfunction of a device. Hence, the quality staff would not only have to help them resolve the problem, but to also assure them that the issue is nothing major and can easily be resolved. As the quality assurance manager in Asia, Fan also has to constantly fly to factories located in different countries such as Indonesia in order to assess the quality control of the production line. Hence, he would often have to keep the conversations simple and clear to ensure that the translator will have no problem in translating the messages back and forth.\nProblem solving\nAs discussed above, a large part of being a quality assurance worker requires problem solving. Fan stated that as a quality assurance worker, there were not many experienced quality assurance workers who could provide help and insight, and therefore he would often have to face the issues as a “one man band”. He found that this was a great challenge to his job as it was hard for him to seek help from other people. At times, even if he was able to obtain solutions from the manufacturing sites, it may not be suitable for his setting, and he would have to think of alternative solutions. He gives the example of a manufacturing site may not often give solutions that are tailored to Hong Kong. For example, the United States may have systems and policies in place to help people suffering from diabetes, where as Hong Kong may not, and thus the solution may be practical in the United States, but unsustainable in Hong Kong. Hence, he would often have to get creative and think of other alternative solutions that would work for the setting of Hong Kong or Asia.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/the-road-to-become-a-quality-assurance-manager"
 },
 {
  "text": "Feature Stories \nHow important are the “five things\" to do during university life? \nPerhaps ingrained into the culture of universities around Hong Kong, the “five things to do during university life” is a well-known phrase for students studying in Hong Kong. Such things include “living in halls”, “getting into a romantic relationship”, “studying”, “get a part-time job”, and “join the student societies”. Local Hong Kong students may have been talking about this with their peers in high-school, whereas students from other backgrounds may be unfamiliar. Regardless, one of the first things you hear about university—whether it is through a pamphlet handed to you on orientation day, through your friends, or through speaking with senior students—are the five things to do during university life. However, why exactly are they so significant to our lives?\nWith the university being the transition between adolescence and adulthood, one may find themselves carrying a larger burden of responsibilities than before. The five things which are talked about are all activities that will require a certain level of responsibility. In an interview with Canadian professor Dr. Jordan Peterson, he was asked to give advice to people in their 20s. He stated, “Don’t be afraid of taking on responsibility, it’s where you find what sustains you in life.” Thus, to a certain extent, partaking in such activities can help for the betterment of self-discipline and can prepare one for larger responsibilities later on in life.\nIt is important to note that the “five things to do in university life”, which is, quintessentially a social norm, could also be a double-edged sword. Many people who fail to complete those tasks may find themselves feeling inferior, especially in instances whereby they get unpleasant remarks from their peers. In turn, irrational thoughts and decisions may be made that could result in negative consequences. For example, one could rush into a relationship that they don’t enjoy, live in halls without properly preparing oneself, or spend too much time in their student societies, thereby neglecting their other responsibilities. Such consequences may do more harm than good. Hence, despite the importance of stepping out of the comfort zone, it is also essential to maintain a balance within the mind and recognize that it is completely fine to not blindly conform to such social norms.\nWritten by Orion KEUNG (Year 2 -Bachelor of Science (Honours) in Biomedical Engineering) \nExpanding the abovementioned ideas further into other areas of life, perhaps you underperformed in a test that you had prepared for, or are struggling to find job opportunities, or are experiencing any form of loss. It is important to not be disheartened by such seemingly negative events. Furthermore, such five things in university will evolve to other social norms such as being able to buy a house, buying a car, etc. One should recognize that it is not essential to conform to such norms, and should live knowing that they are striving to pursue their own version of happiness. Additionally, being able to differentiate between factors within your control and external factors that are not within your control is an important mindset to carry in your journey of resilience when things turn against you. Through recognizing this, what previously felt tragic may suddenly feel quite unimportant. Looking back from the future, you may see how much you developed as a person. I hope that from this story, you will be able to be more inspired to take on more responsibilities and have the resilience to carry on through the increased responsibilities.",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/how-important-are-the-five-things-to-do-during-university-life"
 },
 {
  "text": "What does it mean to learn at PolyU BME?\nThe transition between adolescence to adulthood can be a daunting process. During this stage, people often have to change from prioritizing acquiring knowledge for oneself to thinking about how they can use their own skills and knowledge to help the community. At PolyU BME, one of our mission statements is to nurture future leaders in prosthetics and orthotics, clinical engineering, medical instrumentation and sensors, and biological engineering by imparting interdisciplinary knowledge, innovative ideas, critical thinking and practical skills. Through conducting an interview with Dr. Hin Chung Lau, our Programme Leader (BSc in BME) here at PolyU BME, we learn how he envisions to nurture his students to transition from solely focusing on academics to becoming more aware of how to help the community.\nThe importance of purpose\nThe process of learning is something that is self-driven. It can be especially dull for certain students if they fail to understand the significance of the task. In turn, students may lack the ambition to motivate oneself to perform at their best. When asked about how Dr. Lau keeps his students interested in the subjects that he teaches, he stated “As BME is so broad. Some students may only be interested in a particular area, for example, chemistry or biomedical sensors. The subjects that I teach are more related to physics, like electronics and medical equipment. Not every student will be too keen in studying such things. It is therefore important for the students to know what they are learning and the implications of the knowledge in their future careers.”\nIn order to allow students to recognize the significance of their study and project work, Dr. Lau has been organizing territory-wide student project competition in Hong Kong since 2018 to promote the role of biomedical engineering in enhancing the quality of living in the community. “Many people understand that the ageing population and COVID-19 present new challenges to the society.” claims Dr. Lau, “We must work directly and together with the stakeholders to achieve meaningful impact. The competition that I organize relates to STEM education and require students to work closely with the stakeholders to design products or services to fulfil their needs. I hope to change how students, not only within PolyU BME, understand how they can apply their knowledge to enable us to live healthier and more comfortably. This is the reason why I organize such competitions, and of course to promote BME to the general public as well.”",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/interview-with-hin-chung"
 },
 {
  "text": "People \nAcademic Staff \nDr Hin Chung Lau \nDr Hin Chung Lau\nSenior Teaching Fellow, Programme Leader (BSc in BME) \nPromotes cross-faculty student collaboration in entrepreneurship and service-learning projects\nST408 \n+852 2766 7674 \nhinchung.lau@polyu.edu.hk \nResearch Interests\nFoot Ulcers \nForce & Motion Analysis \nShear Force & Wearable Sensors \nMobile Medical Apps ",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-hin-chung-lau"
 },
 {
  "text": "Academic Staff \nMs Jessie Kar \nBiography\nMs. Jessie Kar received her M.Phil in Textiles and Clothing from the Hong Kong Polytechnic University where she worked on the relationship between thermal and moisture transfer properties of T-shirts and the human comfort sensations. She have worked in the Service-Learning and Leadership Office for 10 years and her first project was to develop e-Learning modules for students and teachers on service-learning. She also worked closely with different faculty members in planning, executing and assessing large-scale local and off-shore STEM service-learning subjects and projects. She has worked in the Department of Biomedical Engineering since 2021 and she is responsible for offering service-learning subjects and projects.\nEducation and Academic Qualifications\nInstructor, Department of Biomedical Engineering, Faculty of Engineering, the Hong Kong Polytechnic University, 2021 - Current\nService-Learning Officer, Service-Learning and Leadership Office, the Hong Kong Polytechnic University, 2011 - 2021 \nResearch Associate, Institute of Textiles and Clothing, the Hong Kong Polytechnic University, 2009 - 2011",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/ms--jessie-kar"
 },
 {
  "text": "Academic Staff \nIr Albert Ka Fat Poon \nIr Albert Ka Fat Poon\nProfessor of Practice \nNurtures students with practical experiences in clinical engineering\nST421d \n+852 3400 3201 \nalbert.poon@polyu.edu.hk \nResearch Interests\nBiomedical Engineers Training \nClinical engineering \nHealth Technology \nMedical Device Regulation \nAcademic and Professional Experiences\nQuality engineering in electronics industry, 1976-1981\nBiomedical and healthcare engineering in EMSD, Hong Kong Government, 1981-2011\nVisiting Lecturer to HK Polytechnic and Technical Institute, 1981 - 2002\nProject Consultant for the survey of medical devoice regulation in East African countries, 2011-2012\nHospital Engineering Consultant for HK Baptist Hospital, 2012-2016\nAssociate Specialist Lecturer for SGS HK Academy on MD Regulation courses, 2013-2015\nHospital Engineering Consultant for HK Adventist Hospital-Stubbs Road, 2016 - Current\nProfessor of Practice for BME Department, HK PolyU in areas of Clinical Engineering and Medical Technology Management and Regulation\nHospital Biomedical Consultant for HK Adventist Hospital-Tsuen Wan, 2017 –current\nVisiting Professor to BME Department of City University of HK, 2015 - 2019 for HKIE Top-up course.\nSpecialist Lecturer for HKU SPACE medical and scientific programme, 2018-2019\nVisiting Professor to BME Department of CUHK for years 2019 and 2020 in Masters programme\nBiomedical Consultant of GE Healthcare Co. for Hospital Authority contract, 2019- current\nEsteem Measures\nHonorary Appointments\nFounding Chairman and Chairman for two later-on sessions of the Biomedical Division of HK Institution of Engineers , 1986/7, 1999/2000 and 2010/11\nChairman and Panel Members, total of over 12 years voluntary service in Biomedical Discipline Advisory Panel , 2005 – 2017 and 2020 current\nChairman of IEE Hong Kong Branch for 3 sessions during, 1981 - 2005\nChairman of IEE Asia Region and Chairman of Asia Executive Committee (AEC) , 2000-2003\nCore Team for Asia Harmonization Working Party (AHWP) to develop medical device regulations amongst Asian countries.\nChairman of MD Pre-market Working Group of AHWP Tc , 2004 - 2008.\nChairman of Technical Committee (TC) of Asia Harmonization Working Party (AHWP) , 2005 -2008\nCo-Chair of IVD Pre-market Working Group of AHWP Tc for years of 2012 to present 2020.\nMember of Technology Committee for NT West Cluster & Tuen Mun Hospital of Hospital Authority , 2009 - 2020 current\nAppointed WHO Technical Advisor on Medical device and member of the Technical Advisory Group (TAG) for Medical Devices and Essential Medical Products , 2009 – current\nProject Member with London School of Hygiene and Tropical Medicine to develop medical diagnostics regulation in African Countries and for formation of Pan African Harmonization Working Party ,2011-2014\nHonorary Advisor for HK Medical and Healthcare Device Industries Association , 2011 – current\nMember of Clinical Engineering Board (CED) of International Federation of Medical and Biological Engineering (IFMBE), 2012 - 2018\nAssociate Specialist for Medical Device Programme for SGS HK Academy, 2013-2015\nMember of Departmental Advisory Committee (DAC) of BME Department of City University of HK, 2015 to current\nMember of Health Technology Assessment Board (HTAD) of International Federation of Medical and Biological Engineering (IFMBE), 2019 – current",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/ir-albert-kf-poon"
 },
 {
  "text": "Prof. Zhang received his BSc in automation control engineering, MSc in mechanical engineering, from Beijing Institute of Technology in 1982 and 1987, and PhD in medical engineering from King’s College, University of London in 1995. He currently is a Chair Professor of Biomechanics, Head of the Department of Biomedical Engineering, and Director of Research Institute for Sports Science and Technology. Prof Zhang is Councilor of World Council of Biomechanics (WCB), President of World Association for Chinese Biomedical Engineers (WACBE), Chair of Chinese Society of Rehabilitation Engineering, Committee member of Chinese Society of Biomechanics, Committee member of Biomedical Division of Hong Kong Institute of Engineers, and Standing Council Member of Chinese Society of Biomedical Engineering and Vice President of China Rehabilitation Devices Association. He also serves as editorial board number for a few journals and chaired a number of conferences.\nHe has published more than 400 journal papers and book chapters. Prof Zhang received the 2005 Outstanding Young Scholars Fund for Overseas or Hong Kong and Macau Young Scholars, National Natural Science Foundation of China, and has won a number of international awards, including the Natural Science Award (First-class) of 2015 Higher Education Outstanding Scientific Research Output Awards by the Ministry of Education, and The Hong Kong Polytechnic University President’s Awards for Excellent Performance/Achievement in Research and Scholarly Activities 2016.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/prof-zhang-ming"
 },
 {
  "text": "Biography\nProfessor Dong obtained his Bachelor’s degree in Engineering Mechanics and Fluid Dynamics from Shanghai Jiao Tong University, China in 1982. He further received his higher degrees from Columbia University, USA, including Master’s degree in Civil Engineering and Engineering Mechanics in 1984, as well as Master of Philosophy degree in 1986 and Doctor of Philosophy degree in 1988, both in Bioengineering and Engineering Mechanics. Professor Dong joined the Pennsylvania State University (Penn State), USA, as Assistant Professor in 1992 and was promoted to Associate Professor and Professor in 1997 and 2003 respectively. He has been appointed as Distinguished Professor of Biomedical Engineering since 2009 and served as Department Head of Biomedical Engineering at Penn State during 2011-22.\nProfessor Dong is a Member of the United States National Committee on Biomechanics; a Fellow of the Biomedical Engineering Society (BMES), the American Institute of Medical and Biological Engineering (AIMBE), and the International Academy of Medical and Biological Engineering (IAMBE); a Council Member of the International Society of Biorheology; a past Chair of the BMES Cellular & Molecular Bioengineering Special Group; and a past Secretary of the US national Biomedical Engineering Council of Chairs. He is a Managing Editor for Frontiers in Bioscience; an Associate Editor for BMES Cellular and Molecular Bioengineering, Molecular and Cellular Biomechanics; and an Editorial Member of the Journal of Medical Biomechanics and Journal of Medicine in Novel Technology and Devices. He has received several prestigious awards, including the Faculty Career Award from the US National Science Foundation; Faculty Research Award from the American Cancer Society; Y.C. Fung Investigator Award from the American Society of Mechanical Engineers (ASME), Melville Medal and Best Journal Paper Award from ASME; and Harold Lamport Young Investigator Award from BMES.\nA major focus of Professor Dong's research is to elucidate cellular functions in the circulatory system related to cell adhesion and migration, and study micro-hemodynamics, cellular biomechanics, inter-/intra-cellular signaling, cancer immunology and metastases. In particular, he investigates how fluid dynamics, adhesion kinetics and tumor microenvironment change leukocyte and endothelial immune functions which subsequently affect tumor cell extravasation and metastasis. In recent years, Professor Dong focuses on cell engineering and adaptive immunotherapies, using chimeric antigen receptor (CAR) immune cell mediated nanoparticle, drug, antibody or miRNA deliveries that target either brain tumors across the blood-brain barrier or inflammatory responses in regenerative tissues.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/prof-dong-cheng"
 },
 {
  "text": "Prof. Arthur Mak obtained his B.Sc. in Engineering Mechanics with highest honor from University of Illinois at Urbana-Champaign in 1976 and earned his Ph.D. in Biomechanics at Northwestern University in 1980. After a postdoctoral fellowship in Tissues Mechanics under Professor Van Mow at Rensselaer Polytechnic Institute, he took up an Assistant Professorship in Bioengineering & Orthopedic Research at University of Pennsylvania. After completing his M.A. from Westminster Theological Seminary, Arthur joined the Jockey Club Rehabilitation Engineering Center at PolyU in 1988 and became Chair Professor in 1997. He later also served PolyU as Founding Head of Department of Health Technology & Informatics, Associate Vice President (Academic), and Founding Dean of Students. Arthur moved to CUHK in 2011 and led the Biomedical Engineering Programme there as its Director & Division Head. Upon his retirement from CUHK, he joined HKBU as Associate Vice President (Student Experience) in 2019. He rejoined PolyU in 2023 as Interim Director of the Institute for Higher Education Research and Development. \nProf. Mak has been very active professionally in biomedical and rehabilitation engineering, both locally and globally. He has served in the World Council on Biomechanics, International Society for Prosthetics and Orthotics, the Asia-Pacific Working Group of International Federation for Medical and Biological Engineering, etc. He was President of the World Association for Chinese Biomedical Engineers, and is an elected Fellow of the American Institute for Medical and Biological Engineering.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/prof-arthur-fuk-tat-mak"
 },
 {
  "text": "Biography\nProfessor Yongping Zheng received the BSc and MEng in Electronics and Information Engineering from the University of Science and Technology of China. He received PhD degree in Biomedical Engineering from the Hong Kong Polytechnic University (PolyU) in 1997. After a postdoctoral fellowship at the University of Windsor, Canada, he joined PolyU as an Assistant Professor and was promoted to Professor in 2008 and Chair Professor in 2019 respectively. He served as the Associate Director of the Research Institute of Innovative Products in PolyU from 2008 to 2010. He has served as the Founding Head of Biomedical Engineering during 2012-2020. Prof. Zheng has been appointed as Henry G. Leong Professor in Biomedical Engineering since July 2017. He is currently also the Director of Jockey Club Smart Ageing Hub and the interdisciplinary Research Institute for Smart Ageing. \nProf. Zheng’s main research interests include biomedical ultrasound instrumentation, soft tissue elasticity measurement and imaging, 3D ultrasound imaging, and smart aging technologies. He is a Senior Member of IEEE, a Fellow of Hong Kong Institution of Engineers (HK), Secretary of World Association of Chinese Biomedical Engineers (2017-2019), the past Chair of Biomedical Engineering Division of HKIE and Honorary Advisor of Hong Kong Medical and Healthcare Device Industry Association (HMHDIA). He also serves as the President of Guangdong Hong Kong Macau Chapter of the International Society of Gerontechnology. He serves as Associate Editor and Editorial Board Members for some leading journals in the field.\nHe has trained over 10 PhD and 8 MPhil students, and over 10 postdoctoral fellows, and many of them are now Professor and Associate Professors in different universities in Mainland China. He also owned more than 45 patents, published 220 journal papers, and wrote two books “Measurement of Soft Tissue Elasticity In Vivo: Techniques and Applications” and “Sonomyography: Dynamic and Functional Assessment of Muscles, a number of technologies invented by his team have been successfully commercialized, including Scolioscan (http://scolioscan.com), an ultrasound device to provide radiation-free assessment of scoliosis.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/prof-zheng-yong-ping"
 },
 {
  "text": "Biography\nDr. Lei SUN, an Associate Professor in the Department of Biomedical Engineering, the Hong Kong Polytechnic University. He received his bachelor's degree from the University of Science and Technology of China and his Ph.D. from Pennsylvania State University. He then conducted postdoctoral research at the University of Southern California. And joined the Hong Kong Polytechnic University in 2008. His research interests include understanding the underlying mechanisms and possible translational strategies of using ultrasound for neuro-modulation and brain stimulation, investigating the potentials of ultrasound bio-effects for cancer therapy and diabetes, and multimodality molecular imaging and theranostics.\nDr. Lei SUN has 20 years of research and development experience in medical ultrasound technology, including system development, signal/image processing and biomedical applications. As a PI, he has managed numerous research projects such as Research Grants Council General Research Fund (GRF), Health and Medical Research Fund (HMRF), Innovation Technology Fund (ITF), and National Natural Science Foundation (NSFC), with a total funding of over 38 million Hong Kong Dollars. He also participated in the 973 project of the Ministry of Science and Technology. He has published more than 200 peer-reviewed journal articles and international conference proceedings, including Advanced Science, Biomaterials, Cell Reports, npj Regenerative Medicine, Acta Biomaterialia, iScience, Ultrasound in Medicine and Biology, IEEE Transactions on Biomedical Engineering, IEEE Transactions on Ultrasonics Ferroelectrics Frequency Control, etc. Dr. Sun is a member of the Institute of Medical Ultrasound Engineering of the Chinese Society of Biomedical Engineering and a member of the Instrument and Equipment Development Committee of the Chinese Society of Ultrasound and Engineering. He has chaired/co-chaired many international conferences and won several best papers/poster awards, e.g. the research achievement awards from the Faculty of Engineering Hong Kong Polytechnic University.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-lei-sun"
 },
 {
  "text": "Academic Staff \nDr X.L. Hu \nDr Hu Xiaoling received her PhD in Electronic Engineering from The Chinese University of Hong Kong. Since graduation, she has been devoting herself in the area of Biomedical Engineering at PolyU. Currently, she is an Associate Professor in Dept of Biomedical Engineering. Dr. Hu invented several hybrid robots for stroke rehabilitation, e.g., neuromuscular electrical stimulation (NMES) and robot hybrid exoskeletons and mobile exo-neuro-musculo-skeletons. The core patents of the inventions have been licensed out to companies for further commercialization. Dr. Hu serves as a reviewer of journals, including Annuals of Biomedical Engineering, Biomedical Signal Processing and Control, Clinical Biomechanics, Journal of NeuroEngineering and Rehabilitation, Journal of Applied Biomechanics, Sports Medicine, Arthroscopy, Rehabilitation, Therapy & Technology, and Current Medical Imaging Reviews. She is also an associate editor for Journal of NeuroEngineering and Rehabilitation and IEEE Transactions on Neural Systems and Rehabilitation Engineering. Dr. Hu has served as a committee member of IEEE Engineering, Medicine, and Biology Society (EMBS), Hong Kong and Macau Joint Chapter since 2008. She was the programme officer of the Chapter in 2008 and 2009, the secretary in 2010 and 2011, and was the vice chair from 2017 to 2019. \nResearch Interests\nNeural Engineering \nMulti-module Robotic System \nBiomechatronic Engineering \nBio-Signal Processing \nStroke Rehabilitation \nSports Medicine \nWearable Technology \nQuantitative Measurement for Diagnosis and Evaluation \nAcademic and Professional Experiences\nPanel Member: Assessment Panel (AP) of the “Innovation and Technology Fund for Application in Elderly and Rehabilitation Care” (I&T Fund), Social Welfare Department, The Government of the Hong Kong SAR, Nov 2019 – current\nCommittee Member, Institute of Electrical and Electronics Engineers (IEEE) Engineering, Medicine, and Biology Society (EMBS), Hong Kong and Macau Joint Chapter, Jan 2020 – current\nVice Chair, IEEE EMBS Hong Kong and Macau Joint Chapter, Jan 2017 – Dec 2019\nCommittee Member, IEEE EMBS Hong Kong and Macau Joint Chapter, Jan 2012 – Dec 2016\nResearch Output\nAssociate Editor, Jan 2020 – Present, Journal of NeuroEngineering and Rehabilitation\nLead guest editor, Automations in Long-term Neurorehabilitation, Frontiers in Neurology & Frontiers in Neurorobotics, https://www.frontiersin.org/research-topics/14876/automations-in-long-term-neurorehabilitation 2020\nThe Editor, Intelligent Biomechatronics in Neurorehabilitation, Elsevier, U.K., ISBN: 9780128149423. 2019\nLead Guest Editor, Special Issue of ‘Neural Engineering for Rehabilitation' in Behavioural Neurology. 2017\nLead Guest Editor, Special Issue of ‘Neural Computation for Rehabilitation’ in BioMed Research International. 2014\nY.H. Huang, J. Jiao, J.Y. Hu, C.C. Hsing, Z.Q. Lia, Y. Yang, X.L. Hu.*, Measurement of sensory deficiency in fine touch after stroke during textile fabric stimulation by electroencephalography (EEG), Journal of Neural Engineering, doi: 10.1088/1741-2552/aba160, 2020.\nZ.Q. Guo, Q.Y. Qian, K.F. Wong, H.L. Zhu, Y.H. Huang, X.L. Hu*, Y.P. Zheng, Altered Corticomuscular Coherence (CMCoh) Pattern in the Upper Limb During Finger Movements After Stroke, Front Neurol. doi: 10.3389/fneur.2020.00410, 2020.\nY.H. Huang, C.Y. Nam, W.M. Li, W. Rong, Y.N. Xie, Y.C. Liu, Q.Y. Qian, X.L. Hu*, A comparison of the rehabilitation effectiveness of neuromuscular electrical stimulation robotic hand training and pure robotic hand training after stroke: A randomized controlled trial, Biomedical Signal Processing and Control, doi: 10.1016/j.bspc.2019.101723 , 2020\nQ.Y. Qian, C.Y. Nam, Z.Q. Guo, Y.H. Huang, X.L. Hu*, S. Ng, Y.P. Zheng, W.S. Poon, Distal versus proximal – an investigation on different supportive strategies by robots for upper limb rehabilitation after stroke: a randomized controlled trial, Journal of Neuroengineering and Rehabilitation, doi: 10.1186/s12984-019-0537-5, 2019.\nY.H. Huang, W.P. Lai, Q.Y. Qian, X.L. Hu*, W.C. Tam, Y.P. Zheng, Translation of robot-assisted rehabilitation to clinical service: a comparison of the rehabilitation effectiveness of EMG-driven robot hand assisted upper limb training in practical clinical service and in clinical trial with laboratory configuration for chronic stroke, BioMed Eng OnLine, doi: 10.1186/s12938-018-0516-2, 2018.\nC.Y. Nam, W. Rong, W.M. Li, Y.N. Xie, X.L. Hu*, Y.P. Zheng, The Effects of Upper-Limb Training Assisted with an Electromyography-Driven Neuromuscular Electrical Stimulation Robotic Hand on Chronic Stroke. Front Neurol. doi: 10.3389/fneur.2017.00679. 2017.\nQ.Y. Qian, X.L. Hu*, Q. Lai, S.C. Ng, Y.P. Zheng, W.S. Poon, Early Stroke Rehabilitation of the Upper Limb Assisted with an Electromyography-Driven Neuromuscular Electrical Stimulation-Robotic Arm, Frontiers in Neurology, 2017, doi:10.3389/fneur.2017.00447.\nW. Rong; W.M. Li; M. Pang; J.Y. Hu; X.J. Wei; B.B. Yang; H.W. Wai; X.X. Zheng; X.L. Hu*, A Neuromuscular Electrical Stimulation (NMES) and Robot Hybrid System for Multi-joint Coordinated Upper limb Rehabilitation after Stroke, Journal of NeuroEngineering and Rehabilitation, 2017, 10.1186/s12984-017-0245-y.\nX.L. Hu*, Y.W. Wang, T. Zhao, A. Gunduz, ‘Neural Coding for Effective Rehabilitation’, BioMed Research International, 2015, doi: 10.1155/2014/286505.\nX.L. Hu, K.Y. Tong, S.K. Ho, J.J. Xue, W. Rong, L.S.W. Li, Wrist Rehabilitation Assisted by an Electromyography (EMG)-driven Neuromuscular Electrical Stimulation (NMES)-robot after Stroke, Neurorehabilitation and Neural Repair, 2014, doi:10.1177/1545968314565510.\nQ.Y. Qian, C.Y. Nam, W. Rong, W.M. Li, Z.Q. Guo, Y.H. Huang, X.L. Hu*, Y.P. Zheng, W.S. Poon, Robotic and Neuromuscular Electrical Stimulation (NMES) Hybrid System, in Intelligent Biomechatronics in Neurorehabilitation, edited by X.L. Hu, Elsevier, U.K. ISBN: 9780128149423, 2019.\nY.H. Huang, W.P. Lai, Q.Y. Qian, X.L. Hu, E.W.C. Tam, Y.P. Zheng, Translation of robot-assisted rehabilitation to clinical service in upper limb rehabilitation, in Intelligent Biomechatronics in Neurorehabilitation, edited by X.L. Hu, Elsevier, U.K. ISBN: 9780128149423, 2019.\nX.L. Hu, K.Y. Tong, R. Li, M. Chen, J.J. Xue, S.K. Ho, P.N. Chen, Chapter 8: Combined Functional Electrical Stimulation (FES) and Robotic System Driven by User Intention for Post-Stroke WrÍst Rehabilitation, in Biomechatronics in Medicine and Health Care, Pan Stanford Publishing, Singapore, 2011.\nX. L. Hu, R. Song, X. J. Zheng, W. W. F. Leung, S. Ng, S. S. Y. Au-Yeung, K. Y. Tong, Chapter 5:‘A Novel continuous Intention-Driven Rehabilitation Robot and Its Training Effectiveness’, in Biomechatronics in Medicine and Health Care, Pan Stanford Publishing, Singapore, 2011.\nHu XL, Tong KY, Li R, Chen M, Xue JJ, Ho SK, Chen PN, Chapter 43: Combined Functional Electrical Stimulation (FES) and Robotic System for Wrist Rehabiliation after Stroke, 2010 vol 8, ppl176-I80, in Annual Review of CyberTherapy and Telemedicine, edited by B.K. Wiederhold, G. Riva, and S. Kim, IOS Press, The Netherlands.\nS.K. Ho, K.Y. Tong, M. Chen, H.F. Zhou, P. Pang, X.L. Hu, D.T.W. Ng, ‘Hand Rehabilitation Robot using Electromyography (EMG)’, in Biomechatronics in Medicine and Health Care, Pan Stanford Publishing, Singapore, 2011.\nW. D. Chen, J. H. Dai, Y. W. Wang, S.M. Zhang, N.G. Zhang, X. X. Zheng, X. L. Hu,‘Neuromic Interface- Implanted Brain Machine Interfaces in Rats’, in OMICS: Biomedical perspectives and Applications, CRC Press, USA, 2011.\nK. Y. Tong and X. L. Hu, ‘Service Robotics: Robot-Assisted Training for Stroke Rehabilitation’, in Service Robotics, I-Tech Education and Publishing, Vienna, Austria, 2008.\n‘Mobile Exo-neuro-musculo-skeleton for Upper Limb Rehabilitation after Stroke’ IAS Workshop on Neural Engineering and Rehabilitation, Hong Kong, 2019\n‘Voluntary Intention Driven Exo-neuro-musculo-skeleton for Mobile Rehabilitation after Stroke’, NSFC-RGC Mainland China and Hongkong Young Scholars Forum on Flexible Electronics and Digital Healthcare, 2018.\n‘Mobile Exo-neuro-musculo-skeleton’, InnoCarnival 2018, Hong Kong.\n‘Intelligent Rehabilitation Robots for Stroke Rehabilitation’, Youth Forum of the Biomedical Engineering Society of China, Tianjin, 2018.\n‘Voluntary Intention Driven Neuromuscular Electrical Stimulation (NMES) and Robot Hybrid Systems in Upper Limb Rehabilitation’, BIT’s 9th World Gene Convention 2018, Singapore, 2018.\n'Intelligent Rehabilitation Robots for Stroke Rehabilitation', the 158th West Lake Forum on Neural Interface for Rehabilitation Engineering, Hangzhou, China, 2017\n'Voluntary Intention Driven Rehabilitation Robotics for Stroke Rehabilitation', The 2nd International Conference of BCI: Science and Practice, Samara, Russia, 2016.\n'Rehabilitation Sleeve -A Functional Electrical Stimulation (FES) and Robotic Hybrid System for Stroke Rehabilitation', in APAC Innovation Summit 15, 2015, Hong Kong.\n‘Intelligent Robotics for Stroke Rehabilitation’, in Macau BME Forum 2014, Macau.\n‘Virtual Reality Cognitive and Instrument-Assisted Stroke Rehabilitation’, in 15th Annual Cybertherapy & Cyberpsychology Conference, 2010, Korea.\nESTEEM MEASURES\nAWARDS RECEIVED BY SUPERVISED STUDENTS (Chief Supervisor)\nWong, Jiancong, Ekon Medical Limited, winner of PolyU Micro Fund, 2015\nRemovable Intelligent Direction Differentiation System For White Cane, winner of the “Merit Award” at the 10th International Convention on Rehabilitation Engineering and Assistive Technology (i-CREATe 2016), 25-28 July 2016, Thailand.\nQiuyang Qian, Second Prize Winner, Student Paper Competition, IEEE EMB Hong Kong and Macau Joint Chapter, 2015\nYanhuan Huang, Second Prize Winner (postgraduate session), Student Paper Competition, IEEE EMB Hong Kong and Macau Joint Chapter, 2016.\nChingyi Nam, First Prize Winner (undergraduate session), Student Paper Competition, IEEE EMB Hong Kong and Macau Joint Chapter, 2016.\nQiuyang Qian, Third Award, Student Paper Competition, the 11th IEEE-EMBS International Summer School and Symposium on Medical Devices and Biosensors (MDSS 2017), 2017\nQiuyang Qian, Best Paper Award, Young Investigator Paper Competition, the 8th WACBE World Congress on Bioengineering, 2017\nZiqi Guo, Third Prize Winner (postgraduate session), Student Paper Competition, IEEE EMB Hong Kong and Macau Joint Chapter, 2018\nZiqi Guo, 2nd Runner-up, Hong Kong Medical and Healthcare Device Industries Association Student Research Award 2017, Dec\nChingyi Nam, 1st Prize Award, First Prize Winner (postgraduate session), Student Paper Competition, IEEE EMB Hong Kong and Macau Joint Chapter, 2019.\nRESEARCH AWARDS OF THE TEAM\nGrand Prize, Gold Medal and Special Merit Award, Mobile Exo-neuro-musculo-skeleton for Upper Limb Rehabilitation after Stroke, 47th International Exhibition of Inventions of Geneva, 2019.\n2nd Runner-up of Most Favorite PolyU Research News of 2018, Mobile Exoneuromusculoskeleton for stroke rehabilitation, 2019.\nTop 100 Science Spinoffs 2018 in Science Department SPINOFF.COM Database (SDB), covering all industries, 2018. (Uniqueness of the technology, high commercial potential and positive impact on the humanity’s well-being)\nGold Medal and Special Merit Award, Rehabilitation Sleeve - An FES-robot Hybrid System, 43rd International Exhibition of Inventions of Geneva, 2015.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-xiaoling-hu"
 },
 {
  "text": "Dr Thomas Lee \nDr. Thomas Lee is currently an Associate Professor and serving as the Associate Head (Academic). He received his bachelor's, master's, and doctoral degree in Chemical Engineering from The Hong Kong University of Science and Technology. He joined PolyU BME in 2006. His research focuses on in vitro diagnostics, in particular point-of-care and on-site testing. He has worked with surface functionalization of nanomaterials (e.g., gold nanoparticles, quantum dots, and graphene oxide) for biosensing applications. His research team is currently working on COVID-19 testing based on isothermal nucleic acid amplification (loop-mediated isothermal amplification). For teaching, he is now teaching/coordinating “Biosensors: Theories and Biomedical Applications”, “Biomedical Engineering in Society”, “Biomedical Engineering Industrial Internship”, and “Intellectual Property, Standards and Regulations of Medical Devices”. He received the “Faculty Merit Award in Teaching (Individual)” in 2018. \nResearch Interests\nPoint-of-care and on-site nucleic acid testing \nNanomaterials for in vitro diagnostics \nAcademic and Professional Experiences\nAssociate Professor, Department of Biomedical Engineering, The Hong Kong Polytechnic University, Jul 2014 - Current\nAssistant Professor, Interdisciplinary Division of Biomedical Engineering, The Hong Kong Polytechnic University, Apr 2012 - Jun 2014\nAssistant Professor, Department of Health Technology and Informatics, The Hong Kong Polytechnic University, Aug 2006 - Mar 2012\nVisiting Scholar, Department of Chemical Engineering, The Hong Kong University of Science and Technology, Feb 2005 - Jul 2006\nResearch Associate, Department of Chemistry and Biochemistry, Arizona State University and New Mexico State University, Jan 2004 - Jan 2005\nResearch Associate, Department of Chemical Engineering, The Hong Kong University of Science and Technology, Jul 2003 - Dec 2003\nResearch Output\nQin, L. T. Fu, J. K. F. Wong, L. Y. Chau, S. P. Yip, T. M. H. Lee, Precipitation of PEG/Carboxyl-Modiﬁed Gold Nanoparticles with Magnesium Pyrophosphate: A New Platform for Real-Time Monitoring of Loop-Mediated Isothermal Ampliﬁcation, ACS Appl. Mater. Interfaces, 2017, 9, 10472–10480. (Click here to access the article in the publisher's website)\nY. Chau, Q. He, A. Qin, S. P. Yip, T. M. H. Lee, Platinum Nanoparticles on Reduced Graphene Oxide as Peroxidase Mimetics for the Colorimetric Detection of Specific DNA Sequence, J. Mater. Chem. B, 2016, 4, 4076–4083. (Click here to access the article in the publisher's website)\nK. F. Wong, S. P. Yip, T. M. H. Lee, Ultrasensitive and Closed-Tube Colorimetric Loop-Mediated Isothermal Amplification Assay Using Carboxyl-Modified Gold Nanoparticles, Small, 2014, 10, 1495–1499. (Click here to access the article in the publisher's website)\nK. F. Wong, S. P. Yip, T. M. H. Lee, Ultra-Stable Oligonucleotide-Gold and -Silver Nanoparticle Conjugates Prepared by a Facile Silica Reinforcement Method, Nano Res., 2012, 5, 585–594. (Click here to access the article in the publisher's website)\nK. F. Wong, S. P. Yip, T. M. H. Lee, Silica-Modified Oligonucleotide-Gold Nanoparticle Conjugate Enables Closed-Tube Colorimetric Polymerase Chain Reaction, Small, 2012, 8, 214–219. (Click here to access the article in the publisher's website)\nT. M. H. Lee, K. F. Wong, S. P. Yip, Ultra-Stable Oligonucleotide–Gold and –Silver Nanoparticle Conjugates Prepared by a Facile Silica Reinforcement Method, U.S. Patent Number: 9605304, Granted on 28 Mar 2017.\nI-M. Hsing, T. M. H. Lee, S. W. Yeung, X. Luo, Method and System for Real-Time Quantification and Monitoring of Nucleic Acid Amplification Using Electroconductive or Electrochemically Active Labels, U.S. Patent Number: 8465926, Granted on 18 Jun 2013.\nTeaching and Learning\nTeaching Awards\nFaculty Merit Award in Teaching (Individual), Faculty of Engineering, The Hong Kong Polytechnic University, 2018\nBest Teacher Award, Interdisciplinary Division of Biomedical Engineering, The Hong Kong Polytechnic University, 2016\nTeaching and Learning Project\nGongyeh 講嘢app (https://www.gongyeh.com/; also a web platform); language enhancement grant; project title: using technology to improve students' presentation skills and enhance students' engagement in others' presentation; project team: Dr. Thomas Ming Hung Lee (project leader; BME), Dr. Hin Chung Lau (project leader; BME), Dr. Joe Wai Kin Ching (project leader; ELC), Ms. Vickie Wai Kei Li (ELC), and Mr. Mitesh Patel (EDC)",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-thomas-mh-lee"
 },
 {
  "text": "Prof. Mo Yang \nProf. YANG Mo received the B.E. and M.S. degrees in Power Mechanical Engineering from Shanghai Jiaotong University, China, in 1998 and 2001, respectively. He received the Ph.D. degree in Mechanical Engineering from the University of California, Riverside, in 2004. From Jan 2005 to Oct 2005, he was a Postdoctoral Research Associate in Mechanical Engineering of Boston University. He is currently a Professor at Department of Biomedical Engineering, Faculty of Engineering in the Hong Kong Polytechnic University and the Hong Kong Research Grant Council (RGC) Joint Funding Scheme Panel member. Prof. Yang’s research focuses on microfluidic device for biosensing and nanomaterials based bioprobes for imaging, sensing and therapy. Prof. Yang has published more than 110 journal papers and is involved in 4 US patents and 1 China patent. He has been in charge of many research projects including 2 Hong Kong Research Grant Council Collaborative Research Fund (CRF) as Principal Coordinators, 8 Hong Kong Research Grant Council General Research Fund (GRF), 2 National Natural Science Foundation of China (NSFC) fund, 2 Innovation and Technology Fund (ITF) and 1 深港澳科技計劃項目(c類) as Principal Investigators, and 1 Research Grant Council Collaborative Research Fund (CRF) as Co-PI.\nBio-nanotechnology \nBiosensing \nTheranostics \nLab-on-a-chip \nProfessional Qualifications\nLife Member of the World Association for Chinese Biomedical Engineers\nAcademic and Professional Experiences\nProfessor, Department of Biomedical Engineering, Faculty of Engineering, the Hong Kong Polytechnic University, Jul 2018 - current\nAssociate Professor, Department of Biomedical Engineering, Faculty of Engineering, the Hong Kong Polytechnic University, Oct 2017 - Jun 2018\nAssociate Professor, Interdisciplinary Division of Biomedical Engineering, Faculty of Engineering, the Hong Kong Polytechnic University, Jul 2012 - Oct 2017\nAssistant Professor, Interdisciplinary Division of Biomedical Engineering, Faculty of Engineering, the Hong Kong Polytechnic University, Apr 2012 - Jul 2012\nAssistant Professor, Biomedical Engineering Programme, Department of Health Technology and Informatics, the Hong Kong Polytechnic University, Oct 2005 - Apr 2012\nPostdoctoral Research Associate, Boston University, MA, United States, Jan 2005 - Oct2005\nResearch Output\nH-index: 34 (ISI Web of Knowledge, Research ID: K-1274-2012) / 35 (Scopus, ID: 7404927250) /39 (Google Scholar) ORCID: (0000-0002-3863-8187) \nThe paper \"Ultrasensitive detection of ebola virus oligonucleotide based on upconversion nanoprobe/nanoporous membrane\" (ACS Nano 10(1) 598-605, 2016) is “Highly Cited Paper” in Essential Science Indicators (ESI) ( top 1% of the academic field of Chemistry) \nThe paper \"J.Y. Shi, C.Y. Chan, Y.T. Pang, W.W. Ye, F. Tian, J. Lyu, Y. Zhang, M. Yang, \"A fluorescence resonance energy transfer (FRET) biosensor based on graphene quantum dots (GQDs) and gold nanoparticles (AuNPs) for the detection of mecA gene sequence of Staphylococcus aureus\", Biosensors and Bioelectronics 67, 595–600, 2015.\" is “Highly Cited Paper” in Essential Science Indicators (ESI) ( top 1% of the academic field of Chemistry) \nThe paper \"F. Tian, J. Lyu, J.Y Shi, M. Yang* Graphene and graphene-like two-denominational materials based fluorescence resonance energy transfer (FRET) assays for biological applications, Biosensors and Bioelectronics, 89(1), 123-135, 2017.\" is \"Highly Cited Paper\" in Essential Science Indicators (ESI) ( top 1% of the academic field of Chemistry) \nThe paper \"Nanoparticle based fluorescence resonance energy transfer (FRET) for biosensing applications\", (J. Mater. Chem. B, 3, 6989-7005, 2015) is among the most downloaded article of Journal of Material Chemistry B in 2015\nZ.W. Li, Z.Q. Meng, F. Tian, X.F. Zhou, X.J. Zhong, Q. Chen, M. Yang, Z. Liu, Y. D. Yin, FFT-weighted photoacoustic imaging by in vivo magnetic alignment of hybrid nanorods, Nano Letters (In press) (IF:11.189). \nM. Xiao, F. Tian, X. Liu, Q.Q. Zhou, J.F. Pan, Z.F. Luo*, M. Yang*, C.Q. Yi*, Virus detection: From state-of-the-art laboratories to smartphone-based point-of-care testing, Advanced Science, 2022, 2105904. (IF:16.881)\nQ. Zhang, B.H. Yin, J.H. Hao, L.J. Ma, Y.Y. Huang, X.Y. Shao, C.Q. Li, Z.Q. Chu, C.Q. Yi, S.H.D. Wong*, M. Yang*, An AIEgen/graphene oxide nanocomposite (AIEgen@GO)-based two-stage “turn-on” nucleic acid biosensor for rapid detection of SARS-CoV-2 viral sequence, Aggregate (In press, https://doi.org/10.1002/agt2.195). \nF.Y. Qu, L.Y. Zhao, L.Q. Li, S.R. Zhao, M. Yang, J. Yu, Y.P. Ho, Thermo-induced coalescence of dual cores in double emulsions for single cell RT-PCR, Analytical Chemistry (In Press) (IF:6.986). \nB.H. Yin, W.K.H. Ho, Q. Zhang, C.Q. Li, Y.Y. Huang, J.X., Yan, H.R. Yang, J.H. Hao, S.H.D. Wong*, M. Yang*, Magnetic-responsive surface-enhanced raman scattering platform with tunable hot spot for ultrasensitive virus nucleic acid detection, ACS Applied Materials & Interfaces, 2022, 14, 3, 4714–4724. (IF:9.229) \nD. Jiang, Y.D. Zhang, X.J. Du, Y.H. Tan, W. Chen, M. Yang*, Wavelength-regulated switchable photoelectrochemical system for concurrent detection of dual antibiotics, Biosensors & Bioelectronics, 2022, 202, 113999. (IF:10.618) \nB.H. Yin, J.G. Ni, C.E. Witherel, M. Yang, J.A. Burdick, C.Y. Wen, S.H.D., Harnessing tissue-derived extracellular vesicles for osteoarthritis theranostics, Theranostics, 2022, 12(1), 207–231.\nF. Tian, S.Y. Wang, K.D. Shi, X.J. Zhong, Y.T. Gu, Y.D. Fan, Y. Zhang, M. Yang*, Dual-depletion of intratumoral lactate and ATP with radicals generation for cascade metabolic-chemodynamic therapy, Advanced Science, 2021, 8(24), 2012595. (IF:16.881)\nL. Zhang#, Y.D. Fan#, Z. Yang, M. Yang*, C.Y. Wong*, NIR-II-driven and glutathione depletion-enhanced hypoxia-irrelevant free radicals nanogenerator for combined cancer therapy, Journal of Nanobiotechnology, 2021 19, 265 (IF=10.435) (# equivalent contribution) \nM.T. Au#, J.Y. Shi#, Y.D. Fan, J.G. Ni, C.Y. Wen*, M. Yang*, Nerve growth factor-targeted molecular theranostics based on molybdenum disulfide nanosheet coated gold nanorods (MoS2-AuNR) for osteoarthritis pain, ACS Nano (In Press, # Co-first authors) (IF: 15.881)\nD. Jiang, C.Q. Yang, Y.D. Fan, P. H.M. Leung, I. Kiao, Y. Zhang, Z.Y. Li, M. Yang*, Ultra-sensitive photoelectrochemical aptamer biosensor for detecting E. coli O157:H7 based on nonmetallic plasmonic two-dimensional hydrated defective tungsten oxide nanosheets coupling with nitrogen-doped graphene quantum dots (dWO3·H2O@N-GQDs), Biosensors and Bioelectronics, 183, 113214, 2021 (IF:10.618)\nG. Oudeng, M. Benz, A. Popova, Y. Zhang, C.Q. Yi, L. Pavel*, M. Yang*, Droplet-Microarray Based on Nanosensing Probe Patterns for Simultaneous Detection of Multiple HIV Retroviral Nucleic Acids, ACS Applied Materials & Interfaces, 12, 50, 55614–55623, 2020. (IF:9.229)\nC.M. Cheng, R.L. Zhang, J.H. Wang, Y, Zhang, S.S. Xiong, Y. Huang*, M. Yang*, Porphyrinic Metal-Organic Framework Nanorod-Based Dual-Modal Nanoprobe for Sensing and Bioimaging of Phosphate, ACS Applied Materials & Interfaces, 12, 26391−26398, 2020. (IF:9.229)\nG. Oudeng, M.T. Au, J.Y. Shi, C.Y. Wen*, M. Yang*, One-step in-situ detection of miRNA-21 expression in single cancer cells based on biofunctionalized MoS2 nanosheets, ACS Applied Materials & Interfaces, 10(1), 350-360, 2018 (IF:9.229)\nJ.H. Wang, Y.D. Fan, Y.H. Tan, X. Zhao, Y. Zhang, C.M. Cheng, M. Yang*, Porphyrinic metal–organic framework PCN-224 nanoparticles for near-infrared-induced attenuation of aggregation and neurotoxicity of Alzheimer’s amyloid-β peptide, ACS Applied Materials & Interfaces, 10(43), 36615-36621, 2018. (IF:9.229)\nX.Q. Su, C.Y. Chan, J.Y. Shi, M.K. Tsang, Y. Pan, C.M. Cheng, O.D. Gerile, M. Yang*, A graphene quantum dot@Fe3O4@SiO2 based nanoprobe for drug delivery sensing and dual modal fluorescence and MRI imaging in cancer cells, Biosensors and Bioelectronics. 92, 489–495, 2017 (IF: 10.618)\nJ.Y Shi, J. Lyu, F. Tian, M. Yang*, A fluorescence turn-on biosensor based on graphene quantum dots (GQDs) and molybdenum disulfide (MoS2) nanosheets for epithelial cell adhesion molecule (EpCAM) detection, Biosensors and Bioelectronics, 93, 182–188, 2017 (IF: 10.618)\nF. Tian, J. Lyu, J.Y Shi, M. Yang* Graphene and graphene-like two-denominational materials based fluorescence resonance energy transfer (FRET) assays for biological applications, Biosensors and Bioelectronics, 89(1), 123-135, 2017(IF: 10.618)\nM.K. Tsang, W.W. Ye, G.J. Wang, J.M. Li, M Yang*, JH Hao*, Ultrasensitive detection of ebola virus oligonucleotide based on upconversion nanoprobe/nanoporous membrane, ACS Nano 10(1) 598-605, 2016. (IF: 15.881)\nJ.Y. Shi, C.Y. Chan, Y.T. Pang, W.W. Ye, F. Tian, J. Lyu, Y. Zhang, M. Yang*, A fluorescence resonance energy transfer (FRET) biosensor based on graphene quantum dots (GQDs) and gold nanoparticles (AuNPs) for the detection of mecA gene sequence of Staphylococcus aureus, Biosensors and Bioelectronics 67, 595–600, 2015. (IF: 10.618)\nJ.Y. Shi, J.B. Guo, G.X. Bai, C.Y. Chan, X. Liu, W.W. Ye, J.H. Hao, S. Chen, M. Yang*, A graphene oxide based fluorescence resonance energy transfer (FRET) biosensor for ultrasensitive detection of botulinum neurotoxin A (BoNT/A) enzymatic activity, Biosensors and Bioelectronics, 65 238-244, 2015.(IF: 10.618)\nW.W. Ye, M.K. Tsang, X. Liu, M. Yang*, Jianhua Hao*, Upconversion luminescence resonance Energy Transfer (LRET)-Based Biosensor for Rapid and Ultrasensitive Detection of Avian Influenza Virus H7 Subtype, Small, 10(12), 2390–2397, 2014. (IF: 13.281)\nB.J. Xu, W.W. Ye, Y. Zhang, J.Y. Shi, C.Y. Chan, X.Q. Yao, M. Yang*, A hydrophilic polymer based microfluidic system with planar patch clamp electrode array for electrophysiological measurement from cells, Biosensors and Bioelectronics, 53, 187-192, 2014.(IF: 10.618)\nC.Y. Hu, D. P. Yang, Z.H. Wang, P. Huang, X.S. Wang, D. Chen, D.X. Cui, M. Yang, N.Q. Jia, “Bio -mimetically synthesized Ag@BSA microspheres as a novel electrochemical biosensing interface for sensitive detection of tumor cells, Biosensors and Bioelectronics, 41, 656-662, (2013) (IF=10.618)\nK. Y., Chan, W. W. Ye, Y. Zhang, L.D. Xiao, P.H.M. Leung, Y. Li, M. Yang*, “Ultrasensitive detection of E coli O157:H7 with biofunctional magnetic bead concentration via nanoporous membrane based electrochemical immunosensor”, Biosensors and Bioelectronics, 41,532–537 (2013) (IF=10.618)\nP. Lin, F. Yan, J.J. Yu. H.L.W. Chan, M. Yang, The application of organic electrochemical transistors in cell-based biosensors, Advanced Materials, 22(33), 3655–3660 (2010) (IF: 30.849)\nY. Zhang, M. Yang, J.H. Park, J. Singelyn, H.Q. Ma, M.J. Sailor, E. Ruoslahti, M. Ozkan, C. Ozkan, A surface charge study on cellular uptake behaviors of F3 peptide conjugated iron oxide nanoparticles, Small, 5(17), 1990-1996, 2009. (IF: 13.281)\nQ.J. Liu, J.J. Yu, L.D. Xiao, J.C.O. Tang, Y. Zhang, P. Wang, M. Yang*, Impedance studies of bio-behavior and chemosensitivity of cancer cells by micro-electrode arrays, Biosensors and Bioelectronics, 24(5), 1305-1310, 2009. (IF:10.618)\nF. Yan, S.M. Mok, J.J. Yu, H.L.W. Chan, M. Yang, Label-free DNA sensor based on organic thin film transistors, Biosensors and Bioelectronics, 24(5), 1241-1245, 2009. (IF:10.618)\nJ.J. Yu., S.K. Jha, L.D. Xiao, Q.J. Liu, P. Wang, C. Surya, M. Yang*, AlGaN/GaN heterostructures for non-invasive cell electrophysiological measurements, Biosensors and Bioelectronics, 23, 513-519, 2007. (IF:10.618)\nQ.J. Liu, H. Cai, Y. Xu, L.D. Xiao, M. Yang, P. Wang, Detection of heavy metal toxicity using cardiac cell-based biosensor, Biosensors and Bioelectronics, 22(12), 3224-3229, 2007. (IF:10.618)\nM. Yang, C.C. Lim, R.L. Liao, X. Zhang, A novel microfluidic impedance assay for monitoring endothelin-induced cardiomyocyte hypertrophy, Biosensors and Bioelectronics 22(8), 1688-1693, 2007. (IF:10.618)\nJingyu Shi, Mo Yang*, \"A fluorescence resonance energy transfer (FRET) biosensor based on graphene quantum dot (GQD) and graphene oxide (GO) for detection of circulating tumour cells in vitro\". the 26th Anniversary World Congress on Biosensors, , Gothenburg, Sweden, 25–27 May 2016. \nJing Lyu, Mo Yang*, \"A graphene quantum dot based intracellular fluorescence resonance energy transfer (FRET) assay for monitoring caspase-3 protease activity during apoptosis process in single cells\". the 26th Anniversary World Congress on Biosensors, , Gothenburg, Sweden, 25–27 May 2016.\nXiaoqian Su, Mo Yang*, \"Graphene quantum dot – magnetic nanoparticle conjugates for simultaneous dual modal imaging and drug delivery sensing based on fluorescence resonance energy transfer\". the 26th Anniversary World Congress on Biosensors, , Gothenburg, Sweden, 25–27 May 2016. \nJingyu Shi, Mo Yang*, \"Graphene Oxide based Fluorescence Resonance Energy Transfer (FRET) Biosensor for Bacterial Protein Toxin Detection\", the 24th Anniversary World Congress on Biosensors, Melbourne, Australia, May 27-30, 2014. \nJingyu Shi, Mo Yang*, \"Graphene Oxide based Fluorescence Resonance Energy Transfer (FRET) Biosensor for Bacterial Protein Toxin Detection\", the 24th Anniversary World Congress on Biosensors, Melbourne, Australia, May 27-30, 2014. \nChuanyu Chan, Mo Yang*, \"Biofunctionalized graphene field effect transistor for rapid and ultrasensitive detection of H5N1 Avian Influenza Virus\", the 24th Anniversary World Congress on Biosensors, Melbourne, Australia, May 27-30, 2014. \nWeiWei Ye, Mo. Yang*, \"Nanoporous alumina membrane and nanoparticle based microfluidic sensing platform for direct DNA detection,\" 17th International Solid-State Sensors, Actuators and Microsystems Conference (TRANSDUCERS 2013), Barcelona, Spain, June 16-20, 2013 \nWeiWei Ye, Mo. Yang*, \"A functionalized nanoporous alumina membrane electrochemical sensor for DNA detection with gold nanoparticle amplification\" Proceeding of PACRIM 10-The 10th Pacific Rim Conference on Ceramic and Glass Technology, San Diego, USA, June 2-7, 2013.\nWeiWei Ye, Mo. Yang*, \"Optimal surface functionalization of nanoporous alumina membrane for DNA detection\", Materials Engineering for Advanced Technologies (ICMEAT 2012), Xiamen, China, December 27-28, 2012. Advanced Materials Research Vols. 631-632 pp 572-575, 2013. \nWeiWei Ye, Mo. Yang*, \"Nanoparticle Enhancement for Electrochemical DNA Detection using Nanoporous Alumina Membrane\", the 6th World Congress of Bioengineering (WACBE), Beijing, China, August 5-8, 2013 \nJ.H. Wang, M. Yang, “Two-dimensional nanomaterials in cancer theranostics”, Theranostic Bionanomaterials, Elsevier, ISBN: 9780128153413, 2019\nC.S. Ozkan, M. Ozkan, M. Yang, X. Zhang S. Prasad, \"Bridging Microelectronics and Biotechnology: 9 Cell Based Microarray Biosensors\". Encyclopedia of Sensors, American Scientific Publishers, United States, ISBN 158883056X, Vol. 1, 401-420, 2006.\nC.S. Ozkan, M. Ozkan, M. Yang, X. Zhang, S. Prasad, A. Morgan, \"Cell Based Sensors for Chemical Detection \" BioMEMS and Biomedical Nanotechnology V4: Biomolecular Sensing, Processing and Analysis, Springer, New York, ISBN 978-0-387-25561-3, 55-89, 2006.\nM. Ozkan. C.S. Ozkan, S. Prasad, M. Yang., X. Zhang,“ Microarray and Fluidic Chip for Extracellular Sensing”, BioMEMS and Biomedical Nanotechnology V2: Micro/Nano Technologies for Genomics and Proteomics, Springer, New York, ISBN 978-0-387-25561-3, 47-98, 2006. \n\"Multifunctional Nanoprobes for Biosensing, Imaging and Therapeutics\", the 4th CIRP Conference on BioManufacturing 2019, 11-15 December, 2019, Guangzhou, China\n\"Nanparticle based fluorescence resonance energy transfer (FRET) biosensor for ultrasensitive detection\", BME 2014 Biomedical Engineering International Conference, December 5, 2014, Hong Kong \n\"Multifunctional 2D nanomaterials based nanoprobes for sensing, imaging and drug delivery\", 8th WACBE World Congress on Bioengineering 2017 (WACBE 2017), August 1, 2017, Hong Kong\n\"Two-dimensional materials based nanoprobe for bioimaging and sensing\", International workshop on Recent Advances in Organic Bioelectronics, June 9, 2017, Hong Kong\n\"Nanopore/nanoparticle based optical biosensor for biomolecule detection\", 2nd Asia University Symposium on Biomedical Engineering, July 21, 2016, Beijing \n\"Nanopore and nanoparticle based optical biosensor for biomolecule detection\", Bioengineering in the 21st Century Symposium, Aug. 20, 2015, Hong Kong\n\"Nanoparticle based fluorescence resonance energy transfer (FRET) biosensor for ultrasensitive detection\", the 4th international conference of Optofluidics 2014, August 28, 2014, Guangzhou. \n\"Nanoparticle based fluorescence resonance energy transfer (FRET) biosensor for ultrasensitive detection\", 1st Asia University Symposium on Biomedical Engineering, December 12, 2014, Taiwan \n\"Microfluidic devices with nanopore structures for ultrasensitive foodborne pathogen detection\", the 3rd international conference of Optofluidics 2013, August 15, 2013, Hong Kong\n\"Microfluidic devices with nanopore structures for ultrasensitive foodborne pathogen\", Symposium of Biotechnology and Medical Instruments among Mainland, Taiwan and Hong Kong，Guangzhou, November 23, 2013. \n\"Culturing rat mesenchymal stem cell on 2D and 3D poly(ethylene glycol) (PEG) hydrogel structure with various RGD-peptide concentrations\", The 2nd International Symposium on Surface and Interface of Biomaterials (ISSIB-II)，January 5th, 2010, Hong Kong\n\"Micro chip with nanostructured membranes for anti cancer drug screening using impedance spectroscopy\", 10th World Congress on Biosensors, Shanghai, China, May 16th, 2008. \n\"Multifunctional 2D nanomaterials based nanoprobes for sensing, imaging and drug delivery\", invited by Zhejiang University, June 19, 2017\n\"Multifunctional 2D nanomaterials based nanoprobes for sensing, imaging and drug delivery\", invited by Zhejiang Technological University, November 17, 2016\n\"Multifunctional 2D nanomaterials based nanoprobes for sensing, imaging and drug delivery\", invited by Sun Yat-Sen University, August 30, 2016\n\"Microfluidic Devices Integrated with Micropore/Nanopore Structure for Bio-analytical Applications\", North-eastern University, August 27, 2016\n\"Microfluidic Devices Integrated with Nanopore Structure for Foodborne Pathogen Detection\", invited by Shanghai Advanced Research Institute, Chinese Academy of Sciences, January 15, 2013.\n\"Microfluidic Devices Integrated with Micropore/Nanopore Structure for Bio-analytical Applications\" invited by University of Sydney, Aug 30, 2011\n\"Microfluidic Devices for Bio-analytical Applications\", invited by King Abdullah University of Science and Technology, July 3, 2010\n\"Polymer Microfluidic Devices with biosensing applications\", invited by Suzhou Institute of Biomedical Engineering and Technology, Chinese Academy of Sciences, May 26, 2010\n\"Polymer Microfluidic Devices with biosensing applications\", invited by Shanghai Advanced Research Institute, Chinese Academy of Sciences, April 16, 2010.\n\"Talk in the Television Programme of Open University of Hong Kong, for part of \"Open for learning: Exploring Science: Development of Nanotechnology in Hong Kong\", April 4, 2010\nExternal Competitive Grants as Principle Investigator (PI) /Co- Principle Investigator (Co-PI)\nHong Kong Research Grants Council (RGC) Collaborative Research Fund (CRF), “An upright multiphoton microscope for intravital imaging and optogenetic studies”, (C5078-21EF), HK$ 3,910,000, (PC) , (2022-2024)\n深港澳科技计划C类, “用于新冠病毒和流感病毒现场筛查的快速检测技术和便携式微纳机电系统”, RMB 1,000,000 (PI), 2021-2023.\nHong Kong Research Grants Council (RGC) General Research Fund (GRF), “Multiplexed single exosome analysis based on hybridization chain reaction (HCR) enhanced multi-color fluorescence resonance energy transfer (FRET) nanoprobes in a droplet optofluidic platform”, HK$, 815,601, 2022-2024 (PolyU 15217621, PI).\nHong Kong Research Grants Council (RGC) Collaborative Research Fund (CRF), “Multi-level synergistic COVID-19 point-of-care diagnostics based on upconversion luminescence biosensing platform” (C5110-20G), HK$8, 408,102, 2021-2024 (Co-PI sharing HK$ 2 million)\nHong Kong Research Grants Council (RGC) Collaborative Research Fund (CRF), \"Multi-scale spatiotemporal single-cell in-situ analysis: Mechanism and biomedical applications\", (C5011-19G), HK$, 2,349,052 (Principle Coordinator) 2020-2021\nInnovation Technology Fund (Guangdong- Hong Kong Cooperation Fund), \"Development of an integrated microfluidic platform for high-throughput isolation of circulating tumor cells (CTCs) and on-chip detection of CTC-heterogeneity via multicolor nanoprobes\", (GHP-039-18GD), PI, HK$1,472,500, 2020-2021\nHong Kong Research Grants Council (RGC) General Research Fund (GRF), \"Hybrid ZnIn2S4/GQD nanointerface based artificial photoreceptors for restoring human-like colour sensitivity of degenerative retina\", (PolyU 152146/19E), HK$, 869,898, 2020-2022 (PI).\nHong Kong Research Grants Council (RGC) General Research Fund (GRF), \"A hybrid nanosystem for photo-treatment of Alzheimer’s disease in a blood-brain barrier on-a-chip\", (PolyU 152108/18E), HK$, 632,421, 2019-2021 (PI).\nHong Kong Research Grants Council (RGC) General Research Fund (GRF), \"A hybrid molybdenum disulfide (MoS2)/graphene quantum dot (GQD) nanosystem for imaging-guided combinatorial phototherapy targeting cancer stem cells\", (PolyU 15216917), HK$, 443,950, 2018-2020 (PI).\nHong Kong Research Grants Council (RGC) General Research Fund (GRF) \"A graphene quantum dot based intracellular fluorescence resonance energy transfer (FRET) assay for monitoring caspase-3 protease activity during apoptosis process in single cells\", (PolyU 15221315) HK$ 845,000, 2016-2018 (PI)\nHong Kong Research Grants Council (RGC) General Research Fund (GRF) \"A hydrophilic polymer based microfluidic patch clamp array system for simultaneous multiple cell recording\", (PolyU 530511), HK$, 818,800, 2012-2015 (PI).\nHong Kong Research Grants Council (RGC) General Research Fund (GRF) \"Simultaneous and rapid detection of multiple foodborne pathogens by nanoporous membrane based impedance arrays\" (PolyU 535809), HK$ 607,000, 2010-2013 (PI).\nHong Kong Research Grants Council (RGC) General Research Fund (GRF) \"An integrated microfluidic chip for single cell electrophysiological studies within picoliter volume\", (PolyU 531607), HK$ 429,000, 2008-2010 (PI). \nNatural Science Foundation General Project (面上項目) (Natural Science Foundation of China (NSFC) \"用於單細胞水平上檢測幹細胞內多種miRNA原位表達的多色納米感測探針的研究\", (NSFC 31771077), CNY 60万, 2018-2021 (PI)\nNatural Science Foundation General Project (面上項目) (Natural Science Foundation of China (NSFC)) “基於納米孔膜的微納機電系統及其在食源性病原微生物檢測上的應用”, (NSFC 81471747), CNY 73万, 2015-2018 (PI)\nPatent 1: J.H. Hao, M. Yang, M.K. Tsang, W.W. Ye, \"Heterogeneous Microarray Based Hybrid Upconversion nanoprobe/nanoporous membrane system\", U.S. Patent No. 10,266,403, issued on April 23, 2019.\nPatent 2: K. Vafai, C.S. Ozkan, R.C. Haddon, A.R.A. Khaled, M. Yang, \"Innovative biosensors for chemical and biological assays\", US Patent, No.7695951, issued on April, 13, 2010\nPatent 3: K. Vafai, C.S. Ozkan, R.C. Haddon, A.R.A. Khaled, M. Yang, \"Microcantilevers for biological and chemical assays and method of making and using thereof\", US Patent, No.7288404, issued on Oct, 30, 2007.\nPatent 4: M. Ozkan, C.S. Ozkan, M. Yang, X. Zhang, S. Prasad, ''Biosensors having single reactant components immobilized over single electrodes and methods of making and using thereof\", US Patent, Publication No. US2006/0188904 A1 (Publication date: August 24, 2006)\nApplication Paradigm 1: \"Nano biosensor for rapid detection of flu virus\" Jianhua Hao, Mo Yang, Ming-Kiu Tsang, Weiwei Ye, Gold medal award with congratulations of Jury and special merit award from scientific community of Romania, the 45th International Exhibition of Inventions of Geneva Brussels, 2017\nLink to public report:\nhttp://www.sciencenewsline.com/news/2016031414560037.html\nhttps://www.techinnovation.com.sg/technologies/detail/1241\nhttp://www.qsnews2wow-u.com/dev/2016/08/05/polyus-nano-biosensor-virus-detection/\nhttp://std.stheadline.com/yesterday/loc/0315ao07.html\nApplication Paradigm 2: \"Biosensor to safeguard food safety\", Mo Yang, Leung Hang Mei Polly, Jingjiang Yu, Gold medal award in Brussels Eureka 2009, also known as the 58th World Exhibition of Innovation, Research and Industrial Innovation, November,19-21, 2009. \nLink to public report:\nhttp://paper.wenweipo.com/2009/12/15/HK0912150012.htm\nhttp://orientaldaily.on.cc/cnt/news/20091215/00176_072.html\nhttp://www.ouhk.edu.hk/wcsprd/Satellite?pagename=OUHK/tcOLE2_2004&OLE_YEAR=2016&OLE_MONTH=JUNE&OLE_DATE=19&CALENDA=true&TOB=true&SHOWPREV=true&c=C_ETPU&cid=191157083000&lang=eng&dis=1\nEsteem Measures\nHonorary Appointments\nSpecial Merit Award from Scientific Community of Romania\nHao, Jianhua (Recipient), Yang, Mo (Recipient), Ming Kiu TSANG (Recipient) & Weiwei YE (Recipient), Mar 2017\nGold Medal with the Congratulations of Jury\nHao, Jianhua (Recipient), Yang, Mo (Recipient), Ming Kiu TSANG (Recipient) & Weiwei YE (Recipient), Mar 2017\nThe Faculty Merit Award for Outstanding Performance/Achievement in Research (Individual)\nYang, Mo (Recipient), 2015",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/prof-mo-yang"
 },
 {
  "text": "Dr Toshiki Kobayashi \nPolyU Scholars Hub \nDr Toshiki Kobayashi\nAssociate Professor \nI am a prosthetist and orthotist, and my primary research interest is gait biomechanics in individuals with lower-limb prostheses or orthoses.\nGH143 \n+852 2766 7672 \ntoshiki.kobayashi@polyu.edu.hk \nDr. Toshiki Kobayashi is an Associate Professor of the Department of Biomedical Engineering at The Hong Kong Polytechnic University. He received his BSc in Health Technology and PhD in Biomedical Engineering from The Hong Kong Polytechnic University. He previously worked at Orthocare Innovations in Seattle, USA and at Department of Prosthetics and Orthotics, Hokkaido University of Science in Sapporo, Japan. Dr. Kobayashi is a registered prosthetist and orthotist in Japan. Dr. Kobayashi has also been an Associate Editor of Prosthetics and Orthotics International. He hasconducted extensive biomechanics research on prosthetics and orthotics as well as orthopedic or neuromuscular movement disorders with research collaborators across the globe. \nGait biomechanics \nProsthetics \nOrthotics \nAssistive technologies \nMovement disorders \nProfessional Qualifications\nRegistered Pharmacist, Ministry of Health, Labor and Welfare of the Japanese Government, 2002-Present\nRegistered Prosthetist and Orthotist, Ministry of Health, Labor and Welfare of the Japanese Government, 2016-Present\nAssociate Professor, Department of Biomedical Engineering, The Hong Kong Polytechnic University, 2020- Present\nProfessor, Department of Prosthetics and Orthotics, Hokkaido University of Science, Japan, 2015-2020\nResearch Scientist, Orthocare Innovations, USA, 2010-2015\nAssociate Editor, Prosthetics and Orthotics International, 2015-Present",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/toshiki-kobaysashi"
 },
 {
  "text": "Dr Youhua Tan \nPolyU Scholars Hub \nDr Youhua Tan\nAssociate Professor, Programme Coordinator (MSc in BME) \nExplores the roles of mechanical factors in tumor progression and metastasis\nST406 \n+852 3400 8897 \nyouhua.tan@polyu.edu.hk \nDr. Tan received the Bachelor degree in Mechanical Engineering from University of Science and Technology of China in 2005 and his PhD degree in Biomedical Engineering from both City University of Hong Kong and University of Science and Technology of China in 2010. He completed his postdoctoral fellowship in University of Illinois at Urbana-Champaign from 2011-2015. Since July 2015, Dr. Tan joined the Department of Biomedical Engineering at PolyU as Assistant Professor. Dr. Tan’s research interest includes cell mechanics and mechanobiology, especially the fundamental roles of mechanical forces in tumor metastasis. His research has been supported by many external grants, including 2 Hong Kong Research Grant Council General Research Fund (GRF), 1 Hong Kong Research Grant Council Collaborative Research Fund (CRF; Co-PI), 2 National Natural Science Foundation of China General Programme (NSFC), and 2 Shenzhen Science and Technology Innovation Commission Basic Research (STIC).\nMechanobiology \nMechano-oncology \nTumour Metastasis \nCell Mechanics \nCancer Stem Cell. \nPh.D. in Mechanical and Biomedical Engineering, City University of Hong Kong, Hong Kong, Sep 2005 – Jun 2010\nBachelor in Mechanical Engineering, University of Science and Technology of China, China, Sep 2001 – Jun 05 \nPrevious academic positions held:\nPostdoctoral Fellow, Department of Mechanical Science and Engineering, University of Illinois at Urbana-Champaign, USA, Mar 2011 – Jun 2015\nPostdoctoral Fellow, Department of Mechanical and Biomedical Engineering, City University of Hong Kong, Hong Kong, Jul 2010 – Feb 2011 \nPresent academic position:\nAssistant Professor, Department of Biomedical Engineering, Hong Kong Polytechnic University, Hong Kong, Jul 2015 – current\nResearch Output\nYing Xin, Xi Chen, Xin Tang, Keming Li, Mo Yang, William Chi-Shing Tai, Yiyao Liu, Youhua Tan# (2019) Mechanics and actomyosin-dependent survival and chemoresistance of suspended tumor cells in shear flow, Biophysical Journal, 116, 1803-1814 (8 out of 8).\nYueting Peng, Zhongyuan Chen, Yu Chen, Shun Li, Ying Jiang, Hong Yang, Chunhui Wu, Fengming You, Chuan Zheng, Jie Zhu, Youhua Tan, Xiang Qin, Yiyao Liu (2019) ROCK isoforms differentially modulate cancer cell motility by mechanosensing the substrate stiffness, Acta Biomaterialia, 88, 86-101 (10 out of 13).\nJing Jin, Kai Tang, Ying Xin, Tianlong Zhang, Youhua Tan# (2018) Hemodynamic shear flow regulates biophysical characteristics and functions of circulating breast tumor cells reminiscent of brain metastasis, Soft Matter, 14, 9528-9533 (5 out of 5).\nTang Xin, Jin Jing, Huang Shiying, Xin Ying, Tan Youhua# (2018) Blood shear stress selects metastasis-initiating cells with metastatic advantages, Biophysical Journal, 114, 325a (5 out of 5).\nTan, Y.*, Tajik, A.*, Chen, J.*, Jia, Q., Chowdhury, F., Wang, L., Chen, J., Zhang, S., Hong, Y., Yi, H., Wu, D.C., Zhang, Y., Wei, F., Poh, Y-C., Seong, J., Singh, R., Lin, L-J., Doğanay, S., Li, Y., Jia, H., Ha, T., Wang, Y., Huang, B., Wang, N. (2014). Matrix softness regulates plasticity of tumor-repopulating cells via H3K9 demethylation and Sox2 expression, Nature Communications 5, 4619 (1 out of 24).\nWang, R., Chow, YT., Chen S., Ma, D., Luo, T., Tan, Y.#, Sun D.# (2018) Magnetic force-driven in Situ selective intracellular delivery, Scientific Reports, 8, 14205 (6 out of 7).\nTan, Y.*, Wood, AR.*, Jia, Q.*, Zhou, W., Luo, J., Yang, F., Chen, J., Chen, J., Sun, J., Seong, J., Tajik, A., Singh, R., Wang, N. (2017) Soft matrices downregulate FAK activity to promote growth of tumor-repopulating cells, Biochemical and Biophysical Research Communications 483, 456 (1 out of 13).\nLiu, J.*, Tan, Y.*, Zhang, H., Zhang, Y., Xu, P., Chen, J., Poh, Y-C., Wang, N., Huang, B. (2012). Soft fibrin gels promote selection and growth of tumorigenic cells. Nature Materials 11, 734-741 (2 out of 9).\nTan, Y., Kong, C-W., Chen, S., Cheng, S.H., Li, R.A., Sun, D. (2012). Probing the mechanobiological properties of human embryonic stem cells in cardiac differentiation by optical tweezers. Journal of Biomechanics 45, 123-128 (1 out of 6).\nTan, Y., Fung, T-K., Wan, H., Wang, K., Leung, A.Y.H., Sun, D. (2011). Biophysical characterization of hematopoietic cells from normal and leukemic sources with distinct primitiveness. Applied Physics Letters 99, 083702 (1 out of 6).\nResearch Grant Council General Research Scheme (RGC GRF) 2019: The resistance of suspended circulating tumor cells to fluid shear stress in hematogenous dissemination through Piezo1-YAP/TAZ-p73 signaling, 01/01/2021-31/12/2024, HK$ 873,995, Project# 15214320, PI.\nResearch Grant Council Collaborative Research Fund (RGC CRF) 2019: Multi-scale spatiotemporal single-cell in-situ analysis: Mechanism and biomedical applications, 01/05/2020-30/04/2021, HK$ 2,349,052, Project# C5011-19G, Co-PI.\nNational Natural Science Foundation of China General Program (NSFC) 2019: Blood shear stress regulates the survival of suspended tumor cells, 01/01/2020-31/12/2023, RMB 630,000, Project# 11972316, PI.\nShenzhen Science and Technology Innovation Commission Basic Research (STIC) 2017: Mechanical regulation of cancer stem cells and tumor progression and metastasis in hepatocellular carcinoma, 01/01/2018-31/12/2020, RMB 2,000,000, Project# 20170248, PI.\nShenzhen Science and Technology Innovation Commission Basic Research--Exploration (STIC) 2017: Regulation of metastatic potential of cancer stem cells in hepatocellular carcinoma by cell mechanics, 01/06/2017-31/05/2019, RMB 400,000, Project# JCYJ20170303160515987, PI.\nProject of Strategic Importance, Hong Kong Polytechnic University (PolyU Internal Grant) 2017: Biomechanical and Multiomics Characterization of Ocular Tissues during Myopic Development, 02/05/2017-01/05/2020, HK$ 4,074,000, Project# 1-ZE1A, Co-PI.\nResearch Grant Council Early Career Scheme (RGC ECS) 2016: Cell mechanics regulate tumorigenic potential of soft cancer stem-like cells in hepatocellular carcinoma, 01/01/2018-31/12/2020, HK$ 750,000, Project# 25209417, PI.\nNational Natural Science Foundation of China General Program (NSFC) 2016: Low cell stiffness regulates high tumorigenic and metastatic potential of hepatocellular carcinoma tumor-repopulating cells, 01/01/2017-31/12/2020, RMB 600,000, Project# 11672255, PI.\nDean's Reserve for Intra-Faculty Collaboration Research, Hong Kong Polytechnic University (PolyU Internal Grant) 2016: Mechanical Regulation of Cancer Metastatic Potential and Tropism, 01/08/2016-31/01/2018, HK$ 400,000, Project# 1-ZVJ8, PI.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-youhua-tan"
 },
 {
  "text": "Dr. Puxiang Lai received his Bachelor from Tsinghua University in 2002, Master from Chinese Academy of Sciences in 2005, and PhD from Boston University in 2011. In September 2015, he joined Department of Biomedical Engineering at the Hong Kong Polytechnic University as a Tenure-track Assistant Professor, and was promoted to Tenured Associate Professor in July 2021. \nDr. Lai’s research interests focus on deep-tissue optical focusing, imaging, stimulation, and treatment. Current research projects include, but are not limited to, wavefront shaping, photoacoustic imaging, neuron stimulation, computational optics, and artificial intelligence. His research has fueled more than 80 top journal publications, such as Nature Photonics，Nature Communications，Light: Science & Applications，PhotoniX, Advanced Photonics, Advanced Science, and The Innovation. He has been invited to give more than 90 seminars or invited talks worldwide. Since 2015, his research has been continuously supported by National Natural Science Foundation of China (NSFC), Hong Kong Research Grant Council (RGC), Hong Kong Innovation and Technology Commission (ITC), Department of Science and Technology of Guangdong Province, and Shenzhen Science and Technology Innovation Commission (STIC). \nDr. Lai was awarded the 2016-2017 Hong Kong RGC Early Career Award, the 2018/2021 Hong Kong Polytechnic University Faculty of Engineering Research Grant Achievement Award, the 2019 PolyU K.C. Wong Belt and Road Visiting Fellowship Award, and the 2020 Hong Kong Polytechnic University Faculty of Engineering Faculty Research Award. As a recognition for his contribution to the field, currently Puxiang serves as Associate Editor of Journal of Visual Computing for Industry, Biomedicine, and Art (VCIBA), Editor of Journal of Innovative Optics in Health and Science (JIOHS), Session Editor of Medicine in Novel Technology and Devices (MEDNTD), Editor of Advanced Photonics Nexus, Youth Editor in The Innovation, Standing Committee Member of the Biomedical Optics Panel in the Chinese Optical Society, Committee Member of the Biomedical Optics Panel in the Chinese Society of Biomedical Engineering, Senior Member of the Optical Society of America (Optica/OSA), and Guest Professor of Southern Medical University (China).",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-puxiang-lai"
 },
 {
  "text": "Dr Sharon (YC) Ruan received her Ph.D. degree from Sun Yat-Sen University in 2009, and afterwards went for postdoctoral training at Harvard Medical School/Massachusetts General Hospital (USA) for 4 years. In 2013, she was recruited as a Research Assistant Professor at the Chinese University of Hong Kong. In 2017, Dr Ruan was appointed as Assistant Professor in Department of Biomedical Engineering (BME) at PolyU. In May 2022, Dr Ruan was promoted as Associate Professor.\nDr Ruan’s research has focused on ion channels, a group of membrane proteins, and their related signaling transduction in reproduction, endocrinology, development and associated human diseases. Her work has yielded important findings including identifying novel roles of ion channels and their related signaling pathways in embryo implantation (published in Nature Medicine 2012; Theranostics 2019), labour (EMBO Molecular Medicine 2018), and endocrine/metabolic diseases (Nature Communications 2014). In recent years, she has extended the research into new roles of ion channels in musculoskeletal physiology and diseases, and made major breakthroughs in understanding the osteogenic effect of orthopaedic implant-derived magnesium ion (Nature Medicine 2016) as well as ion channel-associated bone disease (Bioactive Materials 2022).\nDr Ruan has won a couple of major awards such as “National Science and Technology Award in Women and Children’s Health” and successfully obtained funding support from General Program (PI, 2015-2018; PI, 2021-2024) by National Natural Sciences Foundation of China; General Research Fund (PI, 2014-2018; PI,2023-2025), Early Career Scheme (PI, 2017-2021), Theme-based Research Scheme (Co-PI, 2017-2022), Area of Excellence (Co-PI, 2021-2029) by Research Grants Council of Hong Kong; and Health and Medical Research Fund (PI, 2017-2020; PI, 2022-2023) by Food and Health Bureau of Hong Kong.\nCurrently, Dr Ruan aims to continue her research on ion channels with a particular interest in developing ion channels into molecular targets in the diagnosis/treatment of reproductive, endocrine and musculoskeletal diseases.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-sharon-yc-ruan"
 },
 {
  "text": "Dr M.S. Wong \nDr M. S. Wong is an Associate Professor (Prosthetics and Orthotics) of the Department of Biomedical Engineering, The Hong Kong Polytechnic University. With his clinical and engineering training background, Dr Wong has the educational vision of nurturing students with state-of-the-art professional knowledge and skills as well as all-rounded attributes, especially in positive attitude to face and tackle the uncertainties and challenges from this ever-changing world, and in social responsibility to serve the less-privileged people. He used to serve as the Associate Head (Academic) and Programme Leader of the B.Sc. (Hons.) programme in Biomedical Engineering and Jockey Club Rehabilitation Engineering Clinic Coordinator. He has been significantly involved in programme development and a number of clinical research studies, and learning and teaching projects (including student integration and internationalisation) as well as the reconstruction works after the Sichuan earthquake in 2008. His main research interests are scoliosis, spinal orthotics, preventions of fragility fractures, gait and posture analysis, CAD/CAM in prosthetics and orthotics, and prosthetics and orthotics outcome evaluations.\nScoliosis \nSpinal orthotics \nPrevention of fragility fractures \nGait and Posture analysis \nCAD/CAM in prosthetics and orthotics \nProsthetics and orthotics outcome evaluation \nProfessional Qualifications\nMember of the International Society for Prosthetics and Orthotics Hong Kong National Society\nLicentiate(Prosthetist/Orthotist) of the British Institute of Surgical Technologists\nFull Member of the Hong Kong Society of Certified Prosthetist-Orthotists\nFull Member of the British Association of Prosthetists and Orthotists\nFellow of International Society for Prosthetics and Orthotics\nFellow of Hong Kong Society of Certified Prosthetist-Orthotists\nCertified Prosthetist-Orthotist (Hong Kong)\nAssociate Professor, Department of Biomedical Engineering, Faculty of Engineering, The Hong Kong Polytechnic University, 2012 – current\nAssociate Head (Academic) & Associate Professor, Department of Biomedical Engineering, Faculty of Engineering, The Hong Kong Polytechnic University, 2016 - 2019\nHall Warden, Violet Hall, Homantin Student Halls of Residence, The Hong Kong Polytechnic University, 2012 – 2016\nClinic Coordinator & Consultant Prosthetist- Orthotist, Jockey Club Rehabilitation Engineering Clinic, The Hong Kong Polytechnic University, 1998 – current\nHonorary Associate Professor, Post-graduate Office, Sichuan University, China, Sep 2011 – current\nResearch Affiliate, Glenrose Rehabilitation Hospital & Alberta Health Services, Canada, 2006 – current\nVisiting Professor, Kobe College of Medical Welfare, Sanda Campus, Kobe, Japan, 2009 – current\nVisiting Professor, Department of Rehabilitation Medicine, West China Hospital, Sichuan University, China, 2010 – current\nVisiting Professor, Hokkaido College of High-Technology, Hokkaido, Japan, 2011– current\nVisiting Professor, School of Rehabilitation, Kunming Medical University, 2018 – current\nVisiting Professor, University of Human Arts and Sciences, Saitama, Japan, Feb 2014\nVisiting Professor, Niigata University of Health and Welfare, Niigata, Japan, Feb 2014\nAssociate Professor, Department of Health Technology and Informatics, Faculty of Health and Social Sciences, The Hong Kong Polytechnic University, 2004 – 2012\nVisiting Professor, Department of Surgery, University of Alberta; Glenrose Rehabilitation Hospital & Alberta Health Services, Canada, Jun – Jul 2011\nVisiting Professor, Sirindhorn School of Prosthetics & Orthotics, Faculty of Medicine Siriraj Hospital, Mahidol University, Thailand, May 2011\nVisiting Professor, Seibu Gakuen Bunri College of Nutrition and Medical Technology, Tokyo, Japan, Jul 2010\nVisiting Professor, Department of Electrical & Computer Engineering, University of Alberta; Glenrose Rehabilitation Hospital; & Alberta Health Services, Canada (supported by Alberta Heritage Foundation for Medical Research), Aug 2007\nVisiting Professor, Department of Rehabilitation, Jonkoping University, Jonkoping, Sweden, Dec 2006 – Jan 2007, Sep – Dec 2004\nVisiting Professor, Faculty of Welfare and Human Functioning, Helsinki Metropolia University of Applied Sciences, Finland, Dec 2004\nAssistant Professor, Jockey Club Rehabilitation Engineering Centre, The Hong Kong Polytechnic University, 1996 - 2004\nProsthetist-Orthotist, Department of Prosthetics and Orthotics, Hong Kong Hospital Authority, 1991 - 1995\nProsthetist-Orthotist, Department of Prosthetics and Orthotics, Hospital Services Department, Hong Kong Government, 1988 - 1991",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-man-sang-wong"
 },
 {
  "text": "Dr Chunyi Wen \nDr. Chunyi WEN, Associate Professor in Department of Biomedical Engineering, leads a research group in Hong Kong to combat osteoarthritis, a leading cause of chronic pain and disability in older adults affecting 500 million people worldwide. Dr. Wen obtained his Ph.D. degree in Chinese University of Hong Kong and received postgraduate training in Johns Hopkins University in U.S., and University of Oxford in U.K.. In his early academic career, Dr. Wen’s work on bone and joint injury and degeneration from mechanism towards therapeutics. He contributed to discovery of TGF-beta1 as a key regulator in subchondral bone disturbance and osteoarthritis pathogenesis (Nature Medicine 2013). His work has been recognized by Young Investigator Award, Mr. Savio Woo and Mrs. Pattie Woo Travel Fellowship, AOSpine East Asia (AOSEA) Research Grant award and AOSEA Travel Grant, and Oldendorf Award. Since joining PolyU BME, Dr. Wen’s research centers on vascular etiology of osteoarthritis. Under the auspices of RGC ECS and GRF, Dr. Wen and his team finally identified endothelin-1 (ET-1), the most potent vasoconstrictor in hypertension, contributing to articular chondrocyte senescence and osteoarthritis pathology (Osteoarthritis and Cartilage 2015 and 2020). It substantiates the vascular etiology hypothesis of osteoarthritis and opens a new avenue for discovery of novel mechanism-based disease-modifying therapies against osteoarthritis (Nature Review Rheumatology 2021) Along this research direction, Dr. Wen has secured the external research fund over 10 million HKD in the capacity of PI from RGC, HMRF and ITF. Meanwhile, we kicked off formal research collaboration with world-leading research institutes such as Kennedy Institute of Rheumatology, University of Oxford (Prof. Tonia Vincent, HMRF research fellowship) and Sorbonne University in Paris (Prof. Francis Berenbaum, PROCORE-France/Hong Kong Joint Research Scheme and INSERM International Research Program). Dr. Wen envisions developing PolyU BME as a regional leading and international renowned osteoarthritis research center.\nCellular Senescence and Skeletal Aging \nPrecision Medicine for Skeletal Ageing \nData-driven Community-based Bone and Joint Healthcare Revolution \nAssociate Professor, Department of Biomedical Engineering, Hong Kong Polytechnic University\nHonorary Assistant Professor, Department of Orthopaedics and Traumatology, Li Ka Shing Faculty of Medicine, The University of Hong Kong\nDoctor of Philosophy, Department of Orthopaedics and Traumatology, Faculty of Medicine, The Chinese University of Hong Kong\nMaster of Medical Science (Orthopedic Surgery), Faculty of Medicine, The University of Hong Kong\nMB.BS, West China School of Medicine, Sichuan University, China\nMedical License (POC)",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-chunyi-wen"
 },
 {
  "text": "Dr. Xin Zhao is an Associate Professor at the Department of Biomedical Engineering, the Hong Kong Polytechnic University (PolyU). She obtained her PhD at University College London, UK and postdoc training at Harvard University, USA, before joining PolyU. Her research interest is on Translational Regenerative Medicine, where she integrates multi-disciplinary approaches including material science, cell biology, engineering and medicine to modulate cell microenvironments, control cell behaviors and generate tissue-engineered organs, for addressing clinical issues.\nSo far, she has published >100 articles (with h-index of 38 in Google Scholar, 6 of which are ESI highly cited paper) in prestigious journals including Nat. Mater., Proc. Natl. Acad. Sci. USA, Chem. Rev., Mater. Today, Adv. Funct. Mater., Angew. Chem. Int. Ed., Biomaterials, Small. She has successfully attracted over 10 grants (⁓11 million) as principal investigator from the Hong Kong Research Grants Council (RGC), Health and Medical Research Fund (HMRF), Innovation and Technology Fund of Hong Kong (ITF), National Science Foundation of China (NSFC), Guangdong Basic and Applied Basic Research Foundation, private company, etc. She is a recipient of the National Science Fund for Excellent Young Scholars (優青, 2021, only 25 recipients in Hong Kong and Macau each year), Faculty Award of 2019 (only 3 were selected from over 150 academic staff of the Engineering Faculty of PolyU) and the Engineering Research Grant Achievement Award of 2019 (only 8 were selected from over 150 academic staff of the Engineering Faculty). With only 4 participants selected from Asia, she represented Hong Kong in the prestigious Asia Pacific Research Network Fellowship Program in 2018. In 2020, she also represented PolyU as the K. C. Wong Education Foundation visiting scholar to deliver talks in mainland China. Moreover, she has been shortlisted for the “Nature Research Awards for Inspiring Science” in 2019 (10 shortlisted from >150 applicants globally) and her project “Biomimicking Photocrosslinkable Nanocomposite Bone Graft” has won the Silver Medal at the Special Edition 2021 Inventions Geneva. She is also a founding editor of Engineered Regeneration, associate editor of Bio-Des. Manuf., and guest editor for 11 other journals.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-xin-zhao"
 },
 {
  "text": "Dr. Christina Zong-Hao Ma is an Assistant Professor, a Certified Prosthetist and Orthotist (CPO, ISPO Category I), and a Certified Rehabilitation Therapist (CRT) at PolyU BME. Before her appointment at PolyU, she served as a Lecturer, later promoted to Assistant Professor (permanent position), in Prosthetics and Orthotics at Department of Rehabilitation, Jönköping University (JU), Sweden, from 2018 to 2020. She received her PhD from Faculty of Engineering, The Hong Kong Polytechnic University (2018); and BSc from West China School of Medicine, Sichuan University (2012). She also used to work as a Certified Prosthetist and Orthotist and a Clinical Instructor at China Rehabilitation Research Center (permanent employment, 2012-2013), and a Visiting Research Scholar in Mechanical Engineering at University of Michigan - Ann Arbor (2017).\nDr. Ma’s research is focused on:\ninvestigating the mechanism of human posture and motion control;\npromoting physical activity and active health; and\ndeveloping solutions for improving balance and preventing falls in older/disabled people. \nTo address these challenges, Dr. Ma has contributed to research and development (R&D) of a series of smart wearable devices that could monitor the postural balance, walking pattern, and muscle contraction performance; and then provide some real-time corresponding reminders/warnings to users for necessary motion adjustments. Such devices can not only act as balance/motion aids in daily life, but also facilitate community-/home-based training. Her research outcomes can benefit older adults, patients with stroke, trainers/trainees of muscular fitness training, lower-limb amputees, and patients with low back pain, etc.\nAs a CPO and CRT who used to work in hospitals and rehabilitation centers, Dr. Ma is well-aware of how physical disability could significantly affect the quality of life of older adults and patients, as well as their families. This is why Dr. Ma has a genuine interest in promoting these persons’ quality of life with research and development. Dr. Ma's multidisciplinary academic background in Healthcare and Engineering and her clinical experience enabled her to employ various interdisciplinary approaches such as Biomechanics, Electronics, Rehabilitation, Biomedical Ultrasound Imaging, and Smart Wearable Technology to achieve her research goals.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-christina-zong-hao-ma"
 },
 {
  "text": "Dr. Emma Shujun WANG is an Assistant Professor at PolyU BME. Before that, she was a Research Associate in the Department of Applied Mathematics and Theoretical Physics, at the University of Cambridge, from 2022 to 2023. She was a Postdoctoral Researcher in Department of Computer Science and Engineering at the Chinese University of Hong Kong, from 2021-2022. She received her Ph.D from from Department of Computer Science and Engineering at the Chinese University of Hong Kong (CUHK) in 2021, and B.Eng from Honors College at Northwestern Polytechnical University (NPU) in 2017. Her research is in the interdisciplinary field of artificial intelligence (AI) and healthcare. More specifically, she specialize in the areas of machine learning (ML), deep learning (DL), and their major applications on digital health and computational precision medicine. She is dedicated to designing AI-driven computational methods to enable reliable decision-making models for precision medicine, covering from disease diagnosis to prognosis, and from medical image computing to multi-modal biomedical data integration. Her current and future research will facilitate personalized prognosis and treatment with multi-modal biomedical data computing from both imaging and non-imaging information and reliable machine learning-based disease diagnosis algorithms.\nShe has published 20 papers on top-tier conferences and journals (on The Lancet Digital Health (IF: 36.615), IEEE-TMI, MedIA, NeurIPS, AAAI, ECCV, MICCAI, etc.). Her team won the Best Paper Award of CMMCA workshop at MICCAI 2022. She has attended several International challenges on medical image analysis and got the Champion of the REFUGE challenge in 2018 and the Second place of PALM challenge in 2019. She also co-organized the workshop of Women in Medical Image Understanding and Analysis in 2022. What’s more, she serves as reviewers for top-tier journals and conferences. And she got IEEE TMI Distinguished Reviewer this year.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-emma-wang"
 },
 {
  "text": "Dr Kenneth Chik-Chi Cheng \nDr Kenneth Cheng is currently a Research Assistant Professor at the Department of Biomedical Engineering, Faculty of Engineering, at the Hong Kong Polytechnic University. He received his B.A.Sc. (first class honor) degree in Systems Engineering from Simon Fraser University, Canada in 2003, as well as M.A.Sc. and Ph.D. degrees from the Institute of Biomaterial and Biomedical Engineering (IBBME) and Institute of Medical Science (IMS), University of Toronto, Canada in 2006 and 2012, respectively. After his graduation, he has returned to Hong Kong and has worked in the University of Hong Kong (HKU) and the Chinese University of Hong Kong (CUHK) before joining the Hong Kong Polytechnic University in 2022. His main research interest is in balance and gait control, sports biomechanics, as well as fall prevention and rehabilitation. \nPreviously, Dr. Cheng has managed a HK$30.08 million project, the CUHK - Jockey Club HOPE 4 Care Programme, funded by the Hong Kong Jockey Club Charitable Trust Fund. During the project period, the research team has collaborated with over a hundred therapists and clinical staffs from 39 centers from 25 NGOs to provide technology-assisted stroke rehabilitation therapy to around 650 beneficiaries (>10,000 training sessions) all over Hong Kong. The project was recognized internationally at the 9th Asia-Pacific Eldercare Innovation Awards Ceremony by the industry, as the HOPE 4 Care Programme was announced the winner of the Best Rehabilitation Programme by Ageing Asia in Singapore on 3 December 2021.\nEducation and Academic Qualifications\nDoctoral of Philosophy (Ph.D.)\nInstitute of Medical Science, University of Toronto\nMaster of Applied Science (M.A.Sc.)\nInstitute of Biomaterial and Biomedical Engineering, University of Toronto \nBachelor of Applied Science (B.A.Sc.) – First Class Honors\nMajor in Engineering Science, Systems Option, Biomedical Engineering Stream; Double Minor in Kinesiology and Computing Science\nDepartment of Engineering, Faculty of Applied Science, Simon Fraser University \nProfessional Qualifications\nDoctoral of Philosophy (Ph.D.)\nInstitute of Medical Science, University of Toronto\nMaster of Applied Science (M.A.Sc.)\nInstitute of Biomaterial and Biomedical Engineering, University of Toronto \nBachelor of Applied Science (B.A.Sc.) – First Class Honors\nMajor in Engineering Science, Systems Option, Biomedical Engineering Stream; Double Minor in Kinesiology and Computing Science\nDepartment of Engineering, Faculty of Applied Science, Simon Fraser University \nBalance and Gait Control \nFall Prevention \nSports Biomechanics \nRehabilitation Engineering \nAssistive Devices ",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-kenneth-chik-chi-cheng"
 },
 {
  "text": "Dr. James Chung-Wai Cheung received his Bachelor degree in applied physics in City University of Hong Kong in 1992, University of London Graduate Diploma in Astrophysics, University of East London, Master degree in Business Information System in 1993, while he obtained his Master and PhD degree in Healthcare with technology in 2005, and biomedical engineering in 2013, respectively in The Hong Kong Polytechnic University. \nHe is currently a research assistant professor at the Department of Biomedical Engineering of The Hong Kong Polytechnic University. He also serves as a honour advisor in Yan Chai Hospitals Social Services department towards the use of gerontechology in rehabilitation centres and elderly hostels. He engages in undergraduate teaching on the subject “BME1D02 Wearable Healthcare and Fittness Devices for Everyone”, “BME1D03 Technologies for Smart Ageing”, and “BME3S02 Assistive Technologies: Service Learning Towards the Elderly and Disabled”, which involves heavily in elements covering machine learning, data analytics and prototype development. In addition, he is invited to serve as a guest lecturer in Faculty of Medicine of The Chinese University of Hong Kong on “AI-Technologies in Dementia Caring” \nThe research interest of Dr. Cheung dedicates to artificial intelligence, wearable technologies and IoT, Medical imaging and signal processing, robotics, and their applications to elderly, such as dementia, and dysphagia, hostels management. He joined several projects and produced several patents on image recognition and optimization for assessing spinal problems, IoT sensors monitoring and classifying elderly behaviour in hostels, NLP-based therapeutic dolls for elderly dementia, etc. He is currently working on the application of deep learning to detect and screen dysphagia using acoustic-sonographic sensors, as well as a new deep learning-based algorithms to improve knee osteoarthritis prediction, and sleep posture classification and quality of sleep analysis. He is also mentoring projects on Metaverse and interactive robotic companion for elderlies.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-james-chung-wai-cheung"
 },
 {
  "text": "Dr Edmond Lam \nDr. Lam is currently a Research Assistant Professor (RAP) in the Department of Biomedical Engineering (BME) at The Hong Kong Polytechnic University (PolyU). He received his B.Sc. degree in Applied Physics from City University of Hong Kong in 2014 where his research focused on biophysics of alpha-particle in zebrafish embryos via radiation-induced bystander effect. He then obtained his M.Sc. degree in Medical Physics from Duke University in 2017 where he worked on investigating effects of combining radiotherapy and immune checkpoint blockade, known as Radioimmunotherapy, on lung metastasis using mouse model of breast cancer. Dr. Lam further received his Ph.D. degree in Medical Physics from PolyU in 2022 where he investigated potential of multi-omics from routine radiotherapy data in prediction adaptive radiotherapy eligibility in patients with nasopharyngeal carcinoma. In addition to the academic journey, Dr. Lam has gained exposure in a medical imaging centre as a magnetic resonance imaging technologist, and in a world-leading innovator of precise radiation therapy solutions for managing cancer patients, Elekta Instrument Limited, as a research physicist.\nEducation and Academic Qualifications\nPh.D. in Medical Physics, The Hong Kong Polytechnic University\nM.Sc. in Medical Physics, Duke University\nB.Sc. in Applied Physics, City University of Hong Kong\nResearch Assistant Professor, Department of Biomedical Engineering, HK PolyU (2022-Present)\nResearch Assistant, Department of Health Technology & Informatics, HK PolyU (2018-2019)\nResearch Physicist, R&D Department, Elekta Instrument Limited, SH & BJ, China (2017-2018)\nMagnetic Resonance Imaging Technologist, Centrum MRI Centre Limited, HK (2014-2015)\nAdaptive radiotherapy \nAgeing-related diseases \nArtificial intelligence \nBig data analytics \nCancer management \nDeep learning \nMedical image processing \nRadiomics \nLam SK, Zhang YP, Zhang J, Li B, Sun JC, Liu YT Carol, Chou PH Bosco, Teng XZ, Ma ZR, Ni RY, Zhou T, Peng T, Xiao HN, Li T, Ren G Gary, Cheung LY Andy, Lee KH Francis, Yip WY Celia, Au KH, Lee HF Victor, Chang TY Amy, Chan WC Lawrence, Cai J. Multi-organ Omics-based Prediction for Adaptive Radiation Therapy Eligibility in Nasopharyngeal Carcinoma Patients undergoing Concurrent Chemoradiotherapy. Frontiers in Oncology (2022). 11:792024. doi: 10.3389/fonc.2021.792024\nLam SK, Zhang J, Zhang YP, Li B, Ni RY, Zhou T, Peng T, Cheung LY Andy, Chau TC, Lee KH Francis, Yip WY Celia, Au KH, Lee HF Victor, Chang TY Amy, Chan WC Lawrence, Cai J. A Multi-center Study of CT-based Neck Nodal Radiomics for Predicting Adaptive Radiotherapy Trigger of Ill-fitted Thermoplastic Mask in Patients with Nasopharyngeal Carcinoma. Life (2022). 12(2):241. https://doi.org/10.3390/life12020241 \nZhang YP, Lam SK, Yu T, Teng XZ, Zhang J, Lee KH Francis, Au KH, Yip WY Celia, Wang ST, Cai J. Integration of an Imbalance Framework with Novel High-generalizable Classifiers for Radiomics-based Distant Metastases Prediction of Advanced Nasopharyngeal Carcinoma. Knowledge-Based Systems (2021)\nTie X, Lam SK, Zhang Y, Lee KH, Au KH, Cai J. Pseudo-CT Generation from Multi-parametric MRI using a Novel Multi-channel Multi-path Conditional Generative Adversarial Network for Nasopharyngeal Carcinoma Patients. Medical Physics, 2020 Feb 3. doi: 10.1002/mp.14062\nZhang XF, Lam SK, Palmer G, Das S, Oldham M, Dewhirst M. Non-invasive Measurement of Tissue Blood Oxygenation with Cerenkov Imaging during Therapeutic Radiation Delivery. Optics Letter, 15 August 2017, doi: 10.1364/OL.42.003101",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-edmond-lam"
 },
 {
  "text": "Dr. Lee is a Research Assistant Professor at the Department of Biomedical Engineering in The Hong Kong Polytechnic University. He received his BEng degree in Medical Engineering from The University of Hong Kong and MSc degree in Biomedical Engineering from The Chinese University of Hong Kong in 2010 and 2011, respectively. He then acquired his MPhil and PhD degrees in 2014 and 2019, respectively in the Hong Kong Polytechnic University. Before his appointment as a Research Assistant Professor, he served as a Research Associate and Postdoctoral Fellow in the Hong Kong Polytechnic University. \nWith Dr. Lee’s strong research background on spine imaging using 3D ultrasound and radiography, his recent works involved clinical validation of ultrasound on the evaluation of coronal and sagittal curvatures and axial vertebrae rotation, investigation of curvature coupling and progression on individuals with idiopathic scoliosis, and alternation of spinal curvature in different clinical position and limb postures. Currently, Dr Lee aims to continue his research on 3D ultrasound imaging in the evaluation, diagnosis, and treatment of idiopathic scoliosis as well as for spine problems of elders, meanwhile explores the possibility of different imaging modalities on various musculoskeletal procedures.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr--timothy-lee"
 },
 {
  "text": "Ir Dr Duo Wai-Chi Wong \nIr Dr Duo Wai-Chi Wong\nResearch Assistant Professor \nPromote healthcare and designs by biomechanical modeling and digitalization.\nGH140 \n+852 2766 7669 \nduo.wong@polyu.edu.hk \nBiomechanics \nComputational Orthopaedics \nPhysical Medicine and Rehabilitation \nDigital Health \nData Analytics \nVirtual Reality \nBiostatistics and Epidemiology \nEducation and Academic Qualifications\nMember (MHKIE, Biomedical) of The Hong Kong Institute of Engineers\nAssociate Member of The Hong Kong Society of Certified Prosthetist and Orthotist\nRegular Member of The World Association for Chinese Biomedical Engineers\nFounding Member of The Hong Kong Society of Biomechanic \nResearchOutput \nSelected Publication\nInvited Book Chapter\nWong, D.W-.C., Ni, M., Wang, Y., & Zhang, M. (2020). Biomechanics of Foot and Ankle. In: Frontier in Orthopaedic Biomechanics. Edited by Cheng, C.-K. and Woo, S.L.-Y., (pp. 219-263), Springer Singapore, ISBN: 978-981-15-3158-3. \nWong, D.W-.C. (黃偉志), Wang, Y. (王岩), & Zhang, M. (張明). (2017). Biomechanics of Wedge Insole (楔形鞋垫生物力学). In: Frontier Series of Biomechanical Research in Rehabilitation Engineering (生物力学前沿系列 – 康复工程生物力学). Edited by Fan, Y.-B. (樊余波) and Zhang, M. (張明), (pp. 57-68), Shanghai Jiaotong University Press (上海交通大学出版社), ISBN 978-7-313-17993-7.\nWong, D.W-.C., Zhang, M. & Leung, A.K.-L. (2014) First Ray Model Comparing Normal and Hallux Valgus Foot. In: Computational Biomechanics of the Musculoskeletal System. Edited by Zhang, M. and Fan Y.-B., (pp. 49-60), CRC Press, ISBN 978-146-658-803-5.\nWong, D.W.-C. & Zhang, M.. (2014). Knee Implant Model: A Sensitivity Study of Trabecular Stiffness on Periprosthetic Fracture. In: Computational Biomechanics of the Musculoskeletal System. Edited by Zhang, M. and Fan, Y.-B., (pp. 93-102), CRC Press, ISBN 978-146-658-803-5.\nYu, J., Wong, D.W.-C. & Zhang, M. (2014) Dynamic Foot Model for Impact. In: Computational Biomechanics of the Musculoskeletal System. Edited by Zhang, M. and Fan, Y.-B., (pp. 61-71), CRC Press, ISBN 978-146-658-803-5.\nWong, D.W.-C., Pang, Z.-H., Yu, J., Leung, A.K.-L. & Zhang, M.. (2014) Hip Model for Osteonecrosis. In: Computational Biomechanics of the Musculoskeletal System. Edited by Zhang, M. and Fan, Y.-B., (pp.113-123), CRC Press, ISBN 978-146-658-803-5.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/ir-duo-wong"
 },
 {
  "text": "Dr Yuhe Yang \nDr. Yuhe Yang is a Research Assistant Professor at the Department of Biomedical Engineering, the Hong Kong Polytechnic University (PolyU). He obtained his bachelor and master’s degree in Materials Process Engineering from the Harbin Institute of Technology (HIT) in 2014 and 2016 and his PhD in Mechanical Engineering from National University of Singapore in 2020. Before the current appointment, he works as a Postdoctoral Research Fellow in PolyU. He has substantial research experience in biofabrication, biomaterials and tissue engineering. So far, he has published 22 articles (with 10 as first or co-first authors) in prestigious journals including Nat. Mater., Adv. Funct. Mater., Biomaterials, Small. In addition, he has applied 15 patents (11 granted). His project “Biomimicking Photocrosslinkable Nanocomposite Bone Graft” has won the Silver Medal at the Special Edition 2021 Inventions Geneva. ",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-yuhe-yang"
 },
 {
  "text": "Dr Yan Wang \nDr Yan Wang\nResearch Assistant Professor \nExploration of biomechanics of the musculoskeletal system for the benefit of human health and rehabilitation\nGH138 \n+852 2766 7675 \nannie.y.wang@polyu.edu.hk \nI am now a research assistant professor in the Department of Biomedical Engineering. My bachelor degree and the MPhil degree in mechatronic engineering were obtained in 2008 and 2011 respectively, from Shandong University. My PhD study was in musculoskeletal biomechanics and rehabilitation engineering in the Department of Biomedical Engineering in Hong Kong Polytechnic University and graduated in 2016. I have had more than 60 publications including SCI journal papers, scientific book chapters, conference papers and patents, and been honored of 13 relevant awards. I have been involved in 18 research grants as Co-Investigator and participant and is a PolyU team leader of a project funded by national key R&D program (Ministry of Science and Technology). As Principle Investigator I am taking charge of a NFSC (National Natural Science Foundation of China) general project grant. My research interests include Biomechanics of musculoskeletal system; Rehabilitation engineering; Sports injury; Motion analysis; Computational modelling and simulation; 3D printing in rehabilitation engineering; Prosthetics and orthotics bioengineering; Foot biomechanics and foot-support design; Bone and joint motion and mechanics; Ankle joint surgery; Ankle implant, etc. \nBiomechanics of musculoskeletal system \nRehabilitation engineering \nSports injury \nMotion analysis \nComputational modelling and simulation \nProsthetics and orthotics bioengineering \nFoot biomechanics and foot-support design \nBone and joint motion and mechanics \nAnkle joint surgery \nAnkle implant \nPhD in Biomedical Engineering, Department of Biomedical Engineering (BME), Hong Kong Polytechnic University\nMPhil. in Mechatronic Engineering, School of Mechanical Engineering, Shandong University\nBSc. in Mechanical Engineering, School of Mechanical Engineering, Shandong University\nPhD in Biomedical Engineering, Department of Biomedical Engineering (BME), Hong Kong Polytechnic University\nMPhil. in Mechatronic Engineering, School of Mechanical Engineering, Shandong University\nBSc. in Mechanical Engineering, School of Mechanical Engineering, Shandong University\nResearch Fellow, Department of Biomedical Engineering (BME),Hong Kong Polytechnic University, Hong Kong, Apr 2018 – Jun 2020\nPostdoctoral Fellow, Department of Biomedical Engineering (BME),Hong Kong Polytechnic University, Hong Kong, Apr 2016 – Apr 2018\nResearch Associate, Department of Biomedical Engineering (BME),Hong Kong Polytechnic University, Hong Kong, Oct 2015 – Apr 2016\nResearch Assistant, Cleveland Clinic, Ohio, USA, Sep 2013 – Dec 2013\nResearch Engineer, Sany Group Co.,Ltd., Shanghai, China, Jul 2011 – Nov 2011",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-wang-yan"
 },
 {
  "text": "Dr. WONG Siu Hong Dexter joined the Department of Biomedical Engineering at the Hong Kong Polytechnic University in 2020. He received a B.Eng degree in Biomedical Engineering from the Chinese University of Hong Kong (CUHK) in 2015 where he worked on the fabrication and application of micro/nano-optical-patterned structures to regulate cell mechanics. He further received the Ph.D. degree in Biomedical Engineering from CUHK in 2019 and focused his doctoral study on harnessing cell receptor-ligand interactions via tunable nanostructures to regulate cell fates. Dr. Wong’s research interests focus on novel nanomaterial and nano-composite hydrogel to investigate the nano-bio interface and harness ligand-receptor interaction for cellular mechanotransduction, tissue engineering, and immunotherapy. Moreover, he is also interested in exploring nanoprobes for imaging, biosensing, and therapy in the current study, especially viral detection, to address the current COVID-19 pandemic issue. He has published over 30 journal papers with corresponding, first- and co-authorships, including Advanced Materials, Nano Letters, ACS Nano, Advanced Functional Materials, Theranostics, Nature Communications, Journal of the American Chemical Society, Small, Biomaterials, etc. He is also a member of the Royal Society of Chemistry (MSRC).\nDr. Wong is engaged in teaching postgraduate research students on Nanobiotechnology in Biomedical Engineering and undergraduate level courses on Skin-care Technologies, and Biomaterials Science and Engineering.",
  "url": "https://www.polyu.edu.hk/bme/people/academic-staff/dr-dexter-siu-hong-wong"
 },
 {
  "text": "Prof. Ming Zhang is the head and professor at PolyU BME. His research mainly focuses on the biomechanics of the musculoskeletal system and body support. In this interview, we dove deeper into the topics such as his research interests and the unique advantages of studying BME.\nQ1: Having first studied in automation control engineering, then mechanical engineering, why did you switch over to learn more about biomedical engineering?\nAfter obtaining my MPhil degree in mechanical engineering, I worked as a lecturer at Beijing Institute of Technology. I read several papers related to human bones and joints. I felt it was interesting to apply engineering knowledge to human body. I also learnt that several Chinese researchers, like Yuan-Cheng Fung (馮元楨), Van C. Mow (毛昭憲), Ed Chao (趙以甦) and Savio Woo (胡流源), who were all very successful in applying their engineering knowledge to biomedical engineering research and education, bringing great benefits to the human race. At that time there were very few engineering programs in China. Hence, more people were needed to contribute to this area. Then I decided to select biomedical engineering for my Ph.D. study. Nowadays, Biomedical Engineering in Hong Kong and the mainland has greatly improved. I want to extend my warmest welcome to those who are interested in biomedical engineering to join us and meet new challenges.\nQ2: Having an esteemed career worldwide, how do you think BME will evolve in the future worldwide and locally? \nBME will become a more and more demanding discipline. It is an era of the appearance of new innovative technologies and people and government have paid more and more attention to human health, and ageing issue as well. As a bridge between engineering technology and health and medical care, BME should play an increasingly important role.\nQ3: Do you think the COVID-19 pandemic might have a positive effect on BME that highlights the importance of healthcare and safety?\nWe cannot say the Covid-19 pandemic has positive effects on BME. However, the unprecedented challenges to public health and social disruptions may make people think more on the solutions in prevention, diagnosis, treatment and rehabilitation. BME should play a more critical role in both research and education. Some staff working on virus detection have obtained more research grants recently. I believe BME will attract more attention in the future, becasue we are working along the direction to provide help for health and medical care by using innovative technologies.\nPhoto: Prof. Ming Zhang and his research team \nQ4: Having won multiple research awards, can you share more information about your research that you found the most fascinating?\nMy research focuses on biomechanics of the musculoskeletal system (骨骼肌肉系統生物力學) and body support design applied to the fields of orthopaedics, sports science, and rehabilitation engineering. In the past 20 years, my team has been mainly working on the development of biomechanical platform integrating experimental study with computational simulation for the understanding of human foot and its support effects. Our computational simulation using both musculoskeletal model and finite element model can give a clear picture of biomechanical performance of the foot and ankle and provide useful information for surgical intervention and shoe and orthosis design. We are also collaborating with Beihang University to apply the platform to investigate why woodpeckers can protect their heads under extremely high impact acceleration. These publications with fascinating findings attracted many media’s interests. We were glad to obtain a series of awards including the first-class Natural Science Award from the national Ministry of Education (國家教育部自然科學獎).\nQ5: How do you think PolyU could attract more students to study BME for MPhil or Ph.D.?\nIn my view, people choose PolyU BME for postgraduate study because of the reputation of both PolyU and BME. Our university strives for world-class excellence and to improve the ranking for recognition and reputation. BME staff together with all research staff and students will conduct impactful and cutting-edge research and promote our programmes.\nQ6: What are your biggest challenges and obstacles that you had to overcome in your personal life or professional career?\nMy research focuses on biomechanics of musculoskeletal system and body support design, applied to the fields of orthopaedics, sports science, and rehabilitation engineering, belonging to macro-level biomechanics. Biomechanics to support orthopaedics was a very hot topic 30 years ago. However, in the past 20 years, hot topics have shifted to micro-level or cellular level. Macro-topics no longer seemed to be cutting-edge research in some people’s view, and sometimes it is hard to get grants and to publish papers in high impact-factor journals. However, we have persisted in working in this direction because we believe our research is very useful for clinics and prosthetics and orthotics. Now, we have become one of world leading teams in biomechanics of musculoskeletal system.\nQ7: What are the unique advantages of PolyU BME in comparison to BME from other universities?\nPolyU BME can be dated back to Jockey Club Rehabilitation Engineering founded in 1987, originally focused on rehabilitation engineering. Our BME programme has evolved from Prosthetics and Orthotics (1995-1999), and Health Technology (2000-2012). It is the only program in Hong Kong integrating strong rehabilitation engineering and P&O elements in biomedical engineering, whereby we provide more clinically oriented BME programmes. We have a strong team of faculty members with expertise in smart ageing technology and assistant technology, besides the research strength in general biomedical engineering.\nCredit to: Orion KEUNG (Year 2 -Bachelor of Science (Honours) in Biomedical Engineering)/ Tsun Ming YAM(Year 3 - Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/news-and-events/feature-stories/interview-with-ming"
 },
 {
  "text": "Professional Engineering Practice\nWorking in medical device industrial settings,hospitals, the government, medical device regulatory firms, or other biomedical institutions, graduates apply their knowledge in biomedical engineering. This includes engineering research and development, engineering design and product development, regulatory and business aspects of engineering, such as sales,marketing, and technical management.\nProfessional Clinical Practice\nGraduates work in hospitals and healthcare sectors, including Prosthetics & Orthotics, clinical and rehabilitation engineers and hospital scientific officers, and in healthcare product customer services.",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/work-integrated-education"
 },
 {
  "text": "Introduction\nProgram Overview\nCurriculum\nList of Subjects and Subject Description Forms\nWork-Integrated Education\nNon-local Learning Experience\nStudent Message\nPamphlet\nEntry Credit Transfer\nStudent Message \nMy programme within the Department of Biomedical Engineering at PolyU has paved a path for me into the healthcare service industry. The programme’s focus on Prosthetics and Orthotics is unique in Hong Kong. Using knowledge of biomechanics,material science and pathologies, this programme nurtures students to become professional clinicians and serve the public by providing high-quality healthcare services. This summer, I had a two-month clinical attachment in the Department of Prosthetics and Orthotics at Tuen Mun Hospital, which allowed me to acquire more bedside clinical experience and learn about the real-life workings of the industry and the local healthcare system. This experience has shaped my perspective of the local healthcare servicing field and has better equipped me for my future career.\nPolyU emphasises the all-round development of its students. In addition to striving for academic excellence, I have been able to explore and stretch my potential at PolyU by being selected for the university’s men’s volleyball team. PolyU has a well-established sports department, providing high-quality training and support to aid student athletes to perform well in both local inter-collegiate and international competitions. Last year, the men’s volleyball team received the gold medal in the University Sports Federation of Hong Kong competition, and PolyU won the overall inter-collegiate championship.\nCHIU Ka Tsun, Edmond\n(Year Four Student）",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/student-message"
 },
 {
  "text": "Introduction\nProgram Overview\nCurriculum\nList of Subjects and Subject Description Forms\nWork-Integrated Education\nNon-local Learning Experience\nStudent Message\nPamphlet\nBME Study Tour \nBME Study Tour is a self-planned summer activity organized by BME Year-2 students and led by BME academic staff since the Year 2016.\nThe Study Tour not only allows students to gain first-hand experiences and to learn new knowledge by attending academic conferences and visiting overseas universities and museums, but is also an opportunity to promote the image of The Hong Kong Polytechnic University through students’ presentations and sharing during the visits.\nOutbound Exchange Programmes \nThe Department of Biomedical Engineering (BME) has established studentexchange programmes with a number of world renowned universities, including:\nHelsinkiMetropolia University of Applied Sciences (Finland)\nJönköpingUniversity (Sweden)\nUniversity of Pennsylvania (USA)\nUniversityof Strathclyde (UK)\nWashington University in St.Louis (USA)",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/non-local-learning-experience"
 },
 {
  "text": "For IB/GCE/HKAL Students\nBME will grant entry credit transfer of Discipline-Specific Requirements (DSR) credits to IB/GCE/HKAL students as follows:\nExam/ Subject\nMin. Grade/ Score\n\t\t\nHKALE/ Physics\nD\nAll levels one Physics\nAP10005 Physics I\nAP10006 Physics II\nGCEAL/ Physics\nB\nIB/ HL/ Physics\n6\nHKALE/ Pure Mathematics\nE\nAll levels one Mathematics\nAMA1110 Basic Mathematics I - Calculus and Probability & Statistics\nAMA1120 Basic Mathematics II -Calculus and Linear Algebra\nHKALE/ Applied Mathematics\nE\nGCEAL/ Pure Mathematics\nB\nGCEAL/ Further Mathematics\nB\nIB/ HL/ Further Mathematics\n5\nIB/ HL/Mathematics\n6\nFrom the 2022/23 intake cohort, students holding A-Level or IB qualifications may be given credit transfer upon their admission to the 4-year full-time undergraduate degree schemes / programmes. Normally, they will be given credit transfer from 9 credits (including 6 credits for the broadening subjects and 3 credits for University English under the Language & Communication Requirements) to a maximum of 25% of the award requirements, depending on their previous study and grade attainments.\nFor Senior Year Students\nWe provide a flexible curriculum for students admitted to the senior year of our 4-year full-time undergraduate degree schemes / programmes. These students will follow a reduced curriculum.\nStudents are also expected to meet the equivalent standard of the Undergraduate Degree Language and Communication Requirements (LCR). Students not meeting the equivalent standard of the LCR will be required to take degree LCR subjects.\nBME will grant credit transfer of Discipline-Specific Requirements (DSR) credits to Senior Year students. The guidelines are as follows:\nGranting of credit transfer is mainly based on the subject contents and the learning outcomes attained. \nThe subject contents attained should be at least 75% similar to the PolyU subjects of a similar level, credits, and contact hours. \nThe subject grade/mark achieved should be B / 75% or above.\nThe granting of credit transfer is a matter of academic judgement. Information stated above is for reference and subject to review and changes.",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/admissions/entry-credit-transfer"
 },
 {
  "text": "Over the summer, I was able to get a taster for what the working world of engineering is. Working at a start-up research and design company was a very eye-opening experience. In this article, I would like to share some of the insights I gained from participating in this internship.\nImportance of curiosity and creativity\nA big takeaway from this internship was the necessity for curiosity and the creativity to solve problems. The essence of engineering is essentially to create a physical solution to solve a problem. When us interns first came to the company, we thought that a very fancy, grand, sophisticated robotics idea would be very suiting for the issues that our boss has set for us to solve. However, the best solution may not always be the most complicated. Instead, our boss would often urge is to get inspired by mechanisms and processes that are in day to day objects because it would therefore be simple, easy to build and replicate, which ultimately meant that we knew that I would work and that it was a solution that would work. Therefore, when we actually thought of any ideas to add mechanisms to put into our solutions and potential robots are free what we essentially did was me we went to IKEA had to basically find out different mechanisms, or just utilize day-to-day objects such as a lunchboxes to actually get inspired. This prompted me to think that our knowledge of how day-to-day things work and knowledge in different fields can all link back to engineering or our respective, specific fields. This further prompted me to think that acquiring knowledge from many different fields could still have used in one singular field. The constant need to design and think of mechanisms appeared to me that the need for creativity is quite abundant. Furthermore, I was given the task of having to draw some CAD to represent the ideas, and I truly believe that with drawing CAD requires quite a lot of logic as well as creativity in order to draw the object that you would want.\nMeeting People\nThrough this internship, I had the pleasure of meeting many very gifted and talented people in all sorts of areas. Due to the fact that we are colleagues, we are almost forced to approach them and interact with them. Often times, this leads to a tight knit friendship that I think is quite invaluable. I believe that having good communication and social skills is very important as well. During the pandemic, for myself at least, My social skills have potentially declined due to the fact that we have all been locked in and advised to not go out all that much. In turn, I have seen that there may be less face to face communication. This can potentially hinder the possibilities for networking, which could mean the loss of more fun and exciting opportunities and projects ahead, or even fascinating lessons to learn from other people. Hence, I would say that it’s still very important to interact with other people and truly be confident with speaking with even complete strangers. \nCredit by Orion KEUNG (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/work-integrated-education/orion"
 },
 {
  "text": "Internship or WIE (Work-Integrated Education) is an integral part of our journey in university. Sometimes we all ask ourselves why we need the internship. I tried to answer that question and learn something important out of my experience. I believe we need an internship, simply because it helps students immerse themselves in the workplace and gain practical experience. Usually, before the internship application period starts, the BME professor will share the Internship provision forms to every student so we can have a clear picture of how many options are currently available and what is the job nature of the internship position. For me, the internship form was very helpful, it included all the information like the duration of the internship, my duties, etc. I therefore decided to apply for a summer job at W.O.M. Novanta. My goal was to better understand minimally invasive surgical technologies and learn more about the commercial side of medical companies, how they work, and all the ins and outs. \nW.O.M. or World of Medicine Limited is a subsidiary of Novanta Group, which is one of the world's leading providers of GIS technology and equipment. When I joined the WOM team, I was assigned several important and complex tasks that I was not aware of at all. It was very difficult for me to work on this task initially, as it was difficult to find important information on the web. The more I learned about endoscopes, minimal invasive surgical devices, the easier it was for me to get through. \nAlthough I had some challenges, I appreciated the process and am grateful for the knowledge and skills I gained from this internship. When it comes to achievements during my internship, I think I have learned to be more independent and also enhanced my communication and Excel skills. And the most important thing I am thankful for is my team as they have always supported and guided me every step of the way.\nI learned to tackle different issues by looking at them from different angles, and my ability to think critically was the main strength of my internship. For instance, I had the task to present all the data I collected in 3 months in a simple but informative ppt. This task seemed pretty easy at first, but then I realized I had to put myself in the place of those who didn't know the Coupler market. So I started to think about my experience and how I got started on it. For me, it was a long journey, but the goal was to let my audience learn everything about Camera Couplers and its activities in 20 minutes. I tried to frame my presentation as a logical sequel.\nI think I have successfully finished all the tasks assigned by the company only because I am a careful listener. It is the most important skill in the workplace as well as good communication skills. This experience helped me draw some important conclusions on myself and taught me to communicate professionally.\nCredit by Aliya TUMANBAYEVA (Year 3 -Bachelor of Science (Honours) in Biomedical Engineering)",
  "url": "https://www.polyu.edu.hk/bme/study/undergraduate-programme/work-integrated-education/aliya"
 },
 {
  "text": "The programme of Master of Science in Biomedical Engineering is an ideal choice for those who would like to pursue advanced education in biomedical engineering, rehabilitation engineering, and digital health, with an opportunity to develop advanced levels of knowledge and skills for healthcare.\nThis biomedical engineering award addresses the growing importance of the development of state-of-the-art medical devices, assistive, digital and other health technologies for affordable healthcare. It is designed for engineers, scientists and health professionals who are interested in the field of health technology. We provide students with a broad-based knowledge of advances in biomedical engineering, rehabilitation engineering and digital health, thus enhancing their ability to develop and apply technology in health and rehabilitation care.\nThe programme has the following aims:\n(a) to nurture professionals and specialists with professional competence, strategic thinking and lifelong learning capability in the biomedical engineering field;\n(b) to provide students with the modern engineering knowledge and advanced technology tools necessary for biomedical engineering practice; and\n(c) to equip students with critical thinking and problem-solving skills in the biomedical engineering field through high-quality education.",
  "url": "https://www.polyu.edu.hk/bme/study/taught-postgraduate-programme/master-of-science-in-biomedical-engineering/programme-aims"
 },
 {
  "text": "The programme provides the option for students to engage either in the full-time or part-time study mode. \nFull-time students normally take five subjects per semester and the normal study period is 1 year.\nPart-time students normally take two to three subjects per semester and the normal study period is 2.5 years.\nIn general, each subject requires a 3-hour class per week over a 13-week semester and subjects are offered on weekday evenings.\nAward Requirements\nStudents need to obtain 30 credits for graduation. The curriculum for each award is listed as follows.\nFor Award Title: Master of Science in Biomedical Engineering\nStudents must complete:\n(i) 1 Compulsory Subject:\nResearch Methods & Biostatistics\n(ii) 9 Elective Subjects (or 6 Elective Subjects plus Dissertation)\nFor Award Title: Master of Science in Biomedical Engineering (Rehabilitation Engineering) \nStudents must complete:\n(i) 5 Compulsory Subjects:\nDigital Design and Manufacturing for Biomedical Engineering\nClinical and Sports Biomechanics\nAdvanced Prosthetics and Orthotics \nModern Rehabilitation Engineering and Robotics\nResearch Methods & Biostatistics \n(ii) 5 Elective Subjects (or 2 Elective Subjects plus Dissertation)\nFor Award Title: Master of Science in Biomedical Engineering (Digital Health) \nStudents must complete:\n(i) 5 Compulsory Subjects:\nMolecular and Functional Imaging: From Body System to Molecules\nBiomedical Microdevices \nWearable Technology for Digital Health \nMedical Artificial Intelligence and Data Analytics \nResearch Methods & Biostatistics \n(ii) 5 Elective Subjects (or 2 Elective Subjects plus Dissertation)\nSubject List\n(All subjects carries 3 credits except the 9-credit dissertation)",
  "url": "https://www.polyu.edu.hk/bme/study/taught-postgraduate-programme/master-of-science-in-biomedical-engineering/programme-structure"
 }
]