[
 {
  "text": "Home \nPeople ",
  "url": "https://www.polyu.edu.hk/ee/people"
 },
 {
  "text": "People \nAcademic and Teaching Staff ",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff"
 },
 {
  "text": "Programme Overview\nThe Department offers different training opportunities to meet your career needs. Amongst the universities in Hong Kong, our Department is the major education provider in electric power engineering and the utilization of electric power. The Department is playing an important role in educating the much needed electrical engineers for Hong Kong and overseas as electrical infrastructure is expanding worldwide.\nApart from the basic discipline-based subjects, all students could practice their engineering skills through the Work-Integrated Education and Industrial Summer Placement. Students could also apply for exchange studentship for up to 6 months in famous overseas universities. Both PolyU and the Department have numerous scholarship available for academically excellent students for application.\nWe welcome you to join us, to learn, experience and explore for the sake of your fruitful career prospect!",
  "url": "https://www.polyu.edu.hk/ee/study"
 },
 {
  "text": "Study \nUndergraduate Programmes \nBachelor of Engineering (Honours) Scheme in Electrical Engineering \n電機工程學(榮譽)工學士組合課程 (Programme Code: 41482)\nProgramme Aims & Learning Outcomes\nThe BEng (Hons) Scheme in Electrical Engineering consists of the following degrees. It aims to give students the flexibility to decide on the final degree in their study.\nBEng (Hons) in Electrical Engineering\nIt provides in-depth coverage of electrical engineering based on an outcome-based education philosophy. The programme produces engineers who are able to practise their professions in a wide range of areas of electrical engineering, such as electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nBEng (Hons) in Transportation Systems Engineering\nIt aims to make full use of the hugely versatile applications of the in-demand disciplines of electrical engineering to broaden the career opportunities available to our graduates. Students are expected to acquire a solid understanding of the fundamentals of electrical engineering, and apply the knowledge gained and techniques learned to relevant areas in the field of transportation systems. \nStudents admitted to the Scheme will complete a common Year 1 curriculum. They will select any one of the Honours degree awards and can begin studying the relevant content as early as in semester one of Year 2, or as late as in semester two of Year 2.\nThe BEng (Hons) Scheme in Electrical Engineering aims to equip our graduates with professional skills in electrical engineering that are applicable worldwide. Through theoretical and practical training, they could be capable of serving in frontline roles in the development, design and application of electrical systems in relevant industries. The programme also provides a pathway for students to pursue higher research and senior management prospects. \nApplication Information ",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes"
 },
 {
  "text": "Study \nTaught Postgraduate Programmes \nEngineering Doctorate (EngD) in Electrical Engineering 電機工程工學博士（EngD）\nThe Engineering Doctorate Programme (EngD, programme code 05001) is a self-financed advance programme, caters for those who wants to pursue advanced electrical engineering studies beyond Master Degree level. This doctorate programme consists of half coursework and half research. The coursework will consist mainly of advanced subjects from our MSc. pool, whereas the research will be an innovative type of study with strong industrial application characteristics.\nMaster of Science (MSc) in Electrical Engineering 電機工程科學碩士（MSc）\nWe provide advanced study opportunities for electrical engineers who are working in power utilities, electricity utilization industries, electrical product manufacturing industries, government organizations and contracting and consulting companies. We will develop your in-depth knowledge of state of the art advances in modern electrical science and technology such as power systems, the industrial utilization of electrical energy, power electronics, railway systems and drives control, automation and optoelectronics.",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes"
 },
 {
  "text": "Department Faculty of Engineering \nEntrance Year Sept 2022 \nProgramme Code 05001 \nStream Code \nFD (Full-time) \nPD (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n3 years (Full-time) \n5 years (Part-time)\nCandidates will be deregistered from the programme if they exceed the normal duration of the programme, unless approval is obtained from the relevant authority. \nFund Type Self-Financed \nCredits Required for Graduation 48 \nInitial Registration Credits \nHK$82,000 per semester for full-time mode\n3 credits for candidates of part-time mode\nLocal Application Deadline 30 Jun 2022 \nNon-Local Application Deadline 30 Jun 2022 \nTuition Fees \nHK$82,000 per semester for full-time mode\nHK$10,250 per credit for part-time mode\nRemarks: Full-time candidates will be charged HK$82,000 per semester for 6 semesters (which is the normal duration for completing the programme on a full-time basis) whereas part-time candidates will be charged HK$10,250 per credit for 48 credits.\nThe total tuition fee of the 48-credit programme is HK$492,000 for both full-time and part-time candidates.\nFull-time candidates having taken all the 48 credits earlier than the normal registration period (i.e. 6 semesters) will be required to pay the remaining fee when they submit their thesis for oral examination.\nThe normal duration for the completion of thesis is consecutive six semesters. Approval has to be sought for extending the completion of thesis beyond six semesters and an extension fee of HK$30,750 per semester will be charged.\nCandidates have to bear flight cost, hotel accommodation fees, make extra travel insurance arrangement according to individual needs (especially for those who wish to advance or extend their stay in the destination. Basic travel insurance will be provided by the University covering the designated period of the study trip), etc. if they select overseas study trips as their electives.\nProgramme Leaders Dr S.Q. Bu\nBEng, BSc, MEng, PhD, CEng, MIET, SMIEE \nRemarks\nThis programme is co-hosted by the following academic departments: \nDepartment of Biomedical Engineering;\nDepartment of Computing;\nDepartment of Electrical Engineering;\nDepartment of Electronic and Information Engineering;\nDepartment of Industrial and Systems Engineering; and\nDepartment of Mechanical Engineering.\nWe have a quota for admissions. Early applications are strongly encouraged. Shortlisted candidates will be invited for interviews. Offers will be made on a rolling-basis.\nAn incomplete application cannot be processed promptly and may reduce your chance of admission. Please complete all relevant fields on the application form and upload all necessary documents.\nAims and Characteristics\nThe Engineering Doctorate Programme (EngD, programme code 05001) is a self-financed advance programme, caters for those who wants to pursue advanced electrical engineering studies beyond Master Degree level. This doctorate programme consists of half coursework and half research. The coursework will consist mainly of advanced subjects from our MSc. pool, whereas the research will be an innovative type of study with strong industrial application characteristics. \nTo train engineers who are capable of demonstrating creative skills in the application of advanced knowledge in electrical engineering, and to develop innovative thinking while solving real industrial problems.\nTo enhance the professional competence of the students who are already, or have the potential to rise to senior management or principal research/development positions.",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes/engineering-doctorate-in-electrical-engineering"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 05002 \nStream Code \nNE (Full-time)\nEET (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time)\n2.5 years (Part-time)\nFund Type Self-Financed \nCredits Required for Graduation \n30\nInitial Registration Credits \n6 for local students\n12 for non-local students\nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nTuition Fees \nHK$5,410 per credit for local students\nHK$5,800 per credit for non-local students\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 12 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the fellowship at any time. In case of any dispute/disagreement, PolyU’s decision is final.\nProgramme Leaders \nDr NIU Shuang-xia\nBSc(Eng.), MSc(Eng.), PhD\nRemarks\nNote to Applicants\nWe have a limited quota of admission. Early applications are strongly encouraged.\nThis programme is offered within the Postgraduate Scheme in Engineering.\nAims and Characteristics\nProgramme Aims\nWe provide advanced study opportunities for electrical engineers who work in power and electricity utilisation industries, electrical product manufacturing industries, government organisations, and contracting and consulting companies. Our students gain in-depth knowledge of state-of-the-art advancements in modern electrical science and technology, such as power systems, the industrial utilisation of electrical energy, power electronics, railway systems and drive control, automation, and optoelectronics.\nCharacteristics\nThe multidisciplinary nature of this programme encourages students to develop a broad perspective and allows them to take subjects in related technical fields, such as communications, computing, marketing, management and information sciences. The programme also allows students to take a combination of subjects and provides three specialism options:\n​​MSc in Electrical Engineering (Electrical Power Systems)#\n電機工程學理學碩士學位 (電力系統)#\nMSc in Electrical Engineering (Electric Vehicles and Power Electronics)\n電機工程學理學碩士學位 (電動車輛及電力電子)\nMSc in Electrical Engineering (Railway Systems)*\n電機工程學理學碩士學位 (鐵路系統)*\n# The HK Electric Institute assists in teaching some of the designated subjects.\n* MTR Academy assists in teaching some of the designated subjects.",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes/master-of-science-in-electrical-engineering"
 },
 {
  "text": "The research in smart materials, devices, and applications is a strategic technology resource to facilitate sustainable development of electrical engineering (and its related science, technology, and engineering fields) into newer and smarter dimensions. \nSupported by the well-equipped Smart Materials and Systems Laboratory, the research group has the primary focus on developing multifunctional smart materials with interestingly high magneto-/electro-/thermo-/mechano-/optical responses in the bulk, micro-, and nano-scale. It also aims to investigate the fundamentals of energy generation, conversion and storing processes, structural integrity as well as environmental sustainability for multidisciplinary applications of the materials. The smart materials of interests include, but are not limited to, multiferroic, magnetoelectric, ferroelectric, piezoelectric, magnetostrictive, magnetocaloric, ferromagnetic shape memory, magnetorheological, and photovoltaic materials. Moreover, the development of smart devices, including power supply-free energy-harvesting wireless sensors, coil-free self-isolated circuit protection and control devices, electromagnetic wave nano-absorbents, green batteries and energy cells, sensori-actuators/-transducers, ultrasonic motors, self-sensing vibration absorbers/isolators/dampers, etc., forms the application focus. In addition, condition and health monitoring; signal analysis, processing and transmission; drives, control and automation; energy harvesting, conversion and storage; prognosis and diagnosis; nondestructive evaluation; etc. are the synergic technologies for integrated systems. \nThe research group has an outstanding record of research performance and an excellent reputation for professional services in the three aspects of basic research, applied research, and industrial research, both locally and internationally. \nContact: Prof. Derek S.W.",
  "url": "https://www.polyu.edu.hk/ee/study/research-postgraduate-programme"
 },
 {
  "text": "Guidelines on Credit Transfer\nGranting of credit transfer is mainly based on the subject contents and the learning outcomes attained. The subject contents attained should be at least 75% similar to the PolyU subjects of a similar level, credits and contact hours.\nThe subject grade/mark achieved should be C / 65% or above.\nEntry Credit Transfer\nFor students admitted from 2022/23 onwards, students holding A-Level or IB qualifications may be given credit transfer upon their admission to the 4-year full-time undergraduate degree schemes / programmes. Normally, they will be given credit transfer from 9 credits (including 6 credits for the broadening subjects and 3 credits for University English under the Language & Communication Requirements) to a maximum of 25% of the award requirements, depending on their previous study and grade attainments. For students admitted in 2021/22 or before, students holding A-Level or IB qualifications may be given credit transfer upon their admission to the 4-year full-time undergraduate degree programmes. Normally, they will be given credit transfer from 12 credits (including 6 credits for the broadening subjects, 3 credits for the Freshman Seminar and 3 credits for University English under the Language & Communication Requirements) to a maximum of 25% of the award requirements, depending on their previous study and grade attainments.\nEntry credit transfer of Discipline-Specific Requirements (DSR) credits may be given to the graduates of Higher Diploma or Associate Degree in Electrical Engineering or a related discipline. Students are also expected to meet the equivalent standard of the Undergraduate Degree Language and Communication Requirements (LCR). Students not meeting the equivalent standard of the LCR will be required to take degree LCR subjects.\nFor students admitted based on other qualifications, the number of credit transfer to be granted at admission will be considered on individual merits.",
  "url": "https://www.polyu.edu.hk/ee/study/information-for-current-students/credit-transfer"
 },
 {
  "text": "Experience and Opportunities ",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities"
 },
 {
  "text": "Experience and Opportunities \nEngineering Entrepreneurship Club \nUnderwater ROV Workshop\nWelcome to our website \nThe Hong Kong Polytechnic University Engineering Club was formed in 2013. It aims at promoting critical and creative thinking, as well as teamwork for our students by participating in games and competitions. In past years, the Engineering Club had successfully invited students to participate in the Robot Wars Competition, organized a team to participate in the Marine Advanced Technology Education (MATE) Underwater Robot Challenge in 2015, 2016 and 2017. In 2015, the team also participated in the International MATE competition held in St. John's, Newfoundland of Canada.\nInvolve in many project\nThe Engineering Club had successfully invited students to participate in the Robot Wars Competition and the Marine Advanced Technology Education (MATE) Underwater Robot Challenge in differnet years.\nEnhance hands-on experience\nTo strengthen students’ motivation in learning as well asprovides an opportunity to showcase their engineering skills.\nRank 11 out of 31\nThe team also won a place to attend the underwater Robot competition held in June 2016 in NASA Johnson Space Centre’s Neutral Buoyancy Lab in the US.\nWhat is our missions ?\nTo enhance student’s practical knowledge and skills.\nTo offer support to students with technical advice, know-how and experience.\nTo offer chances for students to compete in international events.\nTo instill entrepreneurial spirit to students.\nTo gear up students for their final year projects.\nWorkshop\nArduino Workshop\nRaspberry Pi Workshop\nUnderwater Robot Workshop\nSapiente repudiandae perspiciatis\nEvents being held in past years\nMATE Underwater competition 2015\nMATE Underwater competition 2016\nMATE Underwater competition 2017\nRobot Wars Competition 2016\nComputer Vision for Pre-flight Walk Around Check Competition\nProject Arduino 2016 and 2017\nOur Photos \n\nHow to become a member?\nAre you someone that loves a challenge and are looking for an opportunity to grow and test potential as part of an engineering team?\nIf yes, then please send email to Dr Isaac Fung\nFacebook: https://www.facebook.com/uprisingrov/",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/engineering-and-entrepreneurship-club"
 },
 {
  "text": "Experience and Opportunities \nMentorship Programme \nMentorship Programme - Electrical Engineering \nSince 2013, EE has started its mentorship programme with IET-Hong Kong. We are very glad to have an increasing number of mentors and mentees year by year.\nOUR MISSIONS\nTo enhance the exposure of our EE students through experience sharing and interaction with experienced professionals and senior executives from industries. \nBENEFITS OF THE PROGRAMME\nThrough the interaction, we anticipate our mentees could be able to obtain advice for their future career planning and development, erect a strong networks for further development. This platform also allows our mentors to inspire our students, and post as a role model for the next generation to be a professional engineer. \nMENTORS\nThrough the interaction, we anticipate our mentees could be able to obtain advice for their future career planning and development, erect a strong networks for further development. This platform also allows our mentors to inspire our students, and post as a role model for the next generation to be a professional engineer. \nEVENTS\nThrough the interaction, we anticipate our mentees could be able to obtain advice for their future career planning and development, erect a strong networks for further development. This platform also allows our mentors to inspire our students, and post as a role model for the next generation to be a professional engineer. \nCONTACT US",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/mentorship-programme"
 },
 {
  "text": "Experience and Opportunities \nAcademic Advising \nAims\nAcademic advising at PolyU aims to help students to make informed and intelligent academic decisions/choices about their study at PolyU that suit their intellectual, professional and personal goals. It is instrumental to promoting student success, and plays a vital role in enhancing students’ overall learning experience at PolyU. The specific objectives are: \nTo build up an early connection between the students and their home departments, and to promote their sense of affiliation to the department and the University,\nTo provide students with accurate information about the academic regulations and requirements regarding their Major/programme, as well as the GUR,\nTo assist students to explore their interests, abilities and values on academic pursuits, and formulate appropriate intellectual, professional and personal goals,\nTo provide advice and guidance to students that enables them to develop and pursue a study plan for their 4 years of study appropriate for meeting their intellectual, professional and personal goals,\nTo connect students to resources, opportunities and support within and outside the University that enhance their educational experiences and success.\nAcademic Advisors’ Responsibilities\nBuilding rapport with the students\nBeing accessible, available and responsive\nHelping students to clarify their intellectual, professional and personal goals\nHelping students to develop an appropriate study plan\nAlert students to academic regulations and requirements, particularly those relating to the Major\nEarly identification of students with special learning needs or early signs of learning problems and make necessary referrals\nContact with student advisees regularly and to have at least one face-to-face meeting (individually or in small groups) during the academic year.\nStudents’ Role\nTake the final responsibility for making decisions and choices regarding their academic study based on the information and advice given. \nUnderstand the academic regulations and requirements of their chosen Major/programme, as well as the GUR requirements,\nActively obtain information, and seek out advisors and resources on a regular basis and as needed,\nTake the final responsibility for making decisions and choices regarding their academic study based on the information and advice given.\nMeeting with the Academic Advisor\nDuring the semester, there will be an allocated time slot for each student with his/her designated academic advisor to have face-to-face discussion on the latest status, subject selection, study plan and other issues within the scope of academic advising.\nAll students are also welcome to discuss with his/her designated academic advisor in addition to that allocated time slot.\nPreliminary meeting plan: \nDepartmental Orientation Day (end of August)\nConsultation meetings before Subject Registration period\nDuring the Semester, students could contact their advisors through different means to seek academic advice in relation to their studies.\nContact with Academic Advisor\nThe academic advisors, together with their contact information can be found under the \"Academic Advising\" section of eStudent. ",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/departmental-academic-advisor"
 },
 {
  "text": "Scholarships \nScholarships\nThe Department is very supportive to students with outstanding academic achievements. Through the offering of different types of scholarships, the Department recognizes the efforts paid by the students in achieving outstanding academic performance during their studies. Apart from offering entry scholarships to students during admission, we also offer scholarships with the donation from a number of private organizations, firms, professional bodies and individuals.\nPlease click here for more details ",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/scholarship"
 },
 {
  "text": "Exchange and Placement \nStudent Exchange Programme\nOur students can apply for exchange studentship for up to 6 months in famous overseas universities. Sponsorship will be offered to a number of selected students to enable them to be attached to overseas universities for one semester as exchange students. Through this exchange experience, our students could learn and understand different cultures and gain a global perspective.\nWe have explored many exchange opportunities for our students to various renowned universities around the world. Here are some examples:\nFriedrich-Alexander-Universität Erlangen-Nürnberg, Germany\nLinköping University, Sweden\nNanyang Technological University, Singapore\nNational Cheng Kung University, Taiwan\nNational Taiwan University of Science and Technology, Taiwan\nNational University of Singapore, Singapore\nNorwegian University of Science and Technology, Norway\nStudent Placement Opportunities\nThrough the Work Integrated Education Scheme and the Industrial Summer Placement Scheme, all students have the opportunity to practice their engineering skills in Hong Kong or overseas. The period usually lasts for about 6 weeks. ",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/exchange-and-placement"
 },
 {
  "text": "Research \nResearch Themes and Strength \nSmart Grid & Future Mobility",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength"
 },
 {
  "text": "Teaching Labs Facilities and Equipment \nLaboratory / Special Room Location \nElectrical Protection and High Voltage Co-ordination Laboratory\tEF002\t\nUndergraduate Teaching Laboratory\tEF003\t\nEngineering Entrepreneurship Club\tEF005\t\nElectrical Engineering Laboratory\tEF402\t\nSmart Materials and Systems Laboratory\tHJ803 - HJ803a\t",
  "url": "https://www.polyu.edu.hk/ee/experience-and-opportunities/teaching-labs-facilities-and-equipment"
 },
 {
  "text": "Research Overview\nThe primary mission of the Department is to transmit, advance and apply electrical engineering knowledge. Through innovative teaching, the Department produces high quality engineers and technologists, who are equipped with knowledge, skills, leadership and resourcefulness to deal with changes in the modern society. Through applied research and consultancy, the Department provides high quality service to the industry and community. \nThe Department’s research spans from fundamental research activities to large-scale system integrations. In compliance with the research strategy of the University, the Department’s research activities are grouped under four areas to reflect its major research focuses. The four areas are Photonics and Electrical Materials, Smart Mobility, Power System and Energy, Power Electronics and Utilities. The optical fibre and material and device technologies emphasize on fundamental research and served as important platforms to underpin the development of the other three focused areas, allowing the Department to tackle engineering problems of a multidisciplinary nature, and cultivate strategic partnership with the electrical engineering industry in consultancy and product development.\nThe Department is very responsive to the rapid evolution of Electrical Engineering and will continue to actively contribute to the quality and practice of this important branch of engineering.",
  "url": "https://www.polyu.edu.hk/ee/research/research-overview"
 },
 {
  "text": "Photonic Instrumentation Laboratory (BC522)\nPhotonic technologies for sensing application are versatile and have unique advantages, which are developing rapidly with active researches into novel materials, micro/nano technology, and advanced processing techniques. However, the design and development of the photonic instruments are complex and challenging, and still in its infancy, thus leaving opportunities for further fundamental and applied research. The laboratory closely works together with the Photonic Sensors Research Laboratory, and currently focuses on photonic instrumentation research and ultra-sensitive optical fiber gas sensor prototyping.",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/bc522-fiber-optics-laboratory"
 },
 {
  "text": "Projects undertaken by Avaron experts\nClient Key State Investigation City/Country Number of projects Year period \nMTR Hong Kong (Light Rails, East Rail, Airport Express Line, West Rails)\t\nTrack switch and crossing monitoring \n- continuous monitoring for rail crossing at West Rail to avoid premature breakage \nAxle counting\n- railway axle counting system based on FBG sensing technology \nStructural integrity monitoring of Light Rail Vehicles \n- monitoring of Light Rail Vehicles after modification of vehicle structure \nBrake and motor condition monitoring for Airport Express Line \n- monitoring of motor bearing temperature and brake temperature to prevent motor breakdown and brake jam \n\tHong Kong SAR, China\t6\t2005 - 2012\t\nBeijing- Shanghai High Speed Railway \t\nRail clamps, subsistence-level monitoring \n- monitoring for abnormal vibration at rail fasteners\n- monitoring for land subsistence of highspeed rail track due to adjacent construction works \n\tNanjing, China \t3\t2010 - 2011 \t\nMinistry of Railway China \t\nStructural integrity monitoring of highspeed trains \n- train-borne system to monitor structural health condition of highspeed rail train\n\tTangshan, China \t1\t2010 - 2011 \t\nTaiwan Railway Authority \t\nReal-time wheel profile measurement, vibration \n- track-based system to detect and monitor wheel defects\n\tTaiwan \t2\t2010 - 2012 \t\nDAMEL Delhi India \t\nRail clamp breakage, excessive vibration of trains \n- monitoring and identification of excessive vibration at Delhi Airport Express Line\n\tNew Delhi, India \t1\t2013 - 2015 \t\nMTR Hong Kong \t\nPantograph-based catenary monitoring \n- train-borne system for identifying and monitoring of catenary hard spots and misalignments\n\tHong Kong SAR, China \t2\t2014 - 2016 \t\nEast Rail, MTR Hong Kong \t\nMLR train thermal performance monitoring \n- monitoring of train underside thermal performance after introducing soundproof skirting at mid-life refurbished train\n\tHong Kong SAR, China \t1\t2014 - 2015 \t\nUrban Line & Airport Express Line, MTR Hong Kong \t\nTrain vibration and wheel off-loading monitoring system using track-based FBG sensor systems \n- real-time train condition monitoring system for the entire MTR urban based on FBG sensing technology\n\tHong Kong SAR, China \t1\t2014 - 2021 \t\nCRRC, China Railway Rolling Stock Co. \t\nHigh speed train monitoring at Changchun \n- identification and monitoring of train running gear problem for highspeed rail trains\nCondition monitoring for Lanzhou-Xinjian high speed railway (1906km) \n- identification and monitoring of abnormal vibrations of running gears, wheel polygonization and bump stop fatigue\n\t\nChangchun, China \nLanzhou, China \n\t2\t2015 - 2016 \t\nRicardo Rail, The Netherlands \t\nPantograph-based catenary monitoring \n- train-borne system for catenary hard sport and misalignment monitoring\n\tThe Netherland \t1\t2015 - 2016 \t\nSydney Metro Northwest, Australia \t\nPantograph-based OCS condition monitoring \n- train-borne system for monitoring and identification of catenary hard spot and misalignment for Sydney Metro Northwest Line\n\tSydney, Australia \t1\t2018 - 2019 \t\nSMRT, Singapore \t\nTrain & track-based railway condition monitoring system \n- track based and train borne system to monitor health conditions of trains and tracks in SMRT North South Line and East West Line\n\tSingapore \t1\t2016 - 2021 \t\nHK International Airport \t\nCondition monitoring of APM vehicle pantograph and power rail \n- identification and monitoring of vehicle pantograph dynamic performance and power track conditions\n\tHong Kong SAR, China \t1\t2019 - 2021 \t\nHK International Airport \t\nCondition monitoring of Baggage Handling System T-cart system \n- monitoring and identification of defective carts and track hard spots at HKIA baggage handling system\n\tHong Kong SAR, China \t1\t2020 - 2021",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/cd001-polyu---kcrc-smart-railway-research-laboratory"
 },
 {
  "text": "Research \nResearch Centres and Labs \nHJ804 Low Voltage Materials Laboratory \nLow Voltage Materials Laboratory (HJ804) investigates novel functional materials for energy conversion and storage applications. It is also equipped with some of the most advanced equipment for the measurement of electrical transport and thermal properties. ",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/hj804-low-voltage-materials-laboratory"
 },
 {
  "text": "The Photonic Sensors Research Laboratory (HJ805) carries out fundamental and applied research on the development of micro-structured fiber sensors and devices. Research areas include spectroscopic sensors, optical fiber components and sensing systems for the measurement of strain, temperature, vibration, pressure, acoustic wave, electric/magnetic field, rotation, refractive index, gas and liquid concentration. \nOur research works are supported by Hong Kong Research Grant Council, Innovation Technology Commission of Hong Kong Government, National Natural Science Foundation of China, and Post-graduate and Postdoctoral Programme from the university. The overall research grant is in excess of HK$50M. Our academic collaborator include University of Strathclyde, Korea Advanced Institute of Science and Technology, Tsinghua University, Beijing University of Aeronautics and Astronautics, Shenzhen University.",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/hj805-photonic-sensors-research-laboratory"
 },
 {
  "text": "The Theme Based Smart MicroGrid Research Laboratory was established in 2014 with funding supports by RGC via two Theme Based Research Scheme projects and The Hong Kong Polytechnic University. The Laboratory is well equipped with state-of-the-art smart grid research facilities such as programmable AC/DC sources and electric loads, power amplifiers, smart inverters, battery energy system, a PV microgrid system with advanced sensing and monitoring devices. The focused research areas include novel operation and control methods for smart grids/microgrids with high renewables, grid integration of renewable energy systems and EVs, AI and data analytics for energy systems, and electricity market planning and management etc.\nGeneva 2022 Video EEO integrated solar energy performance management toolkit\nhttps://www.youtube.com/qalx9BQqgec",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/ag713-theme-based-smart-grid-research-laboratory"
 },
 {
  "text": "Keywords \nOutstanding Alumni Award of PolyU Department of Electrical Engineering 2023\nThe Department of Electrical Engineering is pleased to announce that two distinguished graduates are awarded the “Outstanding Alumni Award of PolyU Department of Electrical Engineering 2023” in… \n15 Jun, 2023\nBest Student Papers Awards 2022 by The Hong Kong Institution of Engineers (HKIE) Logistics & Transportation Division (LTD)\nCongratulations! The paper “Comparative Study of the Mass Transit Systems in Hong Kong and Shenzhen” which was completed by our student, Mr Chan Kei Chit, is awarded as one of the HKIE… \n11 May, 2023\nTechConnect 2023 National Innovation Awardee - Professor Eric Cheng, for the new technology “Ammonia Powered Fuel Cell-based Electric Vehicle”\nCongratulations! Prof. Eric Cheng Ka-wai and his research team developed the world’s first ammonia-powered fuel-cell EV in 2021. And now, we are thrilled to know that this new technology “Ammonia… \n24 Apr, 2023\nHKSAR Government’s Smart Traffic Fund - Dr Weihua GU’s project “Development of Software for Optimising the Planning and Scheduling of New Energy Buses”\nThe project “Development of Software for Optimising the Planning and Scheduling of New Energy Buses” which is led by Dr Weihua GU’s has been received the HKSAR Government’s Smart Traffic… \n20 Apr, 2023\nThe Champion of IET ROV Design Competition 2022 - Engineering & Entrepreneurship Club members\nCongratulations to the Engineering & Entrepreneurship Club members on winning the championship of the Hong Kong Regional Underwater Robot Challenge 2022 Design Competition (Explorer Class)… \n1 Jul, 2022\nOutstanding Alumni Award of PolyU Department of Electrical Engineering 2022\nThe Department of Electrical Engineering is pleased to announce that two distinguished graduates are awarded the “Outstanding Alumni Award of PolyU Department of Electrical Engineering 2022” in… \n1 Apr, 2022\nCongratulations to the Winners for the President’s Awards for Outstanding Achievement in Knowledge Transfer 2021\nThe President’s Executive Committee has endorsed the setting up of the President’s Awards for Outstanding Achievement in Knowledge Transfer (KT) to recognise and reward staff members’ KT endeavours which are underpinned by research and innovation and have created significant impact on industry and… \n10 Feb, 2022\nCongratulations to the Winners for the Faculty Research Grants Achievement Awards 2020\nFaculty of Engineering Research Grant Achievement Award has been set up by the Faculty Research Committee since 2003, with a view to recognize the outstanding performance of FENG academic staff members in securing external competitive research grants. This year, both Professors Wei Jin and Aping… \n31 Jan, 2022\nWorld’s first ammonia-powered fuel-cell EV– Achievements by Professor Eric Cheng\nProf. Eric Cheng Ka-wai and his research team developed the world’s first ammonia-powered fuel-cell EV in just three months. The ammonia inside the fuel-cell system will be transformed into hydrogen… \n18 Aug, 2021\nCongratulations! Best Paper Award by IEEE IAS I&CPS Asia 2021\nProfessor Xu Zhao and his research team obtained the Best Paper Award, 2021 IEEE IAS Industrial and Commercial Power System Asia Conference (IEEE IAS I&CPS Asia 2021), Chengdu, China. The… \n18 Jul, 2021\n1\n2\n3\n4\n5\nNext\nJump to",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements"
 },
 {
  "text": "Research \nResearch Centres and Labs \nEF405 Fiber Sensors and Instrumentation Laboratory \nThe Fiber Sensors and Instrumentation Laboratory (EF405) comprises of state-of-the-art equipment complemented with cutting-edge technological advances. The laboratory is equipped with two femtosecond laser systems with a wavelength range spanning from visible to near infrared. Our research is a symbiotic mixture of fabrication and characterization of specialty optical fiber sensors. We use these light sources for both fundamental research (i.e. physics of nonlinear optics, fabrication of optical waveguides and Bragg gratings) and applied research in healthcare and advanced manufacturing. The laboratory further equips optical spectrum analyzers, tunable lasers, fiber coupling and tapering facilities such as Fujikura® laser master, Vytran®LDC-400 and Fujikura®100P for scientific research across a wide range of disciplines.\nAnd we also attracted the interesting and collaboration with President of Hong Kong Baptist univerist, Prof. Alex Wai who visited our lab recently. ",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/ef405-femtosecond-laser-laboratory"
 },
 {
  "text": "Research \nResearch Centres and Labs \nCF004c E.M.C. Laboratory \nThe EMC laboratory (CF004C) is equipped with a wide range of electromagnetic measuring equipment for DC to GHz. The analysis of the electric and magnetic fields in terms of electromagnetic compatibility and interference can be conducted. The laboratory is equipped with a GTem cell and some conductive and radiative measurement tools. It is also a customized EM quiet room for the high-level research study. ",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/cf004c-emc-laboratory"
 },
 {
  "text": "Three Minute Thesis (3MT ®) Competition by the Faculty of Engineering\nThis year, the Research Student Gathering was incorporated with the Three Minute Thesis (3MT ®) Competition by the Faculty of Engineering held on 22nd May, 2023. In the competition, the oral… \nDigital Twins for Modern Power Electronics\nDigital Twins for Modern Power Electronics - Prof. Fei Gao Date: 25 May 2023 Thursday Time: 2:20 p.m. - 4:00 p.m. Venue: BC301, The Hong Kong Polytechnic University\nDepartmental Visit by Professor Stefan Östlund\nWe were delighted to have Professor Stefan Östlund, our Departmental Academic Advisor, to visit our Department on 17 and 18 April, 2023. He is the Vice President for global relations at KTH Royal… \nOperation of Future Power Systems with High Penetration of IBRs: A Stability-constrained Optimization Approach\nEvent details: Date: November 14, 2022 (Monday) Time: 3:00 p.m. to 5:00 p.m. Venue: In person in CF617 and online via Zoom Title: Operation of Future Power Systems with High Penetration of IBRs:… \nPolyU 85th Anniversary Alumni Reception cum EE Outstanding Alumni Award Presentation Ceremony\nThe PolyU 85th anniversary reception and EE Departmental outstanding alumni award presentation ceremony was successfully held recently. Different generations of alumni gathered together and… \nResilient analysis and enhancement of power grids against extreme weather\nResilient analysis and enhancement of power grids against extreme weather Event details: Date: November 11, 2022 (Friday) Time: 2:00 to 3:00 p.m. Venue: Online via Zoom Title: Resilient analysis… \nDepartmental Orientation for New Research Postgraduate Students\nWe are glad to have 13 of our new research postgraduate students attend the Department’s Orientation held on 6 September 2022 at P304. Even though Professor W. Jin, our DRC Chairman… \nDepartmental Orientation\nThis is the first year the Department launches its Scheme programme and we are pleased to invite our new Department Head, Professor C.Y. Chung to meet our freshmen in this Orientation held on 26… \nHigh-spatial-resolution Ultrafast Imaging in Picosecond and Femtosecond Time Scales\nThe research seminar by ZENG Xuanke has been arranged as follows: Date: 2 Dec 2021 (Thursday) Time: 10:30 a.m. - 11:30a.m. HK time Venue: Room CD304 and Online via Zoom Presentation title: …",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events"
 },
 {
  "text": "Research Centres and Labs \nHJ809-810 Advanced Materials and Devices Laboratory \nAdvanced Materials and Devices Laboratory (HJ809-810) fosters interdisciplinary research in cutting-edge energy-related materials and sensor and transducer technologies.",
  "url": "https://www.polyu.edu.hk/ee/research/research-centres-and-labs/hj809-810-advanced-materials-and-devices-laboratory"
 },
 {
  "text": "Invitation to PolyU Engineering Project Competition 2023\nWe are pleased to invite school team(s) from your school to join our PolyU Engineering Project Competition 2023. The Engineering Project Competition invites team of 4 student members to join… \nOutstanding Research Postgraduate Alumni Award 2023\nThe Graduate School (GS) will organise the PolyU Graduate School Outstanding Research Postgraduate (RPg) Alumni Award to publicly recognise our distinguished PhD/ MPhil alumni’s… \nOutstanding Alumni Award of PolyU Department of Electrical Engineering 2023\nThe enhanced three-level Outstanding PolyU Alumni Award (OPAA) introduced last year has achieved great success. The Department of Electrical Engineering (EE) is pleased to announce that the new… \nMr Sit Wing Hang Alfred , GBS, JP, as an Adjunct Professor of EE\nMr Alfred Sit Wing-hang, GBS, JP, is currently an Adjunct Professor. He received the Higher Diploma in Electrical Engineering in 1981 and the Associateship in Electrical Engineering in 1982 at The Hong… \nEE Scholars ranked among World’s Top 2% Most-cited Scientists\nCongratulations to the following EE scholars who have been ranked among the top 2% of the most-cited scientists in the world in their respective fields, as compiled by Stanford University. The “top… \nPolyU 85th Anniversary activity - Webinar on Carbon Neutrality (Advances in Carbon Neutral Technologies)\nSpeakers : Professor Yi CUI Director, Precourt Institute for Energy Fortinet Founders Professor of Engineering Department of Materials Science and Engineering, Stanford University Photon Science… \nPESA 2022 Home\nThe 9th International Conference on Power Electronics Systems and Application (PESA) will be held in Sep 2022 in Hong Kong. This three-day conference focuses on the recent research and the industrial projects of power electronics and related technology. Link: http://perc.polyu.edu.hk/pesa2022.html\nWong Wing Yi, Winnie, appointed as PolyU Student Ambassador\nOur EE student, Miss WONG Wing Yi, Winnie, has been appointed as one of the 21 PolyU Student Ambassadors. Professor CY Chung, Head of Department, Professor Alan Lau and Dr Isaac Fung… \nTwo Days University Experience Programme 2022 (Online)\nDate: 16 and 17 August 2022 (Tue & Wed) Time: starting from 2:15 p.m. Format: 7 online lectures on engineering applications A chance to join a campus and lab tour Welcome secondary 4 - 5 students… \nPolyU Faculty Seminar Series: Faculty of Engineering\nDate: 16 May 2022 Time: 7:30 - 9:00pm Link: https://www.polyu.edu.hk/geo/prospective-students/undergraduate/local/faculty-seminar-series/",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news"
 },
 {
  "text": "About EE ",
  "url": "https://www.polyu.edu.hk/ee/about-ee"
 },
 {
  "text": "About EE \nDepartmental Advisory Committee \nDepartmental Advisory Committee (DAC) - Chairman\nThe Hon. Alfred Sit Wing-hang, JP\nSecretary for Innovation and Technology, Innovation and Technology Bureau of HKSAR \nDepartmental Advisory Committee (DAC) – External Members\nIr Ko Chi Wai Gary\nExecutive Director & Chief Operating Officer, Kum Shing Engineering Company Limited \nMr. Charles So\nTransport Advisor, Sun Hung Kai Real Estate Agency Limited \nMr. Chapman Lam\nExecutive Director, MVA Asia Limited \nIr Ho Siu Kwong\nDirector - Operation Power Systems, CLP Power Hong Kong Limited \nIr Wong KW Kelvin\nGeneral Manager, Technical Services Systems, Airport Authority Hong Kong \nMr. Fong Kelvin\nEngineering & Technical Director, Thales Transport & Security (HK) Limited \nIr Leung Chi Lap\nHead of E&M Construction, MTR Corporation Limited \nMs. Chu Carmen\nDirector of Consulting, ARUP \nIr Tony Yeung\nHead of Construction & Maintenance, The Hongkong Electric Company Limited \nDepartmental Advisory Committee (DAC) – Ex-officio Members\nProf. H.C. Man\nDean, Faculty of Engineering, The Hong Kong Polytechnic University \nProf. H.Y. Tam\nHead, Department of Electrical Engineering, The Hong Kong Polytechnic University \nDepartmental Advisory Committee (DAC) – Internal Members\nProfessor Eric Cheng\nDepartment of Electrical Engineering, The Hong Kong Polytechnic University \nProfessor Alan Lau\nDepartment of Electrical Engineering, The Hong Kong Polytechnic University \nDr WC Lo\nDepartment of Electrical Engineering, The Hong Kong Polytechnic University \nDr KH Lam\nDepartment of Electrical Engineering, The Hong Kong Polytechnic University \nDr Isaac Fung",
  "url": "https://www.polyu.edu.hk/ee/about-ee/departmental-advisory-committee"
 },
 {
  "text": "About EE \nContact Us \nGeneral Office\nRoom CF620, 6/F Tang Ping Yuan Building\nDepartment of Electrical Engineering The Hong Kong Polytechnic University\nHung Hom, Kowloon Hong Kong\nPhone: (+852) 2766 6150\nFax: (+852) 2330 1544\nEnquiries: eenotice@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/ee/about-ee/contact-us"
 },
 {
  "text": "About EE \nMessage from Head \nHead of Department and Chair Professor of Power Systems Engineering\nBEng, PhD, PEng, FCAE, FIEEE, FEIC, FIET and FHKIE\nProfessor CHUNG Chi-yung",
  "url": "https://www.polyu.edu.hk/ee/about-ee/message-from"
 },
 {
  "text": "Vision and Mission \nWhat is EE\nIn recent years, due to the issues of Energy Crisis, the Global Warming, and the Pollution Problems, Electrical Engineering has become increasingly important. For mankind to continue to develop, future Electrical Engineers must develop ways to generate and use electricity more efficiently and effectively. Large amount of resources will be poured into the profession to develop new apparatus and systems. The Electrical Engineering is now entering a new and exciting phase. In the not too distant future, you will see the following taking shape: \nHybrid and pure electric vehicles will replace petrol cars.\nWind farms and solar panels will appear in large scale to produce renewable energies.\nAdvanced high-speed electric trains will replace airplanes as the preferred way of inter-city travel.\nHighly efficient lighting device will replace traditional electric lamp as primary lighting components.\nVision\nTo become one of the best departments in electrical engineering in the South East Asia.\nMission\nTo provide (i) top quality education in electrical engineering at undergraduate and postgraduate levels; (ii) top quality applied research in electrical engineering with abundant publications in the best international journals; and (ii) top quality professional service to industry and local community.",
  "url": "https://www.polyu.edu.hk/ee/about-ee/vision-and-mission"
 },
 {
  "text": "Mr Alfred Sit Wing-hang, GBS, JP, is currently an Adjunct Professor. He received the Higher Diploma in Electrical Engineering in 1981 and the Associateship in Electrical Engineering in 1982 at The Hong Kong Polytechnic. Mr Sit has long been dedicated to public services and has been Secretary for Innovation and Technology in the Hong Kong Special Administrative Region since April 2020. He joined the Electrical and Mechanical Services Department (EMSD) in 1984 and climbed the hierarchal ladder to Director of Electrical and Mechanical Services in 2017. All along, Mr Sit has been an ardent advocate of adopting innovative technologies within the public framework and has spearheaded the E&M InnoPortal at EMSD to forge a close connection between government units and the innovation and technology sector, so as to weave advanced, tech-centric and future-proof solutions into the organisational fabric. Since the outbreak of COVID-19, he has been actively promoting R&D by encouraging the adoption of homegrown technologies, in particular to tackle the pandemic, and the provision of hardware and software to enable e-business and e-learning. Mr Sit is also passionate about serving his professional community and alma mater. He was President of The Hong Kong Institute of Facility Management, and Chairman of the Biomedical Division of The Hong Kong Institution of Engineers. He was Chairman of PolyU’s Departmental Advisory Committee of the Department of Electrical Engineering.",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2023/the-hon-alfred-sit-wing-hang"
 },
 {
  "text": "News and Events \nNews \n1 / 1\nCongratulations to the following EE scholars who have been ranked among the top 2% of the most-cited scientists in the world in their respective fields, as compiled by Stanford University. The “top 2%” achievement was based upon standardised field-citation metrics including the total number of citations, h-index factor, co-authorship-adjusted hm-index, and citations to papers in different authorship positions to arrive at an overall composite score. The Department is very proud to acknowledge them as world-leading scientists!\nProfessor CY Chung\nProfessor W Jin\nProfessor HY Tam\nProfessor KW Cheng\nProfessor PT Lau\nProfessor SW Or\nProfessor Z Xu\nProfessor A Zhang\nDr KW Chan\nDr SX Niu",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2022/most-cited-scientists"
 },
 {
  "text": "Mr. Ng has been working in CLP Power (Hong Kong) Limited since 2009 where he currently serves as Principal Manager – Smartgrid Development in Power Systems Business Group. Throughout his career, Mr. Ng has led and contributed to a number of notable projects, including the commissioning of the first two Transmission Intelligent Substations in CLP Power in 2012 and 2014 respectively. These substations have played a vital role in enabling CLP Power to deliver energy in a more efficient and reliable way, while also supporting the development of smartgrid. \nOutside of his professional career, Mr. Ng is committed to community service. During the fifth wave of the epidemic, he led the construction team in the North Region of CLP Power and worked closely with various Government departments to connect power to thousands of new community isolation and treatment facilities in the New Territories in order to meet an urgent need for Hong Kong SAR Government to build thousands of new community isolation facilities in the shortest period of time under the fifth wave of the epidemic.\n吳先生現任中華電力有限公司首席智能電網拓展經理，他帶領多個項目，包括中華電力首兩座智能變電站的投產。吳先生還致力於社區服務，他領導團隊與多個政府部門合作，迅速為數千個新的社區隔離及治療設施提供電力，支援第五波疫情下的防控工作的緊急用電需求。 \nDr Lee has been working in the railway industry for 40+ years covering rolling stock and infrastructure maintenance, design and construction of new railway lines and major asset upgrading/replacement projects, operations, business development, and consultancy services both in Hong Kong, Mainland China and overseas including Sweden, India, Middle East, Philippine, Singapore, and Australia. From 2013 to 2020 Dr Lee has been working on the first driverless metro line in Australia - Sydney Metro project and overseeing the successful commencement of first passenger service of the Northwest section in mid-2019, and the award in 2020 of a major contract to Hong MTR for the City and Southwest section of the project. Since 2016 Dr Lee has also been serving as consultant to Singapore LTA on metro asset condition assessment, and SMRT as a member of the Technical Advisory Panel and Technical Mentor. \nDr Lee has been doing research work for the continuous condition monitoring of mission critical components of the railway using Fibre Bragg Grating sensors since 2012 and the deployment of AI to develop Smart Railway Linear Infrastructure and Smart Trains. \nDr Lee is a Chartered Engineer(UK), Member of IET (UK) and a Fellow of the Hong Kong Institution of Engineers.\n李博士在鐵路行業擁有超過 40 年的工作經驗，涉及鐵路車輛和基礎設施維護、新鐵路線的設計和建設以及主要資產升級/置換項目、運營、業務發展以及諮詢服務，包括中國香港, 中國大陸, 瑞典、印度、中東、菲律賓、新加坡和澳大利亞。 從 2013 年到 2020 年，李博士一直致力於澳大利亞第一條無人駕駛地鐵線路—悉尼地鐵專案，並監督西北段於 2019 年年中成功開通客運服務，並於 2020 年將城市和西南部分一項重大合同授予MTR。 自 2016 年以來，李博士還一直擔任新加坡 LTA 的地鐵資產狀況評估顧問，以及 SMRT 的技術顧問小組成員和技術導師。 \n自 2012 年以來，李博士一直致力於使用光纖布拉格光柵感測器對鐵路關鍵任務部件進行持續狀態監測的研究工作，以及部署人工智慧以開發智慧鐵路線性基礎設施和智慧列車。 \n李博士是特許工程師（英國）、IET（英國）會員及香港工程師學會資深會員。",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2023/outstanding-polyu-alumni-award-2023"
 },
 {
  "text": "Events \n1 / 5\nThe PolyU 85th anniversary reception and EE Departmental outstanding alumni award presentation ceremony was successfully held recently. Different generations of alumni gathered together and shared their fond memories of EE. We took this precious moment to present our two Outstanding Alumni: Ir Wong Ka Wo (awarded the Outstanding Alumni Award in Professional Achievement); and Dr Li Siyang (awarded the Outstanding Young Alumni Award in Entrepreneurial Achievement).\n\nThe Department has nurtured countless talents over the years. We all wish that our alumni could form a strong and professional expertise in electrical engineering and they could have a bright careers in the future. The Department will meet organize more events of this kind to meet our alumni.",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2022/anniversary-alumni-reception-cum-ee-outstanding-alumni-award-presentation-ceremony"
 },
 {
  "text": "1 / 1\nThe Graduate School (GS) will organise the PolyU Graduate School Outstanding Research Postgraduate (RPg) Alumni Award to publicly recognise our distinguished PhD/ MPhil alumni’s distinctive accomplishments and impactful contributions to the professions, research and entrepreneurship.\nPlease visit the below link for the details\nhttps://www.polyu.edu.hk/gs/news-and-events/outstanding-rpg-alumni-award-2023_call/",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2023/polyu-graduate-school-outstanding-research-postgraduate-alumni-award"
 },
 {
  "text": "1 / 1\nWe are pleased to invite school team(s) from your school to join our PolyU Engineering Project Competition 2023.\nThe Engineering Project Competition invites team of 4 student members to join our competition workshop and complete a STEM-based project. Winners of the projects will be showcased and will be presented with trophies and certificates. This is a good opportunity for interested students to learn more about Computing and Engineering and experienced hands on laboratory experiences. All artefacts of the competition can be brought back to their own schools.\nDetails can be found at our website: www.polyu.edu.hk/feng/competition and via the poster below. The registration is now open, from 10 April to 12 May 2023. An online briefing of the competition will be held on 5 May 2023 4:30 p.m., teachers/ students if interested in the competition are welcome to learn more about the competition at the briefing, please register: https://polyu.hk/hgfYN. \nIf you wish to learn more about the competition, welcome to discuss with us (Enquiry: 2766 5064 ( phone) / denquiry@polyu.edu.hk (email))\nWith best regards\nFaculty of Engineering\nThe Hong Kong Polytechnic University ",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2023/invitation-to-polyu-engineering-project-competition-2023"
 },
 {
  "text": "News and Updates\nCongratulations to Dr. Darren TY ZHENG for the successful PhD thesis defense of \"Mechanisms of Phase Transformations in Aluminum Anodes for Lithium-based Batteries\"\" \nChemSusChem\nNew work by Dr. Darren TY ZHENG on \"Exploring the Reversibility of Phase Transformations in Aluminum Anodes through Operando Light Microscopy and Stress Analysis\" \nCongratulations to Dr. RAN Sijia for the successful PhD thesis defense of \"In Situ Mechanical and Electrical Testing of Piezoresistive Nanomaterials\" \nCongratulations to Dr. Virag Raut for the successful PhD thesis defense of \"Towards enabling shape memory ceramics: considerations for stress concentration optimisation through additive manufacturing\" \nNature Energy\nExciting collaboration with Prof. Tarascon and Dr. Huang at College de France to realize the start of a new era in battery sensing and real-time monitoring. See our PolyU Press Release as well! \nScripta Materialia\nNew work as part of collaborations with NTU and KIT exploring how polycrystalline Al transforms to become LiAl. Congratulations Darren for \"Granular phase transformation of polycrystalline aluminum during electrochemical lithiation\" \nJoule\nIs the composite design used for lithium-ion battery anodes nearing an end? Check out our recent Commentary in Joule to see why we think metal foils have too much upside to ignore. (Email directly for pdf) \nCongratulations to Dr. LI Bei for the successful PhD thesis defense of \"Capacitive Deionization of Brackish Water with Carbon-based Materials\" \nNano Letters\nCongratulations to Ms. RAN Sijia for her recent publication: The Limits of Electromechanical Coupling in Highly-Tensile Strained Germanium \nJournal of Materials Chemistry A\nCongratulations to Dr. Tahmasebi for his recent publication: In situ formation of aluminum–silicon–lithium active materials in aluminum matrices for lithium-ion batteries \nChemSusChem\nCongratulations to Mr. Darren Zheng for his recent publication: Improvement of the Cycling Performance of Al Anodes through Operando Light Microscopy and Kinetic Analysis \nOptics Express\nCongratulations to Dr. Julien Bonefacino for his recent publication: Impact of high UV fluences on the mechanical and sensing properties of polymer optical fibers for high strain measurements \nTeam\nCurrent Members\nCAiRS\nMany exciting new things happening out of the Center for Advances in Reliability and Safety \nFormer Members\nDr. LI Bei\nNow at Institute of Botany, Jiangsu Province and Chinese Academy of Sciences \nPre-pandemic Outing\nOutputs",
  "url": "http://www.polyu.edu.hk/ee/boles"
 },
 {
  "text": "Speakers\n\t\n:\n\t\nProfessor Yi CUI\nDirector, Precourt Institute for Energy\nFortinet Founders Professor of Engineering\nDepartment of Materials Science and Engineering, Stanford University\nPhoton Science, SLAC National Accelerator Laboratory\nProfessor Xiaohong GUAN\nProfessor and Director at Xi'an Jiaotong University\nXi'an Jiaotong University\nProfessor Weisheng WANG\nChief Engineer, China Electric Power Research Institute\nState Grid Corporation of China\nMr. Yin Piu Bill, HO\nGeneral Manager (Corporate Development)\nThe Hongkong Electric Co., Ltd. (HK Electric)\n\t\nDetails & Free Registration\n:\nhttps://www.polyu.edu.hk/feng/wcn/\n(Registration Deadline: 21stSeptember 2022)\n(Successful registrants will receive Zoom login information) ",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2022/polyu-85th-anniversary-activity-webinar-on-carbon-neutrality"
 },
 {
  "text": "The enhanced three-level Outstanding PolyU Alumni Award (OPAA) introduced last year has achieved great success. The Department of Electrical Engineering (EE) is pleased to announce that the new round of departmental OPAA 2023 is now calling for nominations until 31 March 2023 (Friday).\nThe departmental OPAA aims to publicly recognise outstanding graduates of EE for their professional achievements and significant contributions to the community and their alma mater. The departmental awardees will be officially honoured by the department and be nominated for the Faculty Awards or above.\nAward Categories and Selection Criteria\nThere are four achievement categories, namely “Professional Achievement”, “Entrepreneurial Achievement”, “Scholarly Achievement” and “Community Service Achievement”. Selection is based on the nominee’s accomplishments in his/ her personal achievements in the field, contributions to the community, and support and contributions to PolyU.\nSpecial recognition to young alumni awardees in the award category is added. A candidate who is aged under 40 by the end of the award year can be considered under the Outstanding PolyU Young Alumni stream.\nThe Award will be conducted at three levels: Department level, Faculty/School level and University level. The recipients of the Department Award will be nominated for the Faculty Award. All Faculty/School awardees will be considered for the University Award.\nEligibility\nThe nominated candidate must be a bona fide graduate who has successfully completed the full-time or part-time programme offered by PolyU (or its forerunners: Hong Kong Government Trade School, Hong Kong Technical College, Hong Kong Polytechnic; and its constituent units: School of Professional Education & Executive Development and Hong Kong Community College) which led to academic award accredited by the respective Institution.\nThe proposer can be a PolyU graduate, Honorary Graduate, University Fellow, PolyU staff, current PolyU Council and Court member and current Advisory Committee member. There is no limit to the number of nominations to be submitted by each proposer. However, the proposer cannot be the candidate himself/ herself or a direct relative of the candidate.\nNomination and Selection Schedule\nThe nomination form could be downloaded here. Please return the completed form to eenotice@polyu.edu.hk with all required supplementary documents on or before 31 March 2023.Panel of Judges and Result Announcement\nSelection for Department Award will be conducted by end of April 2023. A panel of judges, comprising both internal and external members, will be formed to examine the nominations and assess candidates’ qualifications and performance for the awards. The result will be announced on our website and social media platforms in early May.Enquiries\nDepartment of Electrical Engineering\nThe Hong Kong Polytechnic University\nEmail: eenotice@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/news/2023/outstanding-alumni-award-of-polyu-department-of-electrical-engineering-2023"
 },
 {
  "text": "Dr. Boles currently holds the position of Professor in the Department of Energy and Process Engineering at the Norwegian University of Science and Technology. He obtained his B.S. in Materials Science and Engineering from Carnegie Mellon University in 2004. From 2002 to 2005, he was a member of the technical staff at Lumileds Lighting in San Jose, CA. Starting in 2005, he conducted his Ph.D. research at the Massachusetts Institute of Technology in the Department of Materials Science and Engineering. Following his graduation in 2010, he worked as a postdoctoral fellow and research scientist with the Institute for Applied Materials at the Karlsruhe Institute of Technology in Karlsruhe, Germany. From 2014 to 2021 he joined PolyU as part of strategic effort to bring interdisciplinary expertise in materials science to electrical engineering. \nDr. Boles specializes in the characterization and development of advanced electronic materials for a variety of energy-focused applications. In particular, his research makes use of in-situ and ex-situ electron microscopy to gain basic insight and understanding into the coupled electrical-mechanical response of nanoscale materials under applied stress. He also has interest in developing electrochemical energy storage systems for use in extreme and/or harsh environments.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/boles-steven"
 },
 {
  "text": "Biography\nProf. Fu obtained his BEng from Hefei University of Technology in 1982, MEng from Shanghai University of Technology in 1989 and PhD from The Hong Kong Polytechnic University in 1999. \nBefore he joined PolyU, he was one of the key developers at Ansoft Corporation in Pittsburgh, USA. He has about seven years of working experience at Ansoft, focusing on the development of commercial software Maxwell, which is a leading commercial software package for the computation of electromagnetic fields of electromechanical equipments. During 1982 to 1986, he worked at Shanghai Electrical Apparatus Research Institute, where he accumulated valuable experience to deal with the design and manufacturing of electric devices in practice, and constructed a solid foundation for further academic career development. \nProf. Fu has made many contributions to the theory and application of electromagnetic field computation and electric device design, including the publication of over 180 refereed journal papers. He regularly serves as paper reviewer for IEEE Trans. Magnetics, IEEE Trans. Energy Conversion, IEEE Trans. Industrial Electronics, IEEE Trans. Power Electronics, IEEE Trans. Industry Application, Energies, and COMPUMAG, CEFC, INTERMAG international conferences. \nProf. Fu’s research interests mainly focus on computational electromagnetics, optimal design of electric devices, applied electromagnetics, and novel electric machines.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/fu-wei-nong"
 },
 {
  "text": "Biography\nKoko K.H. Lam is currently an Adjunct Professor. He received the M.Phil. and Ph.D. degrees in Applied Physics from The Hong Kong Polytechnic University (HKPolyU). During his graduate studies, he worked on the processing and characterizations of piezoelectric materials and their applications in sensors and actuators under the supervision of Prof. Helen L.W. Chan. He was a visiting scholar in Stanford University in 2007. From 2007 to 2009, he acquired the HKPolyU-funded Postdoctoral Research Fellowship and worked on the applications of smart materials in civil engineering structures at HKPolyU. Meanwhile, he also joined an international project (collaborated with Stanford University, University of Michigan, and Georgia Institute of Technology) to conduct wireless vibration monitoring of Guangzhou Television and Sightseeing Tower in China. He joined the group of Prof. Kirk K. Shung as a Research Associate at the NIH Resource Center on Medical Ultrasonic Transducer Technology in the Department of Biomedical Engineering of University of Southern California (USC) from 2011 to 2013. He started his academic career as an Assistant Professor in Department of Electrical Engineering at HKPolyU in 2013.\nDr. Lam has been working in the field of smart materials and applications including materials for energy conversion (e.g., piezoelectrics, thermoelectrics, multiferroics, photocatalysis, etc.) and storage (e.g., electrode materials for rechargeable batteries, dielectrics, etc.), ultrasound transducer technology, biomedical and non-destructive applications of ultrasonic transducers, smart sensor and actuator technology, and condition and structural health monitoring. He has achieved 180+ publications, including 7 patents for 6 inventions, 155+ SCI journal papers, and 15+ international conference papers.\nDr. Lam received an Early Career Award in 2014 presented by Research Grants Council of Hong Kong. He has been a Visiting Professor in South China Normal University since 2015. He is an Exco member of Ultrasound Transducers and Materials Society, China Association of Medical Equipment - Medical Ultrasound Equipment Society, a Secretary of IEEE Hong Kong Joint Chapter of PES/IAS/PELS/IES (IEEE JC PIPI), a Senior Member of the IEEE Society, and a Member of American Chemical Society. He has also served as a Member of local/overseas examination boards, an Organizing Committee Member of international conferences & seminars, and a Reviewer for over 50 prestigious international SCI journals.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/lam-kwok-ho"
 },
 {
  "text": "Biography\nDr Leung has been appointed as the Adjunct Professor by both the Department of Electrical and Electronic Engineering and the Department of Mechanical Engineering, University of Hong Kong teaching the new “Advanced Railway Engineering” course (30 hours) for MSc. in Electrical Engineering and “Railway Engineering – Metro and High Speed Rail” course for MSc. in Mechanical Engineering since January 2019 and January 2020 respectively.\nFrom June 2017 till September 2018, he worked as the Adviser/Railways Safety to the Director of EMSD overseeing and commissioning the Guangzhou-Shenzhen-Hong Kong Express Rail Link project.\nFrom early 2010 till mid 2017, he headed the Railway Inspectorate Office of EMSD (with 34 staff including 23 professionals) regulating railway projects and railway operations in Hong Kong. During these years of railway engineering works, he had carried out on-site testing and commissioning on various high-speed rolling stocks (eg. CRH 380A, and other third party trains from mainland China entering into HK) and railway infra-structures (OHL, rail track, traction power transmission and supply systems), signaling systems, railway stations and so on. The railway projects involved are the Western Island Line, South Island Line, Kwun Tong Line Extension, Express Rail Link and Shatin Central Link.\nDuring Dr Leung’s career life, he had worked as Project Manager and Project Engineer responsible for design, construction and management of various infrastructure projects including the Tsing Ma Bridge, Kap Shui Mun Bridge, Route 5 Tunnel, Tates Cairn Tunnel, Tseung Kwan O Tunnel, Limehouse Link (in London, UK), Macau Ferry Terminal and so on. From 2004 till 2008, Dr Leung headed the Electricity Legislation Division regulating electricity safety of Hong Kong and enforcing the Electricity Ordinance and its subsidiary regulations",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/leung-kin-man"
 },
 {
  "text": "People \nDistinguished Chair Professors, Honorary, Adjunct and Visiting Professors \nDr. LIU Xiang \nDr. LIU Xiang\nAdjunct Professor \nBSc, MSc, PhD, Fellow of IEEE and OPTICA, Chief Expert of Optical Communications Standards, Huawei\nBiography\nDr. Xiang Liu is the Chief Optical Communication Standards Expert of Huawei Technologies. He had been Vice President for Optical Transport and Access at Futurewei Technologies and a Distinguished Member of Technical Staff at Bell Labs. He received the Ph.D. degree in applied physics from Cornell University in 2000. As a top-ranked Google Scholar in optical communications, he has authored/coauthored more than 350 journal and conference papers, as well as a book entitled “Optical Communications in the 5G Era”. Dr. Liu holds 99 US patents. He has served as a Technical Program Co-Chair of OFC 2016 and a General Co-Chair of OFC 2018. Dr. Liu is a Fellow of the IEEE and the OSA (now OPTICA). ",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/dr-liu-xiang"
 },
 {
  "text": "People \nDistinguished Chair Professors, Honorary, Adjunct and Visiting Professors \nMr SIT Wing-hang Alfred, GBS, JP \nMr SIT Wing-hang Alfred, GBS, JP\nAdjunct Professor \nMr Alfred Sit Wing-hang, GBS, JP, is currently an Adjunct Professor. He received the Higher Diploma in Electrical Engineering in 1981 and the Associateship in Electrical Engineering in 1982 at The Hong Kong Polytechnic. Mr Sit has long been dedicated to public services and has been Secretary for Innovation and Technology in the Hong Kong Special Administrative Region since April 2020. He joined the Electrical and Mechanical Services Department (EMSD) in 1984 and climbed the hierarchal ladder to Director of Electrical and Mechanical Services in 2017. All along, Mr Sit has been an ardent advocate of adopting innovative technologies within the public framework and has spearheaded the E&M InnoPortal at EMSD to forge a close connection between government units and the innovation and technology sector, so as to weave advanced, tech-centric and future-proof solutions into the organisational fabric. Since the outbreak of COVID-19, he has been actively promoting R&D by encouraging the adoption of homegrown technologies, in particular to tackle the pandemic, and the provision of hardware and software to enable e-business and e-learning. Mr Sit is also passionate about serving his professional community and alma mater. He was President of The Hong Kong Institute of Facility Management, and Chairman of the Biomedical Division of The Hong Kong Institution of Engineers. He was Chairman of PolyU’s Departmental Advisory Committee of the Department of Electrical Engineering. ",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/alfred-sit-wing-hang"
 },
 {
  "text": "Mr. Simon Cheung received his Fellow from The Institute of Measurement & Control, UK and Asian College of Knowledge Management. He is the Vetting Member of HK Environmental Protection Department for Cleaner Production Partnership Program (CP3) and Environment and Conservation Fund (ECF). He is also the Vice Chairman of Federation of Hong Kong Industry (Group 26), Director and Deputy Chairman of Hong Kong Environmental Industry Association, Founding Member and Honorary Treasurer for the steering committee of Hong Kong Association of Energy Service Companies (HAESCO), Executive Committee Member of Hong Kong E-Vehicles Business General Association Ltd, Hong Kong Green Strategy Alliance and Hong Kong Waste Management Association.\nMr. Cheung actively participates in industrial and governmental conferences, roadshows, seminars and exhibitions to build new business opportunities from cross-industrial meetings and factory visits. He frequently initiates meetings between top government officials and key industrial players to bridge and strengthen the cooperation and collaboration with various parties in government, educational and private sectors and academies.\nMr. Cheung has over 40 years’ experience in leadership, management, engineering, China trade and manufacturing.\nIn 1981-1993, he was Project and Divisional Manager at Hutchison-Boag Engineering Ltd in Process Control & Instrumentation business. As the main contractor, he leads a team of over 40 people in Hong Kong and across China focusing on multiple projects related to HAVC systems, temperature control and building automation systems. \nIn 1994-2001, he was Director of Innocom Ltd where he initiated the design and launch of the unique and unparalleled Personal Emergency Link Service which benefits hundreds of thousands of people with chronic illness and senior citizens who live alone.\nIn 2001-2006, as Director & Chief Technical Officer at Uticom Ltd (a subsidiary of Towngas), he lead the Automated Meter Reading (AMR) system project that won the Federation of Hong Kong Industries’ Consumer Product Design Award in the 2002 Hong Kong Awards for Industry.\nIn 2006-2013, as CEO of Focus Energy Asia Ltd, Mr. Cheung initiated the Energy Management Contract (EMC) which signed performance contracts with customers to provide energy-saving solutions and Pollution Prevention & Energy Efficiency (P2E2) solutions which provided energy audits, energy-saving proposals, negotiation and contract signing, procurement of raw materials and equipment, execution and regular system maintenance. Multi-million dollar contracts were signed with investment banks to further enhance the technology to combat increasing pollution that resulted from mainland China’s industrialization with projects including Waste Heat Recovery that utilized wasted heat from cement plants to power up steel mills.\nSince 2013, Mr. Cheung is the Project Development Director of China Dynamics (Holdings) Limited. With over 15 years’ experience focusing on high quality and strategic impetus of green energy development and environmental protection, he oversees the company’s innovative development of electric vehicles, boats and various related products. Under his leadership, the development of the innovative Vehicle Network Monitoring System was awarded 2018 Asia International Innovative Invention Gold Award.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/cheung-kwok-chuen-simon"
 },
 {
  "text": "Dr. Zhao Guotang is a well-known expert in the domestic railway project, the first and second level candidate of the National \"Ten Million Talents Project\", leader of China Railway Institute academic. Dr. Zhao is included in the expert library of The Organization Department of the CPC Central Committee.\nDr. Zhao mainly engaged in track dynamics, track detection technology, track management and high-speed railway infrastructure engineering research, ballastless track technology research at home and abroad. Dr. Zhao is currently Deputy General Manager of the Beijing-Shanghai High-Speed Rail and Chief Engineer (head office), Deputy Chief Engineer of the Ministry of Railways, researcher and Part-time Dr. of Southwest Jiaotong University, Beijing Jiaotong University, Tongji University, Southeast University and Central South University, and PhD supervisor for Railway Engineering, Applied Mechanics , and Project management.\nDr. Zhao has won The State Science and Technology Prizes. He led and participated in more than 30 scientific research projects, published over 60 papers, e.g. monograph \"high-speed railway ballastless track structure\" and \"numerical methods and artificial intelligence in geotechnical engineering applications\". He has also successfully acquired one patent for his project.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/zhao-guo-tang"
 },
 {
  "text": "Dr Lee has been working in the railway industry for over 50 years covering rolling stock and infrastructure maintenance, design and construction of new railway lines and major asset upgrading/replacement projects, operations, business development, and consultancy services both in Hong Kong, Mainland China and overseas including UK, Sweden, India, Middle East, Thailand, Philippine, Singapore, and Australia. From 2013 to 2020 Dr Lee has been working on the first driverless metro line in Australia - Sydney Metro project and overseeing the successful commencement of first passenger service of the Northwest section in mid-2019, and the award of a trains, systems and O&M contract to Hong Kong MTR for the City and Southwest section of the project. \nDr Lee and the research team in the Hong Kong Polytechnic University has pioneered in the application of Fiber Bragg Grating sensors for the continuous condition monitoring of mission critical components of the railway, and the migration of railway asset maintenance to the era of Maintenance 4.0. Recently he has also started R&D works on the deployment of machine learning and other AI techniques to develop Smart Railway Linear Infrastructure and Smart Trains. Early this year KK has joined the Roland Berger consultant team serving the Saudi Arabia Kingdom to investigate the technological readiness and the prospect of building pilot line for hyperloops in Saudi Arabia. Since 2020 Dr Lee has also been providing advisory support to the Singapore Institute of Technology (SIT) for the setting up of a workplace experience focused engineering degree program. \nDr Lee is a Chartered Engineer(UK), Member of IET (UK) and a Fellow of the Hong Kong Institution of Engineers. Dr Lee possesses an Engineering Doctorate degree and a Master of Electrical Engineering degree awarded by HKPU, an M Sc degree in Physics awarded by Hong Kong Chinese University, and a B Sc degree in Applied Computing awarded by Hong Kong Metropolitan University. Dr Lee has also received training in railway engineering through attachment to the old British Rail in UK.",
  "url": "https://www.polyu.edu.hk/ee/people/honorary-appointment-and-professor-of-practice/lee-kang-kuen"
 },
 {
  "text": "Dr. Edward Lo received his Higher Diploma award in Electronic Engineering from Hong Kong Polytechnic, and then he obtained his BSc(Eng) (First Class Honor), MPhil, and PhD degrees, all from the Department of Electrical Engineering in The University of Hong Kong.\nIn January 2000, Dr. Lo joined the Department of Electrical Engineering at the Hong Kong Polytechnic University. Now he is the Associate Head and an Associate Professor of the Department.\nBefore joining the Department, Dr. Lo worked, on and off, for a number of tertiary institutes in Hong Kong and accumulated 10 years of teaching experience. In between, he worked as a R&D Engineer in a private electronic firm for a year (83-84), he was a visiting scholar in University of Tokyo for a year (87-88), and he also served as a Professional Scientist in the Device & Energy Section of the Telecom Research Lab. of Telecom Australia for three years (91-93).\nCurrently, Dr Lo's main areas of research interests are renewable energy, electrical services of buildings, building automation systems, power quality, and power electronics, drives & traction.\nIn recent years, he has undertaken a number of consultancy projects for the Airport Authority (HK), railway corporations, HKSAR Government, MACAU SAR Government and other private firms.\nDr. Lo has been a member of the Grade C Licensing Examination Committee for electrical workers since 1996. Dr. Lo is a Member of HKIE. He also serves in a number of committees in HKIE and departments of HKSAR Government.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/lo-wai-chau-edward"
 },
 {
  "text": "Dr Norbert C. Cheung obtained his BSc, MSc, and PhD from the University of London, University of Hong Kong and University of New South Wales in 1981, 1987 and 1996 respectively.\nFrom 1981 to 1985 he worked in the Advanced Manufacturing Dept. of General Electric (HK), and the Electronics Services Division, Hong Kong Productivity Council. During this period, he acted as the project leader for the development of Hong Kong's first Photo-plotter System; a high precision numerically controlled light plotting machine for printed circuit board production.\nFrom 1985 to 1992 he worked as a lecturer and a senior lecturer in the Department of Electrical Engineering at the Hong Kong Polytechnic. From 1992-1995 he went to Australia and took a PhD, in the actuator control at the University of New South Wales.\nBefore he rejoined the HK Polytechnic University in 1997, he worked for 2 years as a Technical Manager at ASM Assembly Automation, in the areas of intelligent motion control and robotics systems. Dr Cheung is a Chartered Engineer, a member of IEE, and a senior member of IEEE.\nDr. Norbert Cheung has published more than 25 papers in books and journals, more than 70 papers in conference proceedings, and has obtained 3 patent inventions. He has received the President's Award for Excellent Achievement, the IEEE Industry Application Society Best Paper Award, the IEEE Industrial Electronics Society Best Presentation Award, the Chinese Power Supply Society Outstanding Paper Award, and the PolyU's Most Valued Product Development Award.\nDr. Norbert Cheung is married with two sons.",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/cheung-chow-norbert"
 },
 {
  "text": "Distinguished Chair Professors, Honorary, Adjunct and Visiting Professors \nDr TENG Fei \nDr TENG Fei\nAdjunct Assistant Professor \nDr Fei Teng is a lecturer in the Department of Electrical and Electronic Engineering, Imperial College London. He is currently serving as the education director of Energy Futures Lab and the deputy director of Imperial - Tsinghua Joint Research Centre for Intelligent Power and Energy Systems. He is also holding a visiting position at MINES ParisTech, France. Dr Teng’s research focuses on the low-inertia power system and cyber-resilient energy system operation. He led the “Short-term Inertia Forecasting” project [NGSO0020] funded by the Network Innovation Allowance to develop novel data analytic for inertia forecasting to support real-time power system operation. He is currently leading a project on “Consumer-centric privacy protection scheme for energy consumption data” [SENFC1-032] funded by EPSRC through Supergen Networks to develop a novel privacy protection scheme in order to balance privacy and utility of the energy data. He is a co-Investigator for the ESRC-funded multilateral project “Socio-Techno-Economic Pathways for sustainable Urban energy development (STEP-UP)” [ES/T000112/1] to investigate advanced control algorithms in supplying sustainable urban energy system.\nDr Teng is also the awardee of Kan Tong Po International Fellowship by The Royal Society in 2021. ",
  "url": "https://www.polyu.edu.hk/ee/people/adjunct--visiting-appointments/dr-fei-teng"
 },
 {
  "text": "Dr Minghao WANG received the B.Eng.(Hons.) degree in electrical and electronic engineering from the Huazhong University of Science and Technology, Wuhan, China, and the University of Birmingham, Birmingham, U.K. in 2012, and the M.Sc. and the Ph.D. degree, both in electrical and electronic engineering, from The University of Hong Kong, Hong Kong, in 2013 and 2017, respectively. Since 2018, he has been with the Department of Electrical Engineering, Hong Kong Polytechnic University, Hong Kong. Currently, he is a Research Assistant Professor in the Department of Electrical Engineering, the Hong Kong Polytechnic University. His search interests include power systems and power electronics.\nRelevant research projects \n• Principle Researcher, Integrated energy system bilateral trading mechanism based on ADMM and gaming theories, 2019 China National Science Foundation General Fund Scheme,RMB490,000, 2020-2024\n• Principle Researcher, Testing Services for Smart Inverters, ref: P19-0081 sponsored by CLP Power Hong Kong Limited, Aug-Oct 2019, HK$100,000 \n• Principle Researcher, Research and Design of a Machine Learning Based Adaptive Fault Prediction Data Analytics System for Lift Monitoring, EMSD HKSAR Gov, from 15 Jan-14 July 2020, HK$699,400\n• Participant, ‘Smart Solar Energy Harvesting, Storage and Utilization’, HK RGC 3rd round Theme-Based Program, HK$60.33 Million from 2017-2018; (a Hong Kong Government highly competitive grant)\n• Participant, ‘Sustainable Power Delivery Structures for High Renewables’, HK RGC 4th round Theme-Based Research Scheme, total budget HK$47.12 Million, 2014-2019; (a Hong Kong Government Highly Competitive Grant) \nProf. CHENG Ka-wai Eric, Prof. XU Zhao, Dr WANG Minghao and Dr LIU Qiang of the smart grid, power electronics and advanced material research centers are hiring multiple postdoctoral fellows, research associates and Ph.D. students, collaboratively. The targeted research directions include but not limited to (i) emerging power electronic converter design, control and implementation [hardware]. (ii) wireless power transfer [wireless], (iii) control, dispatch and stability of microgrids [microgrid], (iv) AI/model-based battery modelling and control [AI]; (v) electrochemical mechanism and modelling of lithium-ion batteries [battery]. (Multiple positions for both the RPG and RS) . Applicants are advised to send email with the title of: [abbreviation of topics], target position, degree obtained, name. Example: [hardware] Ph.D., Zhejiang University M.Sc., Chen TaiMan. to minghao.wang@polyu.edu.hk\n[hardware]: Applicants are required to have 4 years of circuit development. He or she shall be familiar with one or two of the skills including: PCB layout designing and debugging, DSP coding, dSPACE hardware control. Applicants must have the ability to design and successfully implement high-efficiency converter prototypes of 5kW and above. Those with experience in electronic competition and practical engineering are considered with high priority.\n[wireless]: Applicants are required to build a wireless charging experimental platform independently. He or she shall master solid electromagnetic field theory, be proficient in electromagnetic modeling and simulation, circuit simulation design. \n[microgrid]: Applicants must have a good foundation of control theory, be familiar with the theory of large-signal modeling and stability analysis, and have good hardware programming and hands-on ability.\n[AI]: Applicants must be proficient in artificial intelligence programming skills such as reinforcement learning, date-driven modeling capabilities of physical systems (or model based modelling technics), data extraction, processing and analysis capabilities;\n[battery]: Applicants must be familiar with the internal electrochemical mechanism of lithium batteries, be familiar with various types of electric heating and electrochemical equivalent circuit models of lithium batteries; be familiar with the use of key parameters testing and measuring instruments of lithium batteries;\nPostdoc/RA applicants must be graduated from the world’s top 150 universities/institute or the related majors rank the top 150 (applicants with outstanding research outputs will be admitted exceptionally, Applicants from Mainland China must be graduated from 985/211 universities/institutes).",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/wang-minghao"
 },
 {
  "text": "Dr. Hongbo Ye holds a PhD in Civil Engineering from Hong Kong University of Science and Technology (2014), and a BEng in Automation from University of Science and Technology of China (2009). Prior joining Hong Kong Polytechnic University, he worked as a Lecturer at University of Liverpool (2018-2020), a Research Fellow at University of Leeds (2015-2018) and a Research Associate at Hong Kong University of Science and Technology (2014-2015).\nDr. Ye has applied optimization and control theory in the modelling and analysis of road and rail systems as well as their operation, management and control. His research areas include transportation optimization and management, day-to- day dynamics, railway control, and eco-driving of trains and autonomous vehicles.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/ye-hongbo"
 },
 {
  "text": "Dr. Xin Yuan received the B.Eng. and M.Sc. degrees in 2013 and 2016, respectively. In 2020, he received the PhD degree in electrical engineering from Beijing Institute of Technology, Beijing, China. During his PhD period, he worked as a Research Associate in PEMC group, University of Nottingham, UK from Jan. 2019 to Jan. 2020.\nPrior to joining the Hong Kong Polytechnic University, He was a Postdoctoral Research Fellow with the School of Electrical and Electronic Engineering, Nanyang Technological University, Singapore. Currently, Dr. Yuan joined Department of Electrical Engineering of the Hong Kong Polytechnic University as a Research Assistant Professor in June 2022. His research interests include AC motor drives in transportation applications, power converters, wireless power transfer, model predictive control, multi-phase motor drives and fault-tolerant strategy of motor. In these areas, he has published over 30 papers and 2 patents, including over 10 top tier journals as the first author, i.e., IEEE Transactions on Industrial Electronics and IEEE Transactions on Power Electronics. In his projects, he has experienced with all stages of the development cycle on electric vehicle/aircraft controller prototype projects.\nHe was invited as a speaker on Outstanding Ph.D. Graduate Summer Webinar in 2020 and served as TCTE member of IEEE IES Technical Committee on Transportation Electrification. He served IECON 2020,46th Annual Conference of IEEE Industrial Electronics Society as a session chair and served as Reviewer for over 20 international journals. He has received many awards, including the best Ph.D. thesis prize, outstanding Ph.D. graduate award and first honor academic scholarship. \nDr. Yuan is actively looking for excellent candidates as Postgraduates, PhD students and Postdocs in the motor drives, motor design and power electronic research area. Please contact him via email if you have any interest in the above relevant research area.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/dr-xin-yuan"
 },
 {
  "text": "Dr. Wenjie Zhang holds a Bachelor of Engineering degree from the School of Artificial Intelligence and Automation at Huazhong University of Science and Technology in China, which he obtained in 2015. In 2020, he received his Doctor of Philosophy in electrical and computer engineering from the National University of Singapore. In 2019, he served as a visiting scholar at Stanford University. Since 2019, Dr. Zhang has worked as a lead data scientist and AI consultant for several public companies in the FinTech and semiconductor domains. Currently, he is a Research Assistant Professor in the Department of Electrical Engineering at the Hong Kong Polytechnic University.\nDr. Zhang's research interests focus on explainable and trustworthy AI and its applications in smart grids, with a broad scope encompassing big data analytics and multimodal learning. He has secured more than seven internal industrial funding awards as the principal investigator and served as a principal researcher in four national research projects supported by government agencies such as the Energy Market Authority in Singapore and AI@SG.\nAlong with Prof. Chung Chi-Yung (Fellow of Canadian Academy of Engineering, IEEE, EIC, IET, and HKIE), Dr. Zhang is recruiting multiple postdoctoral fellows, research associates, and Ph.D. students as part of the Research Centre for Grid Modernization. The targeted research areas include, but are not limited to:\nAI-based grid digitalization and renewable integration\nMultimodal learning for defect/fault detection in smart grids\nBig data-based energy policy analysis.\nPotential applicants are cordially invited to reach out to Dr. Zhang at wenjie-ee.zhang@polyu.edu.hk, and kindly copy Prof. Chung at c.y.chung@polyu.edu.hk with their inquiries. To be eligible for consideration as a postdoctoral fellow or research associate, it is required that applicants have received a degree from a top 150 university/institute in the world or have a related field of study that is ranked within the top 150. However, exceptional candidates who have demonstrated outstanding research outputs may be considered for admission, regardless of their institutional affiliation. For applicants from Mainland China, graduation from a 985/211 university/institute is required.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/wenjie-zhang"
 },
 {
  "text": "Academic and Teaching Staff \nDr ZHANG Yang-xi \nDr Yangxi ZHANG received the B.S. degree in Microelectronics and B.A. degree in Economics from the Peking University, Beijing, China, in 2010. He received his Ph.D. degree in Microelectronics and Solid-State Electronics from Peking University, Beijing, China, in 2016. Since 2016, he has been with the Department of Electrical Engineering, Hong Kong Polytechnic University, Hong Kong. Currently, he is a Research Assistant Professor in the Department of Electrical Engineering, the Hong Kong Polytechnic University. His research interests include nanophotonics, micro/Nano fabrication and MEMS sensors.\nEducation and Academic Qualifications\n• PhD, Microelectronics and Solid-State Electronics, Peking University, Beijing, China, 2016 \n• BS, Microelectronics, Peking University, Beijing, China, 2010 \n• BA, Economics, Peking University, Beijing, China, 2010 ",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/dr-yangxi-zhang"
 },
 {
  "text": "Welcome to Join Prof. Chung's Research Team\nOutstanding students and researchers are invited to join Prof. Chung's research team and conduct cutting-edge research with Prof. Chung. Please do not hesitate to discuss with him through his email address: c.y.chung@polyu.edu.hk.\nFully-funded PhD Degree Studies in Power and Energy Systems\nThe applicant must possess a first-class (honours) bachelor's degree or equivalent (a GPA of 3.75 or above in the US system, or be within the top 10% of graduates under other systems) in a relevant discipline and from a reputable university. Final-year students in bachelor's degree programmes are also eligible to apply and, if successful, will be given a conditional offer subject to their obtaining a first-class honours degree or equivalent.\nThe selected applicants will receive a monthly stipend (around HK$27,000, approximately US$3,500 or RMB23,500); a conference and research related travel allowance per year. The tuition fees of the study will be waived. \nProf. Chung is collaborating with renowned scholars in the top universities in North America, Europe and Asia. The outstanding students will be funded to visit these universities for a period of 6 to 12 months. \nThe training programs are tailor-made for individual students. Applicants should submit their CVs to Prof. C.Y. Chung and discuss with him directly. \nResearchers for Grid Modernization and Renewable Energy\nApplicants must have research experience in one of the following areas:\nPower System Situational Awareness and Health Assessment;\nData Analytics and AI-based Techniques for Power Systems;\nPower System Automation and Robotics;\nSmart Grid Technologies;\nGrid-Edge Technologies;\nHigh Power Electronics; \nHigh Power Electronics; \nPower System Stability and Control; and\nPower System Planning and Operation.\nApplicants should also:\npossess proven track-record of publications in IEEE Transactions; \nhave an industrial mindset; \nbe hardworking, a good team-player and able to think analytically; and\nhave sound communication and management skills. \nThe researchers will work closely with Prof. Chung in writing proposal, conducting cutting-edge research, and supervising PhD students. A highly competitive remuneration package will be offered.",
  "url": "https://www.polyu.edu.hk/ee/docdrive/cy.chung/index.html"
 },
 {
  "text": "Prof. Chung received the B.Eng. degree (with First Class Honors) and the Ph.D. degree in electrical engineering from The Hong Kong Polytechnic University, China, in 1995 and 1999, respectively. He has worked for the University of Saskatchewan, Saskatoon, SK, Canada; Powertech Labs, Inc., Surrey, BC, Canada; the University of Alberta, Edmonton, AB, Canada; and The Hong Kong Polytechnic University, Hong Kong, China. His research interests include smart grid, micro grid, renewable energy, power system stability/control, planning and operation, applications of advanced optimization methods, power markets and electric vehicle charging. \nBefore rejoining the department, Prof. Chung was a Professor, the NSERC/SaskPower Senior Industrial Research Chair in Smart Grid Technologies, and the SaskPower Chair in Power Systems Engineering at the University of Saskatchewan. He was a prominent leader for advancing academic activities and applied research in power systems engineering development in the province of Saskatchewan. He led a research team, supported by SaskPower and NSERC of Canada, to conduct cutting-edge and long-term smart grid research for SaskPower and address critical technical issues associated with smart grid technologies and their applications to real power systems. His research work has not only generated 3 US patents, 3 book chapters and over 170 international journal papers, mostly in well-respected IEEE transactions and IET journals, but has also resulted in successful transference of three new commercial software packages developed for power system analysis. Software package “Small Signal Analysis Tool (SSAT)” developed by him is now being used by over 80 power companies and nearly 90 universities worldwide. He has provided consultancy services to both government agencies and well-known private companies. He is a Fellow of CAE, IEEE, EIC, IET and HKIE, and an IEEE PES Distinguished Lecturer. He is also the recipient of the 2021 IEEE Canada P. Ziogas Electric Power Award and 2021 Saskatoon Engineering Society (SES) Educator of the Year Award.\nProf. Chung has also been very active in professional societies. He was the Member-at-Large (Smart Grid) and Member-at-Large (Global Outreach) of IEEE PES Governing Board, the IEEE PES Region 10 North Chapter Representative, and a member of IEEE PES Fellow Evaluation Committee. He was the Past Chairman of the IEEE Hong Kong Section, IEEE Hong Kong Joint Chapter of PES/IAS/PELS/IES and IET Hong Kong PES. He was the General Chair of IEEE EPEC2017 and IEEE PES APPEEC2014, Co-Chair of IEEE TENCON2015, IEEE PES APPEEC2013 and IEEE ICHQP2012, Vice-Chairman of IET APSCOM 2015 and IET APSCOM2012, Technical Chairman of IET APSCOM2009, and Honorary Secretary of IEEE DRPT2004 and IEEE IAS 2005 Annual Meeting. \nProf. Chung is currently a Senior Editor of “IEEE Transactions on Power Systems”, a Consulting Editor of “IEEE Transactions on Sustainable Energy”, a Vice Editor-in-Chief of “Journal of Modern Power Systems and Clean Energy”, a Subject Editor of “IET Generation, Transmission & Distribution”, an Editor of “IEEE Power Engineering Letters”, and an Editorial Board Member of “Protection and Control of Modern Power Systems”.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/prof-cy-chung"
 },
 {
  "text": "Professor K.T. Chau received his B.Sc. (Eng.) degree with First Class Honours, M.Phil. degree, and Ph.D. degree all in Electrical and Electronic Engineering from the University of Hong Kong (HKU). He worked at HKU for 28 years, with various positions including the Director of International Research Centre for Electric Vehicles, Associate Dean of Engineering and Head of Department of Electrical and Electronic Engineering. Starting from June 2023, he serves as Chair Professor of Electrical Energy Engineering at the Department of Electrical Engineering in the Hong Kong Polytechnic University (PolyU). He is a Chartered Engineer (CEng), Fellow of the Institution of Engineering and Technology (FIET), and Fellow of the Hong Kong Institution of Engineers (FHKIE). He is elected Fellow of the Institute of Electrical and Electronics Engineers (FIEEE) for Contributions to Energy Systems for Electric and Hybrid Vehicles.\nHis research interests are focused on Electrical Energy Engineering, with emphasis on Electric and Hybrid Vehicles, Renewable Energy Systems, and Power Electronics & Drives. Currently, he serves as Editor of the Studies in Science and Technology, Co-Editor of the Journal of Asian Electric Vehicles, and Section Editor-in-Chief of the Energies. Professor Chau has published 9 books, 9 book chapters, over 350 refereed journal papers and over 360 international conference papers. He has received the Chang Jiang Chair Professorship by the Ministry of Education, China, and the Environmental Excellence in Transportation Award for Education, Training and Public Awareness by the Society of Automotive Engineers (SAE) International. He has also been honoured the IEEE Vehicular Technology Society (VTS) Distinguished Lecturer and Distinguished Speaker.\nIn community service, Professor Chau has served as Member of the Electrical Safety Advisory Committee for the Electrical and Mechanical Services Department, Member of the Accreditation Advisory Board for the Hong Kong Accreditation Service of Innovation and Technology Commission, Member of the Appeal Board Panel under Energy Efficiency Ordinance, Member of the Disciplinary Tribunal Panel under Electricity Ordinance, and Member of the Disciplinary Board Panel under Building Energy Efficiency Regulation. He has also served as Member of Engineering Panel for the Hong Kong Research Grants Council (RGC), Member of Innovation and Technology Support Program Panel for the Innovation and Technology Fund (ITF), and Member of Incu-Tech/Incu-Bio Program Panel for the Hong Kong Science and Technology Parks (HKSTP).",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/prof-chau-kwok-tong"
 },
 {
  "text": "Wei Jin currently holds the position of Chair Professor of Photonic Instrumentation in Department of Electrical Engineering at the Hong Kong Polytechnic University. He obtained his BEng and MSc from Beijing University of Aeronautics and Astronautics in 1984 and 1987, respectively. He received his Ph.D in Optoelectronics from University of Strathclyde, Scotland, UK, in 1991. From 1991 to 1995, he was employed as a Postdoctoral Research Fellow at Strathclyde University. He joined the Hong Kong Polytechnic University as an Assistant Professor in 1996, was promoted to an Associate Professor in 1998 and a Professor in 2003.\nDr Jin’s research interests include photonic crystal fiber devices, optical fiber sensors, fiber lasers and amplifiers, optical gas detectors, condition monitoring of electrical power transformer as well as civil and mechanical structures. He edited 4 books/proceedings, authored/co-authored 8 book chapters, >280 Journal and 190 conference papers, and >10 patents in the area of fiber optic devices and sensors. He delivered >90 plenary/keynote/invited speeches at international/national conferences. His works were cited >6,995 times with h-index of 42 (SCIE), and >10,045 times with h-index of 51 and i10-index of 220. He secured research funds of over HK$50 million, has successfully supervised or co-supervised 30 PhD, and is currently supervising 7 Research Students.\nHe received the President Award of the Hong Kong Polytechnic University in 1999 for outstanding performance in Research and Scholarly Activities, the Hong Kong Polytechnic University PTeC’s Outstanding Professional Service and Innovation Awards in 2004 for successful technology transfer, the Hong Kong Polytechnic University Overseas Placement Award for Young Professors, Research Grant Achievement Awards from Faculty of Engineering of the Hong Kong Polytechnic University in 2005, 2008, 2011 and 2016, Distinguished Young Scholar Award (Category B) from the National Science Foundation of China in 2006, Chiang Jiang Chair Professor award from Ministry of Education of China in 2009, and seven best conference paper/student paper awards.\nProfessor Jin is a fellow of OSA, a senior member of IEEE and SPIE, a director of the Optical Society of China and a vice Chairman of the Fiber and Integrated Optics Specialty Committee of the Optical Society of China. He was the Co-Chair of the 25th International Conference on Optical Fiber Sensors and the Technical Chair of the 22nd International Conference on Optical Fiber Sensors.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/jin-wei"
 },
 {
  "text": "Hwayaw Tam, received his primary and secondary education in Sabah, Malaysia, and obtained his. B.Sc. and Ph.D. in Electrical and Electronic Engineering at The University of Manchester (UK) in 1985, and 1990. From 1989 to 1993, he was with Hirst Research Center, GEC-Marconi Ltd. (London), working on optical components, fibre laser systems, and erbium optical fiber amplifiers. He conducted pioneering works in optical fibre amplifiers, and in 1992 built two of the first batch of optical amplifiers for Italian PTT.\nProf. Tam joined The Hong Kong Polytechnic in 1993 and is currently the Head of Department, Chair Professor of Photonics at the Department of Electrical Engineering and Associate Director of Photonics Research Institute (PRI) at The Hong Kong Polytechnic University. Prof. Tam established several world-class research facilities at PolyU, including three fibre-drawing towers for fabrication of photonics crystal fibres and polymer optical fibres, an ultra high-speed communication laboratory, and laser platforms for the fabrication of advanced fibre gratings. His current research interests include fabrication of special optical silica fibres and polymer fibres, and complete optical fibre sensor solutions for various industries, including railways, smart buildings and medicines. Prof. Tam published more than 700 technical papers and awarded/applied about 20 patents, has extensive international research collaborations with many universities around the world and is a keynote/invited speaker at more than 540 international conferences.\nProf. Tam has extensive R&D collaboration with industry and his team installed many FBG sensing systems, including an FBG-based SHM system for the 610-m Canton Tower in Guangzhou, China and several condition-monitoring systems for railways in Hong Kong, China mainland, Singapore, the Netherlands, Taiwan, and India. His team built the world’s first city-wide fibre-optic sensing network for condition-based monitoring of metro systems in Hong Kong, and Singapore. Prof. Tam won numerous international awards for his inventions, and is the Third Prize Winner of the prestigious Berthold Leibinger Innovationspreis 2014. Berthold Leibinger Innovationspreis is a biennial event and it is one of the highest remunerated international innovation prizes for laser technology. Prof. Tam is a Chartered Engineer of the Engineering Council (UK), an IEEE Fellow, and Fellow of Optica.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/tam-hwa-yaw"
 },
 {
  "text": "Welcome to Edward's webpage!\nEdward is the Professor of Intelligent Transport Systems at the Hong Kong Polytechnic University (PolyU). He is an internationally recognised expert in the application of Intelligent Transport Systems (ITS) with many years of experience as an engineer and an experienced academic and researcher working nationally and internationally. Prior to joining PolyU, Edward was the inaugural Director of the Smart Transport Research Centre and Professor of Intelligent Transport Systems at Queensland University of Technology (QUT).\nEdward holds a Bachelor of Civil Engineering with Honours, and a PhD from Monash University.\nResearch Interest\n· Machine Learning in traffic flow and speed prediction considering detectors' reliability\n· Reinforcement Learning in traffic signal control, transit priority and electric vehicle charging \n· Surrogate model for traffic signal optimisation \n· Cooperative ITS considering packet loss\n· Freeway merging for CAV and mixed traffic \n· Capacity of signal-free intersections for mixed traffic\n· Transport modelling, traffic management and optimisation",
  "url": "https://www.polyu.edu.hk/ee/docdrive/ecschung/index.html"
 },
 {
  "text": "Prof. Eric Cheng graduated from the University of Bath in 1987 and started research in Power Electronics and obtained his PhD in 1990 from the same university.\nHe was then employed by the University of Bath as a research officer and in 1991 he joined the University of Birmingham as a research fellow. He worked on a number of projects in the Birmingham University including development of power conditioning system for high power ion-thruster for space application, high frequency magnetics, AC to AC conditioning system for future drive applications.\nHe joined Lucas Electronics as a Senior Engineer in 1995, and in 1996 he joined Lucas Advanced Vehicle Systems Development and in 1997 he joined Lucas Aerospace as a Principal Engineer. During his three years in Lucas, he was the project leader of a number of projects with multinational companies and leader of the power electronics group. He developed the advanced power electronics concept for civil aircraft power system, high temperature power semiconductor and aircraft power conditioning and actuation systems.\nHe has developed a number of electric vehicle techniques including the battery charging system, battery management, electric drive, lighting, power conversion, in-wheel and integrated charger. He is also the project leader of a number of electric vehicle projects. He is also then project leader of a number of power electronics projects including medical robotics, intelligent clothing, DC distribution, electromagnetic modeling and excitation. He received the IEE Sebastian Z De Ferranti Premium Award (1995), outstanding consultancy award (2000), Faculty Merit award for best teaching (2003) from the University, Faculty Engineering Industrial and Engineering Services Grant Achievement Award (2006), Brussels Innova Energy Gold medal with Mention (2007), Consumer Product Design Award (2008), Electric vehicle team merit award of the Faculty (2009), Special Prize and Silver Medal of Geneva’s Invention Expo (2011) and Eco Star award (2012), Seoul International Invention Fair Gold prize (2015)for his contribution in super-capacitor to electric vehicles, iCAN Gold Medal (2016) for his contribution in active suspension , and Gold Award – 7th Hong Kong innovation and technology Award – for the contribution body integrated upper-capacitor electric vehicle. He has published over 450 papers and 7 books. His research interests are all aspects of power electronics, electric vehicles, electromagnetics, motor drives, renewable energy and energy systems.\nHe is now the Director of Power Electronics Research Center and the professor of the Department of Electrical Engineering.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/cheng-ka-wai-eric"
 },
 {
  "text": "Prof Edward Chung joined The Hong Kong Polytechnic University as Professor of Intelligent Transport Systems (ITS) at the Department of Electrical Engineering in December 2017. Edward received his Bachelor of Civil Engineering with Honours and PhD from Monash University. Edward has many years experience as an engineer and an experienced academic and researcher working both nationally and internationally. From 1996 to 2009 he was a Senior Research Scientist at the Australian Road Research Board (1996-1999); Manager, Infrastructure Analysis and Modelling, Victorian Department of Infrastructure, Australia (1999-2001); Visiting Professor, Centre for Collaborative Research, University of Tokyo (2002 – 2004); and Head of ITS Group, LAVOC, EPFL, Switzerland (2005-2009).\nPrior to joining PolyU, Edward was a Professor at the Queensland University of Technology (QUT) and Director of the Smart Transport Research Centre, QUT. He has generated over $6M research income in the first 6 years of managing STRC and STRC won the PWC's Queensland Government Innovation Hub Pilot Project in December 2014 for the Roadwork Safety problem. Prof Chung has strong R&D collaboration with industry and his team has developed coordinated ramp metering algorithm for Queensland Department of Transport and Main Roads. Edward was QUT’s co-leader in the iMOVE CRC, an Australian federal government funded collaborative research centre for A$55 million over a 10 year period, to undertake industry-led research and to introduce rapidly evolving technologies in the areas of transport, logistics and connected mobility. iMOVE will be supported by up to A$178.8 million in cash and in-kind from industry and research entity.\nProf Chung collaborates widely with colleagues around Australia, as well as with leading researchers in France, Japan, China and Chile.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/chung-chin-shin-edward"
 },
 {
  "text": "Academic and Teaching Staff \nProf ZHANG A-ping \nDr. Zhang received the BSc and MSc degrees from Zhejiang University (ZJU) in 1997 and 2000, respectively, and received his PhD degree from The Hong Kong Polytechnic University in 2003. He started his academic career in ZJU as Lecturer in 2003, and promoted as Associate Professor of Optical Engineering in 2005. He was a Research Scholar of the Institute for Lasers, Photonics, and Biophotonics, State University of New-York at Buffalo during the period of 2006–2008, and the Department of NanoEngineering of University of California, San Diego in 2011, respectively.\nHe joined the Department of Electrical Engineering of The Hong Kong Polytechnic University as Associate Professor in 2012 and promoted to Professor in 2020.\nDr. Zhang has solid experience in scientific researches and has published more than 100 research papers in international conferences and journals (such as Advanced Materials, Advanced Science, ACS Nano, and Lab on a Chip). His current research interests include: optical micro/nano-manufacturing technologies; photonic devices, sensors, and microsystem; interdisciplinary research and applications. Dr. Zhang was/is the PI of many R&D projects funded by the government and industrial companies. He is the Senior Member of IEEE and OSA. ",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/zhang-a-ping"
 },
 {
  "text": "Professor Zhao Xu received B.Eng, M.Eng and Ph.D from Zhejiang University (China), National University of Singapore, and The University of Queensland in 1996, 2002 and 2006 respectively. He joined as an Assistant Professor, and later became Associate Professor, at Centre for Electric Technology, Department of Electrical Engineering, Technical University of Denmark (DTU) since 2006. In Feb 2010, He joined Department of Electrical Engineering, The Hong Kong Polytechnic University (PolyU), where he is now a Professor and Leader of Smart Grid Research Area.\nHe is the Directors of Power System Laboratory and Smart Microgrid Laboratory, and Leader of B. Eng (PT Electrical Engineering 41080).\nHe has edited 1 book, and published over 150 technical papers in international top journals, and conferences. He has led and participated in several large scale research and consulting projects in Europe, China, and Australia, concerning wind energy, demand side, electric vehicles, electricity market, and power system planning etc., including Hong Kong Research General Council Theme Based Research Projects on Smart Solar Energy harvesting, Storage and Utilization and Sustainable Power Delivery Structures for High Renewables, Wind Energy Development in China (www.dwed.org.cn) and the EDISON project (www.edison-net.dk). He has secured more than 20 million HK$ research funding from local and overseas authorities and organizations. Since 2006, he has successfully supervised 10 PhD students, and more than 30 M.sc students as main or co-supervisor.\nProfessor Xu is a Co-Principle Investigator and Leader of PolyU team for the 5-year Theme Based Research Project ‘Smart Solar Energy harvesting, Storage and Utilization’ (2014-18, total budget HK$60.33 Million), sponsored by Hong Kong Research General Council. He is also a Co-Investigator for Theme Based Research Project ‘Sustainable Power Delivery Structures for High Renewables’ (2015-19, total budget HK$47.12 Million).\nProfessor Xu is an Editor for the following journals\n- IEEE Transactions on Smart Grid\n- IEEE Power Engineering Letters (for IEEE Power and Energy Society (PES) Transactions on Power Systems, Smart Grid, Sustainable Energy, Power Delivery, and Energy Conversion)\n- Electric Power Components and Systems (Taylor&Fancis),\nHe also Member of Editorial Board, Springer Journal of Modern Power Systems and Clean Energy, which is the China's first power engineering journal in English. He is a Senior Member of IEEE, and Chairman of IEEE PES Joint Chapter, IEEE Hong Kong Section. Under his Leadership, the IEEE Hong Kong JC won 2017 Best Chapter Award from IEEE IES Society.\nProf. Xu receives the Top Five Best Algorithm Award in IEEE Competition on 'Application of Modern Heuristic Optimization Methods for Solving Optimal Power Flow Problems' in 2014. Under his supervision, his PhD students receive Third Prize in 2014 IEEE Hong Kong Student Paper Contest, organized by IEEE HK Section, 2nd Prize in 2015 IEEE Region 10 (Asia Pacific) Postgraduate Paper Contest, and the Best Poster Award in 2015 CUHK EneryDay Event. He is the recipient of 2005 Chinese Government Award for Outstanding Overseas Student Aboard. He is a foreign Associate Staff of Centre for Electric Technology, Technical University of Denmark.\nProf. Xu is actively looking for excellent candidates as Research Postgraduates/Research Staffs in the following areas (please contact Prof. Xu directly via email)\n• Solar/wind/battery storage system design, control and hardware implementation\n• Electronic converter design, modeling/simulation and hardware implementation\n• Microgrid control and optimization, stability analysis and hardware implementation\n• Power system operation and control, and security analysis under high wind/solar penetration\n• Cyber-physical power system modeling and security analysis\n• Optimal and robust commitment/system dispatch considering uncertainties and risks\n• Emerging/Evolutionary optimization techniques for system operation and planning\n• Demand side management and control, modeling and simulation",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/xu-zhao"
 },
 {
  "text": "Derek Or has a good mix of academic & industrial experience. Having received his BSc, MPhil (Teaching Company Scheme) & PhD (part-time mode) education at PolyU from 1992 to 2001, Derek acquired industrial experience in the R&D Department of ASM Pacific Technology Ltd. in both HK & Singapore from 1995 to 2001 & performed his postdoctoral research in the MAE Department at UCLA from 2001 to 2002. He started his academic career as Lecturer in the AP Department at PolyU in 2002, became Assistant professor in AP in 2005, advanced to Associate Professor in the EE Department in 2008 & achieved the rank of Professor in EE in 2012.\nDerek established the Smart Materials & Systems Laboratory in 2008, took over the High Voltage Engineering Laboratory in 2009, & has directed them to become strategic technology resources of both EE & PolyU. His group has the primary research focus on developing multifunctional smart materials with interestingly high magneto-/electro-/thermo-/mechano-/optical responses in the bulk, micro- & nano-scale as well as investigating the fundamentals of sensing, actuation & transduction mechanisms, energy generation & conversion processes, structural integrity, environmental sustainability, etc. for multidisciplinary applications. Moreover, the development of smart devices, including self-sustainable/energy-harvesting wireless sensors, coil-free self-isolated circuit protection & control devices, electromagnetic wave nano-absorbers/-shields, waste energy harvesters & converters, green batteries & energy cells, sensori-actuators/-transducers, ultrasonic tools, self-sensing vibration absorbers/isolators/dampers, etc., forms the application focus. In addition, condition & health monitoring; signal analysis, processing & transmission; drives, control & automation; energy harvesting, conversion, storage & management; prognosis & diagnosis; nondestructive evaluation; etc. are the synergic technologies for integrated systems.\nDerek has an outstanding record of research performance & an excellent reputation for professional services, both locally & internationally. He has secured HK$55M+ research grants for 65+ projects & HK$12M+ laboratory & equipment grants from government bodies, industries & PolyU since 2002. He has produced 300+ research publications since 1996, including 2 professional book chapters, 43 patents for 16 inventions, 200+ SCI journal papers (>70% in Q1 journals, h-index: 30+, citations: 3500+) & 60+ international conference papers. He is recipient of 20+ international, national & local research/invention awards/medals. Most of them have been commercialized/deployed in various industrial sectors worldwide, including power distribution systems, circuit protection & control apparatuses, railway electrification systems, cable-suspension bridges, semiconductor packaging equipment, high-power ultrasonic assembly equipment, etc.\nDerek has/had held various prestigious positions in government, academic & professional bodies, including Jury Committee Member of APEC Energy Smart Communities Initiative Best Practices Awards Program (2017), Visiting Professor of Stanford University (2015) & UCLA (2014), International Collaborator of NSF Nanosystems Engineering Research Center for Translational Applications of Nanoscale Multiferroic Systems (since 2013), Assessor of Chang Jiang Scholars Program (since 2013), Assessor of Academic Staff Promotion in Huazhong University of Science & Technology (since 2013), Chief Science & Technology Advisor of Hangzhou Qianjiang Economic Development Area (since 2014) & Zhucheng Municipal People’s Government (since 2012), Adjunct Professor of Zhejiang University (2010–2016) & Shanghai Institute of Ceramics, Chinese Academy of Sciences (2004–2010), etc. He has also served as Associate Editor of 3 SCI journals, Reviewer for 2 research funding schemes in France & China, Chair/Member of various professional bodies, examination boards & international conferences, etc.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/or-siu-wing-derek"
 },
 {
  "text": "Dr. Alan Pak Tao Lau obtained the B.A.Sc. in Engineering Science (Electrical Option) and M.A.Sc. in Electrical and Computer Engineering from the University of Toronto in 2003 and 2004 respectively. He worked on source coding techniques for wireless communication systems utilizing multiuser diversity for his masters’ thesis research. He then obtained the Ph.D. degree in Electrical Engineering at Stanford University in 2008. He is the recipient of numerous government awards during his post-graduate study at Stanford University. He also worked at NEC Labs America in 2006 as a research associate in the Optical Networking Division. His current research interests include system designs and signal processing techniques for coherent fiber-optic communication systems and multi-mode fiber communication systems. He joined the Electrical Engineering Department at the Hong Kong Polytechnic University as an Assistant Professor in Fall 2008.\nHe is a member of IEEE and OSA and serves as a reviewer for numerous journals including OSA Optics Express, IEEE Transactions on Wireless Communications and Transactions on Communications.\nDr. Lau is currently looking for M.Phil., Ph.D. students as well as post-doctoral researchers to perform research in fiber-optic communications and related disciplines. Interested individuals who possess a background in photonics, fiber-optic communications, signal processing and even wireless communications are welcomed to contact Dr. Lau for further information.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/lau-pak-tao-alan"
 },
 {
  "text": "“AI-based Probabilistic Stability Region Evaluation and Visualization”, 17th International Conference on Probabilistic Methods Applied to Power Systems 2020 (PMAPS 2022), Manchester, UK, 06/2022 \n“AI-based Security Assessment of Smart Grid to Enable a Carbon Neutrality Future”, CAiRS Technical Seminar on AI-based Reliability & Safety Transforming Smart Manufacturing and Smart City with Applications, Science Park, Kowloon, Hong Kong, 05/2022\n“Data-driven Frequency Violation Risk Assessment and Visualization for Operational Planning”, IEEE PES Day Workshop on Power System Development and Transformation under the Goal of Carbon Neutrality, Nanjing, China, 04/2022 \n“Risk Assessment and Mitigation on Frequency Stability for Operational Planning of Renewable-rich Power Systems”, IEEE Sustainable Power and Energy Conference 2021 (iSPEC2021), Nanjing, China, 12/2021 \n“Stable Operation of Decarbonized Smart Grid”, Belt and Road Professional Development Programme in Power and Energy, Hung Hom, Kowloon, Hong Kong, 10/2021\n“Power System Stability as Affected by Renewable Energy Integration: Challenges, Understandings and Solutions”, RISE Series Webinar in District Energy Systems and Smart Grid, Hung Hom, Kowloon, Hong Kong, 08/2021\n“Power System Stability Analysis Considering Renewable Energy Integration”, SPARC Sponsored Online Short-term Course on “Sustainable Power Systems”, Tamilnadu, India, 06/2021\n“Data-driven Techniques in Enhancing Reliability and Security of Power Networks”, CAiRS Webinar on System Reliability and Maintenance - Key Success Factors for Your Business, Science Park, Kowloon, Hong Kong, 01/2021 \n“Intelligent Operation of Modern Power Systems”, SPARC Sponsored E-Workshop on Recent Trends in Operation and Planning of Distribution System and Microgrids, Tamilnadu, India, 01/2021\n“Stability Analysis and Operation Control of Power Electronized Power Systems”, SPARC Sponsored E-Workshop on Recent Trends in Operation and Planning of Distribution System and Microgrids, Tamilnadu, India, 01/2021 \n“Application of AI in Operation and Control of Power Systems”, Shanghai University, Shanghai, China, 12/2020\n“Mechanism Investigation and Mitigation of Modal Resonance in Wind Penetrated Power Systems”, Shanghai University, Shanghai, China, 11/2020 \n“Oscillatory Stability Analysis and Control of Wind Penetrated Power Systems”, IEEE Sustainable Power and Energy Conference 2020 (iSPEC2020), Chengdu, China, 11/2020 \n“Application of AI in the Reliability and Security Enhancement of Power Grids”, Belt and Road Professional Development Programme in Power and Energy, Hung Hom, Kowloon, Hong Kong, 09/2020 \n“Energy Market and Policy”, IET Hong Kong Student Section Technical Seminar, Hung Hom, Kowloon, Hong Kong, 07/2019\n“Operational Planning, Smart Dispatch and Stability Control of High Power Electronic Penetrated Power Systems”, Sichuan University, Chengdu, China, 05/2019\n“Technical Solutions to Enable a High Renewable Penetrated Future Grid”, Southeast/Northeast University, Nanjing/Shenyang, China, 12/2018 \n“Mitigating the Intermittence Impact of Renewable Energy in Future Electricity Networks – TSO and DSO Solutions”, IEEE 2nd International Electrical and Energy Conference 2018 (CIEEC2018), Beijing, China, 11/2018 \n“Investigation on Economic and Reliable Operation of Hybrid AC/DC Power System as Impacted by Offshore Wind Farms”, International Conference of IEEE PES ISGT ASIA 2018, Suntec Convention & Exhibition Center, Singapore, 05/2018\n“Current Status and Future Challenges of Power Market Operation in UK – A Brief Overview”, International Workshop on Smart Power and Energy Systems, Nanyang Technological University, Singapore, 05/2018\n“Operation of UK Power Transmission Network and Electricity Market”, IET Hong Kong PES Technical Seminar, University of Hong Kong, Hong Kong, 05/2018\n“Energy Forecasting Challenge for Future UK Transmission System Planning – A Brief Insight”, UK EPSRC Global Challenge Research Fund (GCRF) Award Workshops, Hangzhou, China, 11/2016 \n“UK Transmission System Operation and Planning – A brief”, HKIE Technical Seminar, Hung Hom, Kowloon, Hong Kong, 11/2016",
  "url": "https://www.polyu.edu.hk/ee/siqibu/"
 },
 {
  "text": "Dr Siqi Bu received his BEng (Hons) in Electrical Engineering, BSc (Hons) in Management of Industry and Business in 2006 and MEng (Distinction) in Electrical Engineering in 2008 all from Southeast University. He obtained his PhD from the Queen's University of Belfast, U.K., in 2012, where he continued his postdoctoral research work in the same department before entering industry. He then worked with National Grid UK as an experienced UK National Transmission System Planner and Operator. He joined Department of Electrical Engineering at The Hong Kong Polytechnic University (PolyU), Kowloon, Hong Kong, as an Assistant Professor in 2016 and then was promoted to tenured Associate Professor in 2020. He is also a Chartered Engineer with UK Royal Engineering Council London, U.K.. He is the Departmental Leader of Engineering Doctorate (EngD) Program, Impact and Publicity Committee, Learning and Teaching Committee and International Student Promotion, Departmental Alumni Liaison Officer, and also the Member of Faculty Board. He is the Leader of Renewable Integration and Smartgrid Application (RISA) research lab and the Research Program Leader of Center for Advances in Reliability and Safety (CAiRS) at PolyU. His research interests include power system stability analysis and operation control, considering renewable energy integration and smart grid application. For more details in research led by him, please refer to RISA website (https://www.polyu.edu.hk/ee/siqibu/Research.html) and CAiRS website (https://www.cairs.hk/view/index.php).\nDr Bu serves as a Standing Director of IEEE PES Power System Relay and Control Satellite Committee (China), the Secretary of IEEE PES Long Range Planning Committee, an advisory expert of UK Government and IET on Enabling Distribution System Operation Transition Strategies, TUS-CLP Smart Energy Technology Co. Ltd., Hong Kong 1+1 Science Tip-top Talent Scheme, and Hong Kong Joint School Science Exhibition Scheme, an advisor of IET Hong Kong Student Section, an external examiner of Hong Kong Vocational Training Council, a review panelist of National Natural Science Foundation of China, an International Examiner of PhD Candidate Dissertation and Examination, a committee officer of IET Hong Kong Power and Energy Section, a committee member of IET Power Systems and Equipment Network UK, a HKIE local representative, an EMSD Appeal Board Panel Member and was a committee member of IET Berkshire local network UK. He has been the organizing/technical advisory committee chair/member and session chair of many international conferences and research seminars. \nDr Bu is an Editor of IEEE Transactions on Power Systems, IEEE Power Engineering Letters, IEEE Access, IEEE Open Access Journal of Power and Energy, CSEE Journal of Power & Energy Systems, Protection & Control of Modern Power Systems and PeerJ Computer Science, a Guest Editor-in-Chief/Editor of Renewable & Sustainable Energy Reviews, IET Renewable Power Generation, IET Generation Transmission & Distribution, IEEE Access, Energies, Frontiers in Energy Research, Shock and Vibration and Smart Cities, and a Moderator of IEEE TechRxiv Preprint. He is an active reviewer for over 50 peer-reviewed SCI journals and book publishers. He is the Publons Top 1% Peer Reviewer in Engineering and Cross-Field, and has frequently received Publons Peer Review Awards. He is also the recipient of Outstanding/Excellent Editor Awards from IEEE Open Access Journal of Power and Energy, CSEE Journal of Power and Energy Systems and Protection and Control of Modern Power Systems, and Outstanding Reviewer Awards from IEEE Transactions on Sustainable Energy, IEEE Transactions on Power Systems (5 times in a row), Applied Energy, Renewable Energy, International Journal of Electrical Power & Energy Systems and Journal of Modern Power Systems and Clean Energy respectively. He has received 3 Gold Awards, 2 Silver Awards and 2 Bronze Awards due to excellent performances and outstanding contributions in operational and commissioning projects during the employment with National Grid UK. Moreover, he is the recipient of Faculty Research Grant Achievement Award and Presidential GRF/ECS Awards from PolyU. In the past five years, as Principal Investigator, he has secured a number of research grants from various funding bodies (e.g., UGC, RGC, ITC, NSFC, GDSTD, MHRD India, SHUA etc.). \nCurrently, Dr Bu is proactively recruiting international researchers and PhD/MPhil candidates to support the research to utilize the intelligent computation and data analytics in power system stability analysis and operation control. You will collaborate with international academic and project partners and develop novel computational and analytical techniques for the following research areas (but not limited to):\nApplication of WAMS/PMU and Big Data technology in power system situational awareness (SA) for event detection and preventive control\nApplication of Machine/Deeping Learning in power system stability margin prediction and contingency screening\nOptimal planning and fully distributed control of distributed energy resources (DERs) considering various constraints, uncertainties and market mechanisms of active distribution network (ADN)/micro-grid\nProbabilistic/stochastic analysis of power system dynamics considering various system uncertainties\nStability mechanism analysis of power electronized power systems including transmission, distribution and micro-grid\nCyber physical power system (CPPS) modeling and analysis\nTSO and DSO coordination and optimization\nPower and transport nexus: coordination and optimization \nCarbon emission flow tracking, analysis and optimization\nPower equipment predictive maintenance and Prognostics and Health Management (PHM)\nFor more details in research vacancies of his team, please refer to RISA website (https://www.polyu.edu.hk/ee/siqibu/Post.html) and CAiRS job website (https://www.polyu.edu.hk/hro/job/en/aff-ass/CAiRS/cairs.htm). Please feel free to contact him if you have any interest in the relevant research opportunities.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/bu-siqi"
 },
 {
  "text": "Dr Kevin K.W. Chan Chan received his BSc(Hons) and PhD Degrees in Electronic and Electrical Engineering from the University of Bath (UK) in 1988 and 1992, respectively. His doctoral research study was in the area of real-time power system transient stability simulation using parallel processing techniques.\nFrom 1993 to 1997 Dr Chan was with the Power System and Energy Group at the University of Bath as a research officer. During this period, he successfully completed two EPSRC/ERCOS co-funded research projects. Extensive works has been done in the area of on-line dynamic security analysis, assessment and control of the UK National Grid. A number of industrial strength real-time power system simulators were developed and applied in the National Grid Control Centre, UK for daily monitoring and protection of the UK National Grid.\nDr Chan joined the department of Electrical Engineering of the Hong Kong Polytechnic University in 1998 as a lecturer and subsequently promoted to Assistant Professor in 2005. So far, Dr Chan has secured over 37 research projects, including 6 RGC-ERG, 2 RGC-Large Equipment, and 2 NSF projects with total funding over $15.4M. On-going research projects are in the areas of:\n(1) transient stability constrained optimal power flow using analytical and/or computational intelligence techniques;\n(2) on-line low frequency oscillation monitoring and control based on wide-area measurement system and self-adoptive control;\n(3) self-evolution smart power dispatch for future smart grid with automatic generation and automatic voltage control using distributed reinforcement learning, multiple group search optimization, hybrid equilibrium theory, stochastic optimization and vehicle-to-grid technologies;\n(4) on-line control and scheduling strategy of massive charging and discharging of plug-in electric vehicles for mitigating the intermittency of renewable energy generations and enhancing frequency regulation.\nCompetent undergraduate and postgraduate students, who have interests in power system engineering in particular smart grids or areas listed above, are welcome to contact Dr Chan directly via his email (eekwchan@polyu.edu.hk) for the offering of PhD research studentships and post-doctorate research posts.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/chan-ka-wing-kevin"
 },
 {
  "text": "Academic and Teaching Staff \nDr CHAN Wai-lok \nW. L. Chan received his BSc(Eng) and MPhil degree from University of Hong Kong, in 1988 and 1993 respectively. He then received Ph.D. degree from City University London in 2000. He is now an Associate Professor in the Department of Electrical Engineering, The Hong Kong Polytechnic University. His major research interests are in industrial automation and computer applications in power system. He is the Vice Chairman of the International Association of Elevator Engineers (Hong Kong-China Branch). He is also a senior member of IEEE and a committee member of the Joint Chapter of PES/IAS/PELS/IE, IEEE Hong Kong Section. \nEducation and Academic Qualifications\nBachelor of Science in Engineering, The University of Hong Kong\nMaster of Philosophy, The University of Hong Kong\nDoctor of Philosophy, City University, London\nProfessional Qualifications\nMember of the Hong Kong Institution of Engineers",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/chan-wai-lok"
 },
 {
  "text": "Dr. Gu received his Ph.D. in Civil & Environmental Engineering from University of California, Berkeley in 2012. He also received his B.S. and M.Eng. degrees in Civil Engineering from Tsinghua University (Beijing, China) in 2002 and 2005; and his M.Sc. (in Industrial Engineering & Operations Research) and M.A. (in Economics) degrees from UC Berkeley in 2010 and 2011.\nBefore joining the Department of Electrical Engineering in 2013, he was the Deputy Director of the UC Berkeley Center for Future Urban Transport, and also a lecturer at the Department of Civil & Environmental Engineering, UC Berkeley. His research interests span over public transit systems and railway systems, multimodal urban transportation systems, freeway traffic operations, queueing models, and infrastructure management. He is especially interested in how various transportation modes including cars, buses, rail, and bicycles interact in urban networks, and how to optimally design and manage such a multimodal urban transportation system for the benefit of all.\nHis awards include a Gordon F. Newell Award for Excellence in Transportation Science and a Chinese Government Award for Outstanding Self-Financing Students Abroad.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/gu-weihua"
 },
 {
  "text": "Ilhan received the PhD degree in Electrical Engineering in 2009 from École Polytechnique affiliated with Université de Montréal, Canada. He has 20 years of academic and industrial experience in different fields of electric power and energy systems gained in North America, Europe, and Asia. He was as R&D Engineer in Software Development at CYME International T&D in St-Bruno-de-Montarville (2009-2011), Professor at his alma mater (2011-2022), and R&D Project Engineer at Aselsan Electronics in Ankara (1998-2004). He joined the Department of Electrical Engineering at PolyU in 2022. \nIlhan’s career highlights include breakthrough contributions to scientific simulation tools and development of planning, control, and modeling solutions for large-scale grid integration of renewables. The range of modeling solutions is from steady state to electromagnetic transients. He has accomplished research and grid-consulting projects that cover design, rigorous mathematical modeling, analysis, and experimental characterization. Con Edison of New York, National Grid in the UK, New York Power Authority and RTE in France are among the organizations that he has had collaborations with. \nThe overall impact of his research goes beyond scientific databases; the resulting technological applications support thousands of practicing engineers and researchers in their daily work. Professional grade tool developers such as CYME, OPAL-RT, EMTP, ASPEN and Siemens PSS-CAPE adopted his solutions.\nUnder contract to the Electric Power Research Institute (EPRI), USA, Ilhan has been the principal investigator of the research project on the impact of renewables on system protection since 2014.\nHe is an associate editor of Journal of Modern Power Systems and Clean Energy jointly published by IEEE and State Grid China. He was a guest editor of IEEE Transactions on Power Delivery in 2016. He is a member of the technical committee of IPST. He is a senior member of IEEE and a registered professional engineer in the Province of Québec. \nIf you are interested in pursuing your graduate studies in a top university in collaboration with leading researchers in their fields from all around the world, please get in touch with Ilhan. You need to be coming from an excelling university at the national level, have good academic credentials and like mathematics, power systems/electronics, and programming.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/kocar-ilhan"
 },
 {
  "text": "Dr. Shuangxia Niu received B.Sc. and M.Sc. degrees in electrical engineering, from Tianjin University, China, in 2002 and 2005, respectively. She received Ph.D. in electrical and electronic engineering from the University of Hong Kong in 2009. \nShe joined Department of Electrical Engineering, The Hong Kong Polytechnic University since 2012, where she was a Research Assistant Professor and later became an Assistant Professor. Currently, she is an Associate Professor and also the Director of Electric Machine Laboratory.\nHer research interests include the Electric Vehicle Technologies, Renewable Energy Systems, Machines and Drives, Power Electronics technology, Applied Electromagnetic, Numerical Method and Optimization. She has secured over 30 projects in the above research areas and produced abundant publication record.\nDr. Niu is Senior Member of the IEEE, member of IEEE Vehicular Technology Society (VTS) and the key member of Hong Kong Chapter of IEEE VTS. She serves as Reviewer for over 20 international journals. She serves as Associate Editor of IEEE Journal of Emerging and Selected Topics in Power Electronics (JESTPE), IEEE Access. She also served as associate editor in 2020 IEEE 19th Biennial Conference on Electromagnetic Field Computation (CEFC 2020). She served as Technical Program Committee member of 2022 IEEE 5th international Electrical and Energy Conference(CIEEC2022), 2017 7th International Conference on Power Electronics Systems and Applications (PESA) and 2016 International Symposium on Electrical Engineering (ISEE). She has also been invited as Section Chair, in MMM& INTERMAG 2021, INTERMAG 2021, INTERMAG 2019, INTERMAG 2018, Conference ICEMS 2019, etc. She has published 2 book chapters and around 140 technical papers in international top journals.\nHer Google-Scholar has over 3000 citations of publications with h-index of 33 in 2022. She received numerous scholastic honors and awards, including Best Paper Award in the 22nd international conference on Electrical Machines and Systems (ICEMS, 2019) and Faculty Research Grant Achievement Award for 2017 and 2020. Since 2012, she has successfully supervised 7 PhD students as supervisor.\nDr. Niu is a Co-Principle Investigator and Leader of PolyU team for the Collaborative Research Fund (CRF) 2021/22 with research project “Development of Novel Integrated Wireless Motor Drives for Cordless Joints of Robotics” (2022-2024 total funding of HK$5,509,700), sponsored by Hong Kong Research General Council. Dr. Niu is also a Co-Investigator for ITF project “Demonstration of Ammonia-Powered Fuel-Cell Electric Vehicles (Mini-Ebus) in Hong Kong Innovation and Technology Fund - Automative Platforms and Application Systems R&D Centre (ITF-APAS)” (2021-2022 total funding of HK$9,997,000)\nAs Principle Investigator, Dr. Niu secured over 30 research projects, including 8 RGC-GRF/ECS, 2 NSFC, 3 Hong Kong Scholars program and 2 ITF projects. Dr. Niu is currently seeking Ph.D. students, research associate as well as post-doctoral researchers to perform research in electric machine, electric vehicles, renewable energy and other related topics. Students with a background in electrical engineering, automation and control are welcomed to contact Dr. Niu for more information.\nEditor or Editorial Membership\nIEEE Senior Member\nTechnical Program Committee member 2022 IEEE 5th international Electrical and Energy Conference\nTechnical Program Committee member 2017 7th International Conference on Power Electronics Systems and Applications (PESA)\nTechnical Program Committee member 2016 International Symposium on Electrical Engineering (ISEE)\nAssociate Editor, IEEE Journal of Emerging and Selected Topics in Power Electronics (JESTPE), 2020-present, which is a top-tier transaction in electrical engineering with an impact factor of 6.41.\nAssociate Editor, IEEE Access, 2019-present, which is Q2 journal with an impact factor of 3.745.\nAssociate Editor, 19th Biennial IEEE Conference on Electromagnetic Field Computation (CEFC 2020)\nProfessional Services\nSection Chair, The International Magnetics Conference, INTERMAG 2021\nSection Chair, The International Magnetics Conference, INTERMAG 2019\nSection Chair, The International Magnetics Conference, INTERMAG 2018\nSection Chair, The 22nd international conference on Electrical Machines and Systems (ICEMS)\nResearch interests\nResearch Interests/Areas\nDr. Niu research interests include Electric Vehicle Technologies, Renewable Energy Systems, Machines and Drives, Power Electronics technology, Applied Electromagnetic, Numerical Method and Optimization. The details are presented as follows,\n• Electrical Vehicle Technologies\nAmmonia-powered Fuel-Cell Electric Vehicles Technologies, Energy-Efficiency Technologies, Electric Propulsion Systems, Dual-fed Flux-Modulated Electric Motor for Electric Vehicles\n• Sustainable and Renewable Energy Conversion System\nUltra-High Force Density Generator for Direct Wave Energy Generation, Stand-Alone Wind Energy AC/DC Supply System, Multi-port Permanent Magnet Wind Power DC Generator, Contra-Rotating Wind Energy \nConversion System\n• Design of electric motors and drives\nHybrid-Excited Vernier Reluctance Machines, Memory Machines and Drives, Linear Machine and Drives, Magnetic-geared Machines, Double-Stator Machines, Modular Direct-Drive Fault-Tolerant Motor and Drives, etc.\n• Wireless Power Transfer System\nMulti-directional Magnetic Resonant Wireless Power Transfer System",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/niu-shuang-xia"
 },
 {
  "text": "Dr HUANG Dongmei \nDr. Dongmei Huang received her B.Eng. in Measuring and Control Technology and Instrumentation from Huazhong University of Science and Technology in 2014, Wuhan, China, and M.S. in College of Optoelectronic Engineering from Chongqing University in 2017, Chongqing, China and PhD in the Department of Electronic and Information Engineering from the Hong Kong Polytechnic University in 2020, Hong Kong. Since then she joined the Hong Kong Polytechnic University as a Postdocotral Fellow. Currently, she is a Research Assistant Professor in the Department of Electrical Engineering, the Hong Kong Polytechnic University. Her research focuses on the mode locked fiber lasers, swept fiber lasers and applications in OCT and LiDAR, WGM microresonator and fiber optics sensors. ",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/huang-dongmei"
 },
 {
  "text": "Dr Ulas Karaagac received the BS and MS degrees in electrical and electronics engineering from Middle East Technical University, Ankara, Turkey in 1999 and 2002, respectively, and the PhD degree in electrical engineering from Polytechnique Montreal, Canada in 2011. His doctoral research study was on synchronous machine modeling precision and efficiency in the computation of electromagnetic transients.\nFrom 1999 to 2007, Dr Karaagac worked at Information Technology and Electronics Research Institute (BILTEN) of Scientific and Technical Research Council of Turkey (TUBITAK), as R&D engineer in the field of power systems. At TUBITAK-BILTEN, he managed and participated in the delivery of 8 successful industrial projects on design, operation and planning of transmission and distribution systems. These projects were funded by various sources including Turkish Electricity Transmission Company, European Union and Bosporus Electricity Distribution Inc. (Electricity Distributor of European Side of Istanbul).\nAfter receiving PhD, Dr Karaagac continued working at Polytechnique Montreal as postdoctoral fellow and then as research associate. At Polytechnique Montreal, he worked as principal researcher in several industry funded research projects on grid integration of onshore and HVDC connected offshore wind farms, impact of renewables on power transmission system protection, and electrical machine modeling for the computation of electromagnetic transients. His research projects were funded by various sources including Senvion Wind Energy Solutions (Germany); German Federal Ministry for the Environment, Nature Conservation, Building and Nuclear Safety; Electric Power Research Institute (USA); Réseau de Transport d'Électricité (France); and Électricité de France.\nDr Karaagac joined Department of Electrical Engineering of the Hong Kong Polytechnic University as Research Assistant Professor in December 2016. His research areas include integration of large scale renewables into power grids; modeling and simulation of large scale power systems; power system dynamics and control.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/karaagac-ulas"
 },
 {
  "text": "Isaac Yu-fai Fung was an Assistant Professor in the Department of Electrical Engineering at the Hong Kong Polytechnic University before taking up his current position as a Senior Teaching Fellow.\nHe received the BSc(Eng) degree in 1986 in Electronic Engineering with Computer Science, and the PhD in 1991, all from University College, London.\nBefore joining the Hong Kong Polytechnic University, he worked for the Department of Computer Science in the Chinese University of Hong Kong from 1991.\nHe conducts research and teaches in the areas of computer architecture, software engineering, and parallel computation.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/fung-yu-fai"
 },
 {
  "text": "Dr. Hui Wen Rebecca LIANG received her B.S. and M.S. degrees in Electrical Engineering from National Cheng Kung University. She then joined Chroma ATE Inc. as an engineer, and was involved in the research and development of battery testing system. Afterwards, she obtained her Ph.D. degree in Electrical and Electronic Engineering from the University of Hong Kong with the support of Hong Kong PhD Fellowship.\nDr. Liang has published her work in peer-reviewed journals including IEEE Transactions on Power Electronics (TPEL), IEEE Journal of Emerging and Selected Topics in Power Electronics (JESTPE), and IEEE Transactions on Industrial Electronics (TIE). She also serves as a reviewer for IEEE TPEL and JESTPE. Her research interests include power electronics, wireless power transfer, and switching power supplies.",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/liang-hui-wen-rebecca"
 },
 {
  "text": "Dr BAO Haihong \nDr. Haihong BAO received his B.Eng. and M.Eng. degrees from the University of Electronic Science and Technology of China in 2013 and 2016, respectively. He received his Ph.D. degree from the Hong Kong Polytechnic University in 2020. Afterward, he joined the Department of Electrical Engineering at Hong Kong Polytechnic University as a Postdoctoral Fellow. Currently, Dr. BAO holds the position of Research Assistant Professor in the Department of Electrical Engineering at the Hong Kong Polytechnic University. Dr. BAO's research interests focus on fundamental aspects of light-matter (gas) interaction in micro-structured optical fibers, with the aim of developing advanced spectroscopic techniques for ultra-sensitive and selective gas sensing. ",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/bao-haihong"
 },
 {
  "text": "Kerui Li received the B.Eng. degree from the South China University of Technology in 2013, the M.Eng. degree from the Sun Yat-sen University in 2016, and the Ph.D. degree from The University of Hong Kong, Hong Kong in 2021. \nIn 2014 and 2017, he was a visiting research student at City University of Hong Kong and Aalborg University, respectively. From 2022-2023, he was a Research Fellow at Nanyang Technological University. Currently, he is a Research Assistant Professor in the Department of Electrical Engineering, the Hong Kong Polytechnic University. His research interests include power electronics and wireless power transfer. Dr. Li was the recipient of the IEEE Power Electronics Society Ph.D. Thesis Talk Award in 2022, the University of Hong Kong Power Engineering Prize in 2020, and China National Scholarship in 2016.\nEducation and Academic Qualifications \nBachelor of Engineering, South China University of Technology \nMaster of Engineering, Sun Yat-sen University \nDoctor of Philosophy, The University of Hong Kong",
  "url": "https://www.polyu.edu.hk/ee/people/academic-staff/li-kerui"
 },
 {
  "text": "Programme Characteristics\nIt provides in-depth coverage of electrical engineering based on an outcome-based education philosophy. The programme produces engineers who are able to practise their professions in a wide range of areas of electrical engineering, such as electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nA modern electrical engineer should possess a broad-based education and the specialist knowledge needed to undertake high-level work in design, planning, supervision and manufacturing. The programme thus places emphasis on the mastery of both fundamental principles and the application of latest engineering technology. Of equal importance is training in leadership, entrepreneurship, and communication skills. We encourage lifelong learning to enable graduates to keep abreast of new developments in engineering and technology.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/bachelor-of-engineering"
 },
 {
  "text": "Programme Characteristics\nIt aims to make full use of the hugely versatile applications of the in-demand disciplines of electrical engineering to broaden the career opportunities available to our graduates. Students are expected to acquire a solid understanding of the fundamentals of electrical engineering, and apply the knowledge gained and techniques learned to relevant areas in the field of transportation systems.\nThe programme philosophy focuses on the incorporation of up-to-date engineering knowledge into transportation systems to enhance the efficiency, reliability, safety and maintainability of infrastructure and services. Current practices in transportation, the latest technologies in transportation systems and integrating them to provide engineering solutions to practical problems form the core of the programme.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/transportation-systems"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code JS3170 \nProgramme Intake 61 \nFund Type Government-Funded \nCredits Required for Graduation \n124 (plus training credits)\nProgramme Leaders \nScheme Leader\nDr K.W. Chan\nBSc, PhD, MIEEE, MIET\nProgramme Leader – BEng (Hons) in Electrical Engineering\nDr S.Q. Bu\nBEng, BSc, MEng, PhD, CEng, MIET, SMIEEE\nProgramme Leader – BEng (Hons) in Transportation Systems Engineering\nProf. Alan P.T. Lau\nBASc, MASc, PhD\nRemarks\nStudents will be awarded one of the following awards upon successful completion of the graduation requirements of the programme concerned: \nBEng (Hons) in Electrical Engineering\nBEng (Hons) in Transportation Systems Engineering\nStudents admitted to the Scheme complete a common curriculum in Year 1. They are allowed to enrol on one of the honours degree programmes without being subject to further assessment and can begin studying the content relevant to their path from Semester One of Year 2.\nThe option of Secondary Major in AI and Data Analytics is available to the students of BEng (Hons) in Electrical Engineering. Admission to the Secondary Major is on competitive basis and subject to a different credit requirement for graduation. Please see \"Secondary Major Details\" section.\nStudents may pursue a Minor in a different discipline.\nThe credit requirements of this scheme are indicative only. They are subject to review.\nAll information is subject to change without notice.\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nThe BEng (Hons) Scheme in Electrical Engineering consists of the following degrees. It aims to give students the flexibility to decide on the final degree in their study.\nBEng (Hons) in Electrical Engineering provides in-depth coverage of electrical engineering based on an outcome-based education philosophy. The programme produces engineers who are able to practise their professions in a wide range of areas of electrical engineering, such as electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nA modern electrical engineer should possess a broad-based education and the specialist knowledge needed to undertake high-level work in design, planning, supervision and manufacturing. The programme thus places emphasis on the mastery of both fundamental principles and the application of latest engineering technology. Of equal importance is training in leadership, entrepreneurship, and communication skills. \nWe encourage lifelong learning to enable graduates to keep abreast of new developments in engineering and technology.\nBEng (Hons) in Transportation Systems Engineering aims to make full use of the hugely versatile applications of the in-demand disciplines of electrical engineering to broaden the career opportunities available to our graduates. Students are expected to acquire a solid understanding of the fundamentals of electrical engineering, and apply the knowledge gained and techniques learned to relevant areas in the field of transportation systems.\nThe programme philosophy focuses on the incorporation of up-to-date engineering knowledge into transportation systems to enhance the efficiency, reliability, safety and maintainability of infrastructure and services. Current practices in transportation, the latest technologies in transportation systems and integrating them to provide engineering solutions to practical problems form the core of the programme.\nProgramme Characteristics\nBEng (Hons) in Electrical Engineering is one of the premier electrical engineering degree programmes in Hong Kong that provides unique and up-to-date education in electrical power and energy. The curriculum is designed to give a balanced treatment of university core requirements, electrical engineering fundamentals, advanced and specialist topics, and non-technical subjects such as management. \nBEng (Hons) in Transportation Systems Engineering is unique in Hong Kong, providing students with interdisciplinary knowledge and perspectives in modern transportation systems and a direct career path into the high-growth transportation industry and related sectors.\nEngineering practice is an integrated component of the curriculum. Student learning is supplemented by a variety of laboratory, training and project activities. Students also develop good presentation and problem-solving skills through mini-projects and final-year projects. Students are required to take the Work-Integrated Education (WIE) component, which may be in the form of summer training or industrial attachment.\nStudents can also participate in exchange programmes and spend a semester at an overseas university. Every year, a number of students participate in exchange programmes with institutions including Cardiff University, National University of Singapore, Norwegian University of Science and Technology, Technical University of Munich and Czech Technical University.\nEngineering and Entrepreneurship Club (E&E Club) provides a platform to enhance students’ interests in engineering and understanding of entrepreneurship. E&E Club organises workshops to train students’ technical skills and invites experts to share requirements of entrepreneurship with students. It also supports students participating in both local and overseas underwater robot competitions.\nSeminars, industry visits and overseas study tours are also organised to broaden students’ horizons.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/jupas-applicants"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code JS3170 \nProgramme Intake 61 (JUPAS and non-JUPAS) \nFund Type Government-Funded \nCredits Required for Graduation \n124 (plus training credits)\nProgramme Leaders \nScheme Leader\nDr K.W. Chan\nBSc, PhD, MIEEE, MIET\nProgramme Leader – BEng (Hons) in Electrical Engineering\nDr S.Q. Bu\nBEng, BSc, MEng, PhD, CEng, MIET, SMIEEE\nProgramme Leader – BEng (Hons) in Transportation Systems Engineering\nProf. Alan P.T. Lau\nBASc, MASc, PhD\nRemarks\nStudents will be awarded one of the following awards upon successful completion of the graduation requirements of the programme concerned: \nBEng (Hons) in Electrical Engineering\nBEng (Hons) in Transportation Systems Engineering\nStudents admitted to the Scheme complete a common curriculum in Year 1. They are allowed to enrol on one of the honours degree programmes without being subject to further assessment and can begin studying the content relevant to their path from Semester One of Year 2.\nThe option of Secondary Major in AI and Data Analytics is available to the students of BEng (Hons) in Electrical Engineering. Admission to the Secondary Major is on competitive basis and subject to a different credit requirement for graduation. Please see \"Secondary Major Details\" section.\nStudents may pursue a Minor in a different discipline.\nThe credit requirements of this scheme are indicative only. They are subject to review.\nAll information is subject to change without notice.\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nThe BEng (Hons) Scheme in Electrical Engineering consists of the following degrees. It aims to give students the flexibility to decide on the final degree in their study.\nBEng (Hons) in Electrical Engineering provides in-depth coverage of electrical engineering based on an outcome-based education philosophy. The programme produces engineers who are able to practise their professions in a wide range of areas of electrical engineering, such as electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nA modern electrical engineer should possess a broad-based education and the specialist knowledge needed to undertake high-level work in design, planning, supervision and manufacturing. The programme thus places emphasis on the mastery of both fundamental principles and the application of latest engineering technology. Of equal importance is training in leadership, entrepreneurship, and communication skills. \nWe encourage lifelong learning to enable graduates to keep abreast of new developments in engineering and technology.\nBEng (Hons) in Transportation Systems Engineering aims to make full use of the hugely versatile applications of the in-demand disciplines of electrical engineering to broaden the career opportunities available to our graduates. Students are expected to acquire a solid understanding of the fundamentals of electrical engineering, and apply the knowledge gained and techniques learned to relevant areas in the field of transportation systems.\nThe programme philosophy focuses on the incorporation of up-to-date engineering knowledge into transportation systems to enhance the efficiency, reliability, safety and maintainability of infrastructure and services. Current practices in transportation, the latest technologies in transportation systems and integrating them to provide engineering solutions to practical problems form the core of the programme.\nProgramme Characteristics\nBEng (Hons) in Electrical Engineering is one of the premier electrical engineering degree programmes in Hong Kong that provides unique and up-to-date education in electrical power and energy. The curriculum is designed to give a balanced treatment of university core requirements, electrical engineering fundamentals, advanced and specialist topics, and non-technical subjects such as management. \nBEng (Hons) in Transportation Systems Engineering is unique in Hong Kong, providing students with interdisciplinary knowledge and perspectives in modern transportation systems and a direct career path into the high-growth transportation industry and related sectors.\nEngineering practice is an integrated component of the curriculum. Student learning is supplemented by a variety of laboratory, training and project activities. Students also develop good presentation and problem-solving skills through mini-projects and final-year projects. Students are required to take the Work-Integrated Education (WIE) component, which may be in the form of summer training or industrial attachment.\nStudents can also participate in exchange programmes and spend a semester at an overseas university. Every year, a number of students participate in exchange programmes with institutions including Cardiff University, National University of Singapore, Norwegian University of Science and Technology, Technical University of Munich and Czech Technical University.\nEngineering and Entrepreneurship Club (E&E Club) provides a platform to enhance students’ interests in engineering and understanding of entrepreneurship. E&E Club organises workshops to train students’ technical skills and invites experts to share requirements of entrepreneurship with students. It also supports students participating in both local and overseas underwater robot competitions. \nSeminars, industry visits and overseas study tours are also organised to broaden students’ horizons.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/non-jupas-local-year-1-admissions"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 41470-SY \nProgramme Intake 49 senior year places \nFund Type Government-Funded \nCredits Required for Graduation \nNormally 61 (plus training credits).\nThe actual number of credits required will be determined by the transfer of credits granted based on AD/HD results.\nProgramme Leaders \nDr S.Q. Bu\nBEng, BSc, MEng, PhD, CEng, MIET, SMIEEE\nThe curriculum of this programme, including the credit requirements, is subject to review.\nThe exact study duration and number of credits to be transferred will depend on the entry qualification of individual AD/HD admittees.\nProgramme Aims and Learning Outcomes\nThis programme provides in-depth coverage of electrical engineering according to an outcome-based education philosophy. The programme aims to produce engineers who are able to practise their profession in the broad area of electrical engineering, which includes, but is not limited to, electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nA modern electrical engineer should possess a broad-based education and adequate specialist knowledge to undertake high-level work in design, planning, supervision and manufacturing. The programme thus emphasises the mastery of fundamental principles and applications of the latest engineering technology. Of equal importance is training in leadership, entrepreneurship, and communication skills.\nWe encourage life-long learning so that graduates can keep abreast of new developments in engineering and technology.\nThis programme is a major electrical engineering degree programme in Hong Kong that provides unique and up-to-date education in the interesting field of electrical power and energy.\nThe curriculum is designed to give a balanced treatment of university core requirements, electrical engineering fundamentals, advanced and specialist topics, and non-technical subjects such as economics and management.\nEngineering practice is an integrated component of the curriculum. Student learning is supplemented by a variety of laboratory, training and project activities. Students also develop good presentation and problem-solving skills through mini-projects and final-year projects. They are also required to take the Work-Integrated Education (WIE) component, which may be in the form of summer training or an industry attachment.\nEngineering and Entrepreneurship Club (E&E Club) provides a platform to enhance students’ interests in engineering and understanding of entrepreneurship. E&E Club organizes workshops to train students’ technical skills and invites experts to share requirements of entrepreneurship with students. It also supports students participating in both local and overseas underwater robot competitions.\nSeminars, industry visits and overseas study tours are organized to broaden students' horizons.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/non-jupas-applicants-senior-year"
 },
 {
  "text": "Programme Code JS3170 \nFund Type Government-Funded \n124 (plus training credits)\nScheme Leader\nDr K.W. Chan\nBSc, PhD, MIEEE, MIET\nProgramme Leader – BEng (Hons) in Electrical Engineering\nDr S.Q. Bu\nBEng, BSc, MEng, PhD, CEng, MIET, SMIEEE\nProgramme Leader – BEng (Hons) in Transportation Systems Engineering\nProf. Alan P.T. Lau\nBASc, MASc, PhD\nStudents will be awarded one of the following awards upon successful completion of the graduation requirements of the programme concerned: \nBEng (Hons) in Electrical Engineering\nBEng (Hons) in Transportation Systems Engineering\nStudents admitted to the Scheme complete a common curriculum in Year 1. They are allowed to enrol on one of the honours degree programmes without being subject to further assessment and can begin studying the content relevant to their path from Semester One of Year 2.\nThe option of Secondary Major in AI and Data Analytics is available to the students of BEng (Hons) in Electrical Engineering. Admission to the Secondary Major is on competitive basis and subject to a different credit requirement for graduation. Please see \"Secondary Major Details\" section.\nStudents may pursue a Minor in a different discipline.\nThe credit requirements of this scheme are indicative only. They are subject to review.\nAll information is subject to change without notice.\nProgramme Aims & Learning Outcomes\nThe BEng (Hons) Scheme in Electrical Engineering consists of the following degrees. It aims to give students the flexibility to decide on the final degree in their study.\nBEng (Hons) in Electrical Engineering provides in-depth coverage of electrical engineering based on an outcome-based education philosophy. The programme produces engineers who are able to practise their professions in a wide range of areas of electrical engineering, such as electrical power systems, energy conversion and utilisation, transportation systems, environmental protection, control, and computer and fibre-optic applications.\nA modern electrical engineer should possess a broad-based education and the specialist knowledge needed to undertake high-level work in design, planning, supervision and manufacturing. The programme thus places emphasis on the mastery of both fundamental principles and the application of latest engineering technology. Of equal importance is training in leadership, entrepreneurship, and communication skills. \nWe encourage lifelong learning to enable graduates to keep abreast of new developments in engineering and technology.\nBEng (Hons) in Transportation Systems Engineering aims to make full use of the hugely versatile applications of the in-demand disciplines of electrical engineering to broaden the career opportunities available to our graduates. Students are expected to acquire a solid understanding of the fundamentals of electrical engineering, and apply the knowledge gained and techniques learned to relevant areas in the field of transportation systems.\nThe programme philosophy focuses on the incorporation of up-to-date engineering knowledge into transportation systems to enhance the efficiency, reliability, safety and maintainability of infrastructure and services. Current practices in transportation, the latest technologies in transportation systems and integrating them to provide engineering solutions to practical problems form the core of the programme.\nBEng (Hons) in Electrical Engineering is one of the premier electrical engineering degree programmes in Hong Kong that provides unique and up-to-date education in electrical power and energy. The curriculum is designed to give a balanced treatment of university core requirements, electrical engineering fundamentals, advanced and specialist topics, and non-technical subjects such as management. \nBEng (Hons) in Transportation Systems Engineering is unique in Hong Kong, providing students with interdisciplinary knowledge and perspectives in modern transportation systems and a direct career path into the high-growth transportation industry and related sectors.\nEngineering practice is an integrated component of the curriculum. Student learning is supplemented by a variety of laboratory, training and project activities. Students also develop good presentation and problem-solving skills through mini-projects and final-year projects. Students are required to take the Work-Integrated Education (WIE) component, which may be in the form of summer training or industrial attachment.\nStudents can also participate in exchange programmes and spend a semester at an overseas university. Every year, a number of students participate in exchange programmes with institutions including Cardiff University, National University of Singapore, Norwegian University of Science and Technology, Technical University of Munich and Czech Technical University.\nEngineering and Entrepreneurship Club (E&E Club) provides a platform to enhance students’ interests in engineering and understanding of entrepreneurship. E&E Club organizes workshops to train students’ technical skills and invites experts to share requirements of entrepreneurship with students. It also supports students participating in both local and overseas underwater robot competitions.\nSeminars, industry visits and overseas study tours are also organised to broaden students’ horizons.",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/international-students"
 },
 {
  "text": "Introduction\nMode and Duration\nEntrance Requirements\nAward\nThis is a credit based part-time programme. The minimum duration is three years and the maximum duration is eight years. It is expected that most students can complete in five years. ",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes/engineering-doctorate-in-electrical-engineering/mode-and-duration"
 },
 {
  "text": "Introduction\nMode and Duration\nEntrance Requirements\nAward\nThe normal requirement is a Master Degree in Electrical Engineering or related discipline. Under very exceptional circumstance, a good Honours degree in Electrical Engineering can be considered. The candidate must have substantial working experience. He/she must also show evidence of company sponsor or support. ",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes/engineering-doctorate-in-electrical-engineering/entrance-requirements"
 },
 {
  "text": "Introduction\nMode and Duration\nEntrance Requirements\nAward\nThe Students who complete both the course work and thesis components satisfactorily within the maximum period will be awarded the \"EngD\" title. He/she will be able to use the abbreviation \"Dr.\" before their names. ",
  "url": "https://www.polyu.edu.hk/ee/study/taught-postgraduate-programmes/engineering-doctorate-in-electrical-engineering/award"
 },
 {
  "text": "Research Themes and Strength \nPower Systems & Energy \nPower Systems & Energy\nThis research theme focuses on power system deregulation and restructuring, dynamic stability and security assessment, application and optimization of FACTS devices, intelligent protection devices and AI methods, and real-time digital power system simulation. \nWe have developed a digital power system simulator based on an SGI multi-processor super computer integrated with electromagnetic transients simulator (HYPERSIM). Numerous power softwares are applied to both research and teaching, including Powerworld, ERACS etc.\nOur strength also focuses on developing novel analytical methods for different power system planning and operational problems; and new technologies and emerging devices essential for building an efficient and reliable power grid of the future, i.e. the smart grid.",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/power-systems-energy"
 },
 {
  "text": "Departmental Academic Advisor \nThis is the default Rich Text Editor in each page.\nYou can edit this content and add component above or below this area.\nFor Component List, you may refer to https://www.polyu.edu.hk/cpa/web-design-guide/\nIf you don't have any content to put in this area, you can clear the content inside.\nThen it will become [No text in field], and this area will disappear in preview.",
  "url": "https://www.polyu.edu.hk/ee/about-ee/departmental-academic-advisor1"
 },
 {
  "text": "Power Electronics & Utilities\nWe have established a reputation in the field of power electronics, machines, drives electric mobility use of new materials and energy saving, notably in the areas of power conversion, electric vehicle and renewable engineering. The power electronics area includes static power conversion, the application of power electronics to improve the performance of power distribution and systems, renewable resources, magnetics, battery and superconducting energy storages and use of artificial intelligence in power electronics. The machine and drive areas cover the machines design and motion control research work. They include intelligent motion control, 2D and 3D actuation systems, condition monitoring, induction generators, switched reluctance motor drives and soft-switching drives. The electric mobility research work includes electric vehicle, electric boat, traction system, traffic control, sensors in rail track and vehicle.\nOur aims are to use the above experience to help local industry and the region to improve competitiveness through consultancy services, cooperative projects and research development of new technologies.",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/power-electronics-utilities"
 },
 {
  "text": "Research Themes and Strength \nPhotonics and Smart Materials \nPhotonics and Smart Materials",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/photonics-and-smart-materials"
 },
 {
  "text": "Research Themes and Strength \nFuture Mobility System \nFuture Mobility System (Intelligent Transportation)\nThis research theme focuses on Smart Mobility, Autonomous, Connected, Electric and Shared, traffic management, Planning, design and operations of public transport systems, Resilient and sustainable infrastructure systems.",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/future-mobility-system"
 },
 {
  "text": "Congratulations to the Engineering & Entrepreneurship Club members on winning the championship of the Hong Kong Regional Underwater Robot Challenge 2022 Design Competition (Explorer Class)! Due to COVID-19, the competition was held online. In this competition, the team designed an underwater robot that can achieve various tasks related to the sustainable development of ocean science. The team members presented different features of the underwater ROV and answered questions from the judging panel. \nThe whole process was very exciting. In the meantime, it was also challenging. This is because most of the team members do not possess sufficient hands-on experience in underwater robot design, whilst they needed to complete the job in a concise time frame. However, they could still demonstrate their commitment and interest in working and improving their design continuously. We really appreciate the team’s efforts. Their hard work led to this great accomplishment. We are very proud to know a professional competition recognizing the team members’ design, efforts, knowledge, and skill. \nWe congratulate the team and all its members for earning such high honours.",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2023/the-champion-of-iet"
 },
 {
  "text": "Achievements \nAwards and Achievements \nThe project “Development of Software for Optimising the Planning and Scheduling of New Energy Buses” which is led by Dr Weihua GU’s has been received the HKSAR Government’s Smart Traffic Fund. The project aims to develop a software tool to optimise the planning and scheduling of new energy buses on different routes, in order to build a more environmentally friendly travel experience and promote the development of new energy public transport. Thank Hong Kong Government for giving support to the project. Dr Weihua GU and our Department would continue to commit ourselves to creating a positive impact in addressing social needs through the application of advanced technologies. \nFor more information, please click the link below:\nhttps://www.polyu.edu.hk/rio/news/2023/20230420---innovative-solutions-to-promote-new-energy-transportation-and-enhance-driving-safety",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2023/hksar-governments-smart-traffic-fund"
 },
 {
  "text": "Achievements \nAwards and Achievements ",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2023/techconnect-2023_1"
 },
 {
  "text": "Awardee Profiles: Ir Wong Ka Wo Kelvin Dr Li Siyang \nIr Wong is currently General Manager, Technical Services Systems of Airport Authority Hong Kong overseeing the engineering and maintenance operation of airport systems. He started his career with Airport Authority and took part in the design and construction of the new Chep Lap Kok Hong Kong International Airport upon graduation from PolyU in 1995. Ir Wong has led the effort to develop the applications of innovative technologies in advancing airport systems to help accelerate the digital transformation of Hong Kong International Airport into a smart airport city. Ir Wong has advocated the adoption of the concept of digital twin with the use of 3D modelling to create a virtual digital replica of airport for the design, construction, management and operation of the airport facility. He serves his professional community as a member of the PolyU’s Advisory Committee of the Department of Electrical Engineering, the Committee on Building Information Modelling of Construction Industry Council, the Appeal and Disciplinary Board of CIC’s Certification of BIM Personnel and Accreditation of BIM Course Schemes, the Admissions, Budgets and Allocations Committee of the Community Chest, and CLP Local Customer Advisory Committee of CLP Power. \nDr. Li Siyang is the founder and president of Goal Technology (Shenzhen) Co., Ltd. Goal Technology or Goal Tech is a nationally recognized high technology (small or medium-sized) enterprise with certification from the Innovation Center within the Ministry of Science and Technology, China. Goal Tech is headquartered within ShenZhen, GuangDong. We have a R&D team of 50 members with 60% of the members holding a Masters or PhD degree. We work on the research and development of key components within the advanced semiconductor packaging and testing technology. Goal Tech has 73 invention patents and more than 100 international high-level papers. The fully self-developed linear rotary motor is the world's first high-precision motor that realizes linear and rotary two-dimensional motion within a single shaft. The linear accuracy of the motor is 1um, the rotation accuracy is 0.01 degrees, and the force control can achieve 0.01N.\nIn the years since becoming an entrepreneur, Dr. Li has won many awards including, the \"Forbes 30 Under 30\" Elite List, the \"C-category\" talent of Shenzhen Entrepreneur Program, and the \"U30\" entrepreneurial elite of Shenzhen Association for Science and Technology in 2021.",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2022/opaa2022"
 },
 {
  "text": "The President’s Executive Committee has endorsed the setting up of the President’s Awards for Outstanding Achievement in Knowledge Transfer (KT) to recognise and reward staff members’ KT endeavours which are underpinned by research and innovation and have created significant impact on industry and society. Any successful cases should provide evidence of how PolyU’s research and innovation has created significant impact to industry and/or society during the period of the past 7 years (From January 2014 to 2021), through collaborative/contract research, licensing of a patent, entrepreneurship, consultancy, or other appropriate means.\nThe “President’s Awards for Outstanding Achievement in KT: Industry” recognises KT impact cases which can demonstrate contributions in advancing the technological or industry standards, addressing the needs of the industry, or enhancing its competitiveness through application of PolyU’s research and innovations in the form of products, methodologies, systems and/or solutions. Professor HY TAM (Team Leader) leads his research team on an impact story: “World’s First Predictive Maintenance Railway Monitoring System” is one of the 5 teams awarded in this category. His team members include Ir Dr Lee Kang Kuen, Dr SY Liu, Dr Stephen Cho and Mr. David Au.\nOur greatest congratulations to them!",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2022/congratulations-to-the-winners-for-the-presidents-awards-for-outstanding-achievement"
 },
 {
  "text": "Achievements \nAwards and Achievements \nFaculty of Engineering Research Grant Achievement Award has been set up by the Faculty Research Committee since 2003, with a view to recognize the outstanding performance of FENG academic staff members in securing external competitive research grants. This year, both Professors Wei Jin and Aping Zhang, and Drs KH Lam and SX Niu are the winners of this award.",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2022/congratulations-to-the-winners-for-the-faculty-research-grants-achievement-awards-2020"
 },
 {
  "text": "Achievements \nAwards and Achievements \nProf. Eric Cheng Ka-wai and his research team developed the world’s first ammonia-powered fuel-cell EV in just three months. The ammonia inside the fuel-cell system will be transformed into hydrogen to generate power. This new development is through the support from the University of Oxford and industry partners. The research team plans to develop an ammonia-powered fuel-cell mini-bus by October 2022 and hopes to collaborate with local mini-bus companies to promote zero-emission electric mini-buses. \nFor more details:https://www.facebook.com/151909049548/posts/10159475585939549/?d=n",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2021/worlds-first-ammonia-powered-fuelcell-achievements-by-professor-eric-cheng"
 },
 {
  "text": "Professor Xu Zhao and his research team obtained the Best Paper Award, 2021 IEEE IAS Industrial and Commercial Power System Asia Conference (IEEE IAS I&CPS Asia 2021), Chengdu, China. The paper: Probabilistic Power Flow of Distribution System based on a Graph-Aware Deep Learning Network. ",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2021/best-paper-award-by-ieee-ias-icps-asia-2021"
 },
 {
  "text": "Events \n1 / 5\nThis year, the Research Student Gathering was incorporated with the Three Minute Thesis (3MT ®) Competition by the Faculty of Engineering held on 22nd May, 2023. In the competition, the oral presentations of all presenters were amazing. We really appreciated it. Cash prizes and certificates were awarded to the winners of the Competition (Champion: HK$1,000; First Runner-up: HK$500; Second Runner-up: HK$500; People’s choice Award: HK$500 (by audience ballot)). Congratulations to all the winners. We hope the judges, presenters, and audiences enjoyed the competition as we enjoyed putting it on for you. Thank you all for coming on that day. \nSample Quote Message\nSample Quote Person\nSample Quote Position",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2023/three-minute-thesis"
 },
 {
  "text": "We were delighted to have Professor Stefan Östlund, our Departmental Academic Advisor, to visit our Department on 17 and 18 April, 2023. He is the Vice President for global relations at KTH Royal Institute of Technology in Stockholm, Sweden. He teaches courses in electrical machines and drives, power electronics and electric railway traction. Also, he contributes his research effort in power electronics and drives with an emphasis on propulsion and power supplies for electric railway traction and electric vehicles. \nDuring the visit, Professor Stefan Östlund updated the teaching and learning issues with our Department staff members and shared much about electrical engineering with our undergraduate and postgraduate students. We would like to express how much his visit meant to us since his suggestions contributed immensely to the discussion. We are looking forward to meeting him again! \nFor more information about Professor Stefan Östlund , please click the link below: \nhttps://www.kth.se/profile/stefano",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2023/departmental-visit-by-professor-stefan"
 },
 {
  "text": "Events \nDigital Twins for Modern Power Electronics - Prof. Fei Gao\nDate: 25 May 2023 Thursday\nTime: 2:20 p.m. - 4:00 p.m.\nVenue: BC301, The Hong Kong Polytechnic University",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2023/digital-twins-for-modern-power-electronics"
 },
 {
  "text": "Events \nEvent details: \nDate: November 14, 2022 (Monday) \nTime: 3:00 p.m. to 5:00 p.m. \nVenue: In person in CF617 and online via Zoom \nTitle: Operation of Future Power Systems with High Penetration of IBRs: A Stability-constrained Optimization Approach Presenter: Dr TENG Fei (Adjunct Assistant Professor) \nJoin via Zoom Meeting link: https://polyu.zoom.us/j/92797550471?pwd=aml3eDlSZ3pxbVdaYU1CaG1WUlgzUT09 \nMeeting ID: 927 9755 0471 \nPasscode: 941332",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2022/research-seminar-by-dr-teng-fei"
 },
 {
  "text": "Resilient analysis and enhancement of power grids against extreme weather\nEvent details:\nDate: November 11, 2022 (Friday)\nTime: 2:00 to 3:00 p.m.\nVenue: Online via Zoom\nTitle: Resilient analysis and enhancement of power grids against extreme weather\nPresenter: LIU Hanchen (Visiting Research Student)\nJoin via Zoom\nMeeting link: https://polyu.zoom.us/j/97226991649?pwd=SDNUZ1BNaFdvV0VhTDRHS3Zrd2VyQT09\nMeeting ID: 972 2699 1649\nPasscode: 691568",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2021/resilient-analysis-and-enhancement-of-power-grids-against-extreme-weather"
 },
 {
  "text": "We are glad to have 13 of our new research postgraduate students attend the Department’s Orientation held on 6 September 2022 at P304. Even though Professor W. Jin, our DRC Chairman was unable to attend due to an urgent matter, we are pleased to have invited our new Department Head, Professor C.Y. Chung to welcome our new students to EE Family. He would like all new students not only to learn but also to enjoy the whole study period at PolyU. Since there are some programme structure and policy changes, Dr Kevin Chan, the Associate Head of the Department gave a short introduction about the Department as well as the whole programme particularly in course work and graduation requirements, departmental intranet, and some essential policies on de-registration, transfer of study, deferment etc.\nOnce again, we wish all new students to enjoy their research and learning journey in the Department.",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2022/departmental-orientation-for-new-research-postgraduate-students"
 },
 {
  "text": "Departmental Orientation\n1 / 5\nThis is the first year the Department launches its Scheme programme and we are pleased to invite our new Department Head, Professor C.Y. Chung to meet our freshmen in this Orientation held on 26 August 2022. There are totally 86 freshmen and 28 senior year students attended the orientation which was conducted in hybrid mode. Apart from Dean and Head’s welcome addresses, we have also invited Dr Kevin Chan, Scheme Leader, and other senior staff to greet our freshmen and introduce the programme details and various teaching and learning opportunities to come. \nWe hope that our students could enjoy their study in the Department. Once again, welcome them joining our EE Family.",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2022/departmental-orientation"
 },
 {
  "text": "The research seminar by ZENG Xuanke has been arranged as follows: \nYou are welcome to attend the seminar and raise questions during the \"Questions and Answers\" session. ",
  "url": "https://www.polyu.edu.hk/ee/news-and-events/events/2021/high-spatial-resolution-ultrafast-imaging-in-picosecond-and-femtosecond-time-scales"
 },
 {
  "text": "Behara, K. N., Bhaskar, A., and Chung, E. (2022). Geographical window based structural similarity index for origin-destination matrices comparison, Journal of Intelligent Transport Systems, DOI:10.1080/15472450.2020.1795651.\nHussain, E., Bhaskar, A. and Chung, E. (2022). Zone Prioritisation for Transit Improvement Using Potential Demand Estimated from Smartcard Data, Transportmetrica A: Transport Science, https://doi.org/10.1080/23249935.2022.2028930.\nLong, M., Zou, X., Zhou, Y. and Chung, E. (2022). Deep reinforcement learning for transit signal priority in a connected environment, Transportation Research Part C: Emerging Technologies, 142, https://doi.org/10.1016/j.trc.2022.103814.\nShirke, C., Sabar, N., Chung, E. and Bhaskar, A. (2022). Metaheuristic approach for designing robust traffic signal timings to effectively serve varying traffic demand. Journal of Intelligent Transportation Systems: Technology, Planning, and Operations, 26(3), pp. 343-355. https://doi.org/10.1080/15472450.2021.1878892.\nYu, H., Hegyi, A., Zhang, L., He, Z., Chung, E. and Liu, P. (2022). A new reinforcement learning-based variable speed limit control approach to resolve freeway jam waves, Transportation Research Part C: Emerging Technologies, 144, https://doi.org/10.1016/j.trc.2022.103900.\nZhang, C., Chung, E., Sabar, N., Bhaskar, A. and Ma, Y. (2022). Optimization of Variable Speed Limits at the Freeway Lane Drop Bottleneck, Transportmetrica A: Transport Science, https://doi.org/10.1080/23249935.2022.2033878.\nBevrani, K., Chung, E., and Teo, P. (2021). A Space-Based Approach towards Car-Following Safety Evaluation, Future Transportation, 1(3), pp. 443-465. https://doi.org/10.3390/futuretransp1030024.\nBehara, K. N., Bhaskar, A., and Chung, E. (2021). A DBSCAN-based framework to mine travel patterns from origin-destination matrices: Proof-of-concept on proxy static OD from Brisbane, Transportation Research Part C: Emerging Technologies, Volume 131,\n2021, 103370.\nBehara, K. N., Bhaskar, A., and Chung, E. (2021). Single-level approach to estimate Origin-Destination matrix: Exploiting turning proportions and partial OD flows, Transportation Letters: The International Journal of Transportation Research, https://doi.org/10.1080/19427867.2021.1932182.\nBehara, K. N., Bhaskar, A., & Chung, E. (2021). A novel methodology to assimilate sub-path flows in bi-level OD matrix estimation process, IEEE Transactions on Intelligent Transportation Systems, 22(11), pp. 6931-6941. DOI: 10.1109/TITS.2020.2998475.\nHussain, E., Behara, K. N., Bhaskar, A. and Chung, E. (2021). A framework for the comparative analysis of multi-modal travel demand: Case study on Brisbane network, IEEE Transactions on Intelligent Transportation Systems, https://doi.org/10.1109/TITS.2021.3076270.\nHussain, E., Bhaskar, A. and Chung, E. (2021). A novel origin destination based transit supply index: Exploiting the opportunities with big transit data, Journal of Transport Geography, 93, pp. 103040??.\nHussain, E., Bhaskar, A. and Chung, E. (2021). Transit OD matrix estimation using smartcard data: Recent developments and future research challenges, Transportation Research Part C: Emerging Technologies, 125, pp. ???).\nKan, Y. C., Hsu, L. T. and Chung, E. (2021). Performance evaluation on NDT map-based localization scan matching under point cloud occlusion, IEEE Sensors Letter, 5(3), pp. 1-4, https://doi.org/10.1109/LSENS.2021.3060097.\nPrabha Chandramouli, K., Zou, X., Chung, E. and Gyles, D. (2021) An end-to-end data driven model for coordinated ramp metering systems, Journal of the Eastern Asia Society for Transportation Studies, Vol. 14, pp. 2015-2027, https://doi.org/10.11175/easts.14.2015\nZhou, Y., Ozbay, K., Kachroo, P. and Chung, E. (2021). A supervised switching-mode observer of traffic state and parameters and application to adaptive ramp metering, Transportmetrica A: Transport Science, https://doi.org/10.1080/23249935.2021.1931550.\nZou, X., Zhang, S., Zhang, C., Yu, J. and Chung, E. (2021). Long-term Origin-Destination Demand Prediction with Graph Deep Learning, IEEE\nTransactions on Big Data, https://ieeexplore.ieee.org/document/9369004. \nBehara, K. N., Bhaskar, A., and Chung, E. (2020). A novel approach for the structural comparison of origin-destination matrices: Levenshtein distance, Transportation Research Part C: Emerging Technologies, 111, pp. 513-530.\nMalekzadeh, A. and Chung, E. (2020). A Review of Transit Accessibility Models: Challenges in Developing Transit Accessibility Models, International Journal of Sustainable Transportation, 14(10), pp. 733-748.\nSabar, N., Bhaskar, A., Chung, E., Turky, A. and Song, A. (2020). An Adaptive Memetic Approach for Heterogeneous Vehicle Routing Problems with Two-Dimensional Loading Constraints, Swarm and Evolutionary Computation, Vol. 58, November 2020, 100730.\nKieu, L.M., Ngoduy, D., Malleson, N. and Chung, E. (2019). A stochastic schedule-following simulation model of bus routes. Transportmetrica B: Transport Dynamics, 7(1), pp. 1588-1610.\nMalekzadeh, A. and Chung, E. (2019). A Review of Transit Accessibility Models: Challenges in Developing Transit Accessibility Models, International Journal of Sustainable Transportation, DOI:10.1080/15568318.2019.1625087\nMei, Y., Gu, W., Chung, E., Li, F. and Tang, K. (2019). A Bayesian approach for estimating vehicle queue lengths at signalized intersections using probe vehicle data, Transportation Research Part C: Emerging Technologies, 109, pp. 233-249.\nPickford, A. and Chung, E. (2019). The shape of MaaS: The potential for MaaS Lite. IATSS Research, 43(4), pp. 219-225.\nSabar, N., Bhaskar, A., Chung, E., Turky, A. and Song, A. (2019). A Self-adaptive Evolutionary Algorithm for Dynamic Vehicle Routing Problems with Traffic Congestion, Swarm and Evolutionary Computation, 44, pp. 1018-1027.\nShirke, C., Bhaskar, A. and Chung, E. (2019). Macroscopic modelling of arterial traffic: An extension to the cell transmission model, Transportation Research Part C: Emerging Technologies, 105, pp. 54-80.\nZhang, C., Sabar, N., Chung, E., Bhaskar, A. and Guo, X. (2019). Optimisation of lane-changing advisory at the motorway lane drop bottleneck. Transportation Research Part C, 106, pp. 303-316.\nZhou, Y., Cholette, M., Bhaskar, A. and Chung, E. (2019). Optimal Vehicle Trajectory Planning with Control Constraints and Recursive Implementation for Automated On-Ramp Merging, IEEE Transactions on Intelligent Transportation Systems, 20(9), pp. 3409-3420.\nZhou, Y., Chung, E., Bhaskar, A. and Cholette, M. (2019). A state-constrained optimal control based trajectory planning strategy for cooperative freeway mainline facilitating and on-ramp merging maneuvers under congested traffic. Transportation Research Part C, 109, pp. 321-342.\nJiang, R., Lee, J. and Chung, E. (2018). Proportional-derivative (PD) controller for heuristic rule-based motorway coordinated ramp meters. KSCE Journal of Civil Engineering, 2018, 22(9), pp. 3644–3652.\nTajtehranifarda, H., Bhaskar, A., Nassir, N., Haque, M. and Chung, E. (2018). A path marginal cost approximation algorithm for system optimal quasi-dynamic traffic assignment. Transportation Research Part C: Emerging Technologies, 88, pp. 91–106.\nWallner, G., Kriglsteina, S., Chung, E. and Kashfi, S. (2018). Visualisation of trip chaining behaviour and mode choice using household travel survey data. Public Transport, 10(3), pp 427–453.\nGuo, H., Bhaskar, A., Casey, B., Miska, M. and Chung, E. (2017). An Innovative Framework for Customised Intermodal and Multiobjective Trip Planner, International Journal of Intelligent Transportation Systems Research, 15(2), pp. 117–125.\nKieu, L.M., Bhaskar, A., Cools, M. and Chung, E. (2017). An investigation of timed transfer coordination using event-based multi agent simulation. Transportation Research Part C: Emerging Technologies, 81, pp. 363-378.\nMichau, G., Nantes, A., Bhaskar, A. and Chung, E. (2017). Bluetooth data in urban context: Retrieving vehicle trajectories. IEEE Transactions on Intelligent Transportation Systems,18(9), pp. 2377-2386.\nMichau, G., Pustelnik, N., Borgnat, P., Bhaskar, A. and Chung, E. (2017). A primal-dual algorithm for link dependent origin destination matrix estimation. IEEE Transactions on Signal and Information Processing over Networks, 3(1), pp. 104-113. \nSabar, N., Kieu, L.M. and Chung, E., Tsubota, T., & Maciel de Almeida, P. E. (2017). A memetic algorithm for real world multi-intersection traffic signal optimisation problems. Engineering Applications of Artificial Intelligence, 63, pp. 45-53.\nKieu, L.M., Bhaskar, A., Almeida, P.E.M., Sabar, N.R. and Chung, E. (2017). Transfer demand prediction for timed transfer coordination in public transport operational control. Journal of Advanced Transportation, 50(8), pp. 1972–1989.\nMai, T., Jiang, R. and Chung, E. (2016). A C-ITS based lane changing advisory for weaving sections. Journal of Advanced Transportation, 50(5), pp. 752-768.\nNantes, A., Ngoduy, D., Bhaskar, A., Miska, M. and Chung, E. (2016). Real-time traffic state estimation in urban corridors from heterogeneous data. Transportation Research Part C: Emerging Technologies, 66, pp. 99-118.\nTajtehranifard, H., Bhaskar, A., Haque, Md. M. and Chung, E. (2016). Motorway Crash Duration and its Determinants: Do Durations Vary Across Motorways?. Journal of Advanced Transportation, 50(5), pp. 717-735.\nTang, K., Dong, K. and Chung, E. (2016). Queue discharge patterns at signalized intersections with green signal countdown device and long cycle length. Journal of Advanced Transportation, 50(8), pp. 2100–2115.\nAbedi, N., Bhaskar, A. and Chung, E. (2015). Assessment of antenna characteristic effects on pedestrian and cyclists travel-time estimation based on Bluetooth and WiFi MAC addresses. Transportation Research Part C: Emerging Technologies, 60, pp. 124–141.\nBhaskar, A., Kieu, L.M. and Chung, E. (2015). Is bus overrepresented in Bluetooth MAC Scanner data? Is MAC-ID really unique? International Journal of Intelligent Transportation Systems Research, 13(2), pp. 119-130.\nBhaskar, A., Qu, M. and Chung, E. (2015). Bluetooth Vehicle Trajectories by Fusing Bluetooth and Loops: Motorway Travel Time Statistics. IEEE Transactions on Intelligent Transportation Systems, 16(1), pp. 113-122.\nCasey, B., Bhaskar, A., Guo, H. and Chung, E. (2015). Design and Implementation of an Intermodal Trip Planner. Road & Transport Research: A Journal of Australian and New Zealand Research and Practice, 24(4), pp. 45-58.\nJiang, R. and Chung, E. (2015). A Ramp Metering Strategy for Rapid Congestion Recovery. Computer-Aided Civil and Infrastructure Engineering Journal, 30(3), pp. 202-216.\nJiang, R. and Chung, E. (2015). A multi-hierarchical strategy for on-ramp coordination. International Journal of Intelligent Transportation Systems, 15(1), pp. 50-62.\nKieu, L.M., Bhaskar, A. and Chung, E. (2015). Public transport travel time variability definitions and monitoring. ASCE Journal of Transportation Engineering, 141(1), https://doi.org/10.1061/(ASCE)TE.1943-5436.0000724.\nKieu, L.M., Bhaskar, A. and Chung, E. (2015). Empirical modelling of the relationship between bus and car speeds on signalised urban networks. Transportation Planning and Technology, 38(4), pp. 465-482.\nKieu, L.M., Bhaskar, A. and Chung, E. (2015). A modified Density-Based Scanning Algorithm with Noise for spatial travel pattern analysis from Smart Card AFC data. Transportation Research Part C: Emerging Technologies, 58B, pp. 193–207.\nNantes, A., Ngoduy, D., Miska, M. and Chung, E. (2015). Probabilistic travel time progression and its application to automatic vehicle identification data. Transportation Research Part B: Methodological, 81(1), PP. 131-145.\nTsubota, T., Bhaskar, A., Nantes, A., Chung, E. and V. Gayah (2015). Comparative Analysis of Traffic State Estimation ─ Cumulative Counts-based and Trajectory-based Methods. Transportation Research Record: Journal of the Transportation Research Board, 2491, pp. 43-52.\nAbedi, N., Bhaskar, A. and Chung, E. (2014). Tracking Spatio-temporal Movement of Human in Terms of Space Utilization Using Media Access Control Address Data, Applied Geography, 51, pp. 72-81.\nBhaskar, A., Qu, M. and Chung, E. (2014). Hybrid model for motorway travel time estimation - considering increased detector spacing. Transportation Research Record: Journal of the Transportation Research Board, 2442, pp. 71-84.\nBhaskar, A., Tsubota, T. and Chung, E. (2014). Urban traffic state estimation: Fusing point and zone based data. Transportation Research Part-C: Emerging Technology, 48, PP. 120-142.\nCasey, B., Bhaskar, A., Guo, H., & Chung, E. (2014). Critical review of time dependent shortest path algorithms, an intermodal trip planner perspective. Transport Reviews, 34(4), pp. 522-539.\nJi, Y., Jiang, R., Qu, M. and Chung, E. (2014). Traffic Incident Clearance Time and Arrival Time Prediction Based on Hazard Models. Mathematical Problems in Engineering, http://dx.doi.org/10.1155/2014/508039.\nJi, Y., Jiang, R., Chung, E. and Zhang, X. (2014). The impact of incidents on macroscopic fundamental diagram. Proceedings of the Institution of Civil Engineers - Transport, 168(5), pp. 396-405.\nKieu, L.M., Bhaskar, A. and Chung, E. (2014). Passenger segmentation using smart card data. IEEE Transactions on Intelligent Transportation Systems, 16(3), pp. 1537-1548.\nLiu, Q., Chung, E. and Zhai, L. (2014). Fusing moving average model and stationary wavelet decomposition for automatic incident detection: case study of Tokyo Expressway. Journal of Traffic and Transportation Engineering (English Edition), 1(6), pp. 325-337.\nNantes, A., Miska, M., Bhaskar, A. and Chung, E. (2014). Noisy Bluetooth traffic data? Road and Transport Research Journal, 23(1), p33-43.\nTsubota, T., Bhaskar, A. and Chung, E. (2014). Macroscopic Fundamental Diagram for Brisbane, Australia: empirical findings on network partitioning and incident detection. Transportation Research Record: Journal of the Transportation Research Board, 2421, pp. 12-21.\nBhaskar, A. and Chung, E. (2013). Fundamental understanding on the use of Bluetooth scanner as a complementary transport data. Transportation Research Part C: Emerging Technology, 37, pp. 42-72.\nLee, J., Jiang, R. and Chung, E. (2013). Traffic queue estimation for metered motorway on-ramps using loop detector time occupancies. Transportation Research Record, 2396, pp. 45-53.\nTsubota, T., Bhaskar, A. and Chung, E. (2013). Traffic density estimation of signalised arterials with stop line detector and probe data. Journal of the Eastern Asia Society for Transport Studies, 10, pp. 1750-1763.",
  "url": "https://www.polyu.edu.hk/ee/docdrive/ecschung/Publications.html"
 },
 {
  "text": "EE4019B Intelligent Transport Systems",
  "url": "https://www.polyu.edu.hk/ee/docdrive/ecschung/Teaching.html"
 },
 {
  "text": "Current PhD Students\n· ZOU Xiexin\nApplication of Deep Learning and Transfer Learning for traffic parameters prediction.\n· LONG Meng \nOptimising transit signal priority using Reinforcement learning.\n· CHEN Jieming\nOn-ramp merging for CAV.\n· ZHAO Rong\nSignal-free intersection for mixed traffic.\n· TANG Zhixian\nSurrogate model for traffic signal network optimisation.\nCurrent Postdoc Fellow\n· XIAO Zhuang\nCurrent Project Members\n· BAO Yucheng\n· CHEN Junru \n· ZHANG Haolin \n· LI Chen\nPast Members\n· BI Xiaowen",
  "url": "https://www.polyu.edu.hk/ee/docdrive/ecschung/Members.html"
 },
 {
  "text": "News and Updates\nCongratulations to Dr. Darren TY ZHENG for the successful PhD thesis defense of \"Mechanisms of Phase Transformations in Aluminum Anodes for Lithium-based Batteries\"\" \nChemSusChem\nNew work by Dr. Darren TY ZHENG on \"Exploring the Reversibility of Phase Transformations in Aluminum Anodes through Operando Light Microscopy and Stress Analysis\" \nCongratulations to Dr. RAN Sijia for the successful PhD thesis defense of \"In Situ Mechanical and Electrical Testing of Piezoresistive Nanomaterials\" \nCongratulations to Dr. Virag Raut for the successful PhD thesis defense of \"Towards enabling shape memory ceramics: considerations for stress concentration optimisation through additive manufacturing\" \nNature Energy\nExciting collaboration with Prof. Tarascon and Dr. Huang at College de France to realize the start of a new era in battery sensing and real-time monitoring. See our PolyU Press Release as well! \nScripta Materialia\nNew work as part of collaborations with NTU and KIT exploring how polycrystalline Al transforms to become LiAl. Congratulations Darren for \"Granular phase transformation of polycrystalline aluminum during electrochemical lithiation\" \nJoule\nIs the composite design used for lithium-ion battery anodes nearing an end? Check out our recent Commentary in Joule to see why we think metal foils have too much upside to ignore. (Email directly for pdf) \nCongratulations to Dr. LI Bei for the successful PhD thesis defense of \"Capacitive Deionization of Brackish Water with Carbon-based Materials\" \nNano Letters\nCongratulations to Ms. RAN Sijia for her recent publication: The Limits of Electromechanical Coupling in Highly-Tensile Strained Germanium \nJournal of Materials Chemistry A\nCongratulations to Dr. Tahmasebi for his recent publication: In situ formation of aluminum–silicon–lithium active materials in aluminum matrices for lithium-ion batteries \nChemSusChem\nCongratulations to Mr. Darren Zheng for his recent publication: Improvement of the Cycling Performance of Al Anodes through Operando Light Microscopy and Kinetic Analysis \nOptics Express\nCongratulations to Dr. Julien Bonefacino for his recent publication: Impact of high UV fluences on the mechanical and sensing properties of polymer optical fibers for high strain measurements \nTeam\nCurrent Members\nCAiRS\nMany exciting new things happening out of the Center for Advances in Reliability and Safety \nFormer Members\nDr. LI Bei\nNow at Institute of Botany, Jiangsu Province and Chinese Academy of Sciences \nPre-pandemic Outing\nOutputs",
  "url": "https://www.polyu.edu.hk/ee/boles/index.html"
 },
 {
  "text": "News and Updates\nCongratulations to Dr. Darren TY ZHENG for the successful PhD thesis defense of \"Mechanisms of Phase Transformations in Aluminum Anodes for Lithium-based Batteries\"\" \nNew work by Dr. Darren TY ZHENG on \"Exploring the Reversibility of Phase Transformations in Aluminum Anodes through Operando Light Microscopy and Stress Analysis\" \nCongratulations to Dr. RAN Sijia for the successful PhD thesis defense of \"In Situ Mechanical and Electrical Testing of Piezoresistive Nanomaterials\" \nCongratulations to Dr. Virag Raut for the successful PhD thesis defense of \"Towards enabling shape memory ceramics: considerations for stress concentration optimisation through additive manufacturing\" \nNature Energy\nExciting collaboration with Prof. Tarascon and Dr. Huang at College de France to realize the start of a new era in battery sensing and real-time monitoring. See our PolyU Press Release as well! \nScripta Materialia\nNew work as part of collaborations with NTU and KIT exploring how polycrystalline Al transforms to become LiAl. Congratulations Darren for \"Granular phase transformation of polycrystalline aluminum during electrochemical lithiation\" \nJoule\nIs the composite design used for lithium-ion battery anodes nearing an end? Check out our recent Commentary in Joule to see why we think metal foils have too much upside to ignore. (Email directly for pdf) \nCongratulations to Dr. LI Bei for the successful PhD thesis defense of \"Capacitive Deionization of Brackish Water with Carbon-based Materials\" \nNano Letters\nCongratulations to Ms. RAN Sijia for her recent publication: The Limits of Electromechanical Coupling in Highly-Tensile Strained Germanium \nJournal of Materials Chemistry A\nCongratulations to Dr. Tahmasebi for his recent publication: In situ formation of aluminum–silicon–lithium active materials in aluminum matrices for lithium-ion batteries \nCongratulations to Mr. Darren Zheng for his recent publication: Improvement of the Cycling Performance of Al Anodes through Operando Light Microscopy and Kinetic Analysis \nOptics Express\nCongratulations to Dr. Julien Bonefacino for his recent publication: Impact of high UV fluences on the mechanical and sensing properties of polymer optical fibers for high strain measurements \nTeam\nCurrent Members\nCAiRS\nMany exciting new things happening out of the Center for Advances in Reliability and Safety \nFormer Members\nDr. LI Bei\nNow at Institute of Botany, Jiangsu Province and Chinese Academy of Sciences \nPre-pandemic Outing\nOutputs",
  "url": "https://www.polyu.edu.hk/ee/boles/"
 },
 {
  "text": "“AI-based Probabilistic Stability Region Evaluation and Visualization”, 17th International Conference on Probabilistic Methods Applied to Power Systems 2020 (PMAPS 2022), Manchester, UK, 06/2022 \n“AI-based Security Assessment of Smart Grid to Enable a Carbon Neutrality Future”, CAiRS Technical Seminar on AI-based Reliability & Safety Transforming Smart Manufacturing and Smart City with Applications, Science Park, Kowloon, Hong Kong, 05/2022\n“Data-driven Frequency Violation Risk Assessment and Visualization for Operational Planning”, IEEE PES Day Workshop on Power System Development and Transformation under the Goal of Carbon Neutrality, Nanjing, China, 04/2022 \n“Risk Assessment and Mitigation on Frequency Stability for Operational Planning of Renewable-rich Power Systems”, IEEE Sustainable Power and Energy Conference 2021 (iSPEC2021), Nanjing, China, 12/2021 \n“Stable Operation of Decarbonized Smart Grid”, Belt and Road Professional Development Programme in Power and Energy, Hung Hom, Kowloon, Hong Kong, 10/2021\n“Power System Stability as Affected by Renewable Energy Integration: Challenges, Understandings and Solutions”, RISE Series Webinar in District Energy Systems and Smart Grid, Hung Hom, Kowloon, Hong Kong, 08/2021\n“Power System Stability Analysis Considering Renewable Energy Integration”, SPARC Sponsored Online Short-term Course on “Sustainable Power Systems”, Tamilnadu, India, 06/2021\n“Data-driven Techniques in Enhancing Reliability and Security of Power Networks”, CAiRS Webinar on System Reliability and Maintenance - Key Success Factors for Your Business, Science Park, Kowloon, Hong Kong, 01/2021 \n“Intelligent Operation of Modern Power Systems”, SPARC Sponsored E-Workshop on Recent Trends in Operation and Planning of Distribution System and Microgrids, Tamilnadu, India, 01/2021\n“Stability Analysis and Operation Control of Power Electronized Power Systems”, SPARC Sponsored E-Workshop on Recent Trends in Operation and Planning of Distribution System and Microgrids, Tamilnadu, India, 01/2021 \n“Application of AI in Operation and Control of Power Systems”, Shanghai University, Shanghai, China, 12/2020\n“Mechanism Investigation and Mitigation of Modal Resonance in Wind Penetrated Power Systems”, Shanghai University, Shanghai, China, 11/2020 \n“Oscillatory Stability Analysis and Control of Wind Penetrated Power Systems”, IEEE Sustainable Power and Energy Conference 2020 (iSPEC2020), Chengdu, China, 11/2020 \n“Application of AI in the Reliability and Security Enhancement of Power Grids”, Belt and Road Professional Development Programme in Power and Energy, Hung Hom, Kowloon, Hong Kong, 09/2020 \n“Energy Market and Policy”, IET Hong Kong Student Section Technical Seminar, Hung Hom, Kowloon, Hong Kong, 07/2019\n“Operational Planning, Smart Dispatch and Stability Control of High Power Electronic Penetrated Power Systems”, Sichuan University, Chengdu, China, 05/2019\n“Technical Solutions to Enable a High Renewable Penetrated Future Grid”, Southeast/Northeast University, Nanjing/Shenyang, China, 12/2018 \n“Mitigating the Intermittence Impact of Renewable Energy in Future Electricity Networks – TSO and DSO Solutions”, IEEE 2nd International Electrical and Energy Conference 2018 (CIEEC2018), Beijing, China, 11/2018 \n“Investigation on Economic and Reliable Operation of Hybrid AC/DC Power System as Impacted by Offshore Wind Farms”, International Conference of IEEE PES ISGT ASIA 2018, Suntec Convention & Exhibition Center, Singapore, 05/2018\n“Current Status and Future Challenges of Power Market Operation in UK – A Brief Overview”, International Workshop on Smart Power and Energy Systems, Nanyang Technological University, Singapore, 05/2018\n“Operation of UK Power Transmission Network and Electricity Market”, IET Hong Kong PES Technical Seminar, University of Hong Kong, Hong Kong, 05/2018\n“Energy Forecasting Challenge for Future UK Transmission System Planning – A Brief Insight”, UK EPSRC Global Challenge Research Fund (GCRF) Award Workshops, Hangzhou, China, 11/2016 \n“UK Transmission System Operation and Planning – A brief”, HKIE Technical Seminar, Hung Hom, Kowloon, Hong Kong, 11/2016",
  "url": "https://www.polyu.edu.hk/ee/siqibu/index.html"
 },
 {
  "text": "Home\nResearch\nTeam\nTeaching\nR&D_Projects \nPublications\nPost_Vacancy\nTeaching\nDoctor Course\nSpecial Topic Guided Course\nMaster Course\nPower System Analysis and Dynamics\nPower System Control and Operation\nFinal Year Project Courses for MSc Students\nBachelor Course\nElectrical Energy Systems Fundamentals\nEnergy Policy and Management\nFinal Year Project Courses for BEng and Higher Diploma Students\nYour Visitor no. Pageviews",
  "url": "https://www.polyu.edu.hk/ee/siqibu/Teaching.html"
 },
 {
  "text": "Selected Journal Publications\nR. Q. Zhang, G. Q. Li, S. Q. Bu, S. Aziz and R. Qureshi, “Data-driven cooperative trading framework for a risk-constrained wind integrated power system considering market uncertainties,” International Journal of Electrical Power and Energy Systems, 2022. (In Press)\nR. Q. Zhang, G. Q. Li, S. Q. Bu, G. Kuang, W. He, Y. X. Zhu and S. Aziz, “A hybrid deep learning model with error correction for photovoltaic power forecasting,” Frontiers in Energy Research, 2022. (In Press)\nR. Q. Zhang, G. Q. Li, S. Q. Bu, F. Liu and Y. X. Zhu, “Economic operation of multi-energy system based on adaptive learning rate firefly algorithm,” Integrated Intelligent Energy, 2022. (In Press)\nJisma M., V. Mohan, M. S. Thomas and S. Q. Bu, “Treynor Ratio guided risk-return model for TSO-DSO mutualism considering energy and price volatility,” Sustainable Energy Grids and Networks, 2022. (In Press)\nQ. F. Chen, N. Lin, S. Q. Bu, H. Y. Wang and B. H. Zhang, “Interpretable Time-adaptive Transient Stability Assessment Based on Dual-stage Attention Mechanism,” IEEE Trans. on Power Systems, 2022. (In Press)\nS. Q. Bu, L. G. Meegahapola, D. P. Wadduwage and A. M. Foley, “Stability and Dynamics of Active Distribution Networks (ADNs) with D-PMU Technology: A Review,” IEEE Trans. on Power Systems, 2022. (In Press)\nV. Mohan, A. M. Antonis, Jisma M., N. Krishnakumar, S. Q. Bu, “Tuning of Renewable Energy Bids based on Energy Risk Management: Enhanced Microgrids with Pareto-Optimal Profits for the Utility and Prosumers,” IET Energy Conversion and Economics, 2022. (In Press)\nX. G. Chen, X. Y. Yang, S. Q. Bu and Z. Q. Xu, “Capacity Allocation of Wind Farm Energy Storage System Considering Economic Function,” Power Generation Technology, vol. 43, no. 2, 2022.\nH. Li, S. Q. Bu, J. R. Wen and C. W. Fei, “Synthetical modal parameters identification method of damped oscillation signals in power system,” Applied Sciences, 2022. (In Press)\nB. Jayaprakash, M. R. Balwani, K. Thirumala, V. Mohan, S. Q. Bu and M. Sahoo, “Tariff Rationalization for Reactive Power and Harmonics Regulation in Low Voltage Distribution Networks,” Electrical Engineering, 2022. (In Press)\nV. Mohan, H. Ram, G. Patil, Jisma M, R. Unni, Nandakumar K, K. Thirumala, S. Q. Bu, “Policy assistance for adoption of residential solar PV in India: A stakeholder-centric approach for welfare optimization,” Energy Reports, 2022. (In Press) \nT. Ding, B. Venkatesh, H. Liu, E. Muljadi, P. W. Du, W. Freitas, A. Nassif, S. Q. Bu, R. Arani, M. F. Anjos and J. J. Qi, “Guest editorial: Future distribution grids and integrated energy systems (IES),” IET Generation, Transmission & Distribution, vol. 16, no. 8, 2022.\nZ. Q. Zhu, K. W. Chan, S. W. Xia and S. Q. Bu, “Optimal Bi-Level Bidding and Dispatching Strategy between Active Distribution Network and Virtual Alliances Using Distributed Robust Multi-Agent Deep Reinforcement Learning,” IEEE Trans. on Smart Grid, 2022. (In Press)\nJ. X. Wen, S. Q. Bu and F. X. Li, \"Two-Level Ensemble Methods for Efficient Assessment and Region Visualization of Maximal Frequency Deviation Risk,\" IEEE Trans. on Power Systems, 2022. (In Press)\nK. Zhang, B. Zhou, C. Y. Chung, S. Q. Bu, Q. Wang, N. Voropai, “A Coordinated Multi-Energy Trading Framework for Strategic Hydrogen Provider in Electricity and Hydrogen Markets,” IEEE Trans. on Smart Grid, 2022. (In Press)\nY. Hu, S. Q. Bu and J. Q. Luo, “Application of Energy Flow Analysis in Investigating Machine-side Oscillations of Full Converter-based Wind Generation Systems,” IET Renewable Power Generation, 2021. (In Press)\nB. Y. Liu, B. W. Zhou, D. S. Yang, G. D. Li, J. Cao, S. Q. Bu and T. Littler, “Optimal planning of hybrid renewable energy system considering virtual energy storage of desalination plant based on mixed-integer NSGA-III,” Desalination, 2021. (In Press) \nM. R. Balwani, K. Thirumala, V. Mohan, S. Q. Bu and M. S. Thomas, “Development of a Smart Meter for Power Quality-Based Tariff Implementation in a Smart Grid,” Energies, vol. 14, no. 19, 2021.\nM. J. Cui, F. X. Li, H. T. Cui, S. Q. Bu and D. Shi, “Data-Driven Joint Voltage Stability Assessment Considering Load Uncertainty: A Variational Bayes Inference Integrated with Multi-CNNs,” IEEE Trans. on Power Systems, 2021. (In Press) \nJ. X. Wen, S. Q. Bu and H. H. Xin, “Probabilistic Assessment on Area-level Frequency Nadir/Vertex for Operational Planning,” IEEE Open Access Journal of Power and Energy, 2021. (In Press) \nC. Lei, S. Q. Bu, Q. G. Wang, N. C. Zhou, L. J. Yang and X. F. Xiong, “Load Transfer Optimization Considering Hot-spot and Top-oil Temperature Limits of Transformers,” IEEE Trans. on Power Delivery, 2021. (In Press) \nS. Y. Gao, B. Zhou, K. W. Chan, S. Q. Bu, C. B. Li, N. Liu and C. Zhang, “Optimal Offering Strategy of Virtual Power Plant with Hybrid Renewable Ocean Energy Portfolio,” CSEE Journal of Power and Energy Systems, 2021. (In Press) \nB. W. Zhou, J. Y. Xia, D. S. Yang, G. D. Li, J. Xiao, J. Cao, S. Q. Bu and T. Littler, “Multi-time scale optimal scheduling model for active distribution grid with desalination loads considering uncertainty of demand response”, Desalination, vol. 517, 2021. \nY. Hu, S. Q. Bu, S. J. Yi, J. B. Zhu, J. Q. Luo and Y. L. Wei, “A Novel Energy Flow Analysis and its Connection with Modal Analysis for Investigating Electromechanical Oscillations in Multi-Machine Power Systems,” IEEE Trans. on Power Systems, 2021. (In Press)\nZ. Q. Zhu, K. W. Chan, S. Q. Bu, S. W. Or, X. Gao and S. W. Xia, “Analysis of Evolutionary Dynamics for Bidding Strategy Driven by Multi-Agent Reinforcement Learning,” IEEE Trans. on Power Systems, 2021. (In Press)\nJ. Q. Luo, Y, Q. Zou, S. Q. Bu and U. Karaagac, “Converter-Driven Stability Analysis of Power Systems Integrated with Hybrid Renewable Energy Sources,” Energies, vol. 14, no. 14, 2021.\nL. Meegahapola and S. Q. Bu, “Special Issue: “Wind Power Integration into Power Systems: Stability and Control Aspects,” Energies, vol. 14, no. 12, 2021. \nZ. P. Shen, J. B. Zhu, L. J. Ge, S. Q. Bu, J. B. Zhao, C. Y. Chung and C. S. Wang, “Variable-Inertia Emulation Control Scheme for VSC-HVDC Transmission Systems,” IEEE Trans. on Power Systems, 2021. (In Press)\nQ. Hu, S. Q. Bu, Z. L. Li, B. W. Zhou and D. S. Yang, “Cost-effective communication network planning considering performance of pinning-based secondary control in microgrids,” International Journal of Electrical Power and Energy Systems, 2021. (In Press)\nZ. Q. Zhu, K. W. Chan, S. Q. Bu, B. Zhou and S. W. Xia, “Real-Time interaction of active distribution network and virtual microgrids: Market paradigm and data-driven stakeholder behavior analysis,” Applied Energy, 2021. (In Press)\nJ. X. Wen, S. Q. Bu, F. X. Li and P. W. Du, “Risk Assessment and Mitigation on Area-Level RoCoF for Operational Planning,” Energy, 2021. (In Press)\nQ. Hu, S. Q. Bu and V. Terzija, “A Distributed P and Q Provision Based Voltage Regulation Scheme by Incentivized EV Fleet Charging for Resistive Distribution Networks,” IEEE Trans. on Transportation Electrification, 2021. (In Press)\nQ. Hu, Z. Q. Zhu, S. Q. Bu, K. W. Chan and F. X. Li, “A Multi-market Nanogrid P2P Energy and Ancillary Service Trading Paradigm: Mechanisms and Implementations,” Applied Energy, 2021. (In Press)\nJ. X. Wen, S. Q. Bu, Q. Y. Chen and B. W. Zhou, “Data Learning-based Frequency Risk Assessment in a High-penetrated Renewable Power System,” Power Generation Technology, 2021. (In Press)\nJ. Q. Luo, S. Q. Bu and C. Y. Chung, “Design and Comparison of Auxiliary Resonance Controllers for Mitigating Modal Resonance of Power Systems Integrated with Wind Generation,” IEEE Trans. on Power Systems, 2021. (In Press)\nY. Hu, S. Q. Bu, X. Zhang and C. Y. Chung, “Connection Between Damping Torque Analysis and Energy Flow Analysis in Damping Performance Evaluation for Electromechanical Oscillations in Power Systems,” Journal of Modern Power Systems and Clean Energy, 2020. (In Press)\nY. Wang, X. Y. Yang, J. F. Xu, S. Q. Bu, Z. Q. Xu, “Control Strategy of Civil Controllable Load Participating in Demand Response,” Power Generation Technology, vol. 41, no. 6, 2020. \nX. Y. Yang, Y. H. He, Q. Y. Chen, S. Q. Bu, Z. Q. Xu and T. Y. Xiao, “Review of Intelligent Charging and Discharging Control and Application of Electric Vehicles,” Power Generation Technology, 2020. (In Press)\nQ. Wang, S. Q. Bu, Z. Y. He and Z. Y. Dong, “Toward the Prediction Level of Situation Awareness for Electric Power Systems Using CNN-LSTM Network,” IEEE Trans. on Industrial Informatics, 2020. (In Press)\nT, Wu, S. Q. Bu, X. Wei, G. B. Wang and B. Zhou, “Multitasking multi-objective operation optimization of integrated energy system considering biogas-solar-wind renewables,” Energy Conversion and Management, Vol. 229, 2021. \nJ. Q. Luo, F. Teng and S. Q. Bu, “Stability-constrained Power System Scheduling: A Review,” IEEE Access, vol. 8, 2020. \nJ. Q. Luo, S. Q. Bu and J. B. Zhu, “Transition from Electromechanical Dynamics to Quasi-Electromechanical Dynamics Caused by Participation of Full Converter-Based Wind Power Generation,” Energies, vol. 13, no. 23, 2020.\nM. Kamel, F. X. Li, S. Q. Bu and Q. W. Wu, “A generalized voltage stability indicator based on the tangential angles of PV and load curves considering voltage dependent load models,” International Journal of Electrical Power and Energy Systems, Vol. 127, 2021.\nT. Zhou, Z. Chen, B. X. Ren, S. Q. Bu and P. Y. Wang, “Damping Torque Analysis of VSC-HVDC Supplementary Damping Controller for Small-Signal Stability,” IEEE Access, vol. 8, 2020.\nD. S. Yang, M. J. Ji, B. W. Zhou, S. Q. Bu and B. Hu, “Transient Stability Assessment of Power System Based on DGL-GAN,” Power System Technology, 2020. (In Press)\nJ. B. Zhu, Z. P. Shen, S. Q. Bu, Y. J. Li, X. L. Li, C. Booth, W. Qiu, H. J. Jia and C. S. Wang, “Coordinated Flexible Damping Mechanism with Inertia Emulation Capability for MMC-MTDC Transmission Systems,” IEEE Journal of Emerging and Selected Topics in Power Electronics, 2020. (In Press)\nJ. Q. Luo, S. Q. Bu and J. B. Zhu, “A Novel PMU-based Adaptive Coordination Strategy to Mitigate Modal Resonance between Full Converter-based Wind Generation and Grids,” IEEE Journal of Emerging and Selected Topics in Power Electronics, 2020. (In Press)\nJ. B. Zhu, S. X. Li, L. J. Yu, S. Q. Bu, Y. J. Li, Y. Z. Wang, Z. S. Deng, D. Liu, H. J. Jia and C. S. Wang, “Coherence Analysis of System Characteristics and Control Parameters for Hybrid HVDC Transmission Systems Based on Small-signal Modeling,” IEEE Journal of Emerging and Selected Topics in Power Electronics, 2020. (In Press)\nD. S. Yang, Q. Tang, B. W. Zhou, S. Q. Bu and J. Cao, “District Energy System Modeling and Optimal Operation Considering CHP Unit Dynamic Response to Wind Power Ramp Events,” Sustainable Cities and Society, 2020. (In Press)\nV. Mohan, S. Q. Bu, J. M., R. VC, K. Thirumala, M. S. Thomas and Z. Xu, “Realistic Energy Commitments in Peer-to-Peer Transactive Market with Risk Adjusted Prosumer Welfare Maximization,” International Journal of Electrical Power and Energy Systems, 2020. (In Press)\nS. W. Xia, M. Shahidehpour, K. W. Chan, S. Q. Bu and G. Y. Li, “Transient Stability-Constrained Optimal Power Flow Calculation with Extremely Unstable Conditions using Energy Sensitivity Method,” IEEE Trans. on Power Systems, 2020. (In Press)\nJ. X. Wen, S. Q. Bu, B. W. Zhou, Q. Y. Chen and D. S. Yang , “A Fast-Algorithmic Probabilistic Evaluation on Regional Rate of Change of Frequency (RoCoF) for Operational Planning of High Renewable Penetrated Power Systems,” Energies, vol. 13, no. 11, 2020.\nD. S. Yang, S. C. Zhang, B. W. Zhou and S. Q. Bu, “Consensus-Based Decentralized Optimization for Distributed Generators Power Allocation Over Time-Varying Digraphs in Microgrids,” IEEE System Journal, 2020. (In Press)\nB. Zhou, K. Zhang, K. W. Chan, C. B. Li, X. Lu, S. Q. Bu and X. Gao, “Optimal Coordination of Electric Vehicles for Virtual Power Plants with Dynamic Communication Spectrum Allocation,” IEEE Trans. on Industrial Informatics, 2020. (In Press)\nJ. B. Zhu and S. Q. Bu, “Guest Editorial: Challenges in Future Grid-Interactive Power Converters: Control Strategies, Optimal Operation, and Corrective Actions,” IET Renewable Power Generation, vol. 14, no. 5, 2020.\nX. Y. Yang, F. M. Liu, Q. Y. Chen, B. W. Zhou, S. Q. Bu and Z. Q. Xu, “Profit-Driven Ubiquitous Power Internet of Things,” Modern Electric Power, no. 1, 2020. \nJ. Q. Luo, S. Q. Bu and F. Teng, “An Optimal Modal Coordination Strategy to Mitigate Low Frequency Oscillation in High FCWG Penetrated Power Systems,” International Journal of Electrical Power and Energy Systems, 2020. (In Press)\nJ. Q. Luo, S. Q. Bu, J. B. Zhu and C. Y. Chung, “Modal Shift Evaluation and Optimization for Resonance Mechanism Investigation and Mitigation of Power Systems Integrated with FCWG,” IEEE Trans. on Power Systems, 2020. (In Press)\nQ. Wang and S. Q. Bu, “Deep Learning Enhanced Situation Awareness for High Renewable-Penetrated Power Systems with Multiple Data Corruptions,” IET Renewable Power Generation, 2020. (In Press)\nQ. Wang, S. Q. Bu and Z. Y. He, “Achieving Predictive and Proactive Maintenance for High-Speed Railway Power Equipment with LSTM-RNN,” IEEE Trans. on Industrial Informatics, 2020. (In Press)\nQ. Hu, S. Q. Bu, B. W. Zhou and P. Zhang, “A Fully Distributed Multi-Stage Voltage Regulation Strategy for Distribution Network Based on Intelligent Bus Terminal Technology,” Distributed Energy, vol. 4, no. 6, 2019.\nS. W. Xia, T. Lu, T. Du, G. Y. Li and S. Q. Bu, “Distributed Coordinated Operation Method of Plug-in Electric Vehicles in Micro Grid Considering Fluctuation of Wind Power,” Electric Power Construction, vol. 40, no. 6, 2019.\nL. G. Meegahapola, S. Q. Bu, D. P. Wadduwage, C. Y. Chung and X. Yu, “Review on Oscillatory Stability in Power Grids with Renewable Energy Sources: Monitoring, Analysis, and Control using Synchrophasor Technology,” IEEE Trans. on Industrial Electronics, 2020. (In Press)\nC. Lu, Y. W. Feng, C. W. Fei and S. Q. Bu, “Decomposed-coordinated framework with enhanced extremum Kriging for multicomponent dynamic probabilistic failure analyses,” IEEE Access, vol. 7, 2019.\nC. Lu, Y. W. Feng, C. W. Fei and S. Q. Bu, “Improved decomposed-coordinated Kriging modeling strategy for dynamic probabilistic analysis of multi-component structures,” IEEE Trans. on Reliability, 2019. (In Press)\nY. Liu, W. Du, L. Y. Xiao, H. F. Wang and S. Q. Bu, “Sizing Energy Storage Based on a Life-cycle Saving Dispatch Strategy to Support Frequency Stability of an Isolated System with Wind Farms,” IEEE Access, vol. 7, 2019.\nY. Hu, S. Q. Bu, B. Zhou, Y. Liu and C. W. Fei, “Impedance-Based Oscillatory Stability Analysis of High Power Electronics Penetrated Power Systems - A Survey,” IEEE Access, vol. 7, 2019.\nY. Liu, L. Y. Xiao, G. D. Yao and S. Q. Bu, “Pricing-Based Demand Response for a Smart Home with Various Types of Household Appliances Considering Customer Satisfaction,” IEEE Access, vol. 7, 2019.\nU. Karaagac, J. Mahseredjian, R. Gagnon, H. Gras, H. Saad, L. Cai, I. Kocar, A. Haddadi, E. Farantatos, S. Q. Bu, K. W. Chan and L. Wang, “A Generic EMT-type Model for Wind Parks with Permanent Magnet Synchronous Generator Full Size Converter Wind Turbines,” IEEE Power and Energy Technology Systems Journal, vol. 6, no. 3, 2019. \nS. Q. Bu, J. X. Wen and F. X. Li, “A Generic Framework for Analytical Probabilistic Assessment of Frequency Stability in Modern Power System Operational Planning,” IEEE Trans. on Power Systems, vol. 34, no. 5, 2019.\nJ. B. Zhu, S. Q. Bu, X. L. Li, E. Muljadi and V. Terzija, “Security and Optimization Rule-based Coordinated Generator Simultaneous Tap Changing Dispatch Scheme for Transmission Voltage Regulation,” International Journal of Electrical Power and Energy Systems, vol. 114, 2020.\nS. H. Huang, B. Zhou, S. Q. Bu, C. B. Li, C. Zhang, H. Z. Wang and T. Wang, “Robust fixed-time sliding mode control for fractional-order nonlinear hydro-turbine governing system,” Renewable Energy, vol. 139, 2018.\nY. C. Zhang, Y. Xu, S. Q. Bu, Z. Y. Dong, “Online power system dynamic security assessment with incomplete PMU measurements: A Robust White-Box Model,” IET Generation, Transmission & Distribution, vol. 13, no. 5, 2018.\nT. Zhou, Z. Chen, S. Q. Bu, H. R. Tang and Y. Liu, “Eigen-Analysis Considering Time-Delay and Data-Loss of WAMS and ITS Application to WADC Design Based on Damping Torque Analysis,” Energies, vol. 11, no. 11, 2018. \nS. W. Xia, S. Q. Bu, C. Wan, X. Lu, K. W. Chan and B. Zhou, “A fully distributed hierarchical control framework for coordinated operation of DERs in active distribution power networks,” IEEE Trans. on Power Systems, vol. 34, no. 6, 2019. \nX. Zhang, A. Bruce, V. J. Terzija, S. M. Rowland and S. Q. Bu, “Modeling the Development of Low Current Arcs and Arc Resistance Simulation,” IEEE Trans. on Dielectrics and Electrical Insulation, vol. 25, no. 6, 2018. \nS. W. Xia, S. Q. Bu, J. J. Hu, B. D. Hong, Z. Z. Guo and D. Y. Zhang, “Efficient transient stability analysis of electrical power system based on a spatially paralleled hybrid approach,” IEEE Trans. on Industrial Informatics, vol. 15, no. 3, 2018.\nS. W. Xia, S. Q. Bu, X. Zhang, Y. Xu, B. Zhou and J. B. Zhu, “Model reduction strategy of doubly-fed induction generator-based wind farms for power system small-signal rotor angle stability analysis,” Applied Energy, vol. 222, 2018.\nX. Zhang, J. B. Zhu, S. Q. Bu, Q. Li, V. J. Terzija and S. Rowland, “The Development of Low-Current Surface Arcs under Clean and Salt-Fog Conditions in Electricity Distribution Networks,” IEEE Access, vol. 6, 2018.\nS. W. Xia, K. W. Chan, X. Luo, S. Q. Bu, Z. H. Ding and B. Zhou, “Optimal sizing of energy storage system and its cost-benefit analysis for power grid planning with intermittent wind generation,” Renewable Energy, vol. 122, 2018.\nS. Q. Bu, X. Zhang, J. B. Zhu and X. Liu, “Comparison Analysis on Damping Mechanisms of Power Systems with Induction Generator Based Wind Power Generation,” International Journal of Electrical Power and Energy Systems, vol. 97, 2018.\nJ. B. Zhu, J. B. Hu, W. Hung, C. S. Wang, X. Zhang, S. Q. Bu, Q. Li, H. Urdal and C. D. Booth, “Synthetic Inertia Control Strategy for Doubly-Fed Induction Generator Wind Turbine Generators Using lithium-ion Supercapacitors,” IEEE Trans. on Energy Conversion, vol. 33, no. 2, 2018. \nZ. Chen, H. Chen, M. H. Zhang and S. Q. Bu, “Model, Characterization, and Analysis of Steady-State Security Region in AC/DC Power System with a Large Amount of Renewable Energy,” Energies, vol. 10, no. 8, 2017.\nS. W. Xia, S. Q. Bu, X. Luo, K. W. Chan and X. Lu, “An autonomous real time charging strategy for plug-in electric vehicles to regulate frequency of distribution system with fluctuating wind generation,” IEEE Trans. on Sustainable Energy, vol. 9, no. 2, 2018. \nB. Zhou, D. Xu, K. W. Chan, C. B. Li, Y. J. Cao and S. Q. Bu, “A two-stage framework for multiobjective energy management in distribution networks with a high penetration of wind energy,” Energy, vol. 135, 2017. \nS. Q. Bu, W. Du and H. F. Wang, “Model Validation of DFIGs for Power System Oscillation Stability Analysis,” IET Renewable Power Generation, vol. 11, no. 6, 2017.\nS. Q. Bu, W. Du, H. F. Wang, Y. Liu and X. Liu, “Investigation on Economic and Reliable Operation of Meshed MTDC/AC Grid as Impacted by Offshore Wind Farms,” IEEE Trans. on Power Systems, vol. 32, no. 5, 2017.\nY. Liu, W. Du, L. Y. Xiao, H. F. Wang, S. Q. Bu and J. Cao, “Sizing a Hybrid Energy Storage System for Maintaining Power Balance of an Isolated System with High Penetration of Wind Generation,” IEEE Trans. on Power Systems, vol. 31, no. 4, 2016. \nS. Q. Bu, W. Du and H. F. Wang, “Investigation on Probabilistic Small-signal Stability of Power Systems as Affected by Offshore Wind Generation,” IEEE Trans. on Power Systems, vol. 30, no. 5, 2015.\nS. Q. Bu, W. Du and H. F. Wang, “Probabilistic Analysis of Small-signal Rotor Angle/Voltage Stability of Large-scale AC/DC Power Systems as Affected by Grid-Connected Offshore Wind Generation,” IEEE Trans. on Power Systems, vol. 28, no. 4, 2013. \nJ. Cao, W. Du, H. F. Wang and S. Q. Bu, “Minimization of Transmission Loss in Meshed AC/DC Grids with VSC-MTDC Networks,” IEEE Trans. on Power Systems, vol. 28, no. 3, 2013.\nS. Q. Bu, W. Du, H. F. Wang, et al, “Power Angle Control of Grid-connected Doubly-fed Induction Generator Wind Turbines for Fault Ride-through,” IET Renewable Power Generation, vol. 7, no. 1, 2013.\nS. Q. Bu, W. Du, H. F. Wang, et al, “Probabilistic Analysis of Small-signal Stability of Large-scale Power Systems as Affected by Penetration of Wind Generation,” IEEE Trans. on Power Systems, vol. 27, no. 2, 2012. \nS. Q. Bu, W. Du and H. F. Wang, “An Improved Control Strategy with Ride-through Capability for Doubly Fed Induction Generators,” Journal of Electric Power Science and Technology, vol. 27, no. 1, 2012.\nW. Du, S. Q. Bu and H. F. Wang, “Effect of Stochastic Variation of Grid-connected Wind Generation on Power System Small-signal Probabilistic Stability,” Proceedings of the CSEE, vol. 31, 2011.\nSelected Conference Publications\nY. Hu and S. Q. Bu, “A Novel Energy Flow Analysis and its Connection with Modal Analysis for Investigating Electromechanical Oscillations in Multi-Machine Power Systems,” IEEE PES General Meeting Denver, 2022.\nV. Mohan, H. Ram, G. Patil, Jisma M, R. Unni, Nandakumar K, K. Thirumala, S. Q. Bu, “Policy assistance for adoption of residential solar PV in India: A stakeholder-centric approach for welfare optimization,” The 4th International Conference on Clean Energy and Electrical Systems, Tokyo, Japan, April, 2022.\nC. Y. Wang and S. Q. Bu, “Connections between Different Criteria of Small-signal Stability Analysis of Power Systems,” IEEE Sustainable Power and Energy Conference 2021 (iSPEC2021), 2021.\nY. You, Y. Hu and S. Q. Bu, “PMU Data Issues and Countermeasure Techniques in Cyber-physical Power Systems: A Survey,” IEEE Sustainable Power and Energy Conference 2021 (iSPEC2021), 2021.\nX. Li, Z. R. Zhang and S. Q. Bu, “Analysis of electricity experience for normal electric user in multi-area interconnected power system with gas station network attacked,” The 40th Chinese Control Conference, 2021.\nP. Zhang, S. Y. Wu, J. T. Li, S. Q. Bu, “Application of Emerging Information Technologies in Modern Energy Strategy Planning,” IEEE 4th Conference on Energy Internet and Energy System Integration (EI2), 2020.\nU. Karaagac, J. Mahseredjian, R. Gagnon, H. Gras, H. Saad, L. Cai, I. Kocar, A. Haddadi, E. Farantatos, S. Q. Bu, K. W. Chan and L. Wang, “A Generic EMT-type Model for Wind Parks with Permanent Magnet Synchronous Generator Full Size Converter Wind Turbines,” IEEE PES General Meeting 2020, Montreal, Canada, 2020.\nQ. Hu and S. Q. Bu, “Economic Frequency Regulation Based on Nanogrid Partition and Cost-Driven Droop Function: Enable A Scattered Microgird,” IEEE PES ISGT Asia, 2020.\nJ. Q. Luo, S. Q. Bu, J. X. Wen, Q. Hu, Y. Hu and Q. Wang, “Strong Resonance Identification and Mitigation in PMSG integrated Power Systems,” International Conference on Power, Energy and Electrical Engineering, 2019.\nW. Yuan, S. Q. Bu, J. Q. Luo and S. J. Yi, “Investigation on Impact of Virtual Synchronous Generator and Its Auxiliary Controller on Power System Frequency and Oscillation Stability,” The ICEE Conference, Hong Kong, 2019.\nQ. Hu, S. Q. Bu, S. W. Xia and H. Cai, “A Novel Voltage Regulation Strategy for Secure Operation of High Renewable Penetrated Distribution Networks with Different R/X and Topologies,” IEEE PES ISGT Asia, 2019.\nJ. Q. Luo, S. Q. Bu, J. X. Wen, Q. Hu, Q. Wang and Y. Hu, “Parameter Optimization of POM Tuning in Mitigating Modal Exclusion Effect on Power System Small Signal Stability,” The 18th HUST Annual Research Symposium, 2019.\nJ. X. Wen, S. Q. Bu, J. Q. Luo and Q. Hu, “Comparison of Two Coherency Identification Methods for Frequency Response Assessment on a Large-scale Power System with Fluctuating Wind Power Generation,” The 11th International Conference on Advances in Power System Control, Operation & Management (APSCOM), 2018\nC. J. Liu and S. Q. Bu, “Modelling and Design of a Virtual Energy Storage System (VESS) for Power System Frequency Regulation,” The 11th International Conference on Advances in Power System Control, Operation & Management (APSCOM), 2018.\nS. W. Xia, S. Q. Bu, X. Gao, X. Lu and X. Zhang, “A hybrid fully distributed generation dispatch approach for distribution network integrating with multiple DGs,” The 11th International Conference on Advances in Power System Control, Operation & Management (APSCOM), 2018.\nJ. Q. Luo, S. Q. Bu, J. X. Wen and Q. Hu, “Mechanism Investigation of Inertia Variation Impact on Power System Small Signal Stability,” The 11th International Conference on Advances in Power System Control, Operation & Management (APSCOM), 2018. \nJ. B. Zhu, W. Hung, S. Q. Bu, X. L. Li and S. P. Chang, “Design of Reactive Current Biased Current Regulator for VSC Systems to Improve Transient Decoupling Capability,” The 11th International Conference on Advances in Power System Control, Operation & Management (APSCOM), 2018. \nH. Cai, S. Q. Bu, Z. Y. Peng, C. Wu, W. M. Xi and W. C. Qi, “Consistency of damping torque and energy flow dissipation coefficient in oscillation stability analysis,” International Conference on Power System Technology (POWERCON), 2018.\nJ. X. Wen and S. Q. Bu, “Performance Evaluation of Coherency Identification Methods in Frequency Stability Analysis Based on A Novel Assessment Index,” 2018 IEEE 2nd International Electrical and Energy Conference, 2018. \nQ. Hu, H. Y. Li and S. Q. Bu, “The Prediction of Electric Vehicles Load Profiles Considering Stochastic Charging and Discharging Behavior and Their Impact Assessment on a Real UK Distribution Network,” Energy Procedia, 2018. \nS. Q. Bu, X. Zhang, S. W. Xia, Y. Xu, B. Zhou and X. Lu, “Reducing model complexity of DFIG-based wind turbines to improve the efficiency of power system stability analysis,” Energy Procedia, vol. 142, 2017. \nH. Cai, W. C. Qi, J. H. Huang, Z. J. Xie, S. Q. Bu, T. R. Yin and X. Wu, “Application of flexible alternating-current transmission system in Jiangsu power grid,” IEEE Electrical Power and Energy Conference 2017, Canada, 2017.\nT. R. Yin, X. Wu, S. Q. Bu, H. Cai, W. C. Qi, J. H. Huang and Z. J. Xie, “Analysis on operation conditions of UPFC in Nanjing western power system in 2016,” IEEE Electrical Power and Energy Conference 2017, Canada, 2017.\nY. C. Zhang, Y. Xu, S. Q. Bu and Z. Y. Dong, “Interpretable data-analytics for on-line power system dynamic security assessment with incomplete PMU measurements,” IET HK PES Power Symposium 2017, Kowloon, Hong Kong, 2017. \nB. W. Zhou, D. S. Yang, S. Q. Bu, G. H. Du and T. Littler, “The Impact of Electric Vehicle Uncertainties on Load Levelling in the UK,” IEEE PES General Meeting 2017, Chicago, USA, 2017. \nH. W. Xiao, W. Du, Y. T. Song, Q. Wang, J. Ding, D. Z. Chen, H. F. Wang and S. Q. Bu, “Wind-thermal-bundled power transmission by AC/DC system and coordinated control – A review,” IET AC and DC Power Transmission Conference 2016, 2016.\nX. F. Wang, H. F. Li, W. Du, H. F. Wang and S. Q. Bu, “Dynamic interactions of multiple functions of a power-angle controlled and vector-current controlled UPFC,” IET AC and DC Power Transmission Conference 2016, 2016.\nY. Zhang, H. F. Li, W. Du, Z. Chen, H. F. Wang and S. Q. Bu, “Coordinated damping control of phase angle controlled and vector controlled UPFC – a comparative study,” IET AC and DC Power Transmission Conference 2016, 2016.\nB. X. Ren, H. F. Li, W. Du, Z. Chen, H. F. Wang and S. Q. Bu, “Dynamic Performance of a Vector-current Controlled Unified Power Flow Controller Installed in a Real Chinese Power Network,” IET AC and DC Power Transmission Conference 2016, 2016.\nQ. Fu, W. Du, C. Chen, H. F. Wang and S. Q. Bu, “A new scheme for connecting a VSC-MTDC to an AC power system,” IET AC and DC Power Transmission Conference 2016, 2016.\nC. Chen, W. Du, S. Q. Bu and H. F. Wang, “Probabilistic Rotor Angular Stability Considering Renewable Power Generations – A Survey,” IET Renewable Power Generation Conference 2015, 2015.\nY. Ge, W. Du, T. Littler and S. Q. Bu, “Damping Torque Analysis of AVR in Large-scale Multi-machine Power Systems,” IET Renewable Power Generation Conference 2013, 2013.\nS. Q. Bu, W. Du, H. F. Wang, et al, “Hypothesis Testing of the Stochastic Model of Demand and Supply Power of Plug-in Electric Vehicles,” The 2nd International Conference on SUPERGEN, Hangzhou, China, 2012.\nS. Q. Bu, W. Du and H. F. Wang, “Probabilistic Analysis of Small-signal Stability of Power Systems – A Survey,” The 2nd International Conference on SUPERGEN, Hangzhou, China, 2012.\nW. Du, H. F. Wang, J. Cao, S. Q. Bu, et al, “Effectiveness of Damping Control Implemented by an Energy Storage System as Affected by the Line Loading Conditions,” IEEE PES General Meeting 2011, Detroit, USA, 2011.\nS. Q. Bu, W. Du, H. F. Wang, et al, “A Novel Control Strategy for the Doubly Fed Induction Generators to Improve Grid Fault Ride-Through Capability,” IEEE PES ISGT Europe 2011, Manchester, UK, 2011.\nS. Q. Bu, W. Du, H. F. Wang, et al, “Small-signal Probabilistic Stability of Power Systems Considering the Stochastic Uncertainty of Grid-connected Wind Farm,” IET Renewable Power Generation Conference 2011, Edinburgh, UK, 2011.\nW. Du, J. Cao, H. F. Wang, Y. X. Xiao and S. Q. Bu, “Modeling a Grid-connected SOFC Power Plant into a Multi-machine Power System,” IET Renewable Power Generation Conference 2011, Edinburgh, UK, 2011.\nS. Q. Bu, W. Du and H. F. Wang, “Capability of the HVDC Control and Modulation Systems in Damping Power System Oscillations,” The 16th International Conference on Electrical Engineering, Busan, Korea, 2010.\nW. Du, H. F. Wang and S. Q. Bu, “Damping of Power System Oscillation as Affected by Converter-based Battery Energy Storage Systems,” The 16th International Conference on Electrical Engineering, Busan, Korea, 2010.\nS. Q. Bu, Z. Chen, W. Du, et al, “Application of Eigensolution-Free Method in a Real Large-scale Power System,” The 7th WSEAS/IASME International Conference on Electric Power Systems, High Voltages, Electric Machines, Venice, Italy, 2007.\nBook & Book Chapter\nBook: Hybrid AC/DC Power Grids: Stability and Control Aspects,Springer Nature Publisher, 2022. \nBook: Wind Power Integration into Power Systems: Stability and Control Aspects, MDPI, 2021. \nBook: Small-Signal Stability Analysis of Power Systems Integrated with Variable Speed Wind Generators, Springer Nature Publisher, 2018. \nBook Chapter: Modeling and Control of Modern Power System Integrated with Renewable Energy, 2015",
  "url": "https://www.polyu.edu.hk/ee/siqibu/publication.html"
 },
 {
  "text": "Intelligent Control and Intelligent Optimization \nUtilize fully distributed control strategy for EV/DER/ESS to be connected to the distribution network/micro-grid to regulate system frequency and voltage and for VSG/VESS to provide dynamic support (intelligent demand side response)\nOptimal dispatch and control of distributed generations and smart loads based on various constraints of distribution network/Micro-grid with typical uncertainties \nElectricity, gas and heat energy coordination and synergy in microgrid market\nPeer to peer transactive energy trading by using new IT technologies\nMinimization of transmission loss of hybrid AC/VSC-MTDC grids\nGrid Integration of Renewable Energy Sources/Distributed Energy Resources and Power Electronic Converters \nApply FACTS/ESS/HVDC/VSG technology to improve system stability, control and operation \nHybrid ESS sizing and design to maintain power balancing and system frequency\nNormal/special HVDC technologies to improve system stability\nDamping torque analysis of hybrid AC/VSC-HVDC grids and POD controller design\nImpact assessment of renewable energy integration/penetration \nDeterministic analysis of power system dynamics considering the controllability/inflexibility of RESs \nProbabilistic/stochastic analysis of power system dynamics and operation considering the variability/uncertainties of RESs\nEnhancement of FRT capability of wind power generation",
  "url": "https://www.polyu.edu.hk/ee/siqibu/Research.html"
 },
 {
  "text": "Currently, our team is proactively recruiting international researchers and PhD/MPhil candidates to support the research to utilize the intelligent computation and data analytics in the power electronized cyber physical power system stability analysis and operation control. You will collaborate with international academic and project partners and develop novel computational and analytical techniques for the following research areas (but not limited to): \n1. Application of WAMS/PMU and Big Data technology in power system situational awareness (SA) for event detection and preventive control \n2. Application of Data Mining/Machine Learning in the power system stability margin prediction and power equipment predictive maintenance\n3. Optimal planning and fully distributed control of distributed energy resources (DERs) considering various constraints, uncertainties and market mechanisms of active distribution network (ADN)/micro-grid \n4. Probabilistic/stochastic analysis of power system dynamics considering various system uncertainties \n5. Mechanism analysis on emerging stability problems of power electronized power systems including transmission, distribution and micro-grid \n6. Cyber physical power system (CPPS) modeling and analysis \nPlease feel free to contact us if you have any interest in the relevant research opportunities. More research vacancies of our team in PolyU CAiRS can be found via:\nhttps://www.polyu.edu.hk/hro/job/en/aff-ass/CAiRS/cairs-rs-p2.1-2.pdf\nhttps://www.polyu.edu.hk/hro/job/en/aff-ass/CAiRS/cairs-r7-8-p2.1-2.pdf\nhttps://www.polyu.edu.hk/hro/job/en/aff-ass/CAiRS/cairs-rs-p3.3.pdf\nhttps://www.polyu.edu.hk/hro/job/en/aff-ass/CAiRS/cairs-r11-12-p3.3.pdf",
  "url": "https://www.polyu.edu.hk/ee/siqibu/Post.html"
 },
 {
  "text": "Project Title\nPeriod\nA Universal Probabilistic Analysis Methodology for Grid Oscillatory Risk Assessment and Visualization in Coexistent Transmission and Distribution System Operational Planning\n01/2020 – Present\nReal-time Estimation and Utilization of Frequency and Voltage Response of DERs based on T/D-PMUs: Towards a TSO and DSO Coordinated Smart Grid\n10/2019 – Present\nResearch Platform on Cyber-Physical System Experiment and Simulation\n06/2019 – Present\nPotential Peer to Peer Transactive Energy Market in Indian Power Distribution Systems\n03/2019 – Present\nDevelopment of A Novel Model-independent Monitoring and Analyzing System to Tackle Various Oscillations in High Power Electronic Converter-penetrated Power Systems\n01/2019 – Present\nMechanism Investigation on Impact of Full Converter Based Wind Generation on Power System Dynamic Angular Stability\n01/2018 – 12/2020\nInvestigation on Damping Mechanism of Hybrid AC/DC Power Systems Integrated with Renewable Energy\n06/2016 – 12/2020\nResearch on Adaptive Control Strategy with Probability-1 Stability for the Power System Connected with Large-scale Renewable Energy Resource \n01/2015 – 12/2017\nPower System Offline Stability Analysis Tool Commission Project \n02/2015 – 02/2016\nStability Analysis and Control of Power Networks with Large-scale Energy Storage \n01/2014 – 12/2015\nPower System Constraint Analysis Tool Automation \n05/2014 – 02/2016\nGB West-link HVDC Commissioning project \n06/2014 – 02/2016\nGB TCSC and MSC Commissioning Project \n08/2014 – 01/2015\nWind Power Generation Modeling and Reactive Power Management \n05/2013 – 02/2016\nBasic Research on Security and Efficient Utilization of Large-scale Renewable Energy in Smart Grid \n02/2012 – 12/2015\nThe EPSRC UK-China Joint Clean Energy Research \n01/2009 – 07/2012\nThe Mechanism Investigation of Grid Connection of Large-scale Wind Power Generation in Jiangsu Power Grid\n11/2010 – 10/2011\nThe Oscillation Stability Analysis and Secure Control Strategy of Large Receiving-end Power Systems\n01/2008 – 12/2008\nThe Oscillation Stability Analysis of Hybrid AC and DC Large Receiving-end Power Systems of East China Grid\n05/2007 – 10/2008\nThe Small-signal Stability Analysis and Control of Interconnected Grid\n08/2006 – 08/2007\nSmart Motor Controller Performance and System Energy Saving Analysis\n09/2005 – 03/2006",
  "url": "https://www.polyu.edu.hk/ee/siqibu/RD.html"
 },
 {
  "text": "Study \nUndergraduate Programmes \nmainland \nProgramme Code JS3170 \n124 (另加培训学分)\n电机工程学(荣誉)工学士组合课程主任\n陈家荣博士\nBSc, PhD, MIEEE, MIET\n电机工程学(荣誉)工学士学位课程主任\n卜思齐博士\n运输系统工程学(荣誉)工学士学位课程主任\n刘伯涛教授\nBASc, MASc, PhD\n电机工程学(荣誉)工学士组合课程设有以下学位课程: \n电机工程学(荣誉)工学士\n运输系统工程学(荣誉)工学士\n同学于第一学年及第二学年修毕共同科目，在第二或第三学年上学期完结前选择入读本组合课程内其中一个学位课程。\n同学可选读其中一个学位课程/主修科目，无须额外考核。\n电机工程学(荣誉)工学士学位课程的学生可以选择修读「人工智能及数据分析」副主修课程，详情请参阅「副主修」版面。\n本组合课程提供副修，如会计、商业、财务及管理等科目，拓展专业知识领域。\n入读本组合课程的内地学生，如在入学时未能获得大学提供的奖学金，仍有机会获得本系设立的奖学金。理大有权更改上述奖学金条款或取消奖学金。如有任何争议/分歧，理大保留最终决定权。\n电机工程学(荣誉)工学士组合课程提供以下两个学位课程:\n电机工程学(荣誉)工学士\n运输系统工程学(荣誉)工学士\n课程宗旨及学习成果\n电机工程学(荣誉)工学士学位课程提供电气工程（本地称「电机工程」）学科的专业训练，培养学生的综合能力，培育具全面素质的电气工程师。\n运输系统工程学(荣誉)工学士学位课程让学⽣学习运输⼯程的基本理论知识和应⽤技能。毕业后，学⽣能结合各个⼯程领域的理论和技术，为⼀⽇千⾥的运输业发展提供低成本、⾼效益的解决⽅案。运输系统⼯程学的专业应⽤⼴泛，相关⼈才需求殷切，因此，毕业⽣的就业前景⼴阔。\n​课程特色\n电机工程学(荣誉)工学士学位课程着重电力系统及电气控制方面的知识，辅以相关科目，如能源管理、屋宇电气工程、光电子学、铁道工程及电脑应用等。学生也要接受语文、经济及管理方面的训练。\n运输系统工程学(荣誉)工学士学位课程是香港唯⼀开办交通运输⼯程的本科课程。针对科学技术对运输系统⼯程的重要性，本课程注重学⽣对基本⼯程理论和最新科技的认识和掌握，同时加强理论与实践之结合，让学⽣积累解决实际问题的专业经验。",
  "url": "https://www.polyu.edu.hk/ee/study/undergraduate-programmes/mainland"
 },
 {
  "text": "Yong HU\nYong HU received the Bachelor Degree in Electrical Engineering and Automation from Agricultural University of Hebei, Baoding, Hebei Province, China, in 2014 and the Master Degree in Electrical Engineering from Beijing Jiaotong University, Beijing, China, in 2017. He is currently pursuing the Ph.D. Degree in Department of Electrical Engineering, The Hong Kong Polytechnic University, Kowloon, Hong Kong SAR. His research interests include probabilistic analysis of power system stability with renewable energy and optimal strategies to improve power system stability.\nJiangfeng ZHANG (Frida) \nJiangfeng ZHANG received her B.S. degree in Electrical Engineering and Automation from the Wuhan University of Science and technology, China, in 2017, and M.S. degree in Electrical Engineering from the Huazhong University of Science and Technology, China, in 2020. She is currently a PhD student in the Department of Electrical Engineering in the Hong Kong Polytechnic University. Her current research interests include?power system stability analysis.\nRuoheng WANG \nRuoheng WANG received his B.S. degree in measurement and control technology and instrument from the Wuhan Institute of Technology, China, in 2016, and M.S. degree in hydraulic engineering from the Huazhong University of Science and Technology, China, in 2018. He joined PolyU in 2020, and is now pursuing his Ph.D. degree with the Department of Electrical Engineering. His current research interests include data analytics and intelligent optimization for smart grid applications and renewable energy integration. \nChaoyun WANG \nChaoyun WANG received her BEng in Electrical Engineering and BBM in Business Administration from Xi'an Jiaotong University (China) in 2017. She then received her MEng in Electrical Engineering from Xi'an Jiaotong University (China) and CentraleSupélec (France) in 2020. She is currently a PhD student in the Department of Electrical Engineering in the Hong Kong Polytechnic University. Her research interests focus on optimization and uncertainty analysis of microgrids with penetration of renewable energy.\nChao HUANG (Carmel)\nChao HUANG received his BEng degree in Energy and Power Engineering from North China Electric Power University, Beijing, China, in 2019, and MSc degree in Mechanical and Automation Engineering from The Chinese University of Hong Kong, Shatin, Hong Kong, in 2020. He is currently pursuing a PhD degree in Department of Electrical Engineering, The Hong Kong Polytechnic University, Kowloon, Hong Kong. His research interests include application of artificial intelligence in power system as well as prognostics and health management of electrical apparatus.\nZhaoyuan WANG \nZhaoyuan WANG received his B.S. degree in Electrical Engineering and Its Automation from North China Electric Power University, China, in 2014, and M.S. degree in Electrical Engineering from Huazhong University of Science and Technology, China, in 2021. He is currently a PhD student in the Department of Electrical Engineering in the Hong Kong Polytechnic University. His current research interests include cyber-physical power system stability analysis.\nXianyu ZHOU (Sherry) \nXianyu ZHOU received her M.Eng. in Electrical Engineering from Northeastern University, China, in 2021, and B.Eng. in Electrical Engineering and Its Automation from North China Electric Power University, Beijing, China, in 2018. She is currently a PhD student in the Department of Electrical Engineering, the Hong Kong Polytechnic University. Her research interests include power system stability analysis.\nQifan CHEN \nQifan CHEN received his M.Eng. degree in Power System & Automation and B.Eng. degree in Electrical Engineering & Automation both from Fuzhou University, China, in 2021 and 2018, respectively. He is currently pursuing his Ph.D. degree in the Department of Electrical Engineering, The Hong Kong Polytechnic University, Kowloon, Hong Kong SAR. His research interests include the application of big data/machine learning in power systems stability analysis.\nChao LEI \nChao LEI received his B.S. degree in Agro-Mechanical Engineering from Sichuan Agricultural University in 2010 and M.S. degree in Electrical Engineering from Chongqing University in 2015. From 2015 to 2021, he was an electric power dispatcher working at State Grid Sichuan Electrical Power Company. He joined CAiRS as a Research Associate since 2021, Hong Kong SAR. His current research interests involve data analytics and convex optimization for renewable integration and smart grid applications.",
  "url": "https://www.polyu.edu.hk/ee/siqibu/Team.html"
 },
 {
  "text": "Nano Fabrication and Device\nSchematic diagram of the optical maskless lithography and some fabricated microstructures.\nNew emerging photonic devices demand the development of flexible and high-throughput nanofabrication approaches. We aim to develop rapid high-resolution microfabrication technologies based on fast developing high-performance lasers. Particularly we are developing optical maskless lithography, see the above schematic diagram of pattering of large-area surface and fabrication of novel 3D micro-/nano-structures.\nWith the developed laser nanofabrication platforms, we are developing various photonic devices, sensors and microsystem, e.g. micro-fluidic sensors, flexible optoelectronic devices and microsystem. Our ultimate goal is to fuse photonics with materials and nanotechnologies to develop cutting-edge optoelectronic devices and applications.",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/photonics-and-smart-materials/nano-fabrication-and-device"
 },
 {
  "text": "1 / 2\nCongratulations! The paper “Comparative Study of the Mass Transit Systems in Hong Kong and Shenzhen” which was completed by our student, Mr Chan Kei Chit, is awarded as one of the HKIE LTD Best Student Papers 2022. The year’s topic was “Smart Transport” and Kei Chit put his continued efforts and endless patience into his project on this topic. Ultimately, his hard work and determination have paid off, and we are truly grateful. We would like to thank HKIE LTD for honouring this meaningful award to Kei Chit. It must contribute so much to him towards his professional growth and career development. ",
  "url": "https://www.polyu.edu.hk/ee/achievements/awards-and-achievements/2023/best-student-papers"
 },
 {
  "text": "Fibre Sensors\nOptical fibre Gas Sensor\nFast response and highly sensitive hollow-core optical fibre methane sensor\n1. Periodic micro-channels (with 1cm separation) fabricated by a femtosecond Ti:sapphire laser.\n2. Insertion loss ~0.05 dB for each micro-channel.\n3. Response time ~ 3 sec.\n4. Sensitivity up to few ppm.\n5. This work was highlighted by NATURE PHOTONICS in 2010.\nDistributed gas sensing system\n1. We have carried out preliminary tests of a truly distributed gas detection system with a 75m long hollow-core photonic bandgap fibre (HC-PBF), a pulsed high power DFB laser and an OTDR module.\n2. Along the HC-PBF, micro-channels with separation of 1 m were introduced.\n3. With optical pulse of 10ns, spatial resolution ~ 1m is achieved.\n4. To our best knowledge, this is the first demonstration of absorption based fibre optic distributed gas sensor.\nGas detection with evanescent-wave quartz-enhanced photoacoustic spectroscopy\n1. Quartz-enhanced photoacoustic spectroscopy (QEPAS) draws an increasing interest for trace gas detection due to its simplicity, high sensitivity and low cost. We propose a new method for QEPAS gas detection by using the evanescent field of a tapered optical fibre.\n2. With 30 ms integration time, a minimum detectable concentration limit of 178 ppm C2H2 is obtained by using a taper with a waist diameter of 1.1 μm.\n3. With a thinner fibre taper and an additional acoustic resonator, the sensitivity can be further improved by 2-3 orders.\nDiffusion/concentration measurement of acetylene with solid-core PCF/ hollow-core PBF\n1. First demonstration of PCF and PBF gas sensors in 2002* and 2004**, respectively.\n2. Acetylene (C2H2) and air acted as two different gas species in the experiment.\n3. Sensitivity of 5ppm C2H2 was achieved with 5m solid-core PCF.\n4. Sensitivity of 6ppm C2H2 was achieved with 0.5m HC-PBF.\n* Y. L. Hoo, W. Jin, et al., Optical Engineering, 41(1), pp.8-9, 2002\n** Y. L. Hoo, W. Jin, et al., Sensors and Actuators B- Chemical, 105(2), pp.183-186, 2005 (available online at www.sciencedirect.com in 2004)\nMulti-point fibre optic gas detection system\nMultiplexing techniques for fibre optic gas sensor have been theoretically and experimentally investigated. They include spatial division multiplexing (SDM), time division multiplexing (TDM) and frequency modulated continuous wave (FMCW) multiplexing.\nThe systems with narrow band DFB/external cavity tunable lasers, coupled with simple micro-optic gas cells, wavelength modulation spectroscopy, various noise reduction and multiplexing techniques allows the practical demonstration of high sensitivity (i.e., 80ppm/Hz1/2 acetylene) multi-point (up to 100) gas detection.\nOptical Fibre Pressure/acoustic Sensors\nFibre-tip pressure/acoustic sensor with graphene diaphragm\n1. An extremely thin graphene film is transferred to the fibre end which acts as a reflective mirror.\n2. An air cavity thus a Fabry-Perot interferometer (FPI) is formed which acts as a pressure/acoustic sensor\n3. Pressure sensitivity: 1090 nm/kPa for a 100 nm film (minimum detectable acoustic pressure: 75 μPa/Hz)\n4. It is a record-high pressure responsivity being reported.\nHydrophone with special hollow-core photonic bandgap fibre (HC-PBF)\nfibre type\tConventional SMF\tStandard HC-PBF\tPolymer coated HC-PBF\t\nNR (dB re μPa-1)\t-349\t-335\t-320\t\nImprovement (dB)\t-\t14\t29\t\nOptical fibre Sensors for High Temperature Applications\nSapphire fibre Bragg gating sensor for high temperature measurement\n1. FBG was fabricated on sapphire fibre by using Ti:Sapphire femto-second laser.\n2. The FBG sensor can survive at temperature up to 1600 °C.\nHC-PBF long period grating (LPG) strain sensor\n1. LPG was fabricated on HC-PBF by using CO2 laser.\n2. The LPG can survive at a temperature up to 1200°C.\n3. Strain response ~0.7 pm/me.\nNovel in-fibre Photonic Microcells\nIn-fibre photonic microcells fabrication\n1. Novel in-line photonic microcells are made by post-processing stock photonic crystal fibres (LMA-10 from NKT Photonics).\n2. The fabrication process involves pressurization of selected air-hole of a PCF when it is been heated/tapered at a particular location along the fibre.\n3. The applications of these microcells for in-fibre accelerometers and gain and absorption cells.\nMicro in-fibre cantilever (accelerometer)\n1. An in-line microcell with a suspended core (SC) is firstly made by the flame brushing method.\n2. The SC is then cut by a femtosecond laser. The surrounded struts of one section are removed by scanning the focused femtosecond laser beam across them, resulting in a cantilever beam.\nIn-fibre gain and absorption cells\n1. We also made gain cells by drilling lateral micro-holes into the SC region and filling the microcell with laser dye, Rhodamin 6G.\n2. A ~3-dB amplification was achieved\nMicro/nanofibres\nLong-period gratings in wavelength-scale microfibres\n1. Conventional single mode fibre (SMF) was tapered by flame-brushing technique. LPGs were fabricated by use of a femtosecond IR laser to periodically modify the surface of the fibres.\n2. A strong resonant dip of 25dB was achieved with a 10-period LPG written on an MF of diameter 2.4mm.\n3. Potential applications: wavelength filters, gain equalizers for MF amplifiers, and wavelength-encoded evanescentwave biosensors.\nHighly birefringent optical microfibres\n1. Air-clad highly birefringent elliptical-shaped microfibres with transverse dimension down to wavelength and sub-wavelength scale are fabricated.\n2. The birefringence of such as microfibres is extraordinarily high and on the order of 10-2.\n3. Potential applications: polarization maintaining microfibre couplers, polarization stable microfibre loop resonators and filters, in-line microfibre polarimetric sensors and comb filters.\nFibre-tip Micro-Cavity Sensors\nMicro-cavity sensor for high-pressure measurement\n1. A novel fibre-tip micro-cavity pressure sensor was simply fabricated by use of a fusion splicer and a pressurizing gas chamber.\n2. Micro-cavities with wall thickness of a few micrometers demonstrated a pressure sensitivity of 315pm/MPa.\n3. The sensors have compact size, good mechanic strength, and high temperature stability up to 600°C.\nFabrication process of the micro-cavity sensor: (a) splicing a section of fused-silica capillary to single-mode fibre; (b) tapering the capillary under pressure; (c) break (melt) the taper by applying an electric arc; (d) cross-sectional microscope image of the capillary. The microscope image of fibre-tip micro-cavities with silica wall thickness (e) 6mm and (f) 2.2mm.\nTwo-mode PCF Devices and Sensors\nInvestigation on two-mode index-guided PCF \n1. We discovered that the index-guided highly-birefringent photonic crystal fibre (PCF) with proper structural parameters supports two guided modes over an unprecedented wavelength range of from 500nm to 2000nm. \n2. The two-mode fibres have many potential applications such as acousto-optic fibre-optic frequency shifters, tunable optical filters, wavelength tunable switches, add-drop multiplexers and dual-mode interferometric sensors. \n3. Our work was reported by Laser Focus World-Optoelectronics World News.\n1000 nm tunable acousto-optic filter (co-work with KAIST, Korea)\n1. An all-fibre acousto-optic tunable filter based on a two-mode photonic crystal fibre was demonstrated.\n2. The properties of photonic crystal fibre allow us to demonstrate a notch filter tunable from below 700 to 1700 nm with a single acoustic transducer.\n3. The extreme dynamic range coupled with small insertion loss and fast response time 100ms makes this device promising for ultrawideband optical systems.\nTuning range >1000nm\nApplications of Fibre Optic Sensors\nOn-Line Transformer Condition Monitoring (Dissolved Gas Detection)\nWe developed a fibre optic multi-gas detection system for dissolved gas measurement where three DFB lasers covering the absorption lines of methane (CH4), acetylene (C2H2) and ethylene(C2H4) have been employed. A low-cost multi-pass sensor head with interaction length of 1m have been fabricated. The loss of the sensor head was determined to be less than 8dB. The minimum detectable gas concentrations for methane, acetylene and ethylene are 5ppm, 1ppm and 50ppm respectively.\nPile and Sail Nails Stress Monitoring (co-work with CSE, HKPU)\n1. A fibre-optic technology based on low-coherence interferometry for measuring the length and quality of piles and soil nails was developed. \n2. A number of reflective markers are made along the sensing fibre at predetermined locations before it is installed in the piles or nails. Reflected waves from the two adjacent markers are made to interfere and the number of interference peaks detected at the system output is proportional to the number of reflective markers, from which variation in the length of the fibre embedded in the piles or soil nails can be determined. \n3. Advantages of the system: (i) reliable, (ii) low-cost; (iii) robust and convenient to use.\nFibre grating sensors for flow-induced structural vibration measurement (co-work with ME, HKPU)\n1. We have developed multi-point fibre grating sensors for flow-induced structural vibration measurement and have achieved near shot-noise limited performance. \n2. Our system can measure strain up to 3400me with a strain resolution of 30me / Hz1/2 (at 5kHz) and a frequency range of 100Hz to 10k. \n3. The number of citations of one of our articles received places in the top 1% within its field according to Essential Science IndicatorsSM.\na. Strain measured from FBG\nb. Displacement measured from vibrometer\nc. Wind velocity measured from hot-wire\nNovel optical fiber micro-structures and devices fabricated by femtosecond laser micromachining and their sensing applications\nBy use of femtosecond laser, various types of novel micro-structures have been created in optical fibers, including micro-hole, micro-hole structured long period fiber grating (LPFG), open micro-cavity structured fiber in-line Mach-Zehnder, Fabry-Perot and Michelson interferometers, and combined fiber micro-structures. Compared with conventional optical fiber sensors, these devices possess the advantages of compact device dimensions, relative high sensitivities and capable of performing unambiguous multiple parameter measurement.\nFBG writing by use of femtosecond laser via a phase mask.\nFemtosecond laser inscribed fiber Bragg grating (FBG) has shown excellent high temperature sustainability by relaxing residual stress or introducing compressive residual stress in the optical fiber.\nIn-fiber microstructures such as point-by-point inscribed gratings, micro-cavity interferometers and other structural devices have been fabricated by use of femtosecond laser micromachining.\nExperimental setup for femtosecond laser direct writing of optical fibers. CCD, charge-coupled device camera; MO, microscope objective; BS, beam splitter; W, half-wave plate; P, polarizer; M1, M2: optical mirrors.\nThe micro-hole-structured LPFG can be formed in different types of optical fibers such as single mode fiber (SMF) and photonic crystal fiber (PCF) by use of femtosecond laser micromachining. Fig. 3 shows the morphologies and the transmission spectrum evolution of the micro-hole–structured LPFG in SMF.\n(a) Morphology of an microhole-structured LPFG with the grating period of 450 μm.\n(b) Cross-section view of the grating pitch, i.e. the microholes.\n(c) Evolution of the transmission spectrum of the LPFG.\nFiber in-line interferometers based on the open air-cavity fabricated by femtosecond laser drilling in the fiber have been demonstrated such as the Fabry-Perot interferometer, Mach-Zehnder interferometer and Michelson interferometer.\nConfiguration of various fiber in-line interferometers fabricated by use of femtosecond laser micromachining. (a) Fabry-Perot interferometer; (b) Mach-Zehnder interferometer; (c) Michelson interferometer.\nFiber in-line Mach-Zehnder interferometers based on inner air-cavity have been developed by use of femtosecond laser micromachining and fusion splicing techniques, with good robustness and high temperature sensitivity.\nSchematic diagram of the fiber in-line Mach-Zehnder interferometer\nMoreover, a simultaneous three parameter measurement is achieved for the first time by use a pair of fiber internal mirrors based on inner air-cavity.\nSchematic diagram of the fiber in-line Mach-Zehnder interferometer\nMicroscope image and corresponding spectrum for the hollow sphere pair with separation of (a) 136.6 µm; (b)161.3µm (c) 184.8 µm; (d) 193.8µm (e) 265 µm. and (f) FSR versus the separation of the hollow sphere pair. Inset shows the path of the light reflected by the hollow sphere pair.\nOptical microfiber devices\nFBG has been successfully fabricated in microfiber for the first time by our efforts. Such a microfiber FBG can greatly enhance the functionality of microfiber and, owing to its direct exposure to the surrounding medium, a highly sensitive refractive index sensor can be obtained.\nMicroscope image of the microfiber with diameter of ~10 µm.\nReflection spectra of the FBGs in microfiber with diameter of 2, 4, 6, and 10 µm, respectively.\nMicrofiber in-line Mach-Zehnder interferometer is also constructed to achieve a highly compact and versatile sensing device.\n(a) The micro-hole fabricated by fs laser ablation at the center of cleaved SMF end facet. (b) The hollow sphere formed after fusion splicing with another section of cleaved SMF. (c) SEM image of the cross section view of the hollow sphere. (d) Microfiber with an inner air-cavity with length of L. (e) Transmission spectrum of the microfiber in (d).\nSelective liquid infiltrated photonics crystal fiber devices\nWith the assistance of femtosecond laser, selective infiltration of one of the air holes in the PCF is achieved and applied for temperature sensing with ultrahigh sensitivity.\nFlowchart of selective infiltration with the assistance of femtosecond laser micromachining. (1) Fusion splicing and laser cleaving; (2) laser drilling; (3) infiltration.\nExperimental setup and laser focusing process illustration. CCD, charge-coupled device camera; W, half-wave plate; P, polarizer; BS, beam splitter; MO, microscopic objective. The insets in the right panel show the images of the cleaved sample formed in the fusion splicing plane and the cleaved surface plane, respectively.\nMoreover, by selective infiltration of two adjacent air holes in the innermost layer of the PCF, a novel type of fiber in-line Mach-Zehnder interferometer can be constructed and used in ultrahigh sensitivity temperature sensor.\nCross section of PCF with two holes infiltrated\nTransmission spectra for different PCF lengths\nUltra-sensitive strain sensor has also been achieved by use of such a technique.\n(Color online) Cross section view of the selectively infiltrated PCF with embedded couplers. The red dotted circles highlight the hole filled with standard RI liquid.\nResonant wavelength shift with applied axial strain for (a) 31.3 oC, 1.46-RI liquid filled, (b) 25 oC, 1.506-RI liquid filled PCF, with lengths of 26 and 37 mm, respectively. The infiltrated holes of the samples are the same as that shown in Fig. 1. Insets shows their transmission spectra at different strains.\nOptical fiber laser source\nIn our recent work, a novel passively mode-locked fiber laser system based on a hollow-core photonic crystal fiber filled with few-layered graphene oxide solution is developed. Owing to the good solution processing capability of few-layered graphene oxide, a graphene saturable absorber can be successfully fabricated and used for passive mode-locking.\nExperimental setup for fiber pulsed laser with HC-PCF filled with FGO solution. Insets are the cross-section images of the HC-PCF before (right) and after (left) infiltration of FGO solution.\nMoreover, by using graphene film to cover microfiber to enhance light-graphene interaction, a tunable saturable absorber can be formed and used for wavelength tunable as well as pulse-width tunable passively mode-locked fiber laser. Such a system has high potential in tuning the mode-locked laser pulses across a wide wavelength range.\n(a) Schematic structure of the graphene-based saturable absorber. (b) Raman spectra of monolayer graphene. (c) The insertion loss of the graphene-based saturable absorber.",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/photonics-and-smart-materials/fiber-sensors"
 },
 {
  "text": "Self-Sustainable Magnetoelectric Smart Sensors for Electrical Condition Monitoring\nResearch & Technologies\nSome of Our Invented Smart Materials (From Bulk to Nano Scale)\n“Magnetoelectric” Smart Materials & Sensors\nTesting of Smart Sensor (13–200 A rms)\nCondition Monitoring of Power Distribution Systems\nTesting of Smart Sensor (13–200 A rms)\nCondition Monitoring of Railway Systems \nIn-train Monitoring of Traction System\nIn-train Monitoring of Wiper System\n25 kV–100 V Smart Voltage Transducer\nTraditional Voltage Transformers\n1. Bulky \n2. Expensive \n3. Low input impedance \n4. Susceptible to lightning\nSmart Voltage Transducer / Transformer\nAdvantages:\n1. Lightweight (~0.5 kg) \n2. Compact (~10 cm long) \n3. High input (primary) impedance (MΩ) \n4. Primary & secondary self-isolated \n5. Immune to lightening \n6. Open circuit on breakdown",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/photonics-and-smart-materials/smart-materials"
 },
 {
  "text": "Photonics\nOptical Fiber Communication\nThis is how we connect with each other, live our lives and interact with the world as of Today...\nThe following is expected to come in the near future\nFiber-optic Communications\nFiber-optic communications are the keystone to all forms of communication worldwide. The communication networks formed by optical fibers literally connect everyone on Earth together and continue to play increasing role in shaping our lives. An optical fiber consist of two layers of very pure glass called the core and cladding. In the core, extra materials such as Gemanium (Ge) is injected to make its refractive index higher than that of the cladding. Light then travels along the direction of fiber through an effect called total internal reflection. Now, to transmit digital information (1's and 0's), we can send a single light pulse to represent '1' and send nothing to represent '0'.\nAs we progress into the future, more and more of our activities will rely on faster and faster communications anywhere and anytime, and this is why research in high-speed optical communications is always an important area of research.\nAt PolyU, we integrate communication theory/signal processing with the experimental facilities in the PolyU Photonics Research Center. We conducted theoretical as well as experimental research on various aspects of coherent transmissions. Notable results/achievements in recent years include:\n1. World’s first few-mode EDFA for few-mode fiber transmission with world-record-breaking bit rates (Post-deadline paper, ECOC 2011, in collaboration with NEC Labs America)\n2. World’s longest 256 Gb/s PM-16QAM transmission experiment (Invited paper, OFC 2014, in collaboration with Corning Inc.)\n3. World’s highest spectral efficiency of 4.8 b/s/Hz (10 x 240 Gb/s PM-64-QAM over 160 km) for unrepeated transmission links 4. Fastest and most robust CD estimation for fast link startup and future dynamic optical network (in collaboration with Huawei 2013)\n5. World’s first blind and format-independent cycle-slip detection and correction algorithm future dynamic optical network (in collaboration with Huawei 2013)\nOur works are regularly featured in international prestigious conferences such as OFC, OSA SPPCom and leading journals including:\n1. E. Ip, A.P.T. Lau, D.J.F. Barros and J.M. Kahn (Invited), “Coherent Detection in Optical Fiber Systems,” Optics Express, pp. 753-791, Jan. 2008.\n2. L. Tao, Y. Ji, J. Liu, A.P.T. Lau, N. Chi and C. Lu (Invited), “Advanced Modulation Formats for Short Reach Optical Communication Systems,” IEEE Network Special Issue on Optical Networks in Cloud Computing, vol. 27, no. 6, pages: 6-13, Nov. 2013.\n3. A.P.T. Lau, Y. Gao, Q. Sui, D. Wang, Q. Zhuge, M. Morsy-Osman, M. Chagnon, X. Xu, C. Lu, and D. V. Plant (Invited) , “Beyond 100 Gb/s: Advanced DSP Techniques Enabling High Spectral Efficiency and Flexible Optical Communications” IEEE Signal Processing Magazine: Special Issue on Advanced DSP and Coding for Multi-Tbs Optical Transport, Mar. 2014.\nAs a result of our strong collaboration with industry, we also jointly own several patents with companies such as Huawei and some of our research results are under further developments as the defining technology for next generation commercial optical transponders.\nIn particular, we focus on three major areas of optical communications which are described below in further detail.\nAnalytical modelling, experimental demonstrations for digital coherent communication systems with digital signal processing\nWith the advent of coherent detection and advanced electronic signal processing techniques, cost-effective improvements in fiber-optic communication systems over the next decade will depend increasingly on advanced communication techniques that enhance spectral efficiency and robustness against transmission impairments. In the fiber-optic channel however, the complexity of the interactions between different propagation effects such as chromatic dispersion(CD), Kerr nonlinearity, polarization mode dispersion(PMD) and noise generated by optical amplifiers and laser severely limit the effectiveness and relevance of directly applying well developed signal processing techniques from the wireless or copper-wire literature. We seek to characterize signal propagations in optical fiber from a communication theory point of view. The nature of various system impairments to signal transmission are investigated and appropriate communication and signal processing techniques are developed and shown to significantly improve system performance. These signal processing techniques that is tailored for fiber optic links thus pave the way to practical realization of next generation fiber-optic communications.\nOptical Performance Monitoring for future optical networks\nThe emergence of reconfigurable optical networks offers the potentials for increased flexibility, reduced network operation and maintenance costs, and better exploitation of available transmission capacity by enabling features like automatic path provisioning, fault identification and management, impariment-aware routing and network resources optimization. However, the realization of such potential features demands precise and incessant information about the extent of physical impairments such as optical signal-to-noise ratio (OSNR), chromatic dispersion (CD) and polarization-mode dispersion (PMD) to the transmitted signal and where they originate across the network. Therefore, acquiring real-time knowledge of such physical impairments, or Optical Performance Monitoring (OPM), will be indispensable for the efficient operation and management of such complex dynamic optical networks. As point-to-point communication links is moving towards coherent detection, new OPM techniques specific for coherent systems will be required to further leverage and integrate new transmission strategies in future optical networks.\nNext generation optical fibers for long-distance transmission\nEver since the idea of using optical fiber for long-distance information transmission was proposed back in 1966, countless efforts have been made to produce better fibers that reduce signal attenuation or loss during transmission. Transmission fibers having loss coefficients of less than 0.2 dB/km (more than half of the optical power is retained after 15 km of transmission) has been realized over 15 years ago and was already close to theoretical limits. With the advent of technologies such as coherent detection and our ever-increasing bandwidth demand over the past few years , we have totally 'maxed out' the transmission capacities provided by current fibers. Fiber nonlinearity effects and spatial compactness issues seem to be preventing us from going further and prompts researchers to come back and re-think about the transmission medium - the fiber itself. With this objective in mind, we seek to analytically model and derive new fiber designs such as few-mode fibers (FMF) and multi-core fibers that can provide higher bandwidth and spatial compactness compared with conventional fibers. We will map the physics of electromagnetic waves propagation in optical waveguides and communication theories into interesting fiber structures that provide multi-fold improvements in transmission performances. The fiber designs will also be fabricated with our in-house fiber drawing tower and long-distance performance of these next generation fibers will be experimentally characterized.\nMajor developments\nEver since the idea of using optical fiber for long-distance information transmission was proposed back in 1966, countless efforts have been made to produce better fibers that reduce signal attenuation",
  "url": "https://www.polyu.edu.hk/ee/research/research-themes-and-strength/photonics-and-smart-materials/optical-fiber-communication"
 }
]