[
 {
  "text": "關鍵詞 \nSpecialist Lecture on Chinese History and Culture (5)\n內容簡介： 宣統年間（1909-1911），袁世凱（1859-1916）在攝政王載灃排擠下歸隱彰德府洹上村，與門生故舊唱和，以示無心世務。這些詩作被袁氏次子袁克文（1890-1931）輯錄於《圭塘唱和詩》… \n2023年5月24日\n港澳珠三角地區研究生中國歷史文化研修系列 (春季) 下午\n講座簡介： 這次演講的前半部份通過比較李綱與另一士人孫覿於建炎末和紹興初年被貶期間致與朝中大臣的書信，揭示兩人如何取悅朝中重臣從而得以復官。儘管兩人在信中採用類似的修辭以巴結朝臣… \n2023年5月20日\n港澳珠三角地區研究生中國歷史文化研修系列 (春季) 上午\n講座簡介： “匠人”長期以來被看作是代表著隨著現代工業時代的到來而消失的勞作和生活方式。當代中國逐漸進入後工業社會之後，爲什麽在文藝、影視以及流行文化中會出現呈現“匠”的熱潮呢？而後工… \n2023年5月20日\nDistinguished Lectures on Chinese Culture and Religion (3)\n講座摘要： 講座主要講述嶺南文化形象的歷史變遷，主要對嶺南的地域範圍、歷史發展 文化形象的演變做出梳理，以期為當代粵港澳大灣區“人文灣區”建設提供參考。\n2023年4月28日\nLecture Series of Prominent Chinese Writers (1)\n個人簡介 阿來，中國當代著名作家，同时，他是詩人，是學者，是古早驢友，是環保主義者，是攝影愛好者，還曾經擔任一份科幻刊物的主編。深受藏漢兩種文化薰陶的阿來，擅長用漢語書寫藏地的文… \n2023年4月26日\nSpecialist Lecture on Chinese History and Culture (4)\n內容簡介： 北宋時期大量人口湧入東京，既帶來城市經濟的繁榮，也導致各種“大城市病”。宋廷曾嘗試一系列應對措施，並最終選擇內聚式的發展路徑，即通過提升城市空間的利用效率，最大限度地容納… \n2023年4月21日\nSpecialist Lecture on Chinese History and Culture (3)\n晚清時期英雄傳記風行一時，引發英雄崇拜的熱潮。但是此時所謂「傳記」，其實是融合諸多資源形構而成的新文類。《意大利建國三傑傳》作為晚清英雄傳記的代表作，充分展示了這一特徵。梁啟超借… \n2023年3月23日\nDistinguished Lectures on Chinese Culture and Religion (1)\n中國古典詩歌的重要特色之一是抒情，而抒情中又特別注重感發，往往“思接千載”，“視通萬里”，不僅體現出作者旺盛的創造力，而且為讀者提供了開闊的想像空間。是次講座結合具體創作，從遺貌取神… \n2023年3月2日\nCIHK Chinese Traditional Culture Workshop(1): Kite Making Workshop\n草長鶯飛二月天，拂堤楊柳醉春煙。 兒童散學歸來早，忙趁東風放紙鳶。 相傳，中國的風箏發明於春秋戰國時期。最早出現的風箏是用竹子和木條製成的，隨造紙術發明並普及後，才逐漸開始用紙質代… \n2023年2月25日\nSpecialist Lecture on Chinese History and Culture (2)\n編修地方志為中華民族悠久而獨特的文化傳統，至今已有2000多年歷史。中國方志有始於《山海經》、《尚書‧禹貢》和《周禮》這三種說法。「國有史，地有志」，「方志」和「歷史」在中國史學… \n2023年2月24日\n1\n2\n3\n4\n下一頁\n跳至",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news"
 },
 {
  "text": "Skip to main content\nStart main content\n中國文化與宗教 傑出學者講座系列 \n最新消息 \n精華片段 孔子學院日 \n我們使用Cookies為您提供更好的瀏覽體驗。如果您繼續瀏覽本網站而沒有更改您的私隱設定，表示您同意我們使用Cookies。如欲了解更多，請參閱我們的私隱政策聲明。\n您的瀏覽器不是最新版本。如果繼續瀏覽本網站，部分頁面未必能夠正常運作。 \n建議您更新至最新版本或選用其他瀏覽器。您可以按此連結查看其他相容的瀏覽器。",
  "url": "https://www.polyu.edu.hk/cihk?sc_lang=tc"
 },
 {
  "text": "Skip to main content\nStart main content\n中国文化与宗教 杰出学者讲座系列 \n最新消息 \n精华片段\n孔子学院日 \n我们使用Cookies为您提供更好的浏览体验。如果您继续浏览本网站而没有更改您的私隐设定，表示您同意我们使用Cookies。如欲了解更多，请参阅我们的私隐政策声明。\n您的浏览器不是最新版本。如果继续浏览本网站，部分页面未必能够正常运作。 \n建议您更新至最新版本或选用其他浏览器。您可以按此连结查看其他相容的浏览器。",
  "url": "https://www.polyu.edu.hk/cihk?sc_lang=sc"
 },
 {
  "text": "中國歷史文化研究中心 \n「中國歷史文化研究中心」匯聚專家學者，對中國歷史與文化作縱深的研究，對象包括古今文獻、歷史、文學、哲學、宗教、藝術、風俗、禮儀等；舉辦講座和學術會議， 編撰出版歷史文化通識讀物，指引文化遺跡考察，藉以促進學生及公眾進一步瞭解中國文化的根源和要旨，珍惜中國文化遺產及其價值，認識中國文化對於個人生活以及社會和諧、世界和平的重要性。\n中心的願景是成為世界青年漢學家及中國歷史文化的研修基地。\n中心現任主任為朱鴻林教授，並邀得北京清華大學陳來教授、美國加州大學柏克萊分校戴梅可教授出任顧問，其他成員見於本院網頁相關部分。\n漢語教學研究中心 \n「漢語教學研究中心」開展支援漢語教學的各種活動，包括漢語本體教學理論探討、語言能力培養和提升、跨文化交際能力研究、語文能力評估等課題的研究。除了邀請專家學者參與研究項目外，還定期邀請專家訪問交流，舉行講座及會議，編撰出版漢語教材及參考書籍，組織語言學習活動及師資培訓課程，以提升漢語教學的素質為目標。\n中心的願景是使香港孔子學院成為對外漢語教學的一個重點研究基地。\n中心現任主任為李德超博士，並邀得美國威廉斯學院亞洲學系顧百里教授出任顧問，其他成員見於本院網頁相關部分。",
  "url": "https://www.polyu.edu.hk/cihk/research-programmes/research-centres"
 },
 {
  "text": "您的瀏覽器不是最新版本。如果繼續瀏覽本網站，部分頁面未必能夠正常運作。 \n建議您更新至最新版本或選用其他瀏覽器。您可以按此連結查看其他相容的瀏覽器。",
  "url": "https://www.polyu.edu.hk/cihk/publication"
 },
 {
  "text": "您的瀏覽器不是最新版本。如果繼續瀏覽本網站，部分頁面未必能夠正常運作。 \n建議您更新至最新版本或選用其他瀏覽器。您可以按此連結查看其他相容的瀏覽器。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/event"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \n研究項目 \n研究計劃 \n「古代中外交流互動地圖——『絲綢之路的動物與人』資料庫計劃」\n項目簡介\n該項目獲得香港教育局優質教育基金資助，由香港理工大學香港孔子學院研究團隊開展。該項目旨在為中學教育開發首個古代絲綢之路中外交流的線上互動地圖，整合時間、空間、圖像和歷史四個方面，並以可視化方式呈現，以動物為關注點，講述古代中外交流故事，令中學歷史的更具趣味性和易讀性。是次演講，香港理工大學的研究團隊成員將與同學分享，從動物與人的新角度如何認識古代絲路和中外交流。\n我們使用Cookies為您提供更好的瀏覽體驗。如果您繼續瀏覽本網站而沒有更改您的私隱設定，表示您同意我們使用Cookies。如欲了解更多，請參閱我們的私隱政策聲明。\n您的瀏覽器不是最新版本。如果繼續瀏覽本網站，部分頁面未必能夠正常運作。 \n建議您更新至最新版本或選用其他瀏覽器。您可以按此連結查看其他相容的瀏覽器。",
  "url": "https://www.polyu.edu.hk/cihk/research-programmes/research-projects"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \n教學項目 \n暑期國際生中國文化課程 \n暑期國際生中國文化課程\n今年，香港孔子學院將繼續參與由香港理工大學統籌的學分制「絲路」中國文化暑期班，七月開課，為期兩週。目標參加者為對中國文化有興趣的國際生、理大海外姊妹學校學生、本校學生及西安交通大學學生。本課程提供的科目為「絲綢之路東段文化簡史」。\n我們使用Cookies為您提供更好的瀏覽體驗。如果您繼續瀏覽本網站而沒有更改您的私隱設定，表示您同意我們使用Cookies。如欲了解更多，請參閱我們的私隱政策聲明。",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-1"
 },
 {
  "text": "Home \n教學項目 \n大學通識教育課程 \n大學通識教育課程\n香港理工大學要求所有四年制本科生必須修讀「大學通識教育課程」，旨在培養學生的全人發展。香港孔子學院承辦其中「歷史、文化及世界觀」範疇內以中國文化為主題的若干科目，教授形式包括課堂講授與在中國內地進行的考察。 2022-23及2022-24 學年，本院將開設下列五個科目：\n（1） 亞洲流行文化導論\n（2） 絲綢之路東段文化簡史\n（3） 中國早期帝國的地下世界\n（4） 中國古代女性的日常生活\n（5） 當代中國大陸流行文化\n我們使用Cookies為您提供更好的瀏覽體驗。如果您繼續瀏覽本網站而沒有更改您的私隱設定，表示您同意我們使用Cookies。如欲了解更多，請參閱我們的私隱政策聲明。",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-2"
 },
 {
  "text": "成立背景\n隨著中國的綜合國力不斷增強，中國在國際事務上的影響力日漸提高，漢語的重要性亦逐步提升，學習漢語在不少國家已形成一股熱潮。有些人出於對中國語言和文化的興趣而學習漢語，有些人則視漢語為一項謀生技能而學習。為了創造比較優良的學習條件，為各國漢語學習者提供方便，2002年起，中國政府通過國家漢語國際推廣領導小組辦公室（漢辦）與各國的著名學府及專業機構合作，在有需求的地區，合作建設以開展漢語教學、推廣中國文化為活動內容的「孔子學院」，並在北京設立「孔子學院總部」，集中管理世界各地的孔子學院，提供與日俱增的支援和服務。2020年，經多位孔院院長和中外合作院校校長在內的社會各界人士紛紛呼籲中國成立專業化的基金會運作孔院，一些教育文化類企業、社會組織，如北京大學、復旦大學、北京語言大學等自發聯合起來成立「中國國際中文教育基金會」，以國際化、專業化、民間化的方式承擔運行服務全球孔院的責任。\n2005年，首間孔子學院成立，到目前為止，全球已設立超過519所孔子學院，分佈於162個國家及地區。\n香港孔子學院由漢辦授權予香港理工大學（理大）承辦， 於2006年正式開幕，成為中國境內第一所與外國孔子學院同類的孔子學院，也是香港唯一的一所孔子學院。在香港獨特的歷史背景和社會狀況下，香港孔子學院致力為本地居民提供學習漢語及中國歷史和傳統文化的機會。\n2013年，漢辦與理大達成新的協議，把香港孔子學院納入為理大單位，並從2014年開始置於理大人文學院之下。\n宗旨\n立足香港，面向國際，推廣漢語應用，弘揚中國文化，支持國家文化建設，促進國際漢學研究。\n目的及願景\n支持國家「發展中國與外國的友好關係，促進世界多元文化發展」的文化建設努力，為不同國籍、種族、性別、年齡、行業人士提供學習漢語，認識中國國情及歷史文化、風俗、社會潮流的機會，讓中國文化更為世界所認識，當代中國情況更為世界所瞭解。\n結合香港的獨特歷史背景和社會情況，為本地學生及社會人士增加其對中國歷史與傳統文化以及當代發展之認識與理解。\n利用香港華洋薈萃的人才優勢，在中國研究的學術及教學上溝通中外，拓展國際漢學研究，並成為世界青年漢學家的研修基地。",
  "url": "https://www.polyu.edu.hk/cihk/about/about-cihk"
 },
 {
  "text": "院長的話\n2020年初，由本校出資並主導修復了香港孔子學院在被佔領期間遭到損毀的入口、地毯、桌椅等各類設施。校方和社會的支持，我們都銘記在心。雖然在維修期間無法使用孔子學院的辦公場地，由孔院負責的各項課程依然得以正常進行。\n隨後爆發的新冠疫情令我們不得不推遲或取消已經規劃好的四場學術會議、四場粵港澳地區研究生研討會，以及其它一些文化活動，但線上教學一直沒有停止。2020年7月，我們恢復了已中斷半年以上的學術講座系列。到2020年底為止，孔子學院與中國文化學系已經合作舉辦了八場線上或線上線下同步進行的學術講座。由於各方對於旅行的限制，以及線上直播方式的運用，今年的八場講座與過去的講座相比具有兩個鮮明的特點：一是講者以香港本地學者而非外地學者為主；二是聽眾人數呈上升趨勢，因為外地朋友也可以在線上參與。今後我們將邀請更多本地學者到孔院分享他們的研究成果，也會嘗試繼續向外地聽眾開放孔院的學術講座。\n與國外的孔子學院相比，香港孔子學院因其所處的特殊環境，雖然也提供語言課程，但更加注重中國文化的教育與傳播以及有關中國文化的學術交流。需要特別強調的是，我們認為中國文化所涵蓋的內容廣泛而多樣，包括精神文化、物質文化、精英文化、民間文化、漢族文化、少數民族文化、地方文化等各種形態，而我們的關注點也就不可狹隘和單一。\n2020年7月，中國內地負責協調世界各地孔子學院的部門由中國國家漢語國際推廣領導小組辦公室（國家漢辦）改為中國國際中文教育基金會，香港孔子學院也在年底前完成了轉隸程序。我們對於國家漢辦一直以來的支持深表感激，同時也期待著與中國國際中文教育基金會的緊密合作。\n我們真誠希望能繼續得到各界朋友的支持，也熱誠歡迎本地或外地對中國文化感興趣的組織或個人與我們合作舉辦教育與學術活動！",
  "url": "https://www.polyu.edu.hk/cihk/about/message-from-the-director"
 },
 {
  "text": "Home \n關於我們 \n學院架構 \n香港孔子學院\n香港孔子學院按照中國國際中文教育基金會（前身為孔子學院總部）和香港理工大學（理大）的章程辦學，實行理事會領導下的院長負責制。理事會成員來自理大及香港文化界，因地制宜，共同管理學院。同時，理大亦邀請社會上在文化推廣和語言研究方面有傑出成就的知名人士，擔任香港孔子學院顧問。由理事會任命的院長則全力負責學院的整體運作。\n香港孔子學院現任理事長為理大中國文化講座教授朱鴻林教授，院長為理大中國文化學系系主任韓孝榮教授。兩位分別於2018年4月及2019年11月履新。\n香港孔子學院於2013年3月成立了「中國歷史文化研究中心」和「漢語教學研究中心」，以增強其學術研究的實力。兩個中心的主任分別為朱鴻林教授和李德超博士。",
  "url": "https://www.polyu.edu.hk/cihk/about/structure"
 },
 {
  "text": "News and Events \nNews \n港澳珠三角地區研究生中國歷史文化研修系列 (春季) 下午\n1 / 1\n講座簡介：\n這次演講的前半部份通過比較李綱與另一士人孫覿於建炎末和紹興初年被貶期間致與朝中大臣的書信，揭示兩人如何取悅朝中重臣從而得以復官。儘管兩人在信中採用類似的修辭以巴結朝臣，但兩人身後的名聲卻有天淵之別—孫覿是典型的投機型官僚，而李綱則為正直不阿的名臣。演講的後半部份試圖解釋李綱為何得以流芳百世。通過考察南宋中後期士人對李綱的《建炎時政記》、《建炎進退志》和另一南宋宰相汪伯彥所撰的《時政記》的不同觀感，發現南宋晚期的史學家在道學思潮的影響下有意識地採納李綱對汪伯彥的公開批評，以建構一個褒揚李綱的敘事並且樹立其名臣的形象。\n講者簡介：\n朱銘堅，香港大學中文學院助理教授。曾任香港浸會大學饒宗頤國學院研究助理教授、香港樹仁大學歷史學系講師、英國倫敦大學國王學院和荷蘭萊頓大學博士後研究員。其研究興趣包括五代、宋、元時期的歷史和中國史學史。英文專著The Politics of Higher Education: The Imperial University in Northern Song China 於2020年由The University of Hong Kong Press 出版。\n",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/spring-lectures-pm"
 },
 {
  "text": "News and Events \nNews \n1 / 1\n講座摘要：\n講座主要講述嶺南文化形象的歷史變遷，主要對嶺南的地域範圍、歷史發展\n文化形象的演變做出梳理，以期為當代粵港澳大灣區“人文灣區”建設提供參考。\n講者介紹：\n陳恩維，男，湖南汨羅人，現任廣東外語外貿大學中文學院院長，教授、雲山傑出學者，國際漢學研究中心主任。長期從事嶺南文學與文化、非物質文化遺產研究。主持國家社科金項目2項、國家社科基金重大項目子課題1項、省部級項目5項。已出版專著7種，在《文化遺產》《民俗研究》等刊物發表中英文論文100餘篇，其中A&HCI和CSSCI刊物40餘篇。成果曾獲廣東省優秀哲學社會科學二等獎。\n會議註冊\n",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/distinguished-lectures-(3)"
 },
 {
  "text": "個人簡介\n阿來，中國當代著名作家，同时，他是詩人，是學者，是古早驢友，是環保主義者，是攝影愛好者，還曾經擔任一份科幻刊物的主編。深受藏漢兩種文化薰陶的阿來，擅長用漢語書寫藏地的文化、歷史與風情。\n主要作品有長篇小說《塵埃落定》《格薩爾王》《空山》《雲中記》，中篇小説《蘑菇圈》，紀實文學《瞻對》，詩集《阿來的詩》《棱磨河》，小說集《舊年的血跡》《月光裏的銀匠》，散文集《語自在》《大地的階梯》《就這樣日益豐盈》等。\n會議註冊",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/chinese-writers-lectures-(1)"
 },
 {
  "text": "您的浏览器不是最新版本。如果继续浏览本网站，部分页面未必能够正常运作。 \n建议您更新至最新版本或选用其他浏览器。您可以按此连结查看其他相容的浏览器。",
  "url": "https://www.polyu.edu.hk/cihk/leadership?sc_lang=sc"
 },
 {
  "text": "滕錦光教授 於2019年7月1日出任香港理工大學（理大）校長，執掌理大前，滕教授為南方科技大學副校長兼研究生院院長。\n滕教授生於中國溫州，1983年在浙江大學取得工學學士學位，其後到澳洲悉尼大學深造，1990年獲頒授博士學位。1989年至1991年，在英國愛丁堡大學先後作訪問博士研究生和研究人員，進行了為期約兩年的研究工作。1991年至1994年，在澳洲詹姆士庫克大學 (James Cook University of North Queensland) 先後任職講師、高級講師。滕教授於1994年10月加入香港理工學院土木及結構工程學系，擔任講師一職，逐步晉升至講座教授（2005年1月）。服務理大期間，滕教授先後出任建設及地政學院副院長（2005年至2006年）、協理副校長（2006 年至2010年）、建設及地政學院/建設及環境學院院長（2007年至2013年），以及可持續城市發展研究院院長（2012年至2018年）。\n滕教授是成就不凡的結構工程學者，曾撰專著及兩百多篇SCI期刊論文，著作被世界各地的研究人員廣為引用，多項科研成果被中國、澳洲、歐洲、英國及美國的設計標準、指南所採納。\n滕教授傑出的學術成就享譽中外，屢獲表揚。2017年榮獲中國科技界最高學術榮銜中國科學院院士。此外，他亦於2015年當選為愛丁堡皇家學會通訊院士，2013年當選為香港工程科學院院士。滕教授多年來獲得許多獎項，其中包括2013年度獲頒「國家自然科學獎」二等獎，2004年獲頒「國家傑出青年科學基金」；以及獲理大頒發2013/14年度研究及學術活動組別「校長特設卓越表現/成就獎」。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/president"
 },
 {
  "text": "領導簡介 \n理事長 \n朱鴻林教授 自2018年4月起擔任香港孔子學院理事長，兼本院中國歷史文化研究中心主任。朱教授現任香港理工大學中國文化學系講座教授，中國教育部長江學者講座教授（中國古代史）；曾任本校人文學院院長、中國文化學系主任， 並於2012年5月至2017年10月期間就任香港孔子學院院長。\n朱教授1984年取得美國普林斯頓大學東亞學博士學位，2009年到香港理工大學創辦中國文化學系之前，歷任美國普林斯頓大學東亞學系、威爾遜國際學者中心研究員，台灣中央研究院歷史語言研究所研究員，香港中文大學歷史系教授及副主任。朱教授是香港人文學院創院院士，曾獲香港中文大學「校長模範教學獎」（2002年度）與首次香港特區大學資助委員會「人文學及社會科學傑出學者獎」（2012-13年度）。\n朱教授接受漢學訓練，而專攻中國近世歷史與文化，研究範圍包括中國近世尤其明代的思想及政治、社會歷史、宋明理學經典、明人文集等。朱教授研究積極， 也以多份學術刊物的編委及文稿審查人等職務為所屬的專業服務。朱教授的著作包括《書法與古籍》（中譯本）、《明儒學案點校釋誤》等專著十種，另外學術論文逾八十篇，由北京三聯書店出版為《朱鴻林明史研究系列》五種。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/chairman"
 },
 {
  "text": "領導簡介 \n院長 \n韓孝榮教授 先後求學於廈門大學（歷史學學士）、中國社會科學院研究生院（民族學碩士）、杜蘭大學（人類學碩士）和夏威夷大學（歷史學博士）。他曾先後任職於中國社會科學院民族研究所、夏威夷大學西瓦湖分校、美國康州三一學院、新加坡國立大學、美國印州巴特勒大學和嶺南大學（香港），自2017年8月以來為香港理工大學中國文化學系教授和系主任，自2019年11月以來兼任香港孔子學院院長。他的研究興趣為中國和越南近現代史，重點關注知識分子與農民的關係、政府與少數民族的關係，以及中國與周邊國家、特別是越南的關係。著有《中國思想中的農民：1900-1949》（Chinese Discourses on the Peasant, 1900-1949, SUNY Press, 2005)，《紅神：韋拔群和南中國的農民革命》（Red God: Wei Baqun and His Peasant Revolution in Southern China, 1894-1932, SUNY Press, 2014），《中國民族關係散論》（新加坡：八方文化）及多篇論文，並擔任China and Asia: A Journal in Historical Studies 的共同主編。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/director"
 },
 {
  "text": "关键词 \nSpecialist Lecture on Chinese History and Culture (5)\n內容簡介： 宣統年間（1909-1911），袁世凱（1859-1916）在攝政王載灃排擠下歸隱彰德府洹上村，與門生故舊唱和，以示無心世務。這些詩作被袁氏次子袁克文（1890-1931）輯錄於《圭塘唱和詩》… \n2023年5月24日\n港澳珠三角地區研究生中國歷史文化研修系列 (春季) 下午\n講座簡介： 這次演講的前半部份通過比較李綱與另一士人孫覿於建炎末和紹興初年被貶期間致與朝中大臣的書信，揭示兩人如何取悅朝中重臣從而得以復官。儘管兩人在信中採用類似的修辭以巴結朝臣… \n2023年5月20日\n港澳珠三角地區研究生中國歷史文化研修系列 (春季) 上午\n講座簡介： “匠人”長期以來被看作是代表著隨著現代工業時代的到來而消失的勞作和生活方式。當代中國逐漸進入後工業社會之後，爲什麽在文藝、影視以及流行文化中會出現呈現“匠”的熱潮呢？而後工… \n2023年5月20日\nDistinguished Lectures on Chinese Culture and Religion (3)\n講座摘要： 講座主要講述嶺南文化形象的歷史變遷，主要對嶺南的地域範圍、歷史發展 文化形象的演變做出梳理，以期為當代粵港澳大灣區“人文灣區”建設提供參考。\n2023年4月28日\nLecture Series of Prominent Chinese Writers (1)\n個人簡介 阿來，中國當代著名作家，同时，他是詩人，是學者，是古早驢友，是環保主義者，是攝影愛好者，還曾經擔任一份科幻刊物的主編。深受藏漢兩種文化薰陶的阿來，擅長用漢語書寫藏地的文… \n2023年4月26日\nSpecialist Lecture on Chinese History and Culture (4)\n內容簡介： 北宋時期大量人口湧入東京，既帶來城市經濟的繁榮，也導致各種“大城市病”。宋廷曾嘗試一系列應對措施，並最終選擇內聚式的發展路徑，即通過提升城市空間的利用效率，最大限度地容納… \n2023年4月21日\nSpecialist Lecture on Chinese History and Culture (3)\n晚清時期英雄傳記風行一時，引發英雄崇拜的熱潮。但是此時所謂「傳記」，其實是融合諸多資源形構而成的新文類。《意大利建國三傑傳》作為晚清英雄傳記的代表作，充分展示了這一特徵。梁啟超借… \n2023年3月23日\nDistinguished Lectures on Chinese Culture and Religion (1)\n中國古典詩歌的重要特色之一是抒情，而抒情中又特別注重感發，往往“思接千載”，“視通萬里”，不僅體現出作者旺盛的創造力，而且為讀者提供了開闊的想像空間。是次講座結合具體創作，從遺貌取神… \n2023年3月2日\nCIHK Chinese Traditional Culture Workshop(1): Kite Making Workshop\n草長鶯飛二月天，拂堤楊柳醉春煙。 兒童散學歸來早，忙趁東風放紙鳶。 相傳，中國的風箏發明於春秋戰國時期。最早出現的風箏是用竹子和木條製成的，隨造紙術發明並普及後，才逐漸開始用紙質代… \n2023年2月25日\nSpecialist Lecture on Chinese History and Culture (2)\n編修地方志為中華民族悠久而獨特的文化傳統，至今已有2000多年歷史。中國方志有始於《山海經》、《尚書‧禹貢》和《周禮》這三種說法。「國有史，地有志」，「方志」和「歷史」在中國史學… \n2023年2月24日\n1\n2\n3\n4\n下一页\n跳至",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news?sc_lang=sc"
 },
 {
  "text": "最新消息及活動 \n最新消息 \n個人簡介\n阿來，中國當代著名作家，同时，他是詩人，是學者，是古早驢友，是環保主義者，是攝影愛好者，還曾經擔任一份科幻刊物的主編。深受藏漢兩種文化薰陶的阿來，擅長用漢語書寫藏地的文化、歷史與風情。\n主要作品有長篇小說《塵埃落定》《格薩爾王》《空山》《雲中記》，中篇小説《蘑菇圈》，紀實文學《瞻對》，詩集《阿來的詩》《棱磨河》，小說集《舊年的血跡》《月光裏的銀匠》，散文集《語自在》《大地的階梯》《就這樣日益豐盈》等。\n會議註冊",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/chinese-writers-lectures-(1)?sc_lang=tc"
 },
 {
  "text": "最新消息及活動 \n最新消息 \n講座摘要：\n講座主要講述嶺南文化形象的歷史變遷，主要對嶺南的地域範圍、歷史發展\n文化形象的演變做出梳理，以期為當代粵港澳大灣區“人文灣區”建設提供參考。\n講者介紹：\n陳恩維，男，湖南汨羅人，現任廣東外語外貿大學中文學院院長，教授、雲山傑出學者，國際漢學研究中心主任。長期從事嶺南文學與文化、非物質文化遺產研究。主持國家社科金項目2項、國家社科基金重大項目子課題1項、省部級項目5項。已出版專著7種，在《文化遺產》《民俗研究》等刊物發表中英文論文100餘篇，其中A&HCI和CSSCI刊物40餘篇。成果曾獲廣東省優秀哲學社會科學二等獎。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/distinguished-lectures-(3)?sc_lang=tc"
 },
 {
  "text": "最新消息及活動 \n內容簡介：\n北宋時期大量人口湧入東京，既帶來城市經濟的繁榮，也導致各種“大城市病”。宋廷曾嘗試一系列應對措施，並最終選擇內聚式的發展路徑，即通過提升城市空間的利用效率，最大限度地容納更多的人口，彰顯出開放、共用與包容的城市精神。這種執政理念既理性務實，又洋溢著人文關懷，飽含宋廷對待弱勢群體的脈脈溫情，折射出柔性化治理的特徵。\n講者簡介：\n梁建國，北京大學歷史學博士，曾任中國社會科學院歷史研究所助理研究員、浙江大學高研院駐訪學者、哈佛大學訪問學者，現任廈門大學歷史與文化遺產學院教授、博士生導師。研究方向為宋代城市史、新文化史及社會經濟史。已出版專著《朝堂之外：北宋東京士人交遊》，在《歷史研究》《中國史研究》《中國經濟史研究》《文史哲》《北京大學學報》《中山大學學報》《廈門大學學報》等期刊發表論文20餘篇，其中多篇被《新華文摘》《人大報刊複印資料》全文轉載。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(4)?sc_lang=tc"
 },
 {
  "text": "最新消息及活動 \n晚清時期英雄傳記風行一時，引發英雄崇拜的熱潮。但是此時所謂「傳記」，其實是融合諸多資源形構而成的新文類。《意大利建國三傑傳》作為晚清英雄傳記的代表作，充分展示了這一特徵。梁啟超借鑑明治政治小說的多種書寫模式，又援引本土小說的要素，將意大利建國史轉化為中國未來命運的預言，將意大利建國三傑刻畫為智、仁、勇的化身，將兒女情長俠義精神引入傳記書寫。正是由於梁啟超自出機杼的創造與轉化，此類英雄傳記廣受讀者歡迎，成為晚清文學文化史上的典範作品。\n崔文東現於香港城市大學中文及歷史學系擔任助理教授一職，從事近現代中國文學研究，尤其關注梁啟超、魯迅等文化巨擘。他於香港中文大學中國語言及文學系取得哲學博士學位，並曾任哈佛燕京學社訪問學人。迄今已在《文學評論》、《漢學研究》、《中國文哲研究集刊》等學術刊物發表論文十數篇，先後獲得教育部人文社會科學研究青年基金項目、香港大學教育資助委員會優配研究金、香港藝術發展局項目資助，並曾兩度榮膺宋淇翻譯研究論文紀念獎。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(3)?sc_lang=tc"
 },
 {
  "text": "中國古典詩歌的重要特色之一是抒情，而抒情中又特別注重感發，往往“思接千載”，“視通萬里”，不僅體現出作者旺盛的創造力，而且為讀者提供了開闊的想像空間。是次講座結合具體創作，從遺貌取神和神思超越等方面，從作者和讀者的角度，談談對中國古典詩歌的相關思考。\n張宏生，1989年在南京大學獲得博士學位，任教於南京大學中文系。現為香港浸會大學中文系講座教授。曾任美國哈佛大學、耶魯大學訪問學人。兼任中國明代文學研究會、中國詞學研究會副會長。治學領域包括中國文學史、古籍整理、詞學等。著有《江湖詩派研究》、《宋詩：融通與開拓》、《清代詞學的建構》、《清詞探微》、《經典傳承與體式流變》、《讀者之心》、《全清詞》之《雍乾卷》和《嘉道卷》等十餘種。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/distinguished-lectures-(1)?sc_lang=tc"
 },
 {
  "text": "草長鶯飛二月天，拂堤楊柳醉春煙。\n兒童散學歸來早，忙趁東風放紙鳶。\n相傳，中國的風箏發明於春秋戰國時期。最早出現的風箏是用竹子和木條製成的，隨造紙術發明並普及後，才逐漸開始用紙質代替，加上其外形似鳥，故此被稱為“紙鳶”。後來，古人對風箏進行改造，按上竹哨或弓弦，然後“使風入，作聲如箏”，造型和紋飾也開始變得多樣化。\n本次工作坊將由導師帶領大家製作有北京特色的沙燕風箏，沙燕風箏一直以獨特的燕子造型而聞名，其頭部是燕子頭部的平面變形，雙眉上挑，兩眼炯炯有神，還有一對尖利的剪刀尾巴，整體造型就是一隻展翅而飛的燕子。\n還在等什麼？快快報名參加工作坊，親手製作一隻屬於你的“小燕子”，尋一處沙灘，覓一片草坪，就等東風放紙鳶吧！\n日期：2023年2月25日（週六）\n時間：3：00-5：00 \n地點 ：香港孔子學院大堂PolyU A204\n語言：普通話，輔以粵語 名額：15人（成功報名人士將收到電郵通知）\n按此報名",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/workshop-(1)?sc_lang=tc"
 },
 {
  "text": "編修地方志為中華民族悠久而獨特的文化傳統，至今已有2000多年歷史。中國方志有始於《山海經》、《尚書‧禹貢》和《周禮》這三種說法。「國有史，地有志」，「方志」和「歷史」在中國史學傳統上，有同源異流的密切關係。是次講座根據歷來中國地方志的原始資料和方志學著述，討論「志」與「史」的異同，並疏理中國舊方志和中國新方志在「存史」及「資政」方面的經驗，並就地方志對歷史研究的當代意義提出建議。\n蔡思行博士，現任香港地方志中心執行總編輯，於2013年取得香港大學歷史學博士學位，為首屆王賡武研究生歷史獎得主。蔡博士從事中國歷史及香港史教學和研究工作逾十年，曾於香港樹仁大學擔任助理教授，並先後於香港大學、香港教育大學及香港理工大學任職。蔡博士研究領域涵蓋粵港海洋史、香港憲制性法律、香港城市發展及集體記憶等，著有The Remarkable Hybrid Maritime World of Hong Kong and the West River Region in the Late Qing Period(Brill: 2017)、《辛亥革命群像》、《尖沙咀海濱︰歷史、城市發展及大眾集體記憶》等多本學術專著及普及歷史著作。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(2)?sc_lang=tc"
 },
 {
  "text": "您的浏览器不是最新版本。如果继续浏览本网站，部分页面未必能够正常运作。 \n建议您更新至最新版本或选用其他浏览器。您可以按此连结查看其他相容的浏览器。",
  "url": "https://www.polyu.edu.hk/cihk/publication?sc_lang=sc"
 },
 {
  "text": "您的浏览器不是最新版本。如果继续浏览本网站，部分页面未必能够正常运作。 \n建议您更新至最新版本或选用其他浏览器。您可以按此连结查看其他相容的浏览器。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/event?sc_lang=sc"
 },
 {
  "text": "Investigation Title and Affiliation Project Title CHU Hung-lam Chair Professor of Chinese Culture; Chairman, Council of CIHK, The Hong Kong Polytechnic University Theory and practice of ancestor veneration rites XIE Shi Head and Professor, Department of History, Sun Yat-sen University, Guangzhou History and society of coastal lands and islands in Ming-Qing Zhejiang YANG Haiying Research Fellow and Professor, Institute of History, Chinese Academy of Social Sciences, Beijing The Wu family of military leaders from Shaoxing in the Ming-Manchu war LIU Yong Professor, Department of History, Sun Yat-sen University, Guangzhou\nConfucian diaries for personal cultivation in late imperial China\nZHANG Ruilong Associate Professor, School of History, Renmin University of China, Beijing\nImperial favor for expansion of civil examination quota in Ming and Qing dynasties\nZHANG Feng Associate Professor, School of History, Northwest University, Xi’an Theory and practice of the compilation of official history KWOK Ka Fai Associate Research Fellow, Sun Yat-sen University (Zhuhai)\nRescue of foreigners in shipwreck in Qing dynasty\nXIE Yang Associate Research Fellow, Institute of History, Chinese Academy of Social Sciences, Beijing Statecraft works of Ming China\nZHOU Xin Associate Research Fellow, Institute of History and Sun Yat-sen, Guangdong Academy of Social Sciences, Guangzhou Family Rites by Zhu Xi and familial rites in late imperial China\nHO Wei-hsuan Associate Professor, Department of Chinese Linguistics and Literature, Yuan Ze University, Taiwan Interpretations of Emperor Shun’s marriage written in the Book of Documents\nPI Kuo-li Associate Professor, Graduate Institute of History, National Central University, Taiwan The challenges and responses of modern Chinese medicine (1830-1960)\nLEUNG Wai Kei Manager, Department of Publishing, Joint Publishing (Hong Kong) Company Limited Publishing industry and cultural life of Song times\nTAM Ka-chai Assistant Professor, Department of History, Hong Kong Baptist University Marginal social groups in Ming and Qing China TSE Wai Kit Associate Professor, Department of History, The Chinese University of Hong Kong A short history of violence of ancient China\nGu Liwei Associate Professor, School of History and Culture, Central China Normal University, Wuhan Change and continuity in the government of Northern and Southern Song dynasties\nZHAN Beibei Associate Professor, Yuelu Academy, Hunan University, Changsha Royal wedding in imperial China\nTAN Weihua Associate Professor, School of Public Administration, Hunan Normal University, Changsha The ethnic Cao Miao in the Hunan-Guangxi-Guizhou\nWU Zhaofeng Lecturer, School of History, Wuhan University Ideas and practice of Ming Confucians for the edification of palace eunuchs\nYU Jindong Associate Dean, School of Humanities and New Media and Associate Prof., Department of History, Yangtze University, Jingzhou The civil official evaluation system in Ming dynasty\nZHU Ye Lecturer, Institute of History, Huazhong University of Science and Technology, Wuhan The Compendia of the Four Books, Five Classics, and Nature and Principles in the world of thought in early modern East Asia\nCHEN Guanhua Assistant Research Fellow, Institute of History, Chinese Academy of Social Sciences, Beijing Opening of Confucianism and cultural unity in 16th China\nCHNG Xing Liang Ph.D candidate, Department of Chinese Culture, The Hong Kong Polytechnic University The statecraft proposals of a low-ranking scholar-official in 16th – century China\nHONG Guoqiang Lecturer, School of History and Culture, Central China Normal University, Wuhan Eight-legged essays in Ming times\nHUANG Tao Ph.D, Department of Chinese Culture, The Hong Kong Polytechnic University The Philosophy of Wang Yangming in the transformative last century of imperial China (1840-1911)\nZHOU Zhongliang Lecturer, Department of History, Yangtze University, Jingzhou\nStories of exemplary persons and the idea and practice of moral education in Ming times\nLIN Zhan Lecturer, Department of History, Soochow University, Suzhou\nPrimers of Neo-Confucian learning in Ming times\nWang Anqi Ph.D candidate, Department of Chinese Culture, The Hong Kong Polytechnic University\nEvidential learning and education in mid Qing times",
  "url": "https://www.polyu.edu.hk/cihk/research-programmes/research-centres?sc_lang=sc"
 },
 {
  "text": "“Ancient China-Foreign Relation Interactive Map Project: Animal and People on the Silk Road Database” \nProject Overview\nFunded by the Quality Education Fund of the Hong Kong Education Bureau and carried out by the Hong Kong Confucius Institute of the Hong Kong Polytechnic University. The project aims to develop the first online interactive map of China-foreign exchanges along the Silk Road for secondary school education. Using animals as a focus, the project integrates the four aspects of time, space, images and history, and visualizes these aspects to tell the story of the Silk Road in ancient times, making history more interesting and accessible. In this talk, project team members from the Polytechnic University will share how to understand the ancient Silk Road and China-foreign exchanges from the perspective of animals and people.",
  "url": "https://www.polyu.edu.hk/cihk/research-programmes/research-projects?sc_lang=sc"
 },
 {
  "text": "教学项目 \n暑期国际生中国文化课程 \n暑期国际生中国文化课程\n今年，香港孔子学院将继续参与由香港理工大学统筹的学分制「丝路」中国文化暑期班，七月开课，为期两周。目标参加者为对中国文化有兴趣的国际生、理大海外姊妹学校学生、本校学生及西安交通大学学生。本课程提供的科目为「丝绸之路东段文化简史」。\n我们使用Cookies为您提供更好的浏览体验。如果您继续浏览本网站而没有更改您的私隐设定，表示您同意我们使用Cookies。如欲了解更多，请参阅我们的私隐政策声明。",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-1?sc_lang=sc"
 },
 {
  "text": "成立背景\n随着中国的综合国力不断增强，中国在国际事务上的影响力日渐提高，汉语的重要性亦逐步提升，学习汉语在不少国家已形成一股热潮。有些人出于对中国语言和文化的兴趣而学习汉语，有些人则视汉语为一项谋生技能而学习。为了创造比较优良的学习条件，为各国汉语学习者提供方便，2002年起，中国政府通过国家汉语国际推广领导小组办公室（汉办）与各国的著名学府及专业机构合作，在有需求的地区，合作建设以开展汉语教学、推广中国文化为活动内容的“孔子学院”，并在北京设立“孔子学院总部”，集中管理世界各地的孔子学院，提供与日俱增的支持和服务。2020年，经多位孔院院长和中外合作院校校长在内的社会各界人士纷纷呼吁中国成立专业化的基金会运作孔院，一些教育文化类企业、社会组织，如北京大学、复旦大学、北京语言大学等自发联合起来成立“中国国际中文教育基金会”，以国际化、专业化、民间化的方式承担运行服务全球孔院的责任。\n2005年，首间孔子学院成立，到目前为止，全球已设立超过519所孔子学院，分布于162个国家及地区。\n香港孔子学院由汉办授权予香港理工大学（理大）承办，于2006年正式开幕，成为中国境内第一所与外国孔子学院同类的孔子学院，也是香港唯一的一所孔子学院。在香港独特的历史背景和社会状况下，香港孔子学院致力为本地居民提供学习汉语及中国历史和传统文化的机会。\n2013年，汉办与理大达成新的协议，把香港孔子学院纳入为理大单位，并从2014年开始置于理大人文学院之下。\n宗旨\n立足香港，面向国际，推广汉语应用，弘扬中国文化，支持国家文化建设，促进国际汉学研究。\n目的及愿景\n支持国家「发展中国与外国的友好关系，促进世界多元文化发展」的文化建设努力，为不同国籍、种族、性别、年龄、行业人士提供学习汉语，认识中国国情及历史文化、风俗、社会潮流的机会，让中国文化更为世界所认识，当代中国情况更为世界所了解。\n结合香港的独特历史背景和社会情况，为本地学生及社会人士增加其对中国历史与传统文化以及当代发展之认识与理解。\n利用香港华洋荟萃的人才优势，在中国研究的学术及教学上沟通中外，拓展国际汉学研究，并成为世界青年汉学家的研修基地。",
  "url": "https://www.polyu.edu.hk/cihk/about/about-cihk?sc_lang=sc"
 },
 {
  "text": "教学项目 \n大学通识教育课程 \n大学通识教育课程\n香港理工大学要求所有四年制本科生必须修读「大学通识教育课程」，旨在培养学生的全人发展。香港孔子学院承办其中「历史、文化及世界观」范畴内以中国文化为主题的若干科目，教授形式包括课堂讲授与在中国内地进行的考察。 2022-23及2023-24 学年，本院将开设下列五个科目：\n（1） 亚洲流行文化导论\n（2） 丝绸之路东段文化简史\n（3） 中国早期帝国的地下世界\n（4） 中国古代女性的日常生活\n（5） 当代中国大陆流行文化\n我们使用Cookies为您提供更好的浏览体验。如果您继续浏览本网站而没有更改您的私隐设定，表示您同意我们使用Cookies。如欲了解更多，请参阅我们的私隐政策声明。",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-2?sc_lang=sc"
 },
 {
  "text": "院长的话\n2020年初，由本校出资并主导修复了香港孔子学院在被占领期间遭到损毁的入口、地毯、桌椅等各类设施。校方和社会的支持，我们都铭记在心。虽然在维修期间无法使用孔子学院的办公场地，由孔院负责的各项课程依然得以正常进行。\n随后爆发的新冠疫情令我们不得不推迟或取消已经规划好的四场学术会议、四场粤港澳地区研究生研讨会，以及其它一些文化活动，但在线教学一直没有停止。2020年7月，我们恢复了已中断半年以上的学术讲座系列。到2020年底为止，孔子学院与中国文化学系已经合作举办了八场在线或在线线下同步进行的学术讲座。由于各方对于旅行的限制，以及在线直播方式的运用，今年的八场讲座与过去的讲座相比具有两个鲜明的特点：一是讲者以香港本地学者而非外地学者为主；二是听众人数呈上升趋势，因为外地朋友也可以在在线参与。今后我们将邀请更多本地学者到孔院分享他们的研究成果，也会尝试继续向外地听众开放孔院的学术讲座。\n与国外的孔子学院相比，香港孔子学院因其所处的特殊环境，虽然也提供语言课程，但更加注重中国文化的教育与传播以及有关中国文化的学术交流。需要特别强调的是，我们认为中国文化所涵盖的内容广泛而多样，包括精神文化、物质文化、精英文化、民间文化、汉族文化、少数民族文化、地方文化等各种形态，而我们的关注点也就不可狭隘和单一。\n2020年7月，中国内地负责协调世界各地孔子学院的部门由中国国家汉语国际推广领导小组办公室（国家汉办）改为中国国际中文教育基金会，香港孔子学院也在年底前完成了转隶程序。我们对于国家汉办一直以来的支持深表感激，同时也期待着与中国国际中文教育基金会的紧密合作。\n我们真诚希望能继续得到各界朋友的支持，也热诚欢迎本地或外地对中国文化感兴趣的组织或个人与我们合作举办教育与学术活动！",
  "url": "https://www.polyu.edu.hk/cihk/about/message-from-the-director?sc_lang=sc"
 },
 {
  "text": "关于我们 \n学院架构 \n香港孔子学院\n香港孔子学院按照中国国际中文教育基金会（前身为孔子学院总部）和香港理工大学（理大）的章程办学，实行理事会领导下的院长负责制。理事会成员来自理大及香港文化界，因地制宜，共同管理学院。同时，理大亦邀请社会上在文化推广和语言研究方面有杰出成就的知名人士，担任香港孔子学院顾问。由理事会任命的院长则全力负责学院的整体运作。\n香港孔子学院现任理事长为理大中国文化讲座教授朱鸿林教授，院长为理大中国文化学系系主任韩孝荣教授。两位分别于2018年4月及2019年11月履新。\n香港孔子学院于2013年3月成立了「中国历史文化研究中心」和「汉语教学研究中心」，以增强其学术研究的实力。两个中心的主任分别为朱鸿林教授和李德超博士。\n我们使用Cookies为您提供更好的浏览体验。如果您继续浏览本网站而没有更改您的私隐设定，表示您同意我们使用Cookies。如欲了解更多，请参阅我们的私隐政策声明。",
  "url": "https://www.polyu.edu.hk/cihk/about/structure?sc_lang=sc"
 },
 {
  "text": "最新消息及活动 \n講座摘要：\n講座主要講述嶺南文化形象的歷史變遷，主要對嶺南的地域範圍、歷史發展\n文化形象的演變做出梳理，以期為當代粵港澳大灣區“人文灣區”建設提供參考。\n講者介紹：\n陳恩維，男，湖南汨羅人，現任廣東外語外貿大學中文學院院長，教授、雲山傑出學者，國際漢學研究中心主任。長期從事嶺南文學與文化、非物質文化遺產研究。主持國家社科金項目2項、國家社科基金重大項目子課題1項、省部級項目5項。已出版專著7種，在《文化遺產》《民俗研究》等刊物發表中英文論文100餘篇，其中A&HCI和CSSCI刊物40餘篇。成果曾獲廣東省優秀哲學社會科學二等獎。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/distinguished-lectures-(3)?sc_lang=sc"
 },
 {
  "text": "最新消息及活动 \n個人簡介\n阿來，中國當代著名作家，同时，他是詩人，是學者，是古早驢友，是環保主義者，是攝影愛好者，還曾經擔任一份科幻刊物的主編。深受藏漢兩種文化薰陶的阿來，擅長用漢語書寫藏地的文化、歷史與風情。\n主要作品有長篇小說《塵埃落定》《格薩爾王》《空山》《雲中記》，中篇小説《蘑菇圈》，紀實文學《瞻對》，詩集《阿來的詩》《棱磨河》，小說集《舊年的血跡》《月光裏的銀匠》，散文集《語自在》《大地的階梯》《就這樣日益豐盈》等。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/chinese-writers-lectures-(1)?sc_lang=sc"
 },
 {
  "text": "Event \nFaculties, Schools & Department \nKeywords \nUpcoming Events\n\t\t\nNo results have been found.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/event?sc_lang=en"
 },
 {
  "text": "Teaching Programmes \nSummer Programme for International Students \nSummer Programme of Chinese Culture and Language for International Students\nThis 2-week “Silk Road” summer programme in July organised by The Hong Kong Polytechnic University will admit international students interested in Chinese culture, exchange students from PolyU’s overseas partner institutions, students of Xi’an Jiaotong University and PolyU. A credit-bearing subject titled “Cultural History of the Eastern Silk Road” will be offered.",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-1?sc_lang=en"
 },
 {
  "text": "General University Requirements (GUR) / Cluster Area Requirements (CAR) Subjects\nAll undergraduate students at PolyU are required to take a number of General University Requirements (GUR) courses, which consists of six components including the Cluster Area Requirements (CAR) subjects. CIHK will offer a number of Chinese culture related subjects in the Cluster Area of History, Culture and World Views. The five subjects listed below will be offered in the Academic Year 2022-23 and 2023-24:\n（1） An Introduction on Asian Popular Cultures\n（2） Cultural History of the Eastern Silk Road\n（3） The Underground World of Early Imperial China\n（4） Women and Their Everyday Life in Imperial China\n（5） Popular Culture in Contemporary Mainland China",
  "url": "https://www.polyu.edu.hk/cihk/teaching-programmes/teaching-programme-2?sc_lang=en"
 },
 {
  "text": "BACKGROUND\nAs its comprehensive national strength continuously increases, China’s influence in international affairs and the importance of the Chinese language become increasingly notable. Learning Chinese has become increasingly popular. While some learn it for their interest in the Chinese language and culture, some see learning Chinese as a tool for business. In order to create conditions conducive to learning and facilitate the learning of Chinese overseas, the Chinese government started collaboration with renowned institutions and professional organisations worldwide through the Office of Chinese Language Council International (HANBAN) and established Confucius Institutes to offer Chinese classes and to promote Chinese culture. Confucius Institute Headquarters is set up in Beijing to centrally manage Confucius Institutes around the world and provide ever-increasing support and services. In 2020, after receiving a great number of calls from Directors of Confucius Institutes and presidents of Sino-foreign cooperative colleges and universities to set up a professional foundation to operate the Confucius Institutes, some educational and cultural enterprises and social organizations, such as Peking University, Fudan University and Beijing Language and Culture University, spontaneously joined hands to establish the Chinese International Education Foundation, taking the responsibility of operating and serving the global Confucius Institutes in more international, professional and popular ways.\nSince the establishment of the first Confucius Institute in 2005, the number of Institutes around the world has grown to 519, spreading over 162 countries and regions.\nUnder the auspices of The Hong Kong Polytechnic University (PolyU) and HANBAN, the Confucius Institute of Hong Kong (CIHK) was inaugurated in 2006, dedicated to the promotion of Chinese language and culture as well as the facilitation of cultural exchanges between China and the world. As the first Confucius Institute in China and the only one of its kind in Hong Kong, CIHK addresses Hong Kong’s unique historical background and socio-economic conditions and provides various types of activities and programmes for local residents to broaden and deepen their understanding of Chinese history and traditional culture as well as that of contemporary China.\nIn 2013 HANBAN and PolyU reached an agreement to restructure CIHK as a unit of the University so that the PolyU community could directly benefit from the Institute’s programmes and activities. Beginning 2014 the Institute is further placed under PolyU’s Faculty of Humanities.",
  "url": "https://www.polyu.edu.hk/cihk/about/about-cihk?sc_lang=en"
 },
 {
  "text": "Message From The Director\nIn early 2020, The Hong Kong Polytechnic University funded and supervised the reparation of the CIHK office, which had been damaged during the recent occupation. The support of the university and the community is very much appreciated. Although the facilities of the Confucius Institute could not be used during the period of repair, the instruction of the courses offered by CIHK went on without interruption.\nThe subsequent outbreak of COVID-19 compelled us to postpone or cancel four academic conferences, four forums for postgraduate students in the Guangdong-Hong Kong-Macau region, and some other cultural activities that had been planned, but online teaching of CIHK courses was never disrupted. In July 2020, we were able to resume the academic lecture series that had been discontinued for more than half a year. By the end of 2020, CIHK and the Department of Chinese Culture have jointly presented eight lectures held either online only or online and offline simultaneously. Due to travel restrictions and the use of live online streaming, the lectures of this year have two distinctive features compared to the previous ones: firstly, most of the speakers are scholars based in Hong Kong; secondly, the size of the audience is on the rise, as non-local friends can now attend online. In the future, we will invite more local scholars to share their research results using the CIHK platform, and we will try to continue to open our lectures to non-local audiences.\nThe Confucius Institutes outside China usually attach primary importance to language instruction. In comparison, the Confucius Institute of Hong Kong, to adapt to its unique environment, has put more emphasis on the education and promotion of Chinese culture as well as scholarly exchanges related to Chinese culture. Since Chinese culture encompasses a wide and diverse range of aspects, including spiritual culture, material culture, elite culture, folk culture, Han culture, ethnic minority culture, local culture, and so on, our focus therefore should not be narrow and singular.\nIn June 2020, the Chinese International Education Foundation (CIEF) was created in Beijing as a NGO and it took over from HANBAN the responsibilities of supervising the collaboration with Confucius Institutes around the world. We would like to thank HANBAN for its consistent support since the founding of CIHK, and we are looking forward to working closely with CIEF.\nWe sincerely hope that we will be able to receive continuous support from our friends, and we look forward to collaborating with individuals and institutions to organize educational and academic activities.",
  "url": "https://www.polyu.edu.hk/cihk/about/message-from-the-director?sc_lang=en"
 },
 {
  "text": "CIHK\nEstablished under the Constitution and By-laws of Chinese International Education Foundation (formerly known as Confucius Institute Headquarters) and The Hong Kong Polytechnic University (PolyU), the Confucius Institute of Hong Kong (CIHK) shall adopt a system in which the Director, appointed by and under leadership of the Council, shall assume the main responsibility for the Institute’s overall operation and administration. CIHK is governed by the Council, PolyU and the professional and cultural sectors in Hong Kong.\nCurrently the Chair of the Council of CIHK is Professor Chu Hung-lam, Chair Professor of Chinese Culture at PolyU. Professor Chu was appointed in April 2018. The incumbent Director of CIHK is Professor Han Xiaorong, Head of Department of Chinese Culture, PolyU. Professor Han took up the directorship in November 2019.\nCIHK established two research centres, namely the Research Centre for Chinese History and Culture and the Research Centre for Chinese Language Teaching, in March 2013 to enhance its research capability. The Directors of the above two research centres are Professor Chu Hung-lam and Dr Li De-chao respectively.",
  "url": "https://www.polyu.edu.hk/cihk/about/structure?sc_lang=en"
 },
 {
  "text": "內容簡介：\n北宋時期大量人口湧入東京，既帶來城市經濟的繁榮，也導致各種“大城市病”。宋廷曾嘗試一系列應對措施，並最終選擇內聚式的發展路徑，即通過提升城市空間的利用效率，最大限度地容納更多的人口，彰顯出開放、共用與包容的城市精神。這種執政理念既理性務實，又洋溢著人文關懷，飽含宋廷對待弱勢群體的脈脈溫情，折射出柔性化治理的特徵。\n講者簡介：\n梁建國，北京大學歷史學博士，曾任中國社會科學院歷史研究所助理研究員、浙江大學高研院駐訪學者、哈佛大學訪問學者，現任廈門大學歷史與文化遺產學院教授、博士生導師。研究方向為宋代城市史、新文化史及社會經濟史。已出版專著《朝堂之外：北宋東京士人交遊》，在《歷史研究》《中國史研究》《中國經濟史研究》《文史哲》《北京大學學報》《中山大學學報》《廈門大學學報》等期刊發表論文20餘篇，其中多篇被《新華文摘》《人大報刊複印資料》全文轉載。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(4)"
 },
 {
  "text": "Abstract (based on the abstract of Chapter 1)\nIn this CIHK webinar, we will discuss the material conditions of and historical background to the use of Classical Chinese or Literary Sinitic in writing-mediated brush conversation between literati of Sinitic engaged in cross-border communication within Sinographic East Asia or the Sinographic cosmopolis, which corresponds with today’s China, North Korea, South Korea, Japan (including Okinawa, formerly the Ryukyu Kingdom) and Vietnam. Compared with speech as a modality of communication, real-time writing-mediated interaction between talking humans, synchronously face-to-face, seems uncommon. In any society, speaking is premised on one condition: the interlocutors must have at least one shared spoken language at their disposal, but even then, there are circumstances under which speaking is either physically not feasible or socially inappropriate. Could writing function as an alternative modality of communication when speaking is not an option due to the absence of a shared spoken language, as in cross-border communication settings? Whereas real-time writing-mediated face-to-face interaction is rare where a regional lingua franca was known to exist (e.g., Latin and Arabic), there is ample historical evidence of literati of Classical Chinese or Literary Sinitic from different parts of Sinographic East Asia conducting ‘silent conversation’, synchronously and interactively in writing mode using brush, ink, and paper. Such a pattern of writing-assisted interaction is still practiced and observable in pen-assisted conversation – pen-talk – between Chinese and Japanese speakers today, thanks to the pragma-linguistic affordance of morphographic, non-phonographic sinograms (i.e., Chinese characters and Japanese kanji). We will outline the historical spread of Classical Chinese or Sinitic texts from the ‘center’ to the ‘peripheries’, and the historical background to the acquisition of literacy in Sinitic by the people there. Their shared knowledge of Sinitic helps explain why, for well over a thousand years until the 1900s, literati from these places were able to speak their mind by engaging in ‘Sinitic brush-talk’ 漢文筆談 in cross-border communication.\nSpeaker's Profile：\nDavid C. S. Li\nDavid C. S. Li (李楚成) is professor and Head of the Department of Chinese and Bilingual Studies (中文及雙語學系), The Hong Kong Polytechnic University (香港理工大學). He received his BA in English (Hong Kong), MA in Applied Linguistics (France), and PhD in Linguistics (Germany). He has published widely in multilingualism in Greater China, World Englishes, Hong Kong English, China English, bilingual education and language policy, bilingual interaction and code-switching (translanguaging), Cantonese as an additional language, and South Asian Hongkongers’ needs for written Chinese. He speaks Cantonese, English and Mandarin fluently, is conversant in German and French, and is learning Japanese and Korean. More recent interests focus on the historical spread of written Chinese (Sinitic) and its use as a scripta franca until the early twentieth century in Sinographic East Asia (China, Japan, Korea, and Vietnam).\nEmail: david.cs.li@polyu.edu.hk.\nReijiro Aoyama\nReijiro Aoyama’s (青山玲二郎) research is concerned with transnational and global processes mediated by migration and the movement of information, symbols, capital and cultural commodities. His research interests include anthropology of work and mobility, narratives of migration, and material and non-material culture of cross-border interactions. He has conducted several long-term ethnographies of the Japanese presence in East Asia, and has published on Japanese diaspora, craftsmanship, and emotional work in service industries, Sino-Japanese animation, and historical cross-border interactions mediated by Sinitic writing. Before taking up his post at The Hong Kong Polytechnic University, he taught at Fudan University, Tsinghua University, and City University of Hong Kong.\nEmail: rei.aoyama@polyu.edu.hk\nWong Tak-Sum, Sam\nWONG Tak-Sum (黃得森) is a post-doctoral fellow in the Department of Chinese and Bilingual Studies at the Hong Kong Polytechnic University. He received his BEng in Computer Science from Hong Kong University of Science and Technology (2004), and PhD in Linguistics from City University of Hong Kong (2018). He has built a treebank of the Tripiṭaka Koreana during his doctoral study and has been working on the quantitative study of historical syntax. His research expertise covers Chinese historical linguistics, Cantonese linguistics, corpus linguistics, computer-assisted language learning, Chinese dialectology and Chinese palæography.\nEmail: tak-sum.wong@polyu.edu.hk\nMeeting Registration",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(3)?sc_lang=sc"
 },
 {
  "text": "最新消息及活动 \n内容简介：\n作为宋辽夏金时期的一个王朝，西夏历史文化有突出的特色，同时与中原文化有着内在的、紧密的联系。西夏参照汉字创制了民族文字西夏文，形成了很多文献；吸纳儒学，尊孔子为文宣帝；提倡汉学，实行科举，培养人才；借鉴中原王朝法律，编纂法典，保存了最早的少数民族文字《律令》，丰富中华法系；接受中原社会习俗，存留下大批珍贵社会文书；弘扬中原印刷术，发明木活字印刷，有最早的活字印刷实物；尊崇佛教，翻译中原大藏经，出土了数千卷佛经。西夏同时也吸收了临近吐蕃、回鹘等民族的文化。西夏文化是中华民族优秀传统文化的有机组成部分，对中华民族文化做出了重要贡献。\n讲者简介：\n史金波，中国社会科学院学部委员，中国历史研究院学术咨询委员会委员。民族研究所研究员、博士生导师。兼任全国古籍保护工作专家委员会副主任。主要研究领域为西夏文史、中国民族史和中国民族古文字。主持完成国家和省部级重大、重点项目20余项。出版著作36部（含合作），主要有《文海研究》、《西夏佛教史略》、《西夏文物》、《类林研究》、《西夏天盛律令》、《中国历代民族古文字文献探幽》、《西夏社会》、《西夏文教程》、《西夏经济文书研究》、《中国民族史学史纲要》等。主编著作25种，主要有《俄藏黑水城文献》（31册）、《中国藏西夏文献》（20册），参与撰写、编辑辞书18种，发表文章370余篇。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(2)?sc_lang=sc"
 },
 {
  "text": "最新消息及活动 \n内容简介\n中国戏曲源自新石器时代的巫术仪式，经历汉代百戏、唐代戏弄和北宋杂剧，在北宋末融汇了多种形式的演出艺术、民歌、文人曲子及多种演唱文类，发展成戏曲鼻祖「南戏」。粤剧是清代地方剧种百花齐放的产品，既保留着近乎巫术仪式的《祭白虎》，也承传着昆曲牌子、秦腔梆子、徽剧二黄、宋明南戏和元杂剧的剧目，堪称中国戏曲的缩影。本讲座概述当代香港粤剧的传承状况和中国戏曲的历史面貌，从中探讨粤剧如何保留和发展传统戏曲的元素。讲座将论及粤剧神功戏的演出、《祭白虎》仪式、戏班结构、行当、剧目题材、唱腔特点和传承。\n讲者简介\n陈守仁是前香港中文大学音乐系教授，创办了「粤剧研究计划」和「戏曲数据中心」并出任主任，现任香港中文大学文化管理课程兼任教授，讲授「粤剧与香港文化」。他的近着有《香港神功粤剧的浮沉》（2018；与湛黎淑贞合着）、《粤曲的学和唱 — 王粤生粤曲教程》（增订第四版，2020）、《早期粤剧史－〈广东戏剧史略〉校注》（2020）、《帝女花读本》（2020；与张群显合编）和《紫钗记读本》（2021；与张群显、何冠环合编）等。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(1)?sc_lang=sc"
 },
 {
  "text": "Abstract (based on the abstract of Chapter 1)\nIn this CIHK webinar, we will discuss the material conditions of and historical background to the use of Classical Chinese or Literary Sinitic in writing-mediated brush conversation between literati of Sinitic engaged in cross-border communication within Sinographic East Asia or the Sinographic cosmopolis, which corresponds with today’s China, North Korea, South Korea, Japan (including Okinawa, formerly the Ryukyu Kingdom) and Vietnam. Compared with speech as a modality of communication, real-time writing-mediated interaction between talking humans, synchronously face-to-face, seems uncommon. In any society, speaking is premised on one condition: the interlocutors must have at least one shared spoken language at their disposal, but even then, there are circumstances under which speaking is either physically not feasible or socially inappropriate. Could writing function as an alternative modality of communication when speaking is not an option due to the absence of a shared spoken language, as in cross-border communication settings? Whereas real-time writing-mediated face-to-face interaction is rare where a regional lingua franca was known to exist (e.g., Latin and Arabic), there is ample historical evidence of literati of Classical Chinese or Literary Sinitic from different parts of Sinographic East Asia conducting ‘silent conversation’, synchronously and interactively in writing mode using brush, ink, and paper. Such a pattern of writing-assisted interaction is still practiced and observable in pen-assisted conversation – pen-talk – between Chinese and Japanese speakers today, thanks to the pragma-linguistic affordance of morphographic, non-phonographic sinograms (i.e., Chinese characters and Japanese kanji). We will outline the historical spread of Classical Chinese or Sinitic texts from the ‘center’ to the ‘peripheries’, and the historical background to the acquisition of literacy in Sinitic by the people there. Their shared knowledge of Sinitic helps explain why, for well over a thousand years until the 1900s, literati from these places were able to speak their mind by engaging in ‘Sinitic brush-talk’ 漢文筆談 in cross-border communication.\nSpeaker's Profile：\nDavid C. S. Li\nDavid C. S. Li (李楚成) is professor and Head of the Department of Chinese and Bilingual Studies (中文及雙語學系), The Hong Kong Polytechnic University (香港理工大學). He received his BA in English (Hong Kong), MA in Applied Linguistics (France), and PhD in Linguistics (Germany). He has published widely in multilingualism in Greater China, World Englishes, Hong Kong English, China English, bilingual education and language policy, bilingual interaction and code-switching (translanguaging), Cantonese as an additional language, and South Asian Hongkongers’ needs for written Chinese. He speaks Cantonese, English and Mandarin fluently, is conversant in German and French, and is learning Japanese and Korean. More recent interests focus on the historical spread of written Chinese (Sinitic) and its use as a scripta franca until the early twentieth century in Sinographic East Asia (China, Japan, Korea, and Vietnam).\nEmail: david.cs.li@polyu.edu.hk.\nReijiro Aoyama\nReijiro Aoyama’s (青山玲二郎) research is concerned with transnational and global processes mediated by migration and the movement of information, symbols, capital and cultural commodities. His research interests include anthropology of work and mobility, narratives of migration, and material and non-material culture of cross-border interactions. He has conducted several long-term ethnographies of the Japanese presence in East Asia, and has published on Japanese diaspora, craftsmanship, and emotional work in service industries, Sino-Japanese animation, and historical cross-border interactions mediated by Sinitic writing. Before taking up his post at The Hong Kong Polytechnic University, he taught at Fudan University, Tsinghua University, and City University of Hong Kong.\nEmail: rei.aoyama@polyu.edu.hk\nWong Tak-Sum, Sam\nWONG Tak-Sum (黃得森) is a post-doctoral fellow in the Department of Chinese and Bilingual Studies at the Hong Kong Polytechnic University. He received his BEng in Computer Science from Hong Kong University of Science and Technology (2004), and PhD in Linguistics from City University of Hong Kong (2018). He has built a treebank of the Tripiṭaka Koreana during his doctoral study and has been working on the quantitative study of historical syntax. His research expertise covers Chinese historical linguistics, Cantonese linguistics, corpus linguistics, computer-assisted language learning, Chinese dialectology and Chinese palæography.\nEmail: tak-sum.wong@polyu.edu.hk\nMeeting Registration",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(3)?sc_lang=tc"
 },
 {
  "text": "內容簡介：\n作為宋遼夏金時期的一個王朝，西夏歷史文化有突出的特色，同時與中原文化有著內在的、緊密的聯繫。西夏參照漢字創制了民族文字西夏文，形成了很多文獻；吸納儒學，尊孔子為文宣帝；提倡漢學，實行科舉，培養人才；借鑒中原王朝法律，編纂法典，保存了最早的少數民族文字《律令》，豐富中華法系；接受中原社會習俗，存留下大批珍貴社會文書；弘揚中原印刷術，發明木活字印刷，有最早的活字印刷實物；尊崇佛教，翻譯中原大藏經，出土了數千卷佛經。西夏同時也吸收了臨近吐蕃、回鶻等民族的文化。西夏文化是中華民族優秀傳統文化的有機組成部分，對中華民族文化做出了重要貢獻。\n史金波，中國社會科學院學部委員，中國歷史研究院學術諮詢委員會委員。民族研究所研究員、博士生導師。兼任全國古籍保護工作專家委員會副主任。主要研究領域為西夏文史、中國民族史和中國民族古文字。主持完成國家和省部級重大、重點項目20余項。出版著作36部（含合作），主要有《文海研究》、《西夏佛教史略》、《西夏文物》、《類林研究》、《西夏天盛律令》、《中國歷代民族古文字文獻探幽》、《西夏社會》、《西夏文教程》、《西夏經濟文書研究》、《中國民族史學史綱要》等。主編著作25種，主要有《俄藏黑水城文獻》（31冊）、《中國藏西夏文獻》（20冊），參與撰寫、編輯辭書18種，發表文章370餘篇。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(2)?sc_lang=tc"
 },
 {
  "text": "內容簡介\n中國戲曲源自新石器時代的巫術儀式，經歷漢代百戲、唐代戲弄和北宋雜劇，在北宋末融匯了多種形式的演出藝術、民歌、文人曲子及多種演唱文類，發展成戲曲鼻祖「南戲」。粵劇是清代地方劇種百花齊放的產品，既保留着近乎巫術儀式的《祭白虎》，也承傳着崑曲牌子、秦腔梆子、徽劇二黃、宋明南戲和元雜劇的劇目，堪稱中國戲曲的縮影。本講座概述當代香港粵劇的傳承狀況和中國戲曲的歷史面貌，從中探討粵劇如何保留和發展傳統戲曲的元素。講座將論及粵劇神功戲的演出、《祭白虎》儀式、戲班結構、行當、劇目題材、唱腔特點和傳承。\n講者簡介\n陳守仁是前香港中文大學音樂系教授，創辦了「粵劇研究計劃」和「戲曲資料中心」並出任主任，現任香港中文大學文化管理課程兼任教授，講授「粵劇與香港文化」。他的近著有《香港神功粵劇的浮沉》（2018；與湛黎淑貞合著）、《粵曲的學和唱 — 王粵生粵曲教程》（增訂第四版，2020）、《早期粵劇史－〈廣東戲劇史略〉校注》（2020）、《帝女花讀本》（2020；與張群顯合編）和《紫釵記讀本》（2021；與張群顯、何冠環合編）等。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(1)?sc_lang=tc"
 },
 {
  "text": "Origin of Hong Kong and the Relationship between Hong Kong and the Chinese Mainland\n\nThe presentation focuses on the historical evolution of Hong Kong, the historical and cultural ties between Hong Kong and the Chinese Mainland, and the unique position of Hong Kong in the historical development of China.\n1. Ancient Hong Kong\n2. British Occupation of Hong Kong\n3. Hong Kong and the 1911 Revolution\n4. Hong Kong and the Anti-Japanese War\n5. New China's Policy on Hong Kong\n6. Hong Kong and China's Reform and Opening\n7. The Friendship between Two Places\n\nSpeaker's Profile：\nProfessor Liu Shuyong is an expert in Hong Kong history, a researcher at the Institute of Modern History of the Chinese Academy of Social Sciences, a senior research fellow at the Hong Kong and South China Historical Research Programme of Lingnan University and an affairs consultant of the Hong Kong Chronicles Institute. \nHis major publications include \"A Brief History of Hong Kong\", \"A Brief History of Hong Kong—From Ancient Times to the 1997 Handover\", \"Chronicles of Hong Kong - Summary - Major Events\", \"Liu Shuyong's Collection of Hong Kong History\", \"Hong Kong in the 19th Century\", \"Hong Kong in the 20th Century\", \"Hong Kong Economy in the 20th Century\", \"An Outline History of Hong Kong\", etc.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/distinguished-lecture-(3)?sc_lang=en"
 },
 {
  "text": "Cultural Habitus and Religious Doxa: \nTheorizing the Confucian-Buddhist Encounter in Late Imperial China\n\nThe paper explores Confucianism’s interaction with Buddhism in late imperial China by examining the mediating and defining role of the latter, especially its Chan iteration. The fact that Chan, a predominant Sinitic Buddhist sect, exerted enormous influences on the origination and development of Neo-Confucianism is commonly acknowledged and generally well-known. The paper theorizes the fraught relationship between the two religio-philosophical traditions through the intervention of Pierre Bourdieu’s descriptive-analytic ideas of “habitus” (a continuous system of ideational and ideological dispositions constituted historically) and “doxa” (the cultural realities that are taken for granted, consciously or subconsciously), and in the process, it also questions and critiques the much-used theoretical framework of syncretism. The paper argues that Chan, while being branded as a heterodoxy at odds with the Confucian orthodoxy, was in actuality integrally and functionally a part of the Chinese cultural capital. Their respective putative doctrinal certitude in large part relied on their self-identification in terms of each other. At the same time that they sought to negate and denigrate each other, they became mutually reinforced and clarified. \n\nSpeaker's Profile：\nOn-cho Ng is Professor of Asian Studies and Philosophy, and former founding Head (2012-2021) of the Asian Studies Department at the Pennsylvania State University. Primarily a specialist in late imperial Chinese intellectual history, he has published extensively on a wide range of topics, such as Confucian hermeneutics, religiosity, ethics, and historiography. His books include Cheng-Zhu Confucianism in the Early Qing, Mirroring the Past, and The Imperative of Understanding. His dozens of articles have appeared in major outlets such as Dao, Philosophy East and West, Journal of Chinese Philosophy, Journal of World History, Journal of Chinese Religions, and the Journal of the History of Ideas. He is co-editor of the Book Series on Chinese intellectual history published by National Taiwan University and serves as associate editor of the Journal of Chinese Philosophy. He is also the Vice-President of the International Association for Yijing Studies (Beijing) and sits on the editorial boards of several academic publications.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/distinguished-lecture-(4)?sc_lang=en"
 },
 {
  "text": "Focusing on tensions and links between national formation and international outlooks, this talk shows how classical world visions persist as China’s modernizers and revolutionaries adopted and revised the Western nation-state and cosmopolitanism. The concepts of tianxia (all under heaven) and datong (great harmony) have been updated into outlooks of global harmony that value unity, equality, and reciprocity as strategies of overcoming interstate conflict, national divides, and social fragmentation. The talk will delve into two debates: the embrace of the West vs. aspirations for a common world, and the difference between liberal cosmopolitanism and socialist internationalism.\nSpeaker Bio :\nBan Wang is the William Haas Professor in East Asian Languages and Cultures and Comparative Literature at Stanford University. His publications include The Sublime Figure of History (Stanford UP, 1997), Illuminations from the Past (Stanford UP, 2004), History and Memory (Lishi yu jiyi) (Oxford UP, 2004), and China in the World: Culture, Politics, and World Vision (Duke UP, 2022). He has edited 8 books on socialism, film, memory, culture, and China.\nDiscussant Bio:\nBrian Tsui is Associate Professor at the Department of Chinese Culture, The Hong Kong Polytechnic University. He is the author of China’s Conservative Revolution: The Quest for a New Order (Cambridge UP, 2018) and an editor, with Tansen Sen, of Beyond Pan-Asianism: Connecting China and India, 1840s–1960s (Oxford UP, 2021).",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(4)?sc_lang=en"
 },
 {
  "text": "Abstract\nThe origin of Chinese opera can be traced back to witchcraft rituals of the Neolithic ages. During the Northern Song Dynasty, a variety of performing arts, singing styles and oral literary genres merged to form Nanxi (Southern Drama), the first genre of Chinese opera. While Cantonese opera gradually took shape in the 1850s, it still maintains a close tie to Taoist rituals, preserves tunes from Kunju and a number of other operatic genres, as well as staging plays originated from Nanxi. This talk surveys the contemporary development of Cantonese opera in Hong Kong in the context of Chinese opera history, and puts in perspective how traditional operatic elements are preserved and modernised. Specifically, it will cover topics such as contemporary religious opera, the White Tiger Ritual as stage initiation, troupe organisation, role types, the repertory, characteristic features of vocal music, and training of young artists.\nProfessor Sauyan Chan taught at the Music Department of the Chinese University of Hong Kong from 1987 to 2007 and is currently Adjunct Professor at the Cultural Management Programme of CUHK. His publications include Improvisation in a Ritual Context: The Music of Cantonese Opera (1991) and a number of monographs on the music, history and ethnography of Cantonese opera.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(1)?sc_lang=en"
 },
 {
  "text": "领导简介 \n理事长 \n朱鸿林教授 自2018年4月起担任香港孔子学院理事长，兼本院中国历史文化研究中心主任。朱教授现任香港理工大学中国文化学系讲座教授，中国教育部长江学者讲座教授（中国古代史）；曾任本校人文学院院长、中国文化学系主任，并于2012年5月至2017年10月期间就任香港孔子学院院长。\n朱教授1984年取得美国普林斯顿大学东亚学博士学位，2009年到香港理工大学创办中国文化学系之前，历任美国普林斯顿大学东亚学系、威尔逊国际学者中心研究员，台湾中央研究院历史语言研究所研究员，香港中文大学历史系教授及副主任。朱教授是香港人文学院创院院士，曾获香港中文大学「校长模范教学奖」（2002年度）与首次香港特区大学资助委员会「人文学及社会科学杰出学者奖」（2012-13年度）。\n朱教授接受汉学训练，而专攻中国近世历史与文化，研究范围包括中国近世尤其明代的思想及政治、社会历史、宋明理学经典、明人文集等。朱教授研究积极，也以多份学术刊物的编委及文稿审查人等职务为所属的专业服务。朱教授的著作包括《书法与古籍》（中译本）、《明儒学案点校释误》等专着十种，另外学术论文逾八十篇，由北京三联书店出版为《朱鸿林明史研究系列》五种。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/chairman?sc_lang=sc"
 },
 {
  "text": "滕锦光教授 于2019年7月1日出任香港理工大学（理大）校长，执掌理大前，滕教授为南方科技大学副校长兼研究生院院长 。\n滕教授生于中国温州，1983年在浙江大学取得工学学士学位，其后到澳洲悉尼大学深造，1990年获颁授博士学位。 1989年至1991年，在英国爱丁堡大学先后作访问博士研究生和研究人员，进行了为期约两年的研究工作。 1991年至1994 年，在澳洲詹姆士库克大学 (James Cook University of North Queensland) 先后任职讲师、高级讲师。滕教授于1994年10月加入香港理工学院土木及结构工程学系，担任讲师一职，逐步晋升至讲座教授（2005年1月）。服务理大期间，滕教授先后出任建设及地政学院副院长（2005年至2006年）、协理副校长（2006 年至2010年）、建设及地政学院/建设及环境学院院长（2007年至2013年） ，以及可持续城市发展研究院院长（2012年至2018年）。\n滕教授是成就不凡的结构工程学者，曾撰专著及两百多篇SCI期刊论文，著作被世界各地的研究人员广为引用，多项科研成果被中国、澳洲、欧洲、英国及美国的设计标准、指南所采纳。\n滕教授杰出的学术成就享誉中外，屡获表扬。 2017年荣获中国科技界最高学术荣衔中国科学院院士。此外，他亦于2015年当选为爱丁堡皇家学会通讯院士，2013年当选为香港工程科学院院士。滕教授多年来获得许多奖项，其中包括2013年度获颁「国家自然科学奖」二等奖，2004年获颁「国家杰出青年科学基金」；以及获理大颁发2013/14年度研究及学术活动组别「校长特设卓越表现/成就奖」。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/president?sc_lang=sc"
 },
 {
  "text": "领导简介 \n院长 \n韩孝荣教授 先后求学于厦门大学（历史学学士）、中国社会科学院研究生院（民族学硕士）、杜兰大学（人类学硕士）和夏威夷大学（历史学博士）。他曾先后任职于中国社会科学院民族研究所、夏威夷大学西瓦湖分校、美国康州三一学院、新加坡国立大学、美国印州巴特勒大学和岭南大学（香港），自2017年8月以来为香港理工大学中国文化学系教授和系主任，自2019年11月以来兼任香港孔子学院院长。他的研究兴趣为中国和越南近现代史，重点关注知识分子与农民的关系、政府与少数民族的关系，以及中国与周边国家、特别是越南的关系。着有《中国思想中的农民：1900-1949》(Chinese Discourses on the Peasant, 1900-1949, SUNY Press, 2005) ，《红神：韦拔群和南中国的农民革命》(Red God: Wei Baqun and His Peasant Revolution in Southern China, 1894-1932, SUNY Press, 2014)，《中国民族关系散论》（新加坡：八方文化）及多篇论文，并担任China and Asia: A Journal in Historical Studies 的共同主编。",
  "url": "https://www.polyu.edu.hk/cihk/leadership/director?sc_lang=sc"
 },
 {
  "text": "Professor Jin-Guang TENG assumed office as President of The Hong Kong Polytechnic University (PolyU) on 1 July 2019. Prior to his current appointment, Professor Teng was Vice-President and Dean of Graduate School of Southern University of Science and Technology.\nProfessor Teng was born in Wenzhou, China. He received his BEng Degree from Zhejiang University in 1983. He pursued further study at the University of Sydney, Australia, and obtained his PhD degree in 1990. He spent about two years as a visiting PhD student and then researcher at The University of Edinburgh, the United Kingdom, from 1989 to 1991. From 1991 to 1994, he served as Lecturer and then Senior Lecturer at the then James Cook University of North Queensland, Australia. He joined the then Hong Kong Polytechnic as Lecturer in the Department of Civil and Structural Engineering in October 1994 and rose through the ranks to become Chair Professor in January 2005. He has served in various academic leadership roles at PolyU over the years, including as Associate Dean of Faculty of Construction and Land Use (2005 – 2006), Associate Vice President (2006 – 2010), Dean of Faculty of Construction and Land Use/Faculty of Construction and Environment (2007 – 2013) and Director of Research Institute for Sustainable Urban Development (2012 – 2018).\nA well-accomplished and distinguished scholar in the field of structural engineering, Professor Teng has authored one book and over 200 SCI journal papers. His publications have been widely cited by researchers globally, and many of his research findings have been adopted in relevant design codes/guidelines in China, Australia, Europe, the United Kingdom and the United States.\nProfessor Teng’s outstanding academic achievements have earned him numerous accolades, local and overseas. He was elected in 2017 as Member of the Chinese Academy of Sciences, which is the highest academic title in the field of science and technology in China, Corresponding Fellow of the Royal Society of Edinburgh in 2015, and Fellow of the Hong Kong Academy of Engineering Sciences in 2013. He won the State Natural Science Award of China (Second Class) in 2013 and the Distinguished Young Scholar Award from the National Natural Science Foundation of China in 2004. At PolyU, Professor Teng was the recipient of The President’s Award for Excellent Performance/Achievement 2013/2014 in the category of Research and Scholarly Activities.",
  "url": "https://www.polyu.edu.hk/cihk/leadership/president?sc_lang=en"
 },
 {
  "text": "Professor CHU Hung-lam is Chair Professor of Chinese Culture at The Hong Kong Polytechnic University (PolyU) and a Chang Jiang Scholars Chair Professor of Premodern Chinese History appointed by the Chinese Ministry of Education. He was PolyU’s Dean of the Faculty of Humanities, Head of Department of Chinese Culture, and Director of the Confucius Institute of Hong Kong (CIHK) from May 2012 to October 2017. He has been Chairman of Council of CIHK since April 2018. He is also Director of the Institute’s Center for Chinese History and Culture.\nProfessor Chu earned his PhD in East Asian Studies from Princeton University, USA. Prior to joining PolyU to found and head the Department of Chinese Culture in 2009, Professor Chu was a Fellow of the Woodrow Wilson International Center for Scholars in Washington, D.C., Research Fellow of the Institute of History and Philology at the Academia Sinica in Taipei, and Professor and Deputy Chairman of the Department of History at The Chinese University of Hong Kong. He is a Founding Fellow of the Hong Kong Academy of the Humanities and recipient of The Chinese University of Hong Kong Vice-Chancellor’s Exemplary Teaching Award (2002) and the first Humanities and Social Sciences Prestigious Fellowship awarded by the University Grants Committee of Hong Kong (2012).\nProfessor Chu is by training a sinologist with specialization in the history and culture of late imperial China. His areas of research include the intellectual, social and political history of that period, particularly of the Ming dynasty, Neo-Confucian classics, and literary collections by Ming authors. He is an active researcher and serves the profession as editorial board member of a number of scholarly journals, reviewer of manuscripts and tenure cases, and assessor of academic units. His publications include Calligraphy and the East Asian Book and 9 other books as well as some 80 journal articles and book chapters on Ming history studies in Chinese and in English now included in the 5-volume collection published by Beijing’s Joint Publishers under the collective title of Zhu Honglin mingshi yanjiu xilie.",
  "url": "https://www.polyu.edu.hk/cihk/leadership/chairman?sc_lang=en"
 },
 {
  "text": "Leadership \nDirector \nProfessor HAN Xiaorong\nDirector, Confucius Institute of Hong Kong\nProfessor HAN Xiaorong holds a BA in history from Amoy (Xiamen) University, a LLM in ethnic studies from the Chinese Academy of Social Sciences, a MA in anthropology from Tulane University, and a PhD in history from the University of Hawaii-Manoa. He is currently Professor and Head of Department of Chinese Culture as well as Director of the Confucius Institute of Hong Kong, The Hong Kong Polytechnic University. He had previous held positions at the Chinese Academy of Social Sciences, University of Hawaii-West Oahu, Trinity College, The National University of Singapore, Butler University, and Lingnan University (Hong Kong). He has conducted research on the interactions between intellectuals and peasants and between state and ethnic minorities in China, as well as China’s relations with Southeast Asia, particularly Vietnam. His publications include Chinese Discourses on the Peasant, 1900-1949 (SUNY, 2005), Red God: Wei Baqun and His Peasant Revolution in Southern China, 1894-1932 (SUNY, 2014), Zhongguo minzu guanxi sanlun [Essays on China’s Ethnic Relations] (Singapore, World Scientific, 2015), and numerous articles.",
  "url": "https://www.polyu.edu.hk/cihk/leadership/director?sc_lang=en"
 },
 {
  "text": "‘Lotus Aloft:’ Dunhuang Dance Narratives\nHistorically a frontier metropolis, Dunhuang was a strategic site along the Silk Road in northwestern China, a crossroads of trade, and a locus for religious, cultural, and intellectual influences since the Han dynasty (206 B.C.E.–220 C.E.). The 492 caves at the Mogao cliff near the modern town of Dunhuang have served as temples, sites for performative events, and an archive that consisted of medieval Chinese paintings and Buddhist sutras. Today, the Dunhuang Mogao Caves is among one of the most well-known UNESCO heritage sites along the ancient Silk Road. This lecture presentation introduces the creation of the Dunhuang mural dance genre as a sociocultural phenomenon that emerges through interactions and negotiations among multiple actors and institutions to envision and enact a Chinese vision as well as China’s imaginations of “journeying abroad” from and to the country. This phenomenon is involved in the re-creation of historical memory and identity of China in contemporary moments of contestation and transformation. The lecture examines the semiotics in the present-day imagination of the Silk Road – specifically, staged performances of the Dunhuang dance as an embodied re-interpretation and re-creating of the arts from the Dunhuang.\nDr Lanlan Kuang\nCurrently working on a new book on the Silk Road arts as a Visiting Research Fellow at the Dunhuang Academy, Lanlan Kuang is an Associate Professor and the Director of Humanities and Cultural Studies Program at the University of Central Florida’s Philosophy Department. Specializing in Asian humanities, aesthetics, and heritage studies, her research focuses on China’s media and cultural policies and their impacts on the country’s socioeconomic developments. Aa a Florida State Department’s Folklife Council Member, Kuang also serves as the current President of Florida Folklore Society and is a Center for Ethnic and Folk Literature and Arts (CEFLA) Distinguished Fellow appointed by China's Ministry of Culture and Tourism for her contributions to safeguarding folk arts and heritage culture. A prize-winning documentary film producer, she worked with organizations such as the USIA and SCOLA Educational Network as liaison and project director. Kuang holds a PhD in Folklore and Ethnomusicology from Indiana University, Bloomington and was on a Fulbright in China in 2008-2009. Her monograph on the expressive arts from along the Silk Road, The Dunhuang Performing Arts in Global Context (2016) is available in Harvard-Yenching Library, Princeton-Marquand Library of Art and Archaeology, and other research venues.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(7)?sc_lang=tc"
 },
 {
  "text": "The Blank Exam: Crises of Student Labor and Activism\nin the Late Cultural Revolution Film Juelie\nThis presentation examines the 1976 film Juelie 決裂 (“Breaking with Old Ideas”), a feature film depicting a fictional account of the founding of the Jiangxi Communist Labor University (江西共產主義勞動大學, or “Gongda” for short.) Like workers’ universities, Gongda gained prominence during the Cultural Revolution for its experimental approach to disrupting the divisions of labor that reproduced inequality. First established in 1958, Gongda was founded with the goal of producing new socialist workers. Its students were taught through a curriculum of “part-work, part-study,” and because it was registered as both a university and a production unit, the university supported its operations through the sale of products from its farms and factories. \nThrough explicit references to the historic role students had played in the Cultural Revolution, the fictional university students of Juelie combined mental and manual labor in a transformation of the student from the elite, bespectacled urban intellectual of the May Fourth era into a diffuse, pluralistic subject position embedded within the socialist project and its productive relations. But the film also responded to the crises raised by student activism during the Cultural Revolution, and this presentation will show how the film ultimately reinscribed student subjectivity within the patriarchal and developmentalist structures of the state.\nDr Angie Baecker\nAngie Baecker is a lecturer in the department of Art History at the University of Hong Kong. Her research focuses on the cultural and material history of Maoist China, the politics of the aesthetic, and the postsocialist legacy in contemporary China. She received her PhD from the University of Michigan, and holds an MA in modern Chinese literature from Tsinghua University. She is a 2020 recipient of the Andy Warhol Foundation’s Arts Writers Grant, and her writing on contemporary art has been published widely in venues including Artforum, ArtAsiaPacific, The New Statesman, and Vulture.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(8)?sc_lang=tc"
 },
 {
  "text": "The Blank Exam: Crises of Student Labor and Activism\nin the Late Cultural Revolution Film Juelie\nThis presentation examines the 1976 film Juelie 決裂 (“Breaking with Old Ideas”), a feature film depicting a fictional account of the founding of the Jiangxi Communist Labor University (江西共產主義勞動大學, or “Gongda” for short.) Like workers’ universities, Gongda gained prominence during the Cultural Revolution for its experimental approach to disrupting the divisions of labor that reproduced inequality. First established in 1958, Gongda was founded with the goal of producing new socialist workers. Its students were taught through a curriculum of “part-work, part-study,” and because it was registered as both a university and a production unit, the university supported its operations through the sale of products from its farms and factories. \nThrough explicit references to the historic role students had played in the Cultural Revolution, the fictional university students of Juelie combined mental and manual labor in a transformation of the student from the elite, bespectacled urban intellectual of the May Fourth era into a diffuse, pluralistic subject position embedded within the socialist project and its productive relations. But the film also responded to the crises raised by student activism during the Cultural Revolution, and this presentation will show how the film ultimately reinscribed student subjectivity within the patriarchal and developmentalist structures of the state.\nDr Angie Baecker\nAngie Baecker is a lecturer in the department of Art History at the University of Hong Kong. Her research focuses on the cultural and material history of Maoist China, the politics of the aesthetic, and the postsocialist legacy in contemporary China. She received her PhD from the University of Michigan, and holds an MA in modern Chinese literature from Tsinghua University. She is a 2020 recipient of the Andy Warhol Foundation’s Arts Writers Grant, and her writing on contemporary art has been published widely in venues including Artforum, ArtAsiaPacific, The New Statesman, and Vulture.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(9)?sc_lang=tc"
 },
 {
  "text": "Spectacular Benevolence: \nOperatic Entertainment and Court Politics \nin Qing-Dynasty China\nTheatrical performance occupied a central place in the emotional and political life of the Qing dynasty imperial household. For over two centuries, the Qing court poured a tremendous amount of human and material resources into institutionalizing the theatrical arts for the purposes of entertainment and edification. The emperors and empresses, as ardent patrons, went to great lengths to cultivate a discerning taste in theatre and oversaw the artistic and managerial aspects of court theatrical activities. Staging for the Emperors: A History of Qing Court Theatre, 1683-1923, examines two distinct and interlocking dimensions of the Qing court theatre—the vicissitudes of the palace troupe and the multifaceted functions of court-commissioned ceremonial dramas—to highlight the diverse array of views held by individual rulers as they used theatrical means to promote their personal and political agendas. Drawing on recently discovered materials from the court theatrel bureau, as well as court-commissioned paintings, memoirs written by foreign delegates, and play scripts written for court ceremonial occasions, this talk will zoom in on the theatrical performances produced for ceremonial occasions of Emperor Qianlong’s court. It shows how the ground principles of the guest ritual were reflected in ceremonial plays that addressed the theme of tribute-bearing and obeisance-paying guests and imperial subjects. This example demonstrates that theatre, like other forms of courtly art, served the individual rulers’ desire to embody virtue, to entertain at leisure, and to project aspirations.\nDr Liana Chen\nLiana Chen is Assistant Professor of Chinese and International Affairs at George Washington University. She is the author of Staging for the Emperors: A History of Qing Court Theatre, 1683-1923 (Cambria Press, 2021) and Literati and Actors at Work: The Transformations of Peony Pavilion on Page and on Stage in the Ming and Qing Dynasties (從案頭到氍毹: 《牡丹亭》明清文人之詮釋改編與舞台藝術之遞進; National Taiwan University Press, 2013). Liana Chen’s areas of teaching and research focus on Chinese drama and theatre, Chinese literature of the Ming and Qing dynasties, and Taiwanese literature and film. Her research has been supported by the Foundation for Development of Chinese Culture (Taiwan), the American Council of Learned Societies, and the Sigur Center for Asian Studies at GW.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(9)?sc_lang=en"
 },
 {
  "text": "The Blank Exam: Crises of Student Labor and Activism\nin the Late Cultural Revolution Film Juelie\nThis presentation examines the 1976 film Juelie 決裂 (“Breaking with Old Ideas”), a feature film depicting a fictional account of the founding of the Jiangxi Communist Labor University (江西共產主義勞動大學, or “Gongda” for short.) Like workers’ universities, Gongda gained prominence during the Cultural Revolution for its experimental approach to disrupting the divisions of labor that reproduced inequality. First established in 1958, Gongda was founded with the goal of producing new socialist workers. Its students were taught through a curriculum of “part-work, part-study,” and because it was registered as both a university and a production unit, the university supported its operations through the sale of products from its farms and factories. \nThrough explicit references to the historic role students had played in the Cultural Revolution, the fictional university students of Juelie combined mental and manual labor in a transformation of the student from the elite, bespectacled urban intellectual of the May Fourth era into a diffuse, pluralistic subject position embedded within the socialist project and its productive relations. But the film also responded to the crises raised by student activism during the Cultural Revolution, and this presentation will show how the film ultimately reinscribed student subjectivity within the patriarchal and developmentalist structures of the state. \nDr Angie Baecker\nAngie Baecker is a lecturer in the department of Art History at the University of Hong Kong. Her research focuses on the cultural and material history of Maoist China, the politics of the aesthetic, and the postsocialist legacy in contemporary China. She received her PhD from the University of Michigan, and holds an MA in modern Chinese literature from Tsinghua University. She is a 2020 recipient of the Andy Warhol Foundation’s Arts Writers Grant, and her writing on contemporary art has been published widely in venues including Artforum, ArtAsiaPacific, The New Statesman, and Vulture.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(8)?sc_lang=en"
 },
 {
  "text": "‘Lotus Aloft:’ Dunhuang Dance Narratives\nHistorically a frontier metropolis, Dunhuang was a strategic site along the Silk Road in northwestern China, a crossroads of trade, and a locus for religious, cultural, and intellectual influences since the Han dynasty (206 B.C.E.–220 C.E.). The 492 caves at the Mogao cliff near the modern town of Dunhuang have served as temples, sites for performative events, and an archive that consisted of medieval Chinese paintings and Buddhist sutras. Today, the Dunhuang Mogao Caves is among one of the most well-known UNESCO heritage sites along the ancient Silk Road. This lecture presentation introduces the creation of the Dunhuang mural dance genre as a sociocultural phenomenon that emerges through interactions and negotiations among multiple actors and institutions to envision and enact a Chinese vision as well as China’s imaginations of “journeying abroad” from and to the country. This phenomenon is involved in the re-creation of historical memory and identity of China in contemporary moments of contestation and transformation. The lecture examines the semiotics in the present-day imagination of the Silk Road – specifically, staged performances of the Dunhuang dance as an embodied re-interpretation and re-creating of the arts from the Dunhuang.\nDr Lanlan Kuang\nCurrently working on a new book on the Silk Road arts as a Visiting Research Fellow at the Dunhuang Academy, Lanlan Kuang is an Associate Professor and the Director of Humanities and Cultural Studies Program at the University of Central Florida’s Philosophy Department. Specializing in Asian humanities, aesthetics, and heritage studies, her research focuses on China’s media and cultural policies and their impacts on the country’s socioeconomic developments. Aa a Florida State Department’s Folklife Council Member, Kuang also serves as the current President of Florida Folklore Society and is a Center for Ethnic and Folk Literature and Arts (CEFLA) Distinguished Fellow appointed by China's Ministry of Culture and Tourism for her contributions to safeguarding folk arts and heritage culture. A prize-winning documentary film producer, she worked with organizations such as the USIA and SCOLA Educational Network as liaison and project director. Kuang holds a PhD in Folklore and Ethnomusicology from Indiana University, Bloomington and was on a Fulbright in China in 2008-2009. Her monograph on the expressive arts from along the Silk Road, The Dunhuang Performing Arts in Global Context (2016) is available in Harvard-Yenching Library, Princeton-Marquand Library of Art and Archaeology, and other research venues.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(7)?sc_lang=en"
 },
 {
  "text": "Property and Financial Management of Manchu Imperial Princesses in Qing China, 1617–1911\nDuring the Qing period (1644–1911), the property right of Women who married Manchu imperial family members were protected by Qing laws, but not the one of Manchu imperial princesses. Those Qing imperial princesses did not own full ownership of their property, only occupancy, use, and income rights, but not act of disposition. Their offspring did not have rights to inherit the estate from their mothers. This lecture draws on Qing sources in Manchu, Mongol, and Chinese and focuses on the human dowry of the Qing imperial princesses who married Mongol princes to explore the ownership of their property and how their property were used, managed, and transferred. In the end, this paper will show how the expenditure on patronage of Tibetan Buddhism played an important role in the Qing policies toward the Mongols.\nSpeeaker's Profile :\nWei-chieh Tsai received his PhD of Central Eurasian Studies from Indiana University in 2017 and is currently Assistant Professor of History at Shenzhen University. He is a socio-cultural historian of early modern Central Eurasia focusing on the relations between Inner Asia and China. His research field encompasses the topics of empire, ethnicity, migration, and law. He is also the author of From Marco Polo to George Macartney: Inner Asia and China since the Mongol Epoch (New Taipei: Gūsa Press, 2020) and the co-translator of the Chinese version of China Marches West written by Peter C. Perdue (with Pin-chen Yeh and Wen-kai Lin, New Taipei: Acropolis Press, 2021).\nMeeting Registration",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(5)?sc_lang=en"
 },
 {
  "text": "晚清時期英雄傳記風行一時，引發英雄崇拜的熱潮。但是此時所謂「傳記」，其實是融合諸多資源形構而成的新文類。《意大利建國三傑傳》作為晚清英雄傳記的代表作，充分展示了這一特徵。梁啟超借鑑明治政治小說的多種書寫模式，又援引本土小說的要素，將意大利建國史轉化為中國未來命運的預言，將意大利建國三傑刻畫為智、仁、勇的化身，將兒女情長俠義精神引入傳記書寫。正是由於梁啟超自出機杼的創造與轉化，此類英雄傳記廣受讀者歡迎，成為晚清文學文化史上的典範作品。\n崔文東現於香港城市大學中文及歷史學系擔任助理教授一職，從事近現代中國文學研究，尤其關注梁啟超、魯迅等文化巨擘。他於香港中文大學中國語言及文學系取得哲學博士學位，並曾任哈佛燕京學社訪問學人。迄今已在《文學評論》、《漢學研究》、《中國文哲研究集刊》等學術刊物發表論文十數篇，先後獲得教育部人文社會科學研究青年基金項目、香港大學教育資助委員會優配研究金、香港藝術發展局項目資助，並曾兩度榮膺宋淇翻譯研究論文紀念獎。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(3)?sc_lang=en"
 },
 {
  "text": "本演講的出發點是《西廂記》在法國的傳播與接受，從儒蓮、巴贊的戲曲翻譯談起，說明《西廂記》故事如何被十九世紀的歐陸漢學家理解，進而創發出風貌各異的紅娘、鶯鶯與張生等角色類型。本演講也將觸及晚清民初在法國的外交官、留學生，說明他們如何譯介或改編《西廂記》，並與法國文學界激盪出不同模式的文化交流。由此延伸出的議題是熊式一、夏志清等身處英美國家的華人學者，淺析他們如何將《西廂記》置放於知識傳播的脈絡下，讓《西廂記》在二十世紀成為西方讀者認識中國戲曲的重要媒介之一。\n講者簡介： \n羅仕龍博士畢業於國立臺灣大學，獲得法國巴黎新索邦大學戲劇博士。羅博士曾任教於法國巴黎狄德羅大學中文系、法國蒙彼利埃保羅梵樂希大學中文系，現為國立清華大學中文系副教授。羅博士曾出版法語專書《十九世紀法國戲劇舞台上的中國》，並有二十餘篇專業期刊論文。除了研究論文以外，羅博士也從事法國戲劇翻譯，曾譯有卡繆等作家的作品。自 2020 年起，羅博士擔任台積電文教基金會贊助「白先勇清華 文學講座」之主要負責人。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(1)?sc_lang=en"
 },
 {
  "text": "今天盛行的“科學育兒”話語和“科學母職”家政培訓背後，反映著中國現代化進程與家政工主體之間什麼樣的關係？\n本講座從現代化的理論入手，以商業化科學母職培訓為切入點，展現國家和市場如何共同塑造農村打工女性的現代化主體。\n蘇熠慧博士\n上海財經大學社會學系，副教授",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(8)?sc_lang=en"
 },
 {
  "text": "北宋時期大量人口湧入東京，既帶來城市經濟的繁榮，也導致各種“大城市病”。宋廷曾嘗試一系列應對措施，並最終選擇內聚式的發展路徑，即通過提升城市空間的利用效率，最大限度地容納更多的人口，彰顯出開放、共用與包容的城市精神。這種執政理念既理性務實，又洋溢著人文關懷，飽含宋廷對待弱勢群體的脈脈溫情，折射出柔性化治理的特徵。\n梁建國，北京大學歷史學博士，曾任中國社會科學院歷史研究所助理研究員、浙江大學高研院駐訪學者、哈佛大學訪問學者，現任廈門大學歷史與文化遺產學院教授、博士生導師。研究方向為宋代城市史、新文化史及社會經濟史。已出版專著《朝堂之外：北宋東京士人交遊》，在《歷史研究》《中國史研究》《中國經濟史研究》《文史哲》《北京大學學報》《中山大學學報》《廈門大學學報》等期刊發表論文20餘篇，其中多篇被《新華文摘》《人大報刊複印資料》全文轉載。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(4)?sc_lang=sc"
 },
 {
  "text": "中國古典詩歌的重要特色之一是抒情，而抒情中又特別注重感發，往往“思接千載”，“視通萬里”，不僅體現出作者旺盛的創造力，而且為讀者提供了開闊的想像空間。是次講座結合具體創作，從遺貌取神和神思超越等方面，從作者和讀者的角度，談談對中國古典詩歌的相關思考。\n張宏生，1989年在南京大學獲得博士學位，任教於南京大學中文系。現為香港浸會大學中文系講座教授。曾任美國哈佛大學、耶魯大學訪問學人。兼任中國明代文學研究會、中國詞學研究會副會長。治學領域包括中國文學史、古籍整理、詞學等。著有《江湖詩派研究》、《宋詩：融通與開拓》、《清代詞學的建構》、《清詞探微》、《經典傳承與體式流變》、《讀者之心》、《全清詞》之《雍乾卷》和《嘉道卷》等十餘種。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/distinguished-lectures-(1)?sc_lang=sc"
 },
 {
  "text": "草長鶯飛二月天，拂堤楊柳醉春煙。\n兒童散學歸來早，忙趁東風放紙鳶。\n相傳，中國的風箏發明於春秋戰國時期。最早出現的風箏是用竹子和木條製成的，隨造紙術發明並普及後，才逐漸開始用紙質代替，加上其外形似鳥，故此被稱為“紙鳶”。後來，古人對風箏進行改造，按上竹哨或弓弦，然後“使風入，作聲如箏”，造型和紋飾也開始變得多樣化。\n本次工作坊將由導師帶領大家製作有北京特色的沙燕風箏，沙燕風箏一直以獨特的燕子造型而聞名，其頭部是燕子頭部的平面變形，雙眉上挑，兩眼炯炯有神，還有一對尖利的剪刀尾巴，整體造型就是一隻展翅而飛的燕子。\n還在等什麼？快快報名參加工作坊，親手製作一隻屬於你的“小燕子”，尋一處沙灘，覓一片草坪，就等東風放紙鳶吧！\n日期：2023年2月25日（週六）\n時間：3：00-5：00 \n地點 ：香港孔子學院大堂PolyU A204\n語言：普通話，輔以粵語 名額：15人（成功報名人士將收到電郵通知）\n按此報名",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/workshop-(1)?sc_lang=sc"
 },
 {
  "text": "草長鶯飛二月天，拂堤楊柳醉春煙。\n兒童散學歸來早，忙趁東風放紙鳶。\n相傳，中國的風箏發明於春秋戰國時期。最早出現的風箏是用竹子和木條製成的，隨造紙術發明並普及後，才逐漸開始用紙質代替，加上其外形似鳥，故此被稱為“紙鳶”。後來，古人對風箏進行改造，按上竹哨或弓弦，然後“使風入，作聲如箏”，造型和紋飾也開始變得多樣化。\n本次工作坊將由導師帶領大家製作有北京特色的沙燕風箏，沙燕風箏一直以獨特的燕子造型而聞名，其頭部是燕子頭部的平面變形，雙眉上挑，兩眼炯炯有神，還有一對尖利的剪刀尾巴，整體造型就是一隻展翅而飛的燕子。\n還在等什麼？快快報名參加工作坊，親手製作一隻屬於你的“小燕子”，尋一處沙灘，覓一片草坪，就等東風放紙鳶吧！\n日期：2023年2月25日（週六）\n時間：3：00-5：00 \n地點 ：香港孔子學院大堂PolyU A204\n語言：普通話，輔以粵語 名額：15人（成功報名人士將收到電郵通知）\n按此報名",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/workshop-(1)?sc_lang=en"
 },
 {
  "text": "This talk begins with an overview of the interconnection between literature and philosophy in modern Chinese literature. Then, it probes into the three existentialist allegories in Fortress Besieged (1947), a philosophical novel written by Qian Zhongshu, a polyglot scholar of East-East comparative literature and philosophy. The novel’s overarching allegory, i.e., a fortress besieged, will be compared in juxtaposition with several philosophical allegories about the mutability and limitations of human life in Western philosophy. This talk concludes with a reflection on the seminal influence of this novel in contemporary Chinese society where “fortress besieged” has become an everyday word referring to one’s existential crisis. \nDr. Heidi Huang obtained her PhD and MA in Transcultural Studies from University of Lyon and pursued her postdoctoral studies in comparative literature and world literature at the City University of Hong Kong. She used to work as associate professor in comparative literature and translation at The School of International Studies, Sun Yat-sen University. She is currently Research and Development Manager at The Advanced Institute for Global Chinese Studies at Lingnan University, while also serving the role as managing editor of Prism: Theory and Modern Chinese.\nMeeting Registration",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2023/specialist-lectures-(1)"
 },
 {
  "text": "Abstract (based on the abstract of Chapter 1)\nIn this CIHK webinar, we will discuss the material conditions of and historical background to the use of Classical Chinese or Literary Sinitic in writing-mediated brush conversation between literati of Sinitic engaged in cross-border communication within Sinographic East Asia or the Sinographic cosmopolis, which corresponds with today’s China, North Korea, South Korea, Japan (including Okinawa, formerly the Ryukyu Kingdom) and Vietnam. Compared with speech as a modality of communication, real-time writing-mediated interaction between talking humans, synchronously face-to-face, seems uncommon. In any society, speaking is premised on one condition: the interlocutors must have at least one shared spoken language at their disposal, but even then, there are circumstances under which speaking is either physically not feasible or socially inappropriate. Could writing function as an alternative modality of communication when speaking is not an option due to the absence of a shared spoken language, as in cross-border communication settings? Whereas real-time writing-mediated face-to-face interaction is rare where a regional lingua franca was known to exist (e.g., Latin and Arabic), there is ample historical evidence of literati of Classical Chinese or Literary Sinitic from different parts of Sinographic East Asia conducting ‘silent conversation’, synchronously and interactively in writing mode using brush, ink, and paper. Such a pattern of writing-assisted interaction is still practiced and observable in pen-assisted conversation – pen-talk – between Chinese and Japanese speakers today, thanks to the pragma-linguistic affordance of morphographic, non-phonographic sinograms (i.e., Chinese characters and Japanese kanji). We will outline the historical spread of Classical Chinese or Sinitic texts from the ‘center’ to the ‘peripheries’, and the historical background to the acquisition of literacy in Sinitic by the people there. Their shared knowledge of Sinitic helps explain why, for well over a thousand years until the 1900s, literati from these places were able to speak their mind by engaging in ‘Sinitic brush-talk’ 漢文筆談 in cross-border communication.\nDavid C. S. Li\nDavid C. S. Li (李楚成) is professor and Head of the Department of Chinese and Bilingual Studies (中文及雙語學系), The Hong Kong Polytechnic University (香港理工大學). He received his BA in English (Hong Kong), MA in Applied Linguistics (France), and PhD in Linguistics (Germany). He has published widely in multilingualism in Greater China, World Englishes, Hong Kong English, China English, bilingual education and language policy, bilingual interaction and code-switching (translanguaging), Cantonese as an additional language, and South Asian Hongkongers’ needs for written Chinese. He speaks Cantonese, English and Mandarin fluently, is conversant in German and French, and is learning Japanese and Korean. More recent interests focus on the historical spread of written Chinese (Sinitic) and its use as a scripta franca until the early twentieth century in Sinographic East Asia (China, Japan, Korea, and Vietnam). \nEmail: david.cs.li@polyu.edu.hk.\nReijiro Aoyama\nReijiro Aoyama’s (青山玲二郎) research is concerned with transnational and global processes mediated by migration and the movement of information, symbols, capital and cultural commodities. His research interests include anthropology of work and mobility, narratives of migration, and material and non-material culture of cross-border interactions. He has conducted several long-term ethnographies of the Japanese presence in East Asia, and has published on Japanese diaspora, craftsmanship, and emotional work in service industries, Sino-Japanese animation, and historical cross-border interactions mediated by Sinitic writing. Before taking up his post at The Hong Kong Polytechnic University, he taught at Fudan University, Tsinghua University, and City University of Hong Kong.\nEmail: rei.aoyama@polyu.edu.hk\nWong Tak-Sum, Sam\nWONG Tak-Sum (黃得森) is a post-doctoral fellow in the Department of Chinese and Bilingual Studies at the Hong Kong Polytechnic University. He received his BEng in Computer Science from Hong Kong University of Science and Technology (2004), and PhD in Linguistics from City University of Hong Kong (2018). He has built a treebank of the Tripiṭaka Koreana during his doctoral study and has been working on the quantitative study of historical syntax. His research expertise covers Chinese historical linguistics, Cantonese linguistics, corpus linguistics, computer-assisted language learning, Chinese dialectology and Chinese palæography. \nEmail: tak-sum.wong@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(3)?sc_lang=en"
 },
 {
  "text": "Abstract\nAs a kingdom that existed during the Song, Liao, Xia and Jin period, the history and culture of Xi Xia had its distinctive features, but at the same time, the culture of Xi Xia was also closely related to that of China proper. Following the model of Chinese characters, Xi Xia created its own script, which was used for creating a lot of documents. Xi Xia adopted Confucianism and honored Confucius as Emperor of Exalted Culture. It promoted Chinese scholarship, implemented the civil service examination system, and cultivated talents. The Xi Xia court codified legal codes by incorporating elements of Chinese legal codes, and the Xi Xia legal codes extant today are the earliest legal codes written in a minority script, thus enriching the Chinese legal system. Xi Xia also accepted the Chinese social customs and left a large number of valuable documents regarding social life. The Xi Xia technicians improved the Chinese printing technique by inventing wood movable type printing. Finally, the people of Xi Xia revered Buddhism, translated the Tripitaka brought from China proper into the Xi Xia script, and thousands of volumes of Buddhist scriptures have been unearthed. Xi Xia also borrowed cultural elements from the neighboring Tubo and Uyghur peoples. The culture of Xi Xia is an integral part of the brilliant traditional cultures of China.\nProfessor Shi Jinbo is an academician and a research fellow of the Chinese Academy of Social Sciences, a member of the Academic Advisory Committee of the Chinese Academy of History, and deputy director of the National Committee of Experts on the Protection of Classics. \nHis main research fields are the culture and history of Xi Xia, Chinese national history and Chinese national ancient script. He has Presided over and completed more than 20 major and key national and provincial projects and published 36 books (including cooperation), mainly \"A Brief History of Xi Xia Buddhism\", \"Xi Xia Cultural Relics\", \"Xi Xia Tiansheng Legal Codes\", \"Exploring the Ancient Writings of Chinese Nationalities through the Ages\", \"Xi Xia Society\", \"Xi Xia Text Tutorial\", \"Study of Xi Xia Economic Documents\", \"Outline of Chinese Ethnohistory\", etc. He has been the chief editor of 25 books, including \"Russian Tibetan Literature of Heishui City\" (31 volumes) and \"Chinese Tibetan Literature of Xi Xia\" (20 volumes), and participated in writing and editing 18 dictionaries, and published more than 370 articles.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(2)?sc_lang=en"
 },
 {
  "text": "香港由來與兩地關係\n演講主要介紹香港的歷史沿革，香港與内地的歷史文化聯繫，以及香港在中國歷史發展中的獨特地位。\n一、古代香港\n二、英佔香港\n三、香港與辛亥革命\n四、香港與抗日戰爭\n五、新中國對港政策\n六、香港與國家的改革開放\n七、兩地情緣\n劉蜀永教授：香港史專家、中國社會科學院近代史研究所研究員、嶺南大學香港與華南歷史研究部高級研究員、香港地方志中心事務顧問。\n主要論著有《簡明香港史》、《香港史—從遠古到九七》、《香港志•總述•大事記》、《劉蜀永香港史文集》、《19世紀的香港》、《20世紀的香港》、《20世紀的香港經濟》、An Outline History of Hong Kong 等。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/distinguished-lecture-(3)?sc_lang=tc"
 },
 {
  "text": "Cultural Habitus and Religious Doxa: \nTheorizing the Confucian-Buddhist Encounter in Late Imperial China\nThe paper explores Confucianism’s interaction with Buddhism in late imperial China by examining the mediating and defining role of the latter, especially its Chan iteration. The fact that Chan, a predominant Sinitic Buddhist sect, exerted enormous influences on the origination and development of Neo-Confucianism is commonly acknowledged and generally well-known. The paper theorizes the fraught relationship between the two religio-philosophical traditions through the intervention of Pierre Bourdieu’s descriptive-analytic ideas of “habitus” (a continuous system of ideational and ideological dispositions constituted historically) and “doxa” (the cultural realities that are taken for granted, consciously or subconsciously), and in the process, it also questions and critiques the much-used theoretical framework of syncretism. The paper argues that Chan, while being branded as a heterodoxy at odds with the Confucian orthodoxy, was in actuality integrally and functionally a part of the Chinese cultural capital. Their respective putative doctrinal certitude in large part relied on their self-identification in terms of each other. At the same time that they sought to negate and denigrate each other, they became mutually reinforced and clarified. \nOn-cho Ng is Professor of Asian Studies and Philosophy, and former founding Head (2012-2021) of the Asian Studies Department at the Pennsylvania State University. Primarily a specialist in late imperial Chinese intellectual history, he has published extensively on a wide range of topics, such as Confucian hermeneutics, religiosity, ethics, and historiography. His books include Cheng-Zhu Confucianism in the Early Qing, Mirroring the Past, and The Imperative of Understanding. His dozens of articles have appeared in major outlets such as Dao, Philosophy East and West, Journal of Chinese Philosophy, Journal of World History, Journal of Chinese Religions, and the Journal of the History of Ideas. He is co-editor of the Book Series on Chinese intellectual history published by National Taiwan University and serves as associate editor of the Journal of Chinese Philosophy. He is also the Vice-President of the International Association for Yijing Studies (Beijing) and sits on the editorial boards of several academic publications.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/distinguished-lecture-(4)?sc_lang=tc"
 },
 {
  "text": "Cultural Habitus and Religious Doxa: \nTheorizing the Confucian-Buddhist Encounter in Late Imperial China\nThe paper explores Confucianism’s interaction with Buddhism in late imperial China by examining the mediating and defining role of the latter, especially its Chan iteration. The fact that Chan, a predominant Sinitic Buddhist sect, exerted enormous influences on the origination and development of Neo-Confucianism is commonly acknowledged and generally well-known. The paper theorizes the fraught relationship between the two religio-philosophical traditions through the intervention of Pierre Bourdieu’s descriptive-analytic ideas of “habitus” (a continuous system of ideational and ideological dispositions constituted historically) and “doxa” (the cultural realities that are taken for granted, consciously or subconsciously), and in the process, it also questions and critiques the much-used theoretical framework of syncretism. The paper argues that Chan, while being branded as a heterodoxy at odds with the Confucian orthodoxy, was in actuality integrally and functionally a part of the Chinese cultural capital. Their respective putative doctrinal certitude in large part relied on their self-identification in terms of each other. At the same time that they sought to negate and denigrate each other, they became mutually reinforced and clarified. \nOn-cho Ng is Professor of Asian Studies and Philosophy, and former founding Head (2012-2021) of the Asian Studies Department at the Pennsylvania State University. Primarily a specialist in late imperial Chinese intellectual history, he has published extensively on a wide range of topics, such as Confucian hermeneutics, religiosity, ethics, and historiography. His books include Cheng-Zhu Confucianism in the Early Qing, Mirroring the Past, and The Imperative of Understanding. His dozens of articles have appeared in major outlets such as Dao, Philosophy East and West, Journal of Chinese Philosophy, Journal of World History, Journal of Chinese Religions, and the Journal of the History of Ideas. He is co-editor of the Book Series on Chinese intellectual history published by National Taiwan University and serves as associate editor of the Journal of Chinese Philosophy. He is also the Vice-President of the International Association for Yijing Studies (Beijing) and sits on the editorial boards of several academic publications.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/distinguished-lecture-(4)?sc_lang=sc"
 },
 {
  "text": "‘Lotus Aloft:’ Dunhuang Dance Narratives\nHistorically a frontier metropolis, Dunhuang was a strategic site along the Silk Road in northwestern China, a crossroads of trade, and a locus for religious, cultural, and intellectual influences since the Han dynasty (206 B.C.E.–220 C.E.). The 492 caves at the Mogao cliff near the modern town of Dunhuang have served as temples, sites for performative events, and an archive that consisted of medieval Chinese paintings and Buddhist sutras. Today, the Dunhuang Mogao Caves is among one of the most well-known UNESCO heritage sites along the ancient Silk Road. This lecture presentation introduces the creation of the Dunhuang mural dance genre as a sociocultural phenomenon that emerges through interactions and negotiations among multiple actors and institutions to envision and enact a Chinese vision as well as China’s imaginations of “journeying abroad” from and to the country. This phenomenon is involved in the re-creation of historical memory and identity of China in contemporary moments of contestation and transformation. The lecture examines the semiotics in the present-day imagination of the Silk Road – specifically, staged performances of the Dunhuang dance as an embodied re-interpretation and re-creating of the arts from the Dunhuang.\nDr Lanlan Kuang\nCurrently working on a new book on the Silk Road arts as a Visiting Research Fellow at the Dunhuang Academy, Lanlan Kuang is an Associate Professor and the Director of Humanities and Cultural Studies Program at the University of Central Florida’s Philosophy Department. Specializing in Asian humanities, aesthetics, and heritage studies, her research focuses on China’s media and cultural policies and their impacts on the country’s socioeconomic developments. Aa a Florida State Department’s Folklife Council Member, Kuang also serves as the current President of Florida Folklore Society and is a Center for Ethnic and Folk Literature and Arts (CEFLA) Distinguished Fellow appointed by China's Ministry of Culture and Tourism for her contributions to safeguarding folk arts and heritage culture. A prize-winning documentary film producer, she worked with organizations such as the USIA and SCOLA Educational Network as liaison and project director. Kuang holds a PhD in Folklore and Ethnomusicology from Indiana University, Bloomington and was on a Fulbright in China in 2008-2009. Her monograph on the expressive arts from along the Silk Road, The Dunhuang Performing Arts in Global Context (2016) is available in Harvard-Yenching Library, Princeton-Marquand Library of Art and Archaeology, and other research venues.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(7)?sc_lang=sc"
 },
 {
  "text": "The Blank Exam: Crises of Student Labor and Activism\nin the Late Cultural Revolution Film Juelie\nThis presentation examines the 1976 film Juelie 決裂 (“Breaking with Old Ideas”), a feature film depicting a fictional account of the founding of the Jiangxi Communist Labor University (江西共產主義勞動大學, or “Gongda” for short.) Like workers’ universities, Gongda gained prominence during the Cultural Revolution for its experimental approach to disrupting the divisions of labor that reproduced inequality. First established in 1958, Gongda was founded with the goal of producing new socialist workers. Its students were taught through a curriculum of “part-work, part-study,” and because it was registered as both a university and a production unit, the university supported its operations through the sale of products from its farms and factories. \nThrough explicit references to the historic role students had played in the Cultural Revolution, the fictional university students of Juelie combined mental and manual labor in a transformation of the student from the elite, bespectacled urban intellectual of the May Fourth era into a diffuse, pluralistic subject position embedded within the socialist project and its productive relations. But the film also responded to the crises raised by student activism during the Cultural Revolution, and this presentation will show how the film ultimately reinscribed student subjectivity within the patriarchal and developmentalist structures of the state.\nDr Angie Baecker\nAngie Baecker is a lecturer in the department of Art History at the University of Hong Kong. Her research focuses on the cultural and material history of Maoist China, the politics of the aesthetic, and the postsocialist legacy in contemporary China. She received her PhD from the University of Michigan, and holds an MA in modern Chinese literature from Tsinghua University. She is a 2020 recipient of the Andy Warhol Foundation’s Arts Writers Grant, and her writing on contemporary art has been published widely in venues including Artforum, ArtAsiaPacific, The New Statesman, and Vulture.",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2021/specialist-lectures-(8)?sc_lang=sc"
 },
 {
  "text": "盼望著，盼望著，新學期來了，金秋的腳步近了。\n好朋友們，小夥伴們，暌違許久的香港孔子學院日又！來！啦！\n2022年第六屆香港孔子學院日\n時間：9月24日（週六）下午3點-5點\n地點：PolyU 校園TU201\n當日活動有古琴表演、漢服模特秀和宋代點茶小劇場~\n更為現場觀眾提供漢服體驗機會！\n豐富的傳統文化科普，多彩的傳統藝術表演，更有神秘嘉賓——國家級非遺大師空降現場！\n還有，還有… …\n我們為大家準備了來自故宮博物館、國家博物館和敦煌博物館的文創美物！當日下午2：30開始入場，前50位報名的來賓可於簽到處抽獎，獎品先到先抽，抽完即止！\n錯過抽獎機會的好朋友也無需遺憾，現場還有香港孔院日主題相框、六藝手持拍照板，請盡情發揮創意，上傳你（您）的靚照，關注並@香港孔子學院的 Facebook或Instagram(cihk_polyu)，就有機會贏取精美禮品！\n還等什麼？！",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/cihk-day"
 },
 {
  "text": "清朝皇族婚入女子的財產權受到法律保障，但是皇族女子的財產權則缺乏法律保障，分產的機會也相對稀少。清朝公主出嫁後對於其陪嫁的人丁、動產與不動產並未擁有完整的所有權，僅擁有占有權、使用權與收益權，而不具備轉讓或出售的處分權，其後代對其亦無繼承權。本文以清代滿洲公主的陪嫁莊頭與壯丁為例，運用清代滿蒙漢文檔案材料和官書典籍，輔以其他二手研究文獻，以出嫁蒙古王公之清朝公主的收支為核心，並聚焦於其妝奩上，探討其財產的所有權、管理機制與公主薨逝後的轉讓情況。最後透過研究公主在崇奉藏傳佛教上的花費，說明清朝公主如何在清朝治理蒙古的政策中起到重要作用。\n蔡偉傑，美國印第安納大學內陸歐亞學系博士。現任深圳大學人文學院歷史系助理教授。研究方向為蒙古時代以降的歐亞世界史及內亞與中國關係史，著重於帝國、族群、移民與法制史領域。著有《從馬可波羅到馬戛爾尼：蒙古時代以降的內亞與中國》（新北：八旗文化，2020年），譯有《中國西征》（與葉品岑、林文凱合譯，新北：衛城，2021年）。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(5)?sc_lang=tc"
 },
 {
  "text": "清朝皇族婚入女子的財產權受到法律保障，但是皇族女子的財產權則缺乏法律保障，分產的機會也相對稀少。清朝公主出嫁後對於其陪嫁的人丁、動產與不動產並未擁有完整的所有權，僅擁有占有權、使用權與收益權，而不具備轉讓或出售的處分權，其後代對其亦無繼承權。本文以清代滿洲公主的陪嫁莊頭與壯丁為例，運用清代滿蒙漢文檔案材料和官書典籍，輔以其他二手研究文獻，以出嫁蒙古王公之清朝公主的收支為核心，並聚焦於其妝奩上，探討其財產的所有權、管理機制與公主薨逝後的轉讓情況。最後透過研究公主在崇奉藏傳佛教上的花費，說明清朝公主如何在清朝治理蒙古的政策中起到重要作用。\n蔡偉傑，美國印第安納大學內陸歐亞學系博士。現任深圳大學人文學院歷史系助理教授。研究方向為蒙古時代以降的歐亞世界史及內亞與中國關係史，著重於帝國、族群、移民與法制史領域。著有《從馬可波羅到馬戛爾尼：蒙古時代以降的內亞與中國》（新北：八旗文化，2020年），譯有《中國西征》（與葉品岑、林文凱合譯，新北：衛城，2021年）。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(5)?sc_lang=sc"
 },
 {
  "text": "本演講的出發點是《西廂記》在法國的傳播與接受，從儒蓮、巴贊的戲曲翻譯談起，說明《西廂記》故事如何被十九世紀的歐陸漢學家理解，進而創發出風貌各異的紅娘、鶯鶯與張生等角色類型。本演講也將觸及晚清民初在法國的外交官、留學生，說明他們如何譯介或改編《西廂記》，並與法國文學界激盪出不同模式的文化交流。由此延伸出的議題是熊式一、夏志清等身處英美國家的華人學者，淺析他們如何將《西廂記》置放於知識傳播的脈絡下，讓《西廂記》在二十世紀成為西方讀者認識中國戲曲的重要媒介之一。\n講者簡介： \n羅仕龍博士畢業於國立臺灣大學，獲得法國巴黎新索邦大學戲劇博士。羅博士曾任教於法國巴黎狄德羅大學中文系、法國蒙彼利埃保羅梵樂希大學中文系，現為國立清華大學中文系副教授。羅博士曾出版法語專書《十九世紀法國戲劇舞台上的中國》，並有二十餘篇專業期刊論文。除了研究論文以外，羅博士也從事法國戲劇翻譯，曾譯有卡繆等作家的作品。自 2020 年起，羅博士擔任台積電文教基金會贊助「白先勇清華 文學講座」之主要負責人。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(1)?sc_lang=tc"
 },
 {
  "text": "本演講的出發點是《西廂記》在法國的傳播與接受，從儒蓮、巴贊的戲曲翻譯談起，說明《西廂記》故事如何被十九世紀的歐陸漢學家理解，進而創發出風貌各異的紅娘、鶯鶯與張生等角色類型。本演講也將觸及晚清民初在法國的外交官、留學生，說明他們如何譯介或改編《西廂記》，並與法國文學界激盪出不同模式的文化交流。由此延伸出的議題是熊式一、夏志清等身處英美國家的華人學者，淺析他們如何將《西廂記》置放於知識傳播的脈絡下，讓《西廂記》在二十世紀成為西方讀者認識中國戲曲的重要媒介之一。\n講者簡介： \n羅仕龍博士畢業於國立臺灣大學，獲得法國巴黎新索邦大學戲劇博士。羅博士曾任教於法國巴黎狄德羅大學中文系、法國蒙彼利埃保羅梵樂希大學中文系，現為國立清華大學中文系副教授。羅博士曾出版法語專書《十九世紀法國戲劇舞台上的中國》，並有二十餘篇專業期刊論文。除了研究論文以外，羅博士也從事法國戲劇翻譯，曾譯有卡繆等作家的作品。自 2020 年起，羅博士擔任台積電文教基金會贊助「白先勇清華 文學講座」之主要負責人。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(1)?sc_lang=sc"
 },
 {
  "text": "Abstract: During the sixteenth and early seventeenth centuries, the relaxation of the Ming sea ban, along with the arrival of the Europeans, generated a multipolar environment in East Asia. It revolved around the intra-Asian exchange centered upon Chinese silk and Japanese silver, and a nascent global flow of New World bullion to China and spices for Western Europe. The situation changed during the mid-seventeenth century amid mounting restrictions on overseas contacts from the Tokugawa shogunate of Japan and the consolidation and militarization of Chinese merchants under the Zheng family. By 1683, when the Qing forced the Zheng to surrender and occupied their bastion of Taiwan, China had achieved naval preeminence in the East Asian sea lanes. Other than a few outposts, the Europeans had largely withdrawn from the area north of island Southeast Asia, which remained under the hegemony of the Dutch East India Company. In 1684, the Qing court legalized private trade and travel abroad, prompting another wave of overseas migration. Authorities in China and across eastern maritime Asia enacted policies that kept the Qing merchants and immigrants separate from the earlier Ming loyalists. Additionally, both groups of Chinese were accorded significant political, economic, and legal privileges. This infrastructure, backed by Qing naval power, paved the way for the “Chinese century” in maritime Asia. \nXing Hang is Associate Professor of History at Brandeis University. He received his PhD from the University of California, Berkeley. He is the author of Conflict and Commerce in Maritime East Asia: The Zheng Family and the Shaping of the Modern World, c.1620–1720 and co-editor of Sea Rovers, Silver, and Samurai: Maritime East Asia in Global History, 1550–1700. He has also written numerous articles and reviews for major journals, and is a recipient of many grants and awards, including the American Council of Learned Societies Henry Luce Fellowship and the Michael L. Walzer Prize for Excellence in Teaching. ",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(7)"
 },
 {
  "text": "2022年11月19日（星期六）\n上午 10:00-12:00\n講題一：空間、檔案庫、島嶼：「來者不拒」的文化研究方法論\n作為一門相對新的學科，文化研究(Cultural Studies)對於研究者所使用的文本類型具有很強包容性。這些文本可以包括與各種文化其他社會實踐相關的文字和視覺材料。在本次研習營中，潘律博士將從文化研究領域的研究者的角度和大家分享她對於如何使用歷史和當代的各種文本，並結合相關的批判理論和概念來確定自己的研究目標和方法。潘博士會以她過去和現在的兩項研究——亞洲藝術檔案庫，以及正在進行中的海南島的研究——作為分享的案例。\n下午 2:30-4:30\n講題二：戰中之戰：一個華北鄉村的淪陷政治，1938-1945\n本文利用地方資料研究抗戰時期江蘇豐縣西北村寨的鄉紳及其被近代化的過程。自咸豐、同治年間的捻軍之亂以來，當地鄉紳以寨子為基礎，凝聚家族和社群，強化自衛和自治。抗戰初期，鄉紳在王獻臣、共產黨和國民黨三方之間觀望，在抗日與自衛之間徘徊。1938年12月，歸順日軍的王獻臣主力被國共雙方聯手殲滅，鄉紳在自衛邏輯下全面投向國民黨，組建區常備隊抗日，但隨即在1939年5月被日軍圍殲，死傷慘重。失去地方精英加持的國民黨勢力在鄉村岌岌可危，共產黨則乘機代替鄉紳建設鄉村政權，形成兩套行政體系，加劇國共之爭。1940年6月國共雙方在豐縣西北短兵相接，國民黨勢力被驅逐，殘餘鄉紳逃亡他鄉，其「保護型經紀」的統治體系逐漸被政權武力移除，成為中共在江蘇北部創建根據地的一個路徑。\n潘律博士，香港理工大學中國文化系副教授。潘律著有三本專著：《看不見的復寫城市：柏林和上海的記憶、空間和現代性》（伯爾尼：Peter Lang，2016）、《公共空間的審美化：東亞城市的街頭視覺政治》（布裡斯托爾：Intellect，2015），以及《圖像、想像和想像之所：大中華地區的二戰紀念碑》（新加坡：Palgrave Macmillan，2021）。潘博士也是一名影像藝術家策展人。\n張雷博士，江蘇豐縣人，北京大學碩士，美國雪城大學博士，香港嶺南大學歷史系助理教授，主要研究城市史，環境史，歷史地理。編著有《北平學人訪問記》（商務印書館）等，並在Journal of Urban History, Journal of Historical Geography, Technology and Culture，《近代史研究》，《地理學報》，《中央研究院近代史研究所集刊》以及《二十一世紀》（香港）等專業期刊發有論文。\n按此報名",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/lectures-(1119)"
 },
 {
  "text": "題目：習俗與教化——秦漢魏晉國家治理模式的轉形\n日期：11月22日\n時間：上午10：20 - 12：20\n語言：普通話\n平台：ZOOM\n講座簡介:\n古代中國幅員遼闊，習俗各異，如何實行統一管理是一大難題。秦朝用嚴刑峻法移風易俗，激起東方社會的激烈反抗，很快歸於失敗。西漢初年郡國並行，允許東方王國在一定程度上從俗而治。但王國勢力太大，危及國家的統一，文景二帝不得不收奪諸侯王的自治權。為了避免重蹈亡秦覆轍，儒生們提出“德教”主張，其中又包含“以禮為治”和“以德化民”兩種方案。受其影響，武帝以後的朝廷政策繼續表現出大幅度搖擺，至漢末魏晉才確立了基本符合當時國情的治理模式。\n陳蘇鎮博士，1955年生，畢業於北京大學歷史學系，獲博士學位，現任北京大學歷史學系教授，北京大學中國古代史研究中心主任，香港教育大學人文學院訪問教授。主要從事秦漢魏晉南北朝史、中國古代政治制度史、中國古代政治文化史的教學和研究。著有《<春秋>與“漢道”——兩漢政治與政治文化研究》、《從未央宮到洛陽宮——兩漢魏晉宮禁制度考論》、《兩漢魏晉南北朝史探幽》等。。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(6)"
 },
 {
  "text": "題目: 左江沿岸崖壁上駱越文明的投影——花山岩畫的科技與文化解讀\n日期：10月13日\n時間：下午4：30 - 6：00\n語言：普通話\n平臺：騰訊會議（VooV）\n講座簡介:\n世界遺產「左江花山岩畫文化景觀」，綿延105公里，其中最大的單幅岩畫有8000平米。這一遺產有八個謎：何人、何時、出於什麼目的，投入如此巨大的人力物力，在懸崖峭壁之上繪製令人震撼的岩畫群？是用什麼顏料繪製千年不褪色？是怎樣畫上去的？為什麼人的圖像都是蛙形？岩畫中有數百面銅鼓，為什麼？為何這一世界遺產叫「文化景觀」？如今在廣西少數民族地區還有哪些岩畫遺風？\n萬輔彬教授，中國著名科技史學家，中國科技史學會少數民族科技史專業委員會原主任，以古代銅鼓為研究對象先後獲得3項國家自然科學基金項目和1項國家社科基金項目。近年來對花山岩畫研究有新的昇華。曾任廣西民族大學副校長、資深教授，中科院自然科學史所客座研究員、兼職博導，享受國務院頒發的政府特殊津貼專家。",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/distinguished-lecture-(5)"
 },
 {
  "text": "講座摘要:中國古典詩歌非常善於運用視覺畫面來進行情感表達。在這個時候，視覺畫面就類似一種鏡頭語言，它不需要對白旁白，就能使觀眾理解作者希望表達什麼。講座將選取經典詩作，分析其中的運鏡和剪輯技巧，以及這些鏡頭語言可以激發的心理效果。 于溯，南京大學歷史學學士（2006），文學碩士（2008），文學博士（2011）。現任南京大學文學院副教授。 主要作品有：《中國古典文獻中的模組化書寫》、《行走的書簏:中古時期的文獻記憶與文獻傳播》、《范曄〈後漢志〉篇目考》、《陳寅恪“合本子注”說發微》、《文史結合的三種類型》、《宣傳：中古文學的另一個開端》及《互文的歷史：重讀五柳先生傳》等。 ",
  "url": "https://www.polyu.edu.hk/cihk/news-and-events/news/2022/specialist-lectures-(6)"
 }
]