[
 {
  "text": "2023 Linda Lin Lin, H. F. (2023). Assessing the Role of Vocabulary Knowledge in Developing EFL Learners’ Writing Skills: Implications for Intentional and Incidental Vocabulary Learning. Asian Journal of English Language Teaching, 32(1), 109–137. 2023 Linda Lin Lin, H. F., Foung, D., & Chen, J. (2023). Assuring online assessment quality: the case of unproctored online assessment. Quality Assurance in Education, 31(1), 137-150. 2023 Eric Ho Kohnke, L., Foung, D., Ho, E. (2023). Open educational resources in the English for Academic Purposes context. In J. Olivier and A. Rambow (Eds), Open Educational Resources in Higher Education. Future Education and Learning Spaces (pp. 307-327). Springer, Singapore. https://doi.org/10.1007/978-981-19-8590-4_14 2023 Frankie Har & Eric Ho Har, F., Ho, E. (2023). Use of Perusall for Pre-class Reading Assignments in an English Reading and Writing Course at the Tertiary Level: Students’ Perception of a Flipped Approach. In: TSO, A.W.B., NG, S.K.K., LAW, L., BAI, T.S. (eds) The Post-pandemic Landscape of Education and Beyond: Innovation and Transformation. HKAECT 2022. Educational Communications and Technology Yearbook. Springer, Singapore. https://doi.org/10.1007/978-981-19-9217-9_3 2022 Linda Lin Lee, T. S., & Lin, H. F. (2022). Motivational Strategies Adopted in Postgraduate English Academic Writing Courses: Perspectives of Doctoral Students. SAGE Open, 12(4), 21582440221138259. 2022 Adam Forrester Forrester, A. (2022). Genesis of an e-platform for language enhancement. In M. B. Nunes & P. Isaias (Eds.), Proceedings of the international conference e-learning 2022 (pp. 173-177). IADIS Press. http://www.iadisportal.org/digital-library/genesis-of-an-e-platform-for-language-enhancement 2022 Eric Ho Dang, B. Y. Y., Ho, E., & Tsang, A. (2022). Learner's assessment preferences in higher education: A comparison study of high-achievers and low-achievers. The Asia-Pacific Education Researcher. Epub ahead of print 22 August. https://doi.org/10.1007/s40299-022-00679-w 2022 Frankie Har Har, F. (2022). English language learning in response to the COVID-19 pandemic: Hong Kong English as a Second Language students’ perceptions of Badaboom!. Frontiers in Education. 7:966059. https://doi.org/10.3389/feduc.2022.966059 2022 Frankie Har Har, F. (2022). Content-Based ESP Instruction at Hong Kong Tertiary Level: Student and Teacher Perceptions of a Hybrid Approach in a State of Flux During the COVID-19 Pandemic. In L. Kohnke (Eds.), Cases on Teaching English for Academic Purposes (EAP) During COVID-19: Insights From Around the World (pp. 80-99). IGI Global. https://doi.org/10.4018/978-1-6684-4148-0.ch004 2022 Frankie Har Kohnke, L., & Har, F. (2022). Perusall Encourages Critical Engagement with Reading Texts. RELC Journal. https://doi.org/10.1177/00336882221112166 2022 Eric Ho Ho, E., & Ming, S. M. S. (2022). Responding to COVID-19: Teaching of EAP to Non-Native Postgraduates of Performing Arts. In L. Kohnke (Ed.), Cases on Teaching English for Academic Purposes (EAP) During COVID-19: Insights From Around the World (pp. 132-154). IGI Global. https://doi.org/10.4018/978-1-6684-4148-0.ch006 2022 Linda Lin \nChen, J., Lin, L. H. F., Foung, D., & Nixon, C. (2022). Quality Assurance and Enhancement: An Application of Digitalised Data. In A. Kaplan (Ed.). Digital Transformation and Disruption of Higher Education (pp. 130-143). Cambridge University Press.\n2022 Linda Lin \nFoung, D., Chen, J., & Lin, L. H. F. (2022). When “Blended” Becomes “Online”: A Data-Driven Study on the Change of Self-Directed Engagement During COVID-19. CALICO Journal, 39(1), 1-25. \n2022 Tim Lee Lee, T. S. O. (2022). Motivational strategies in undergraduate EAP courses: Student perceptions and suggestions. Asia Pacific Journal of Education. https://doi.org/10.1080/02188791.2022.2050888 2021 Tim Lee Lee, T. S. O., & Pun, D. H. Y. (2021). The feasibility of motivational strategies in language classrooms: A tentative teacher-oriented definition. Teaching and Teacher Education, 106, 103470. https://doi.org/10.1016/j.tate.2021.103470\n2021 Frankie Har Har, F. (2021). Language Choices between Government Sector Colleagues: A Hong Kong Case Study of English Language Adult Learners' Plurilingual Practices in Computer-Mediated Communication. Linguistics International Journal, 15 (1), 1-20. 2021 Frankie Har Kohnke, L., & Har, F. (2021). Argumentative Writing at the Tertiary Level: Students' and Teachers' Perceptions of a Hybrid Approach. In A. Hirvela & D. Belcher (Eds.), Argumentative Writing in a Second Language: Perspectives on Research and Pedagogy, 223-239. Ann Arbor, MI: University of Michigan Press. 2021 Shari Lughmani Lughmani, D. S., & Foung, D. (2021). Metacognitive strategy-focused instruction in a writing across the curriculum programme in a Hong Kong university: The impact on writing performance. In Innovative Approaches in Teaching English Writing to Chinese Speakers,145-178. De Gruyter Mouton. 2021 Adam Forrester \nForrester, A., & Chan, C. H. J. (2021). Virtual Reality (VR) - possibilities for use in tertiary language centres, TESOL International Journal, 16(8), 7-16. https://www.elejournals.com/tij-2021/tij-volume-16-issue-8-2021-2-2/\n2021 Eric Ho \nHo. E. (2021). Gongyeh: A CALL tool for peer evaluation and feedback on oral assessments. TESOL Journal, 12(3), 1-7. https://doi.org/10.1002/tesj.592\n2021 Linda Lin \nMorrison, M., Chen, J., Lin, L. H. F., & Urmston, A. (Eds.) (2021). English Across the Curriculum: Voices from Around the World. The WAC Clearinghouse; University Press of Colorado. \n2021 Linda Lin \nLin, L. H. F., & Morrison, B. (2021). Challenges in academic writing: Perspectives of Engineering faculty and L2 postgraduate research students. English for Specific Purposes, 63, 59-70.\n2021 Eric Ho \nKohnke, L., Zou, D., Ho, E. (2021). Exploring the potential of push notification in ESL: A qualitative inquiry. The Journal of Asia TEFL, 18(3), 985-994. http://dx.doi.org/10.18823/asiatefl.2021.18.3.18.985\n2021 Adrian Ting \nKohnke, L., Jarvis, A., & Ting. A. (2021). Digital multimodal composing as authentic assessment in discipline-specific English courses: Insights from ESP learners. TESOL Journal, https://doi.org/10.1002/tesj.600\n2021 Adrian Ting \nKohnke, L., & Ting, A. (2021). ESL students’ perceptions of mobile applications for discipline-specific vocabulary acquisition for academic purposes. Knowledge Management & E-Learning, 13(1), 102–117. https://doi.org/10.34105/j.kmel.2021.13.006\n2021 Andrew Jarvis Kohnke, L., Jarvis, A., & Ting. A. (2021). Digital multimodal composing as authentic assessment in discipline-specific English courses: Insights from ESP learners. TESOL Journal, https://doi.org/10.1002/tesj.600 2021 Dean Gui Gui, D.A.F., & Polley, J.S. (Eds.). (2021). Poetry in Pedagogy: Intersections Across and Between the Disciplines (1st ed.). Routledge. https://doi.org/10.4324/9781003089377 2021 Lucas Kohnke \nKohnke, L., & Moorhouse, B.L. (2021). Adopting HyFlex in higher education in response to COVID-19: students’ perspectives. Open Learning: The Journal of Open, Distance, and e-Learning. https://doi.org/10.1080/02680513.2021.1906641\n2021 Lucas Kohnke \nKohnke, L., Zou, D., & Zhang, R. (2021). The Role of Emotions and Self-Regulatory Learning in Emergency Remote Teaching. Sustainability, 13(3), 1-15. https://doi.org/10.3390/su13137111\n2021 Lucas Kohnke \nKohnke, L., Jarvis, A., & Ting. A. (2021). Digital multimodal composing as authentic assessment in discipline-specific English courses: Insights from ESP learners. TESOL Journal, https://doi.org/10.1002/tesj.600\n2021 Lucas Kohnke \nKohnke, L., & Ting, A. (2021). ESL students’ perceptions of mobile applications for discipline-specific vocabulary acquisition for academic purposes. Knowledge Management & E-Learning, 13(1), 102–117. https://doi.org/10.34105/j.kmel.2021.13.006\n2021 Lucas Kohnke \nKohnke, L. (2021). Optimizing Microlearning for Mobile Learning. In J.R. Corbeil, M.E. Corbeil, & B.H. Khan (Eds). Microlearning in the Digital Age: The Design and Delivery of Learning in Snippets, 80-94. Routledge: Taylor & Francis Group.\nKohnke, L. (2021). L2 Learners' Perceptions of a Comic Strip in an ESP Classroom. The Asian ESP Journal, 17(5), 44-64.\nMoorhouse, L.B., & Kohnke, L. (2021). Thriving or Surviving Emergency Remote Teaching Necessitated by COVID-19: University Teachers’ Perspectives. The Asia-Pacific Education Researcher, 30, 279-287. https://doi.org/10.1007/s40299-021-00567-9\nKohnke, L. (2021). Professional development and ICT: English language teachers’ voices. Online Learning, 25(2), 36-53. https://doi.org/10.24059/olj.v25i2.2228\n2021 Shari Lughmani Foung, D., & Lughmani, D. S. (2021). Exploring L2 university students’ assignment Genre Knowledge and Writing Challenges. Asian EFL Journal Research Articles, 28(1.3), 315-335. 2020 Tim Lee \nLee, T. S. O., Gardner, D., & Lau, K. (2020). The effects of L2 motivational strategies: Within and beyond the L2 classroom. Innovation in Language Learning and Teaching, 14(5), 451-465. https://doi.org/10.1080/17501229.2019.1620240\n2020 Eric Ho \nHo, E. (2020). Online Peer Review of Oral Presentations. RELC Journal. Epub ahead of print 15 December. https://doi.org/10.1177/0033688220969280\n2020 Adam Forrester \nForrester, A. (2020). Addressing the challenges of group speaking assessments in the time of the coronavirus. International Journal of TESOL Studies, 2(1), 74-88. https://doi.org/10.46451/ijts.2020.09.07\n2020 Adrian Ting \nTing, A. (2020). Facilitating the writing process in a blended learning environment using Google Docs. In S. Palahicky (Ed.). Enhancing learning design for innovative teaching in higher education (pp.237-265). Hershey, PA: IGI Global.\n2020 Linda Lin \nFoung, D., Chen, J., & Lin, L. H. F. (2020). Unveiling the Inconvenient Truth: The Innovation Process in Implementing a University Dashboard. In S. Palahicky (Ed.), Enhancing Learning Design for Innovative Teaching in Higher Education (pp. 162-181). Hershey, PA: IGI Global. \n2020 Linda Lin \nQian, D. D. & Lin, H. L. F. (2020). The relationship between vocabulary knowledge and language proficiency. In S. Webb (Ed.), The Routledge Handbook of vocabulary studies. Oxford, UK: Taylor & Francis.\n2020 Lucas Kohnke \nKohnke, L. (2020). Exploring Learner Perception, Experience and Motivation of Using a Mobile App in L2 Vocabulary Acquisition. International Journal of Computer-Assisted Language Learning and Teaching, 10(1), 15-26.\n2020 Lucas Kohnke \nKohnke, L. (2020). Book Review: Specialised English: New Directions in ESP and EAP Research and Practice, Ken Hyland, Lillian L.C. Wong (Eds.). Rout-ledge, New York (2019). p. 260. ISBN: 978-1-138-58877-6. Journal of English for Academic Purposes, 44, https://doi.org/10.1016/j.jeap.2020.100849\n2020 Lucas Kohnke \nJarvis, A., Kohnke, L. & Guan, G. (2020). Academic Listening Strategy Use at an English-Medium University. The ASIAN ESP Journal, 16(3), 8-29.\n2020 Lucas Kohnke \nKohnke, L. Zou, D., & Zhang, R. (2020). Exploring Discipline-Specific Vocabulary Retention in L2 through App Design: Implications for Higher Education Students. RELC Journal. (pre-published online first). https://doi.org/10.1177/0033688219899740\nKohnke, L. (2020). Mentoring in the Online Sphere: A Case Study of EAP Teachers. Teacher Development Academic Journal, 1(1), 30-43.\nKohnke, L. (2020). Teacher Development Over Time: Practical Activities for Language Teachers. TESOL Journal, 11(2). https://doi.org/10.1002/tesj.474\nMoorhouse, B. & Kohnke, L. (2020). Using Mentimeter to elicit student responses in the EAP/ESP classroom. RELC Journal, 51(1), 198-204. https://doi.org/10.1177/0033688219890350\nKohnke, L. (2020). Online Discussions: Strategies for Ensuring Active Interaction. English Teaching Professional, 128, 17-18.\nKohnke, L. (2020). Stimulating and Sustaining Language Acquisition: Chatbots as a Pedagogical Possibility. Proceedings of the International Conference on Education and Artificial Intelligence (ICEAI), (pp. 25-27). ISBN: 978-988-74298-1-4\nKohnke, L. (2020). Designing a Chatbot to Teach English: Transforming Learning Spaces. Proceedings of the International Conference on Education and Artificial Intelligence (ICEAI), (pp.23-24). ISBN: 978- 988-74298-1-4\nKohnke L. & Jarvis, A. (2020). How to Keep Online Learners' Attention - Keeping the Ball Rolling. Modern English Teacher, 29(3), 25-26.\nKohnke, L. (2020). Supporting the professional development of English language teachers: Facilitative mentoring. RELC Journal, (51(3), 454-460. https://doi.org/10.1177/0033688219856382\nKohnke, L. & Moorhouse, B.L. (2020). 'There's an app for that!' Writing Technology Reviews for Academic Journals. RELC Journal (Pre-published online first). https://doi.org/10.1177/0033688220945419\nKohnke, L. (2020). The benefits of video-enhanced observations as a collaborative tool. English Teaching Professional, 130, 48-50.\nKohnke, L. & Moorhouse, B.L. (2020). Facilitating Synchronous Online Language Learning through Zoom. RELC Journal, https://doi.org/10.1177/0033688220937235\nKohnke, L. (2020). Make Beliefs Comix. RELC Journal, 51(2), 321-323.\n2020 Andrew Jarvis \nKohnke L. & Jarvis, A. (2020). How to Keep Online Learners' Attention - Keeping the Ball Rolling. Modern English Teacher, 29(3), 25-26.\n2020 Andrew Jarvis \nJarvis, A., Kohnke, L. & Guan, G. (2020). Academic Listening Strategy Use at an English-Medium University. The ASIAN ESP Journal, 16(3), 8-29.\n2019 Tim Lee Lee, T. S. O., & Lin, S. Y. (2019). English teachers’ uses of motivational strategies beyond an established framework. Educational Research, 61(4), 451-468. https://doi.org/10.1080/00131881.2019.1677170\n2019 Andrew Morrall \nMorrall, A. (2019). The typhoon child. In Al-Sofi, J. (Ed.), Coming to our senses (pp. 119-128). Hong Kong: Hong Kong Writers Circle.\n2019 Linda Lin \nLin, L. H. F. (2019). The NMET impact on the English writing of mainland Chinese students. ERL Journal. 1, 122-131. \n2019 Lucas Kohnke \nKohnke, L. (2019). Virtual Mentoring - a social and participatory approach. Modern English Teacher, 28(3), 23-24.\n2019 Lucas Kohnke \nKohnke, L. (2019). Professional Digital Competence and Professional Development among Higher Education Teachers: An Explorative Survey. Proceedings of the 5th International Foreign Language Learning and Teaching Conference, 80-89.\n2019 Lucas Kohnke \nKohnke, L. (2019). Unlocking English Learners' Potential. ASIAN EFL Journal, 23 (3.1), 157-160.\n2019 Lucas Kohnke \nKohnke, L. & Chan, B. (2019). Exploiting Infographics. Modern English Teacher, 28(1), 67-68.\nKohnke, L. (2019). Digital Backchanneling to encourage active learning: YoTeach! On Call: The Newsletter of the Computer Assisted Language Learning Interest Section.\nKohnke, L. (2019). Tech Review: GoSoapBox – Encourage Participation and Interaction in the Language Classroom. RELC Journal (pre-published online first)\nChan, C.C.B. & Kohnke, L. (2019). Reflective Writing with Automatic Speech Recognition. English Australia Journal, 35(2), 45-49.\nKohnke, L. (2019). A New Professional Development Recipe – The ICT Bootcamp. The Teacher Trainer Journal, 33(2), pp. 10-13.\nKohnke, L. & Jarvis, A. (2019). Developing Mentorship Provision for Academic English success. ASIAN EFL Journal, 21 (2.3), 142-157.\nKohnke, L. (2019). Book Review: Mobile Learning. RELC Journal, 50(3), 497-503.\nKohnke, L. & Jarvis, A. (2019). Enriching students' language skills and confidence through a university mentoring scheme. Journal of Education for Teaching, 45(2), 223-224. https://doi.org/10.1080/02607476.2018.1548176\nMoorhouse, B. J. & Kohnke, L. (2019). What's wrong with right and wrong in materials designed for young English language learners. Modern English Teacher , 28(2), 18-20.\nKohnke, L. (2019). Use Sticky Notes - and Make the Content Stick. The Teacher Trainer Journal, 33 (1), 6-7.\nKohnke, L. (2019). Review of New technologies and language learning. Language Learning & Technology, 23 (1), 36-39.\nKohnke, L. (2019). Using comic strips to stimulate student creativity in language learning. TESOL Journal, 10, (2), 1-5. https://doi.org/10.1002/tesj.419\nKohnke, L. (2019). Exploring Critical Pedagogy and Choice in EAP Material Development: A Case Study. The Journal of Asia TEFL, 16(4), 1218-1230.\nKohnke, L., Zhang, R., & Zou, D. (2019). Using Mobile Vocabulary Learning Apps as Aids to Knowledge Retention: Business Vocabulary Acquisition. The Journal of ASIA, 16(2), 683-690.\n2019 Andrew Jarvis \nKohnke, L. & Jarvis, A. (2019). Developing Mentorship Provision for Academic English success. ASIAN EFL Journal, 21(2.3), 142-157.\n2019 Andrew Jarvis \nKohnke, L. & Jarvis, A. (2019). Enriching students' language skills and confidence through a university mentoring scheme. Journal of Education for Teaching, 45(2), 223-224. https://doi.org/10.1080/02607476.2018.1548176\n2019 Dennis Foung \nFoung, D., & Chen, J. (2019). Discovering disciplinary differences: blending data sources to explore the student online behaviors in a University English course. Information Discovery and Delivery, 47(2), pp. 106-114.\n2019 Dennis Foung \nFoung, D. (2019). Redesigning prediction algorithms for at-risk students in higher education: The opportunities and challenges of using classification techniques in a university academic writing course. In A., Raman. & M., Rathakrishnan. (eds.). Redesigning Higher Education Initiatives for Industry 4.0, Hershey, PA: IGI Global. [Available: https://www.igi-global.com/chapter/redesigning-prediction-algorithms-for-at-risk-students-in-higher-education/224218]\n2019 Dennis Foung \nFoung, D. (2019). Making good suggestions in analytics-based early alert systems: Shaping minds and changing behaviors. Journal of Applied Research in Higher Education, 12(1), 109-123. https://doi.org/10.1108/JARHE-12-2018-0264\n2019 Dennis Foung \nChen, J., & Foung, D. (2019). Connecting Teacher-Made Assessments to Course Learning Outcomes Through Learning Analytics: An Empirical Model. In E. White, & T. Delaney (Eds.), Handbook of Research on Assessment Literacy and Teacher-Made Testing in the Language Classroom (pp. 101-125). Hershey, PA: IGI Global. doi:10.4018/978-1-5225-6986-2.ch006\nFoung, D. (2019). Mining students’ data to identify at-risk students in an academic English course: A comparison of various classification techniques from a user and statistical perspective. CALL-EJ, 30(2), 77-91.\nFoung, D., & Chen, J. (2019). A Learning Analytic Approach to the Evaluation of an Online Learning Package in a Hong Kong University. The Electronic Journal of e-Learning, 17(1), pp. 11-24.\n2019 Julia Chen \nChen, J., & Foung, D. (2019). Connecting Teacher-Made Assessments to Course Learning Outcomes Through Learning Analytics: An Empirical Model. In E. White, & T. Delaney (Eds.), Handbook of Research on Assessment Literacy and Teacher-Made Testing in the Language Classroom (pp. 101-125). Hershey, PA: IGI Global. doi:10.4018/978-1-5225-6986-2.ch006\n2019 Julia Chen \nFoung, D., & Chen, J. (2019). A Learning Analytic Approach to the Evaluation of an Online Learning Package in a Hong Kong University. The Electronic Journal of e-Learning, 17(1), pp. 11-24.\n2019 Julia Chen \nFoung, D., & Chen, J. (2019). Discovering disciplinary differences: blending data sources to explore the student online behaviors in a University English course. Information Discovery and Delivery, 47(2), pp. 106-114.\n2019 Christine Burns \nBurns, C., Chigaeva-Heddad, S. & Leung, M. (2019). “Otherwise, good luck…”: Patterns of use associated with good in teacher feedback. ASIAN EFL Journal, 23(3.4), 293-315.\n2019 Shari Lughmani Foung, D., & Lughmani, D. S. (2019). A comprehensive CALL solution for writing in the disciplines. In S. Khadimally (Ed.), Technology-Assisted ESL Acquisition and Development for Nontraditional Learners, 108-132. IGI Global. https://doi.org/10.4018/978-1-5225-3223-1.ch005 2018 Marshall Yin \nYin, M. W. (2018). 國際學校就是你的“詩和遠方”？Teaching at an International school in Hong Kong. From https://mp.weixin.qq.com/s/HmIjBlPPBvNqIERL1-XMbQ\n2018 Vincent Sheung Kwun \nCheng, G., Chen, J., Foung, D., Lam, V., & Tom, M. (2018). Towards automatic classification of teacher feedback on student writing. International Journal of Information and Education Technology, 8(5), 342-346.\n2018 Vincent Sheung Kwun \nCheng, G., Chwo, S.-M. G., Chen, J., Lam, V., Law, E., & Lai, R (2018, July). Exploring the relationship between types of teacher feedback and types of student revision in EFL writing courses. Proceedings of International Symposium on Teaching, Education, and Learning (ISTEL 2018), Seoul, South Korea.\n2018 Jane Robbins \nRobbins, J. M. (2018). Two Steps Forward, One Step Back (and a few to the side): Embedding English Language Teaching in a Discipline Subject. In The Asian Conference on Language Learning 2018: Official Conference Proceedings. International Academic Forum, Web site: https://papers.iafor.org/submission40093/\n2018 Bruce Morrison \nMorrison, B. & Evans, S. (2018). Supporting non-native speaker student writers making the transition from school to an English-medium university. Language Learning in Higher Education, 8, 1. http://dx.doi.org/10.1515/cercles-2018-0001.\n2018 Andrew Jarvis \nJarvis, A. Kohnke, L. Guan, G. Patkin, J. (2018). Academic Listening Survival Strategies: A Guide for Students at English medium Universities. Open Educational Resource. Open webpage\n2018 Andrew Jarvis \nJarvis, A. (2018). Teacher development workshops – given with the help of university students. The Teacher Trainer Journal, 31 (3), 23-25.\n2018 Lucas Kohnke \nKohnke, L., Zou, D., Wang, F. L., & Xie, H. R. (2018). Game-based vocabulary learning in Hong Kong: Students’ perceptions, attitudes and expectations of a game-mediated vocabulary learning APP, Proceedings of The International Conference on Technology in Education (ICTE), Hong Kong, (pp. 56-62).\n2018 Lucas Kohnke \nJarvis, A. Kohnke, L. Guan, G. Patkin, J. (2018). Academic Listening Survival Strategies: A Guide for Students at English medium Universities. Open Educational Resource.\n2018 Lucas Kohnke \nZou D., Wang F.L., Xie H., Kohnke L. (2018) Game-Based Vocabulary Learning in China and Hong Kong: Students’ Evaluation of Different Word Learning APPs. In: Cheung S., Lam J., Li K., Au O., Ma W., Ho W. (eds) Technology in Education. Innovative Solutions and Practices. ICTE 2018. Communications in Computer and Information Science, vol 843. Springer, Singapore\n2018 Lucas Kohnke \nKohnke, L. & Leskis, A. (2018). Multimodal Approaches with Augmented Reality. TESOL CALL.\n2018 Dean Gui \nGui, Dean A. F. (Forthcoming August 2018). “Virtual sense of community in a World of Warcraft® storytelling open forum thread.” Journal for Virtual Worlds Research. Assembled Edition. JVWR: 11 (2).\n2018 Dennis Foung \nChen, J., Foung, D., & Armatas, C. (2018). Adopting Learning Analytics to Enrich Regular Curriculum Review and Enhancement: A Case Study of a University English Programme in Asia. In A. Pardo, K. Bartimote, G. Lynch, S. Buckingham Shum, R. Ferguson, A. Merceron & X. Ochoa (Eds.), Companion Proceedings of the 8th International Conference on Learning Analytics and Knowledge. Sydney, Australia: Society for Learning Analytics Research.\n2018 Julia Chen \nChen, J., Foung, D., & Armatas, C. (2018). Adopting Learning Analytics to Enrich Regular Curriculum Review and Enhancement: A Case Study of a University English Programme in Asia. In A. Pardo, K. Bartimote, G. Lynch, S. Buckingham Shum, R. Ferguson, A. Merceron & X. Ochoa (Eds.), Companion Proceedings of the 8th International Conference on Learning Analytics and Knowledge. Sydney, Australia: Society for Learning Analytics Research.\n2018 Julia Chen \nCheng, G., Chen, J., Foung, D., Lam, V., & Tom, M. (2018). Towards automatic classification of teacher feedback on student writing.International Journal of Information and Education Technology, 8(5), 342-346.\n2018 Julia Chen \nChen, J. (2018). Comprehensive review of university English subjects: Results and reflections. JACET Journal, 62, 1-14.\n2017 Vincent Sheung Kwun \nCheng, G., Chwo, S.-M. G., Chen, J., Foung, D., Lam, V., & Tom, M. (2017, December). Automatic classification of teacher feedback and its potential applications for EFL writing. Proceedings of the 25th International Conference on Computers in Education (ICCE 2017), Christchurch, New Zealand.\n2017 Jim Lo \nLo, J. (2017). Effects of social context on foreign language anxiety among university English learners in Hong Kong. Proceedings of the European Conference on Language Learning 2017. The International Academic Forum, pp. 111-121.\n2017 Voyce Li \nLi, V. (2017). Social Media in English Language Teaching and Learning. International Journal of Learning and Teaching, 3(2), 148-153, doi: 10.18178/ijlt.3.2.148-153. http://www.ijlt.org/uploadfile/2017/0525/20170525052209836.pdf\n2017 Tim Lee \nLee, T. S. O. (2017). L2 motivational strategies that do not work: Students' evaluations and suggestions. In E. Piechurska-Kuciel, E. Szymanska-Czaplak, & M. Szyszka (Eds.), At the crossroads: Challenges of foreign language learning (pp. 135-153). Cham: Springer.\n2017 Lucas Kohnke \nKohnke, L. (2017). Social Responsibility in the Digital Age: a step-by-step guide to student-centered videos. TESOL Social Responsibility.\n2017 Lucas Kohnke \nKohnke, L. (2017). Remix literacy: a picture is worth a thousand words. The Journal of Teaching English with Technology, 17 (3), 50-53.\n2017 Lucas Kohnke \nKohnke, L. (2017). Interaction Online Creative Activities for Blended Learning. The Journal of ASIA TEFL, 14 (4), 833-834.\n2017 Lucas Kohnke \nKohnke, L. & Moorhouse, B. J. (2017). Classroom management dilemmas in the age of mobile devices. TESOL Secondary Accents.\n2017 Julia Chen \nArmatas, C., Tse, A., Chow, J., Foung, D., Chen, J., & Chan, C.S. (2017). Exploring the relationship between the time of completing online quizzes and students’ performance in academic writing. EduLearn17 Proceedings, 5306-5311.\n2017 Julia Chen \nCheng, G., Chwo, S.-M. G., Chen, J., Foung, D., Lam, V., & Tom, M. (2017). Automatic classification of teacher feedback and its potential applications for EFL writing. Proceedings of the 25th International Conference on Computers in Education (ICCE 2017) (pp. 884-889). New Zealand.\n2017 Christine Burns \nBurns, C. (2017, June). Activities and strategies for teaching effective presentation skills. Paper presented at The Future of Education, Florence, Italy. Retrieved from http://conference.pixel-online.net/FOE/files/foe/ed0007/FP/3767-SET2446-FP-FOE7.pdf\n2016 Daisy Di Zou \nZou, D. (2016). Vocabulary acquisition through cloze exercise, sentence writing and composition writing: Extending the evaluation component of the involvement load hypothesis. Language Teaching Research. DOI: 10.1177/1362168816652418 [SSCI, IF = 1.444, 5-Year IF = 1.878, Rank = 26/179, Quartile 1].\n2016 Daisy Di Zou \nXie, H. R., Zou, D., Wong, T. L., & Wang, F. L. (2016). A versatile learning context framework for heterogeneous e-learning applications. Proceedings of the 20th Global Chinese Conference on Computers in Education. Hong Kong, Global Chinese Society for Computers in Education (GCSCE), Hong Kong (pp. 684-687).\n2016 Daisy Di Zou \nXie, H. R., Zou, D., Lau, Y. K., Wang, F. L., & Wong, T. L. (2016). Generating incidental word-learning tasks via topic-based and load-based profiles. IEEE Multimedia Magazine, vol 23(1), pp. 60-70 [SCI, IF = 1.694, 5-Year IF = 1.467, Quartile 1, The Corresponding Author].\n2016 Alan Urmston \nUrmston, A. & Raquel, M. R. (2016). Issues in Developing a Diagnostic Language Assessment in Hong Kong. In V. Aryadoust and J. Fox (Eds.) Trends in Language Assessment Research and Practice: The View from the Middle East and the Pacific Rim. Newcastle upon Tyne: Cambridge Scholars Publishing.\n2016 Alan Urmston \nUrmston, A., Raquel, M. R., & Aryadoust, V. (2016). Can diagnosing university students' English proficiency facilitate language development? In J. Read (Ed.). Post-Admission Language Assessment in Universities: International Perspectives. Springer.\n2016 Bruce Morrison \nEvans, S. & Morrison, B. (2016). Adjusting to higher education in Hong Kong: the influence of school medium of instruction. International Journal of Bilingual Education and Bilingualism, http://dx.doi.org/10.1080/13670050.2016.1228600.\n2016 Bruce Morrison \nEvans, S. & Morrison, B. (2016). English-medium instruction in Hong Kong: illuminating a grey area in school policies and classroom practices. Current Issues in Language Planning, 1-20, http://dx.doi.org/10.1080/14664208.2016.1270106.\n2016 Voyce Li \nLi, V., Mitchell, R., & Boyle, B. (2016). The Divergent Effects of Transformational Leadership on Individual and Team Innovation. Group & Organization Management, 41(1), 66–97. https://journals.sagepub.com/doi/10.1177/1059601115573792\n2016 Andrew Jarvis \nJarvis, A. & Ho, Anna. (2016). Students Teaching Teachers: Can it work? A teacher training project in rural China. In Proceedings of the Second International Conference on Service-Learning (pp. 64-68). Hong Kong: The Hong Kong Polytechnic University.\n2016 Dean Gui \nGui, Dean A. F. and Northern, Andrew. (2016). “Designing self-access language learning centres through MMO and gaming environments.” Games, Leadership and Learning in Virtual Environments. Christina DeCoursey and Dean A. F. Gui (eds.). InterDisciplinary Press.\n2016 Dean Gui \nDeCoursey, Christina and Gui, Dean A. F. (eds.) (2016). Games, Leadership and Learning in Virtual Environments. Oxford, UK: Inter-Disciplinary Press.\n2016 Eric Ho \nHo, E. (2016). Knowing Where the Learning Is a Shift from Summative to Formative Assessment. World Academy of Science, Engineering and Technology, International Science Index 109, International Journal of Social, Behavioral, Educational, Economic, Business and Industrial Engineering, 10(1), 78 - 83.\n2016 Eric Ho \nHo, E. (2016, September). Peer Assessment: Bridging the gap between knowledge and skills in an ESP classroom. Teaching, Evaluation & Assessment Special Interest Group Newsletter, 59, 20-21.\n2016 Julia Chen \nChen, J., Chau, J., Lim, G. & Li, V. (2016). Online language learning to develop English reading and listening skills in university students: A pilot study in Hong Kong. International Journal for 21st Century Education, Vol. 1, No. 1, pp.35-54.\n2016 Julia Chen \nLughmani, S., Gardner, S., Chen, J., Wong, H., & Chan, L. (2016). English across the curriculum: Fostering collaboration. ELTWO: Special Issue on 5th CELC Symposium Proceedings.\n2015 Andrew Jarvis \nCole, J. Doig, A. Jarvis, A. (2015) Junior Oxford Essential Listening 1-3. Oxford University Press.\n2015 Andrew Jarvis \nHo, A. & Jarvis, A. (2015). Teacher Training in China: A Sustainable Approach. In S. Chakrabarty & J. Latzo (Eds), Proceedings of The Asian Conference on Second Language Acquisition and Teacher Education (pp. 178-183). Hiroshima, Japan.\n2015 Daisy Di Zou \nZou, D., Xie, H. R., Wong, T. L., Poon, C. K., & Ho, W. S. (2015). Comparative study on heterogeneous profiling sources for second language learners. In Technology in Education: Transforming Educational Practice with Technology (pp. 209-218). Springer.\n2015 Daisy Di Zou \nZou, D., Xie, H., Wang, F., & Wong, T. (2015). Investigating the effectiveness of the uses of electronic and paper-based dictionaries in promoting incidental word learning. In Cheung et al. (Eds.), Hybrid Learning (Theory and Practice) (pp. 59-69). Springer.\n2015 Daisy Di Zou \nXie, H. R., Zou, D., & Wang, F. L. (2015, June). Computer-supported collaborative word acquisition for language learners. In Proceedings of the 11th International Conference on Computer Supported Collaborative Learning. Gothenburg, Sweden. (Accepted)\n2015 Daisy Di Zou \nZou, D., Xie, H., & Wang, F. (2015, June). Comparing monolingual mobile dictionaries and paper dictionaries in the context of reading among Cantonese EFL learners in Hong Kong. In Proceedings of The 9th International Conference on Asia Association for Lexicography (pp. 504-510). Hong Kong.\nZou, D., Xie, H. R., & Wang, F. L. (2015) Integrating various feedback approaches into inferencing for second language vocabulary acquisition. In Proceedings of The 11th International Conference on Technology Education in Asia Pacific Regions (pp. 19 -21). Hong Kong.\nXie, H. R., Zou, D., Wang, F. L., Wong, T. L., & Troshina, K. (2015). Context-aware personalized courses search based on hybrid learner profile. Proceedings of the 23rd International Conference on Computers in Education: Transforming Education in the Big Data Era. Asia-Pacific Society for Computers in Education (APSCE), Hangzhou, China (pp. 62-67).\nZou, D., Xie, H. R., Wang, F. L., & Wong, T. L. (2015). Investigating the effectiveness of the uses of electronic and paper-based dictionaries in promoting incidental word learning. Hybrid Learning: Innovation in Educational Practices, LNCS, vol 2167, pp. 59-69. [SCI, IF = 0.510].\nZou, D., Xie, H., Wong, T., Poon, C., & Ho, W. (2015). Evaluating the profile accuracy for second language learners. In Technology in Education (Transforming Educational Practices with Technology). (Accepted)\nXie, H. R., Zou, D., Wong T. L., & Wang, F. L. (2015). Identifying context familiarity for incidental word learning task recommendations. Proceedings of the 23rd International Conference on Computers in Education: Transforming Education in the Big Data Era. Asia-Pacific Society for Computers in Education (APSCE), Hangzhou, China (pp. 580-586).\nZou, D., Xie, H., & Wang, F. L. (2015). The use of monolingual mobile dictionaries in the context of reading by intermediate Cantonese EFL learners in Hong Kong. In F. Helm, L. Bradley, M. Guarda, & S. Thouesny (Eds), Critical CALL. (pp. 569-574). Researchpublishing. net.\n2015 Dean Gui \nGui, Dean A. F. (chief ed.); Morrison, Bruce; Morrall, Andrew; Lin, Linda; and Lughmani, Shari (eds.). (2015). Inscribe: A Journal of Undergraduate Student Writing in and about Asia 1. Hong Kong: The English Language Centre, The Hong Kong Polytechnic University.\n2015 Dean Gui, Grace Lim, Jim Lo, Kevinia Cheung \nGui, D. A. F., Lim, G., Lo, J. & Cheung, K. (2015). A Paradigm-Shift in Tertiary Scholarship: Preparing Students for a Borderless World through Student Journal Publication. Proceedings of the International Conference on Technology Education in the Asia Pacific Region. Hong Kong Polytechnic University, pp. 145-150.\n2014 Daisy Di Zou \nZou, D., Xie, H. R., Li, Q., Wang, F. L., & Chen, W. (2014). The load-based learner profile for incidental word learning task generation. In Advances in Web-Based Learning, Proceedings of the 13th International Conference on Web-based Learning, Lecture Notes in Computer Science (Springer) (pp. 190-200). Tallinn, Estonia.\n2014 Robert Yiu \nYiu, R.H.H. (2014). A case study of Hong Kong undergraduates undertaking their disciplinary writing tasks and its implications for EAP pedagogy. The 4th CELC Symposium Proceedings, National University of Singapore, 107-115\n2014 Bruce Morrison \nMorrison, B. and Evans, S. (2014). Challenges faced by non-native undergraduate student writers in an English-medium university. The Asian ESP Journal, July 2014, 136-174.\nMorrison, B. (2014). The case studies: The Hong Kong Polytechnic University. In Gardner, D. & Miller, L. Managing Self-Access Language Learning (pp. 91-100). Hong Kong: City University of Hong Kong.\n2014 Voyce Li \nLi, V. (2014). Collaborative Learning: Implication of Online Forum in English Academic Writing for Engineering Students. The 9th IEEE International Conference on Computer Science & Education, 22-24 August 2014. Vancouver, Canada. http://ieeexplore.ieee.org/document/6926500/?arnumber=6926500&tag=1\n2013 Alan Urmston \nUrmston, A., Raquel, M. & Tsang, C. (2013). Diagnostic Testing of Hong Kong Tertiary Students' English Language Proficiency: The Development and Validation of DELTA. Hong Kong Journal of Applied Linguistics 14 (2), 60-82.\n2013 Bruce Morrison \nLai, C. & Morrison B. (2013). Towards an Agenda for Learner Preparation in Technology-enhanced Language Learning Environments. CALICO Journal, 30, 2, 154-162.\n2013 Bruce Morrison \nLai, C. & Morrison, B. (Eds). (2013). Learner Preparation in Technology-enhanced Language Learning Environments, CALICO Journal, 30, 2.\n2013 Ryan Hunter \nButler, G., Hunter, R., & Kurth, L. (2013). An alternative to in-class presentations: Incorporating student-generated VoiceThread projects. Peerspectives Online, 11. http://peerspectivesonline.org/recent-issues/issue-11/\n2013 Voyce Li \nLi, V. (2013). Computer-aided Assessment Standardisation for Writing and Oral Presentation Assessments: Design, Development and Implementation. The 8th International Conference on Information Technology and Applications (ICITA 2013), 1-4 July 2013, Sydney, Australia, ISBN: 978-0-9803267-5-8. http://www.icita.org/2013/abstracts/hk-li.htm\n2013 Dean Gui \nGui, Dean A. F., and AuYeung, Gigi. (2013). “The Tree of Knowledge project: Organic designs as virtual learning spaces.” International Journal of Virtual and Personal Learning Environments. Special edition: Real Education in Virtual Worlds. IGI Global: 4 (2): 85 – 106.\n2013 Dean Gui \nGui, Dean A. F. and Northern, Andrew. “Supplementing self-access learning for the English Language Centre through virtual platforms.” Experiential Learning in Virtual Worlds 3, Conference Proceedings, Lisbon, Portugal, 7-9 March, 2013. Inter-Disciplinary Press.\n2013 Dean Gui \nLi Lan Wong Dora, Gui Dean A. F., and AuYeung Gigi. (2013). “Collaborative learning in the virtual English class: A Hong Kong case study.” Cases on E-Learning Management: Development and Implementation. Harrison Yang and Shuyan Wang (eds.). IGI Global: Chapter 16, 343 – 370.\n2013 Dean Gui \nGui, Dean A. F. (2013) “Virtual Hybridity: Multiracial Identity in Second Life Explored.” Experiential Learning in Virtual Worlds. Mark Childs and Greg Withnail (eds.). InterDisciplinary Press: 171 – 192.\n2013 Julia Chen \nChen, J. (2013). New direction in university English language training: Blended delivery. In Ji, P.Y. & Fan, Y. (Eds.), New Directions in TESOL (pp. 86-103). Shanghai: Fudan University Press.\n2012 Z. Zvi \nZvi, Z. (2012). Using ASL in the EFL classroom to practice speaking. The Language Teacher, 36(1), 21-23.\n2012 Bruce Morrison \nEvans, S. & Morrison, B. (2012). Learning and using English at university: Lessons from a longitudinal study in Hong Kong. The Journal of Asia TEFL, 9, 2, 21-47.\n2012 Dean Gui \nGui, Dean A. F. “Learning platforms for the English subject in Hong Kong high school classrooms.” 2nd Applying Putonghua and English Language Arts (APELA) Conference Proceedings, Hong Kong, Oct, 2012.\n2012 Dean Gui \nGui, Dean A. F. Gui. Virtual Hybrid Identities: Multiracial Communities in Second Life Explored. Forthcoming (2012). Experiential Learning in Virtual Worlds: Exploring the Complexities. Mark Childs and Greg Withnail (eds.). Inter-Disciplinary Press.\n2012 Julia Chen \nChan, F. & Chen, J. (2012). Impacts of alignment between ESP and content subjects on biomedical engineering students. Asian ESP Journal, 8(2), 27-54.\nChau, J., Wu, W., Chen, J., & Lughmani, S. (2012). ESL readers' comprehension performance: the Chinese secondary context. ELT Journal; doi: 10.1093/elt/ccr088.\n2011 Adrian Ting \nTing, A. (2011) A case study of how podcast transformed learning in ESL Modules for Hong Kong pre-service teachers. In M. Abdous & B. Facer (eds.) Academic podcasting and mobile assisted language learning: Applications and outcomes, Hershey, PA: IGI Global.\n2011 Bruce Morrison \nMorrison, B. (2011). From the thrill of drilling to the dangers of scaffolding. In Everhard, C.J., Mynard, J. & Smith, R. (Eds.) Autonomy in language learning: Opening a can of worms (pp. 145-7). Canterbury: IATEFL.\n2011 Bruce Morrison \nEvans, S. & Morrison, B. (2011) The student experience of English-medium higher education in Hong Kong. Language and Education, 25: 2, 147-162\n2011 Bruce Morrison \nMorrison, B. (Ed.) (2011). Independent Learning: Building on experience, seeking new perspectives. Hong Kong: Hong Kong University Press.\n2011 Bruce Morrison \nMorrison, B. (2011). A Framework for the Evaluation of a Self-Access Language Learning Centre. Studies in Self-Access Learning Journal, 2, 4, 241-256.\nEvans, S. & Morrison B. (2011). Meeting the challenges of English-medium higher education: The first-year experience in Hong Kong. English for Specific Purposes.\n2011 Dean Gui \n\"If I were different\" and \"The Macanese condition\". Blackmail Press. Poetry published (New Zealand: 2011).\n2011 Dean Gui \nGui, Dean A. F. “Multiracial communities and the virtual world: Second Life as educational site of engagement?” Paper for Experiential Learning in Virtual Worlds Conference, Conference Proceedings, Prague, The Czech Republic, March 2011.\n2011 Dean Gui \n“Shanghai”. Fleeting. Poetry (Kent, UK: October 2011), http://www.fleetingmagazine.com/shanghai/\n2011 Dean Gui \nGui, Dean A. F., Li Lan, Wong Dora, and AuYeung Gigi. (2011). “’Good to use for virtual consultation Time.’ Second Life activities for and beyond the technical writing classroom.” Metaverse Creativity Journal. Elif Ayiter and Yacov Sharir (eds.). Intellect: 2 (1): 57 – 76.\n\"Good laundry day\". Transnational Literature Journal, Volume 4, Issue 1. Poetry published (Australia: 2011).\n\"King\" and \"Eurasian\". Mascara Literary Review, Issue 7. Poetry published (Australia: 2011), http://www.mascarareview.com/article/251/Dean_Gui/.\n2011 Linda Kwok \nKwok, L. (2011). College students' participation in e-portfolio learning in relation to academic ability and motivation. Proceedings of the International Conference on e-Commerce, e-Administration, e-Society, e-Education and e-Technology. Tokyo, 2011. Taiwan, Knowledge Association of Taiwan.\n2011 Julia Chen \nChen, J. (2011). From reactive to proactive: Handling student plagiarism in higher education. Higher Education Quality Assurance. (pp.240-251).\n2010 Adrian Ting \nTing, A. & Jones, P.D. (2010) Using free source ePortfolios to empower ESL teachers in collaborative peer reflection. In J. Kush, R. Lombard, J. Hertzog & J. Yamamoto (eds.) Technology implementation and teacher education: Reflective models (pp. 93-107), Hershey, PA: IGI Global.\n2010 Bruce Morrison \nEvans, S. & Morrison B. (2010). The first term at university: implications for EAP. English Language Teaching Journal 2010; doi: 10.1093/elt/ccq072.\n2010 Bruce Morrison \nLin, L. H. F. & Morrison, B. (2010). The impact of the medium of instruction in Hong Kong secondary schools on tertiary students' vocabulary. Journal of English for Academic Purposes, 9, 255-266.\n2010 Linda Lin \nLin, L. H. F., & Morrison, B. (2010). The impact of the medium of instruction in Hong Kong secondary schools on tertiary students' vocabulary. Journal of English for Academic Purposes, 9, 255-266.\n2010 Voyce Li \nLi, V. (2010). eSelf-assessment: A case study in English language learning (Hong Kong) for enhancing writing and oral presentation skills. Education Technology and Computer (ICETC), 2010 2nd International Conference, 4, 371-5, 22-24 June 2010, Shanghai, doi: 10.1109/ICETC.2010.5529662. https://ieeexplore.ieee.org/document/5529662\n2010 Dean Gui \nHodgson, Paula, Gui, Dean A. F., and Wong, Dora. “Doing Academic Assignments: To Use a Wiki or an Alternative Platform.” IADIS e-Learning Conference 2010 Proceedings, Freiburg, Germany, July 2010.\n2010 Dean Gui \nLi, Lan, Wong, Dora, Gui, Dean A. F., and Au Yeung, Gigi. “What can Avatars do? Virtual realities in collaborative language learning.” ED-MEDIA 2010—World Conference on Educational Multimedia, Hypermedia & Telecommunications, Proceedings, Toronto, Canada, 28 June – 2 July 2010.\n2010 Julia Chen \nChan, F., Chen, J., Fung, F., Cheung, A. and Wong, M.S. (2010). Does inter-departmental curricular partnership help achieve biomedical engineering-specific language learning? RELC Anthology Series 52, pp. 190-217.\n2010 Juliana Chau and Victor Forrester \nChau, J. & Forrester, V. (2010). Initial teacher induction in Hong Kong: what needs changing? Asian Journal on Education and Learning 1(2):55-67\n2010 Juliana Chau and Gary Cheng \nChau, J. & Cheng, G. (2010). ePortfolio, technology, and learning: a reality check. Journal of Interactive Learning Research 21(4): 465-481\n2009 Shari Nazir \nNazir, D. and Wilson Trower, V. (2009). Autonomy, Negotiation and Collaboration: Student Participation in Curriculum Development: The Development of an On-line Learning Lexicon for Fashion and Textiles Students. The International Journal of Learning, 16(11), 137-145.\n2009 Bruce Morrison \nMorrison, B. (2009). From the thrill of drilling to the dangers of scaffolding. IATEFL Independence Newsletter Spring 2009, 25-27.\n2009 Gary Cheng and Juliana Chau \nCheng, G. & Chau, J. (2009). Digital video for fostering self-reflection in an ePortfolio environment.Learning, Media and Technology 34(4): 337-50\n2009 Linda Lin \nLin, L. H. F. (2009). Status of English in Hong Kong. In S. Granger (ed.). Status of English in the World. Universite de Louvain Press. 180-185.\n2008 Alan Urmston \nUrmston, A. & Pennington, M. C. (2008). The beliefs and practices of novice teachers in Hong Kong: change and resistance to change in an Asian teaching context. In T.S.C. Farrell (Ed.), Novice Language Teachers: Insights and Perspectives for the First Year (pp. 89-103). London: Equinox Publishing Ltd.\n2008 Andy Morrall \nMorrall, A. J. (2008). Book review: e-Learning initiatives in China: Pedagogy, policy and culture. Asian Journal of English Language Teaching, 18 209-212\n2008 Bruce Morrison \nMorrison, B. (2008). The role of the self-access centre in the tertiary language learning process. System, 36, 2.\n2008 Linda Kwok \nKwok, L. (2008). Students' Perceptions of Peer Evaluation and Teachers' Role in Seminar Discussion. Electronic Journal of Foreign Language Teaching, 5 (1), pp. 84-97.",
  "url": "https://www.polyu.edu.hk/elc/scholarship/publications"
 },
 {
  "text": "Start End In Charge Title \nJun 2023\tDec 2024\tIssa Ying\tDeveloping the model of Writing Café@PolyU and nurturing a community of learners to support discipline-specific academic and professional writing\t\nMar 2023\tAug 2024\tJane Robbins (Team member)\tFrom rubrics to grades: Enhancing grade integrity and grade consistency at PolyU\t\nJan 2023\tJun 2024\tAnna Ho\tAI-powered Video Job Interviewing: Impact on the teaching and learning of professional English\t\nJan 2023\tJun 2024\tLinda Lin\tDeveloping an online English language support platform for SYA students\t\nJan 2022\tDec 2023\tAdam Forrester and Jessica Xia\tFH MOOC- Humanity's Foundations Answers to Life's Questions from Cultural Powerhouses\t\nOct 2022\tDec 2024\tAdam Forrester and Jessica Xia\tDigital Literacy Support Network\t\nOct 2022\tDec 2024\tAdam Forrester, Julia Chen and Paul Rothery\tDeveloping language teachers’ technological pedagogical content knowledge and enhancing students’ language learning in virtual learning environments\t\nAug 2022\tFeb 2024\tJessica Xia\tUsing exemplars to develop students’ self-efficacy in EAP\t\nAug 2022\tJul 2024\tEric Ho\tFlipped learning: step-by-step video guides for self-/peer-assessment\t\nAug 2022\tJul 2024\tAdam Forrester\tDigital and workshop resources for FYPs and ITC students\t\nMay 2022\tJun 2023\tJay Bidal\tAn Interactive Training Tool for Student Self-Correction of Language Errors\t\nApr 2022\tJun 2023\tAdam Forrester\tEnhancing presentation skills through AI\t\nApr 2022\tJun 2023\tAdam Forrester\tFostering Independent Learning Through AI Chatbots\t\nMar 2022\tJun 2023\tAdam Forrester\tFH e-platform for Language Learning\t\nOct 2021\tFeb 2024\tJulia Chen & Linda Lin\tDeveloping an Automated Writing Evaluation System for Chinese Learners around the world\t\nSep 2021\tAug 2024\tJulia Chen and Grace Lim (Co-leader)\tTechnology-enabled English Across the Curriculum\t\nAug 2021\tJul 2023\tWinnie Shum\tDeveloping a generic module with virtual exchange as a platform for English language and intercultural interaction learning\t\nMay 2021\tDec 2022\tShari Lughmani\tPiloting a model for the development of a writing centre to support discipline-specific academic and professional writing\t\nMay 2021\tAug 2022\tVickie Li\tDeveloping a corpus to support postgraduate students’ thesis writing\t\nJul 2020\tJun 2021\tVincent Sheung Kwun & Andy Morrall\tInvestigating the feasibility of using an AI Robot to enhance physical learning spaces for English language learners\t\nJun 2020\tDec 2021\tJessica Xia\tActive learning in flipped ELC classrooms\t\nJun 2020\tDec 2021\tLucas Kohnke\tThe genesis of an ELC Personal English Learning Assistant coupling Artificial Intelligence and Natural Language Learning\t\nJun 2020\tNov 2021\tLinda Lin\tDeveloping an Interactive Academic Vocabulary Learning Tool\t\nApr 2020\tOct 2021\tShari Lughmani\tDeveloping Discipline Specific Writing skills for Tertiary Students of the Social Sciences discipline (APSS) and CAR subjects in the Faculty of Humanities FH\t\nApr 2020\tMar 2021\tLucas Kohnke & Andy Jarvis\tDeveloping English for Academic Purposes (EAP) Provision by bridging the gap between EAP (year 1) and ESP (year 3) delivery\t\nApr 2020\tAug 2022\tGrace Lim\tCommunities of Practice; English for Professional Development\t\nJan 2020\tDec 2022\tTim Lee\tThe Feasibility of Motivational Interventions in Diverse English Teaching Contexts\t\nJan 2020\tJun 2021\tAdam Forrester\tAn investigation into how the ELC’s VR Room is being used by students and is perceived by teachers\t\nAug 2019\tJun 2020\tEric Ho\tImproving ESL student oral presentations through peer review: Reviewing as learning\t\nJun 2019\tDec 2021\tJessica Xia\tFlipping academic presentation skills to enhance PolyU students’ confidence and competence\t\nFeb 2019\tJun 2020\tJohn Iveson\tThe use of digital documentary assessments for English language learning: A study of a project-based assessment of an undergraduate English language course.\t\nOct 2018\tJun 2019\tEric Ho\tConfidence and communication skills of graduates to function effectively in a global labour market\t\nAug 2018\tJan 2022\tTim Lee\tEnhancing doctoral students’ intercultural competence\t\nJul 2018\tDec 2018\tGrace Lim\tExtension of Excel@English (1) & (2): Reading, Vocabulary, Listening and Grammar language activities in academic context for Senior Year Admitted students\t\nJul 2018\tDec 2018\tIssa Ying\tExploring Student Language Needs for Embedded Critical Thinking Instruction in ELC Courses\t\nMay 2018\tDec 2020\tEllen Mok\tLearning English through short stories\t\nMar 2018\tMay 2019\tDennis Foung\tHow students handle blended learning tasks – A case study of an advanced university English course\t\nDec 2017\tJun 2019\tJessica Xia\tTeaching entrepreneurship and creativity – Success stories for ELC3222 students\t\nOct 2017\tMar 2021\tLinda Lin & Julia Chen\tDeveloping a PolyU-Stanford adaptive learning online platform for English and exploratory adaptive assessment for Science subjects. Principle Investigator\t\nSep 2017\tAug 2021\tJulia Chen\tLanguage enhancement for Final Year Projects using interactive app\t\nSep 2017\tAug 2021\tAdam Forrester\tHong Kong Continuing Professional Development Hub\t\nSep 2017\tJul 2021\tAdam Tse\tMastering the technical vocabulary of STEM\t\nSep 2017\tDec 2018\tAndrew Morrall\tEnhancement of the EWR by Automated Feedback\t\nSep 2017\tDec 2018\tAndrew Morrall\tIntegrating CILL resources into LCR feedback\t\nJul 2017\tDec 2018\tJane Robbins\tReview of large-scale English DSR subjects (3): Embedded English DSR subjects\t\nJul 2017\tJun 2019\tDennis Foung\tIdentifying at-risk student with Course Diagnostic Reports – A learning analytics approach\t\nJul 2017\tJun 2019\tDennis Foung\tExploring the language needs and ability of senior year admitted (SYA) students\t\nJul 2017\tJun 2019\tAdam Forrester\tInteractive Virtual Job Interviews with Self-reflection for LMS students\t\nAug 2017\tDec 2018\tShari Lughmani\tDeveloping an open platform for writing support in the disciplines across the faculties\t\nJul 2017\tDec 2018\tShari Lughmani\tDeveloping and piloting an enhanced faculty-based EWR liaison model for English Writing Requirement subjects (3): FAST, FENG, FCE and SD\t\nJul 2017\tDec 2018\tShari Lughmani\tDeveloping and piloting an enhanced faculty-based EWR liaison model for English Writing Requirement subjects (1): FB & FHSS\t\nJul 2017\tDec 2018\tMary Cheung\tExcel@English (2): Listening and Grammar in academic context for SYA students\t\nJul 2017\tDec 2018\tGrace Lim\tExcel@English (1): Reading and Vocabulary language activities in academic context for SYA students\t\nJul 2017\tDec 2018\tLucas Kohnke\tExcel@English Mobile APP: Improving English in a Fun and Flexible Way\t\nJul 2017\tDec 2018\tLucas Kohnke\tDeveloping Mentor Provision for Academic English Success\t\nJul 2017\tJul 2017\tJohn Iveson\tDigitising LCR Subjects (1): Developing and piloting ebooks\t\nJul 2017\tJul 2017\tVivian Li\tDigitalising LCR Subjects (1): Flipped classroom for grammar learning\t\nJul 2017\tDec 2018\tVickie Li\tRe-engineering CILL 1: Language in action for undergraduate students\t\nJul 2017\tDec 2018\tJane Robbins\tReview of large-scale English DSR subjects (2): Professional English for Engineering & Science students\t\nJul 2017\tDec 2018\tJane Robbins\tReview of large-scale English DSR subjects (1): Workplace English for FB & SHTM students\t\nJul 2017\tDec 2018\tAnna Ho\tEnglish through co-curricular activites 1: EC\t\nJul 2017\tDec 2018\tCaitlin Feenstra\tPronunciation Enhancement for Lower-level LCR Students\t\nJul 2017\tDec 2018\tAnna Ho\tEnglish through co-curricular activites 1: EDC\t\nJul 2017\tDec 18\tAdam Forrester\tInteractive Student Response Systems for ELC subjects 2: DSR subjects\t\nJul 2017\tDec 2018\tAdam Forrester\tInteractive Student Response Systems for ELC subjects 1: LCR subjects\t\nJul 2017\tJun 2018\tAlan Urmston\tProvision of support for students taking IELTS\t\nJul 2017\tDec 2018\tShari Lughmani\tDeveloping and piloting an enhanced faculty-based EWR liaison model for English Writing Requirement subjects (2): FH\t\nJul 2017\tDec 2018\tJoe Ching\tRe-engineering CILL 2: Language in action for postgraduate students\t\nMar 2017\tAug 2018\tAnna Ho\tFlipped Service-Learning\t\nMar 2017\tFeb 2018\tLucas Kohnke\tInvestigating the effects of learner-generated and given multimedia annotations on vocabulary acquisition\t\nFeb 2017\tJan 2019\tIssa Ying\tDeveloping Critical Thinking (CT) through Visible Thinking (VT) Routines in EAP Courses\t\nJan 2017\tDec 2018\tMichael Tom, Vincent Lam & Dennis Foung\tTowards automatic tracking of student responses to teacher feedback in draft revision\t\nJan 2017\tDec 2018\tTim Lee\tThe Uses and Perceptions of L2 Motivational Strategies in University English for Academic Purposes (EAP) Subjects\t\nSep 2016\tJul 2019\tAnna Ho\tA language enhancement project for Dabu primary children and teachers\t\nSep 2016\tJun 2018\tChrissy Burns\tImproving English Writing Requirement feedback through genre approach\t\nSep 2016\tMar 2018\tAndy Jarvis & Lucas Kohnke\tAcademic Listening Strategies for the Global Student\t\nJul 2016\tDec 2017\tMichael Dean\tIndependent learning for Higher Diploma students on ELC1008\t\nJan 2016\tJan 2018\tLucas Kohnke, Julia Chen & Grace Lim\tInteractive online English activities and game-mediated app for independent language learning\t\nNov 2015\tMay 2018\tDean Gui\tThe Hong Kong PolyU Virtual Campus: An evolution in immersion, interaction & innovation\t\nSep 2015\tAug 2017\tJane Robbins\tOnline Project for the Improvement of University Speaking (OPTIMUS)\t\nSep 2015\tDec 2016\tLucas Kohnke & Andrew Jarvis\tInteractive e-guides and game-based activities for ELC FB DSR subjects\t\nAug 2015\tDec 2016\tKsenia Troshina\tEmpowering learning: introducing continuous feedback practices in an advanced English course\t\nJul 2015\tDec 2016\tLinda Lin\tPreparation for International Collaboration with Stanford University\t\nJul 2015\tAug 2016\tJoe Ching\tA project to investigate the factors that affect students to participate in an incentive award scheme in enhancing CILL users’ independent English language learning skills\t\nJul 2015\tJun 2016\tJulia Chen\tOverseas Scholarship Scheme Implementation Project\t\nMay 2015\tMay 2016\tChris Shepherd\tAnalysis of frequent English grammatical errors committed by Year 1 PolyU students at the DSE 3 level\t\nMay 2015\tDec 2015\tAnna Ho\tWhat’s learnt in service learning?\t\nJan 2015\tAug 2017\tLinda Lin\tOnline Support for academic writing for the engineering curriculum\t\nNov 2014\tJan 2021\tJessica Xia\tELC Massive Open Online Course (MOOC)\t\nSep 2014\tMar 2017\tAndy Morrall\tReinforcing the Importance of Academic Integrity and Ethics in Students through Blended Learning – A Deployment of Augmented Reality Applications\t\nSep 2014\tJul 2016\tAnna Ho\tA two-tier English Reading Workshop for Dabu Primary Students and Teachers\t\nSep 2014\tFeb 2016\tEllen Mok\tOnline extensive reading and writing\t\nAug 2014\tFeb 2016\tShari Lughmani\tSupporting and developing students’ English literacy practices in the disciplines\t\nAug 2014\tJan 2016\tJuliana Chau\tDesign and analysis of Bring Your Own Choice (BYOD) pedagogies in promoting student learning in higher education\t\nJul 2014\tAug 2017\tAdam Forrester\tMigration of ELC elearning provision from Moodle to Blackboard environment and associated materials development\t\nJul 2014\tAug 2016\tJulia Chen\tProfessional Development in Enhancing English across the Curriculum\t\nMay 2014\tAug 2017\tAnna Ho\tChongqing Train-the-trainers Programme\t\nMay 2014\tJan 2015\tAdam Forrester\tPresentation videos for EUS and University English for Higher Diploma Students I\t\nApr 2014\tMar 2016\tLinda Lin\tImproving the vocabulary knowledge of PhD and MPhil candidates in PolyU\t\nFeb 2014\tJan 2016\tAndy Morrall\tDevelopment of online self access English language materials and repository for tertiary materials developers in Hong Kong Part 2 (ICOSA 2)\t\nJan 2014\tMar 2015\tShari Lughmani\tDeveloping innovative online language learning support activities for the implementation of English writing\t\nJan 2014\tNov 2014\tCharles Griffith / Adam Forrester\tActive learning videos and online practice activities for ELC LCR Subjects\t\nDec 2013\tDec 2016\tJulia Chen\tThe Pilot Development of a Comprehensive and Effective Academic Support System to Facilitate Senior Year-admitted Students’ Academic Success in their University Study\t\nSep 2013\tAug 2015\tJuliana Chau\tAutomatic Classification Techniques In Virtual Environments – The ACTIVE Project: Generating Immediate Feedback to Support Reflective Learning within ePortfolio Contexts\t\nJul 2013\tFeb 2017\tJulia Chen\tDevelopment of an Institutional-wide e-Learning Platform with Diagnostic e-Assessment and e-Learning Packages using Learn@PolyU (理學網) to Enhance Entry Students’ Underpinning Skills and Knowledge\t\nJul 2013\tJun 2016\tJulia Chen\tCommunity of Practice (CoP) Project: Enhancing Students’ English Abilities\t\nMay 2013\tDec 2015\tIrene Lee / Jane Robbins\tDeveloping an Online Independent Learning Course Site in Blackboard for Practical English for University Studies (PEUS)\t\nMay 2013\tSep 2014\tDean Gui\tInscribe: A Journal of Undergraduate Student Writing\t\nNov 2012\tOct 2017\tJulia Chen\tLongitudinal Evaluation of the General University Requirements (GUR) under the New 4-year Curriculum\t\nJan 2012\tDec 2014\tAlan Urmston\tFurther development of the Diagnostic English Tracking Assessment (DELTA): A Web-based English Language Diagnostic Assessment and Tracking System for University Students in Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/scholarship/projects"
 },
 {
  "text": "The Centre provides English language assessments of the highest quality to complement the teaching and learning of English at undergraduate and postgraduate levels at the University.\nThe Centre also provides English language assessment services to the Hong Kong community, including the secondary and tertiary education sectors, and commercial and non-commercial employers.\nThe Diagnostic English Language Tracking Assessment (DELTA) is an English language proficiency measurement system designed specifically for the Hong Kong academic context. Through the DELTA, students can diagnose their strengths and weaknesses in reading, listening, grammar and vocabulary; track their English language gains; and plan their English language learning. The DELTA has been developed and is administered by the Centre in collaboration with Lingnan University and City University.\nThe Research Language Skills Assessment (RLSA) is designed to measure how well research students can write and speak in academic and research-related contexts. The assessment has two components: a written language test and a spoken language test.\nThe Centre provides other assessment services on a consultancy basis to meet the demands of clients from the educational and employment sectors.\nThe Centre has an active research and development profile in language assessment which provides the platform for the production and administration of its assessments.\nFor further information about ELC Assessments, contact us at\nTelephone: 3400 3314\nEmail: elc.assessment@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/elc/assessment"
 },
 {
  "text": "Skip to main content\nStart main content\n1 / 1\nJoin our annual ELC Book Exchange.\nWhere you can:\nexchange your old titles for any new ones that interest you,\nappreciate the world of reading,\nand get a souvenir!\n",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/book-exchange"
 },
 {
  "text": "Skip to main content\nStart main content\n",
  "url": "https://www.polyu.edu.hk/elc/subjects"
 },
 {
  "text": "These subjects help students become effective communicators by developing their language competence for academic and professional needs. \nSubject Code Subject Title Subject Description \nELC1007\tUniversity English for Higher Diploma Students I\t\t\nELC1008\tUniversity English for Higher Diploma Students II\t\t\nELC1011\n\tPractical English for University Studies\t\t\nELC1012\n\tEnglish for University Studies (APA/Harvard)\t\t\nELC1013\n\tEnglish for University Studies (IEEE/Vancouver)\t\t",
  "url": "https://www.polyu.edu.hk/elc/subjects/lcr"
 },
 {
  "text": "These subjects help students become effective communicators in the workplace. ",
  "url": "https://www.polyu.edu.hk/elc/subjects/dsr"
 },
 {
  "text": "1 / 1\nIgnite your 3MT® journey! \nCome join us and register the briefing session (for students from FCE, FENG, FH, & FHSS ONLY).\n",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/polyu-3mt-briefing"
 },
 {
  "text": "These subjects prepare postgraduate students in presentation and thesis writing skills. \nSubject Code Subject Title Subject Description \nELC6001\n\tPresentation Skills for Research Students\t\t\nELC6002\n\tThesis Writing for Research Students\t\t\nELC6011\n\tPresentation Skills for Research Students\t\t\nELC6012\n\tThesis Writing for Research Students\t\t",
  "url": "https://www.polyu.edu.hk/elc/subjects/rpg"
 },
 {
  "text": "Students who enter PolyU with a higher English standard can choose one of our four Level 2 LCR electives as their second LCR subject. \nSubject Code Subject Title Subject Description \nELC2011\n\tAdvanced English Reading and Writing Skills\t\t\nELC2012\tPersuasive Communication\t\t\nELC2013\n\tEnglish in Literature and Film\t\t\nELC2014\n\tAdvanced English for University Studies\t\t",
  "url": "https://www.polyu.edu.hk/elc/subjects/lcr-electives"
 },
 {
  "text": "Make an Appointment\nMaking an appointment\nSimply select a timeslot from the ELC Online Booking System. If you have any difficulties, ask one of our counter staff in the CILL to help.\nFor enquiries, please go to our CILL counter (A305) or call 2766 7526.\nCancelling an appointment\nIf, for any reason, you cannot attend a WAP/SAP session, you MUST cancel your appointment as soon as possible, at least three days in advance, so that another student can take your time slot. Demand for the WAP/SAP is great, so please be considerate.\nNOTE: You will be counted as absent, if you:\ndo not cancel your appointment,\nare over 10 minutes late for a WAP/SAP session.\nStudents who have been absent twice will not be able to make any advance WAP/SAP bookings for that semester.",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/sap"
 },
 {
  "text": "These subjects aim to expand students’ intellectual capacity beyond disciplinary domains and to enable them to tackle professional and global issues from a multidisciplinary perspective. \nSubject Code Subject Title Subject Description \nELC1A01\tScience Fiction as a Reflection on Humanity\t\t\nELC1A04\n\tFrom Lord of the Rings to Harry Potter: Fantasy, Reality and Humanity\t\t\nELC1A06\n\tHumanities and Human Relationships Through Films Across Chinese and Western Cultures\t\t\nELC1A07\n\tStorytelling for Life: Sharing Personal Narratives\t\t\nELC1A08\tDigital Literacies and Language\t\t\nELC1A09\tLanguage for the Workplace of the Future\t\t\nELC1A10\tSharing your story: Language for personal narrative and reflection\t\t\nELC1A11\tBuilding Critical Thinking Skills and Communication\t\t\nELC1CN03\n\tCreative Writing in English\t\t\nELC1CN05\n\tHorror in English Literature and Film\t\t",
  "url": "https://www.polyu.edu.hk/elc/subjects/car"
 },
 {
  "text": "These subjects aim to help students develop into competent professionals with a heart to serve others. ",
  "url": "https://www.polyu.edu.hk/elc/subjects/sl"
 },
 {
  "text": "Language & Communication Requirement (LCR) \nThese subjects help students become effective communicators by developing their language competence for academic and professional needs. \nELC1007\tUniversity English for Higher Diploma Students I\t\t\nELC1008\tUniversity English for Higher Diploma Students II\t\t\nELC1011\n\tPractical English for University Studies\t\t\nELC1012\n\tEnglish for University Studies (APA/Harvard)\t\t\nELC1013\n\tEnglish for University Studies (IEEE/Vancouver)\t\t\nLanguage & Communication Requirement (LCR): Electives \nStudents who enter PolyU with a higher English standard can choose one of our four Level 2 LCR electives as their second LCR subject. \nELC2011\n\tAdvanced English Reading and Writing Skills\t\t\nELC2012\tPersuasive Communication\t\t\nELC2013\n\tEnglish in Literature and Film\t\t\nELC2014\n\tAdvanced English for University Studies\t\t\nDiscipline-Specific Requirement (DSR) \nThese subjects help students become effective communicators in the workplace. \nResearch Postgraduate \nThese subjects prepare postgraduate students in presentation and thesis writing skills. \nELC6001\n\tPresentation Skills for Research Students\t\t\nELC6002\n\tThesis Writing for Research Students\t\t\nELC6011\n\tPresentation Skills for Research Students\t\t\nELC6012\n\tThesis Writing for Research Students\t\t\nCluster Area Requirement (CAR): Electives \nThese subjects aim to expand students’ intellectual capacity beyond disciplinary domains and to enable them to tackle professional and global issues from a multidisciplinary perspective. \nELC1A01\tScience Fiction as a Reflection on Humanity\t\t\nELC1A04\n\tFrom Lord of the Rings to Harry Potter: Fantasy, Reality and Humanity\t\t\nELC1A06\n\tHumanities and Human Relationships Through Films Across Chinese and Western Cultures\t\t\nELC1A07\n\tStorytelling for Life: Sharing Personal Narratives\t\t\nELC1A08\tDigital Literacies and Language\t\t\nELC1A09\tLanguage for the Workplace of the Future\t\t\nELC1A10\tSharing your story: Language for personal narrative and reflection\t\t\nELC1A11\tBuilding Critical Thinking Skills and Communication\t\t\nELC1CN03\n\tCreative Writing in English\t\t\nELC1CN05\n\tHorror in English Literature and Film\t\t\nService Learning: Electives \nThese subjects aim to help students develop into competent professionals with a heart to serve others. ",
  "url": "https://www.polyu.edu.hk/elc/subjects/all-subjects"
 },
 {
  "text": "The aim of the CILL Awards Scheme is \nto help you become an independent learner. You are encouraged to try a variety of CILL's learning activities.\nStart with the Bronze Award\nWhat you need to do:\nstudy for 15 hours in CILL\nfinish the 5 Bronze worksheets about “The Study Skills Handbook” (copies in CILL)\nWhat you will get:\nBronze Certificate\nBronze CILL label\nCoupon\nUpgrade to the Silver Award\nWhat you need to do:\nstudy for a further 15 hours in CILL\nfinish the 5 Silver worksheets about “The Study Skills Handbook” (copies in CILL)\nWhat you will get:\nSilver Certificate\nSilver CILL label\nPhoto on the bulletin board\nCoupon \nMove up to the Gold Award\nWhat you need to do:\nstudy for a further 15 hours in CILL\nupload the 5 Gold worksheets onto the Blackboard e-portfolio site\nwrite a reflection of about 200 words on your independent English language learning\nWhat you will get:\nGold Certificate\nGold CILL label\nPhoto on the bulletin board\nLetter of recommendation\nCoupon \nHow to apply\nThe CILL Awards are based on:\nthe number of hours you spend in CILL (including hours doing WAP/ SAP and CILL Workshops held in Room A305)\nthe worksheets you complete\nRemember\nrecord your study hours in the CILL using the smart card reader when you enter and leave\nhours are not counted if you do not use your smart card\nhours are counted until 31 December (semester 1), 30 May (semester 2) and 31 August (Summer term)\nBronze & Silver Awards\nstudy for 15 or 30 hours\nask the counter staff to write down the number of hours on the hours-checking form\nreturn the completed worksheets to the counter staff\nGold Award\nsend an email to elc.cill@polyu.edu.hk to enrol in the Blackboard eportoflio course\ncomplete a total of 45 hours study\nupload the completed worksheets and 200-word reflection to the Blackboard portfolio course\nask the CILL counter staff to write down the number of hours on the hours-checking form\nCentre for Independent Language Learning",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/award-scheme"
 },
 {
  "text": "What is the Excel@English Scheme (EES)?\nThe EES helps you:\nimprove your English in specifically targeted areas\nexplore appropriate and personalised language learning paths so that you can excel in your studies and future career\nThe Scheme provides you with:\nan experienced ELC English teacher to help you plan your learning and provide support throughout the Scheme\na star system to reward your efforts on a semester basis\nHow to Successfully Complete EES\nSign up during Weeks 1-3 to meet your EES mentor in mentoring sessions from Weeks 3-9\nGet advice on planning learning activities and / or learning paths from Weeks 3 to 9 during the mentoring sessions\nAsk your EES mentor to send/email your EES participation record sheet to you\nInvestigate alternatives to EES mentoring sessions \nbook an ELC Writing Assistance Programme (WAP) or Speaking Assistance Programme (SAP) session\nbook an ELC CILL Workshop\nFulfil the requirements of the Excel@English Scheme before Semester 1 or Semester 2\nBecome an EES Star and obtain the awards at the CILL counter\nConsider joining the CILL Award scheme\nHow to Enrol in EES?\nSign up during Weeks 1-3 each semester for the mentoring sessions – these sessions take place weekly from Week 3 to Week 9\nHow do I become an EES Star?\nTo become an EES Star, you need to meet the following requirements:\nEES / CILL Award Scheme Conversion Table \n​ EES Bronze Star / CILL Bronze Award EES Silver Star / CILL Silver Award EES Gold Star / CILL Gold Award \nEES\t300 points\n(3 sessions)\t500 points\n(5 sessions)\t700 points\n(7 sessions)\t\nCILL\t15 hours of study\t30 hours of study\t45 hours of study\t\nAwards of coupons (supermarket/ book / hotel)\tBronze certificate + $50 coupon\tSilver certificate + $50 coupon\tGold certificate + $100 coupon + recommendation letter\t\nPosted on CILL notice board\tName\tName + photo\tName + photo\t\nEES points value\nEach EES mentoring session is worth 100 points\nEach WAP /SAP session is worth 50 points\nEach ELC CILL workshop is worth 100 points\nClaiming your EES Star / CILL Awards\nTake your completed EES participation record to the CILL counter\nTo claim a CILL Award, please go to the CILL Award page for more information\nDownload the EES Mobile app\nCentre for Independent Language Learning",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/ees"
 },
 {
  "text": "Centre for Independent Language Learning (CILL) at A305 is specially designed for students by the ELC to support creative approaches to teaching and learning. Come to A305 with your friends and find a new area to excel at English in PolyU!\nCentre for Independent Language Learning",
  "url": "https://www.polyu.edu.hk/elc/independent-learning"
 },
 {
  "text": "If you are a degree or higher diploma student on a UGC-funded programme in the PolyU, then the WAP is for you!!\nWe provide individual, professional advice on all aspects of your writing - by appointment or on a drop-in basis.\nWe won't proofread your paper, but we will help you think critically about your own writing and give you some reader suggestions to hopefully make it more effective.\nWAP Service\nThe Writing Assistance Programme, modelled after the Writing Center in North American universities, is offered to all students enrolled in UGC-funded degree or higher diploma programmes. Our goal is to help you become a better writer by providing you with professional feedback on your writing that can hopefully develop your writing skills and confidence.\nWe are not a proofreading service and we do not correct errors for you, but we will help you identify possible errors and areas of improvement.\nWe are happy to show you strategies for improving your writing, such as how to:\ngenerate and develop ideas\norganise your content in logical paragraphs\nunderstand the expectations of your target reader\nlearn paraphrasing and referencing skills\nfind appropriate ways to express your ideas\nexplain grammar points\nWe also have:\nfree, take-away learning resources on how to plan, organise and write better\nguidelines on what the various departments in PolyU require of students' final year project\nguidelines on what employers in Hong Kong want to see and not see in job application documents\nWhat you should do\nYou should make a WAP appointment well in advance and bring with you to WAP\n(i) academic writing, e.g. a written assignment, an essay, a lab report or a final year dissertation,\nOR\n(ii) personal writing, e.g. scholarship application, job application, a debate speech or a newsletter that you are writing for your club or association;\nOR\n(iii) if you haven't actually started writing yet, the writing task or assignment question; and you can discuss ways to get started with a WAP teacher.\nImportant points to remember\nCome to the WAP early in your writing process so that you have enough time to revise your writing after receiving comments from a WAP teacher. Then you can come again after you have revised your draft.\nOur sessions are up to 50 minutes long, and once you have finished an appointment, you can book the next one.\nRemember: BOOK EARLY or you may not get an appointment!\nIf you'd like to audio record the session, please ask the teacher in advance.\nIf you only have a simple question to ask, consider going to the CILL Helpdesk instead.\nMake an Appointment\nMaking an appointment\nSimply select a timeslot from the ELC Online Booking System. If you have any difficulties, ask one of our counter staff in the CILL to help.\nFor enquiries, please go to our CILL counter (A305) or call 2766 7526.\nCancelling an appointment\nIf, for any reason, you cannot attend a WAP/SAP session, you MUST cancel your appointment as soon as possible, at least three days in advance, so that another student can take your time slot. Demand for the WAP/SAP is great, so please be considerate.\nNOTE: You will be counted as absent, if you:\ndo not cancel your appointment,\nare over 10 minutes late for a WAP/SAP session.\nStudents who have been absent twice will not be able to make any advance WAP/SAP bookings for that semester.\nCentre for Independent Language Learning",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/wap"
 },
 {
  "text": "ELC’s services have reached out to a wider community beyond Hong Kong. \nSupport for teachers on the mainland\nStaff of ELC have been serving as advisors to the “Train-the-trainers” Programme, jointly funded and organised by the Hong Kong Tin Ka Ping Foundation and Chongqing Education Commission. It is a teacher training programme in which outstanding primary and secondary English subject teachers are identified and trained to serve as trainers for their fellow colleagues in Chongqing counties. ELC has conducted training courses and visits to Hong Kong schools for these teachers.\nPolyU students’ international service\nELC runs a service-learning subject. Students taking this subject are required to render English classes for less advantaged children. Starting from 2015, in addition to HK, students taking this subject have a chance to teach English in Taiwan and Cambodia, as well as on the China mainland. \nCourses for international students\nELC has experience in running intensive English courses for international students. We have served groups from Kyung Hee University and Sookmyung Women’s University from South Korea, and National Yokohama University from Japan. These courses comprise:\nformal English classes facilitated by ELC teachers\ngroup activities led by PolyU students\nlectures and workshops about Hong Kong history and culture, and\nmany visits and sight-seeing activities",
  "url": "https://www.polyu.edu.hk/elc/extracurricular/international-outreach"
 },
 {
  "text": "PolyU 3MT®\nCheer up with our 3MT® contestants, reserve a seat by 29 June 2023, noon. (Seats are limited)\nPolyU 3MT® Workshop 2\nAre you interested in better connecting with your audience at 3MT? Register this workshop to learn more (for students from FCE, FENG, FH, & FHSS ONLY).\nPolyU 3MT® Workshop 1\nJoin us and transform your research into a thrilling three-minute pitch! Make a registration (for students from FCE, FENG, FH, & FHSS ONLY).\nPolyU 3MT® Briefing\nIgnite your 3MT® journey! Come join us and register the briefing session (for students from FCE, FENG, FH, & FHSS ONLY).\nEnglish Drama Club Annual Performance 2023\nThe English Drama Club proudly presents Check Please! Many of you come and support their annual performance at CCST every year, but since we have not been able to put on a live performance for… \nBook Exchange\nJoin our annual ELC Book Exchange. Where you can: exchange your old titles for any new ones that interest you, appreciate the world of reading, and get a souvenir! \nNew ELC Videos\nWatch our new videos and improve your writing skills. Latest videos include: Know Your Topic Sentences: watch the video and find out how to write better topic sentences. This will improve the… \n7 Mar, 2023\nNews English Language Centre \nBig Mouth Corner\nJoin Big Mouth Corner at CILL A305. Enjoy games, challenges, activities and free chat with our 8 student hosts. New themes each week! Mix and mingle in a relaxed and diverse English-speaking… \n6 Feb, 2023\nSocial Event English Language Centre \nJoin the Metaverse in the ELC\nTry out the metaverse in the ELC's VR Space. Go to Room A305a in the ELC's Centre for Independent Language Learning to find the Space. No booking required. Try out different activities and… \n9 Jan, 2023\nNews English Language Centre \nEnglish Competition- Extended until Jan 7\nThe English Competition has been extended until January 7. Don't miss the opportunity to express yourself using your communicative abilities to share your insights and stories to… \n30 Nov, 2022\nEvent English Language Centre ",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events"
 },
 {
  "text": "General Office\nCentre for Independent Language Learning (CILL)",
  "url": "https://www.polyu.edu.hk/elc/about-elc/contact"
 },
 {
  "text": "Let's hear your voice!\nYour Uni Advice: What advice would you like to give other students about university life?\nYour ELC Life: \nWhich ELC clubs and activities do you enjoy most?\nHow has the ELC helped you in your university life?\nWhich courses have you most enjoyed, and who are your favourite teachers?\nYour Film and Book Reviews: Have you seen any good films or read any good books lately?\nTell us about your experiences in around 100 words and your writing could be featured in the next issue of the ELC Newsletter!\nPlease send your writing to elc.newsletter@polyu.edu.hk for consideration.\nPlease also include your name and programme of study.\nNewsletter \nOct 2021 issue\nThe English Language Centre (ELC) welcomes you back for an engaging semester of learning. We offer many workshops, services, and initiatives that can help you.. Read more\nOct 2020 issue\nThis ELC Newsletter shares some recent developments at the Centre: First, some ELC colleagues share how the sudden switch to online teaching has provided not only challenges, but a few surprises too.. Read more\nSeptember issue\nIn this issue, we delve into a number of interesting aspects of life in the English Language Centre. After exploring the latest news, we catch up on initiatives led by the ELC, including student clubs. Then, we feature several recent activities and .. Read more\nFebruary issue\nThis issue details several major updates to our facilities and services during a very industrious academic year at the ELC! We have information on exciting upgrades to our CILL facilities, as well as a new VR app and updates to our student workshops and online courses.. Read more\nSeptember issue\nIn this issue we catch up on the many exciting projects, events and developments happening within the English Language Centre that bring PolyU staff and students together as part of ELC life. We hear from ELC staff members who discuss their current research interests and we have a recap of the main events organised by ELC clubs, including drama performances, service learning trips and reading groups.. Read more\nJanuary issue\nThis issue showcases some of the many projects and events that have been happening within the English Language Centre at The Hong Kong Polytechnic University. As we begin a new semester, we’d like to introduce new staff who have joined the department, and update you on highlights from recent ELC club events.. Read more",
  "url": "https://www.polyu.edu.hk/elc/about-elc/newsletter"
 },
 {
  "text": "The University invites applications for posts listed below. Unless otherwise specified, applicants should apply online. \n[Applicants who are not invited to an interview within two months of the closing date should consider their applications unsuccessful.]\nCurrent vacancy:\nCurrently there are no vacancies in the English Language Centre. Please click here for other career opportunities in the University.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/job-opportunities"
 },
 {
  "text": "What are the workshop topics?\n1. Academic English (1)\nAcademic writing style \nWrite in university style, not WhatsApp style\nIntegrating citations & referencing skills \nEffectively integrate citations into your essays\nGrammar for academic writing \nUse inversion to enhance your writing and learn other skills\n2. Academic English (2)\nDiscussion skills \nSpeak up with your classmates during discussions\nPresentation skills \nKeep your audience's attention as you present!\nEditing academic essays \nImprove your essays by correcting common errors\n3. Research and Postgrad Skills\nGain tips to succeed in your viva voce \nWrite an effective confirmation report\nEnhance your PowerPoint and Q&A skills during presentations \n4. English for Career Success (1)\nWriting CVs \nMake sure your CV stands out!\nImpressing in job interviews \nLearn how to successfully ace your next job interview\nPersuasive speeches \nMake your pitches succinct and persuasive!\n5. English for Career Success (2)\nCreating a professional profile \nMake sure you impress online and offline\nWriting a personal statement \nShow how you are a unique candidate\nWriting cover letters \nLearn how to match your skills and experience to the job\n6. IELTS\nIELTS Speaking \nFind out about the IELTS Speaking test and get advice on improving your scores\nIELTS Writing \nPractise Task 1 and Task 2 in IELTS Writing and get tips on what to do or not do!\nIELTS Listening and Reading \nDo a practice listening and reading test, and get top tips on how to improve your score\n7. English Writing Requirement (EWR)\nAcademic Essays for EWR (and other courses) \nGet tips on producing a top-notch essay that will wow your instructor\nArgumentative Essays for EWR (and other courses) \nLearn how to build and structure strong arguments and rebuttals\nReflective Writing for EWR (and other courses) \nExplore how to use effective reflection that engages your readers\n8. Pronunciation\nA series of workshops designed to:\nimprove your rhythm and stress\nstrengthen your intonation\nbuild your connected speech\nenhance your fluency\ngain confidence with problem consonants and vowels\n9. Making Digital Documentaries\nTelling your Story \nDevelop your storyboard, build your content & learn all about creating a digital documentary\nEngaging your Audience \nIntegrate audio, visuals, narration, and engagement techniques to capture and entertain your audience\nThe Language of Digital Media \nEnhance your English and digital literacy by writing a clear, compelling, and memorable script\nHow do I make a booking?\nGo to the ELC Booking System (PolyU students only)\nSelect a session from the system and you will receive confirmation by email.\nWhere are the workshops held?\nThe workshops will be held at CILL or online this semester.\nIs there anything else I should remember?\nBe punctual for the workshop.\nUse English!\nBe an active learner! Our workshops are interactive, and you will get the most out of them asking more questions and doing all the activities during the workshop!",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/workshops"
 },
 {
  "text": "Language Resources \nResources Description \nAdvanced Dictionary Skills Program\tThe aim of this site is to save your time and improve your English. It includes information on how to use dictionaries faster, and how to improve your vocabulary, grammar, pronunciation and writing by using the advanced features of modern dictionaries.\t\nCILL A - Z Index\n\tLearn anytime with our online materials.\t\nEnglish in the Workplace\tUseful resources and practice materials for the English you need in the workplace.\t\nFinal Year Project Guidelines\n\tGuidelines for Final Year Projects.\t\nIELTS\tThese materials have been specifically developed to provide support for students who are preparing to take the IELTS test. Watch the video to get an overview of the IELTS test and a guide to these online materials.\t\nITC Supplementary Materials\tSupplementary and Resource Materials for ITC students.\t\nLanguage Support for PhD/MPhil Students\t\nThis site is especially designed to support research students. It contains, annotated samples of theses and confirmation reports, writing guidelines, and strategies for a successful PhD oral defence.\n\t\nLiteracy in the Disciplines\tThe website consists of a comprehensive support system to help provide a stimulating learning environment for students, content and language teachers.\t\nPair-up Game\tEnrich your vocabulary by learning phrases which can replace clichés.\t\nReferencing\tThe guides have been written to help you to become familiar with academic referencing conventions and to reference correctly in your work.\t\nSounds\tThis website is to help you learn English pronunciation.\t\nSTEM Vocabulary Website\tUseful resources and activities to help you master the technical vocabulary of STEM disciplines\t",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/language-resources"
 },
 {
  "text": "In support of the pursuit of English language excellence within the PolyU and in the wider Hong Kong community, ELC runs a wide range of community service projects. \nSupport for local community centres\nELC offers opportunities for PolyU students to reach out to the local community through its service-learning subject. A project known as “Connect Hong Kong”, in which PolyU students serve as literacy tutors and render English reading classes for primary school children, is organised every year. Each year about 30 PolyU students and 100 school children from community centres take part in this project. \nSupport for the elderly\nTo show our respect and support for the senior citizens in our community, ELC has organised a “Practical English for the Elderly” course in collaboration with the Tung Wah Group of Hospital, Community Services Division. The course focuses on vocabulary and conversation skills, and more importantly on developing their confidence and communication skills. \nSupport for Po Leung Kuk’s Language Training Programme\nELC has been the academic consultant to Po Leung Kuk/ Hong Kong Rugby Union language programmes since 2004. The programmes aim to help nearly 900 students in residential care as well as from underprivileged backgrounds by raising their English language proficiency in order for them to reach tertiary level education and reduce the incidence of future inter-generational poverty.\nELC provides a range of services from management, recruitment of teachers and curriculum design to programme assessment and teacher training. Since 2013, with the goodwill of ELC staff, large-scale class observations and post-observation discussion have been made feasible to teachers on the language training programme.\nSupport for PolyU staff\nELC has also run a wide range of courses for staff at PolyU. These include:\nSpeaking in English for PolyU Staff\nWriting in English for Polyu Staff\nFrom Chinglish to English Writing and Speaking\nIn addition to the above, ELC also develops custom-designed courses for individual units in the University such as Finance Office, Academic Secretariat and the Library.",
  "url": "https://www.polyu.edu.hk/elc/extracurricular/community-outreach"
 },
 {
  "text": "The design and delivery of the ELC Open Online Courses aim to support our efforts in achieving our objectives:\nTo support the pursuit of English language excellence within the PolyU and in the wider Hong Kong community, we have developed\nServing the Community through Teaching English is a fusion of face-to-face and online learning experience developed for the subject ELC2S02 Serving the Community through Teaching English. This blended learning initiative provides flexible and engaging online lectures followed up by in-class discussions and practice.\nWhat do I do next?\nGo to edX and edX edge to create separate accounts for free. After registration, you can click on one of the courses from the above links to access it. ",
  "url": "https://www.polyu.edu.hk/elc/independent-learning/moocs"
 },
 {
  "text": "Mission Statement\nOur objectives\nTo enhance students' communication skills so that they can pursue academic and professional excellence\nTo foster students' independent, life-long English language learning and whole-person development\nTo support the pursuit of English language excellence within the PolyU and in the wider Hong Kong community\nWe aim to achieve these objectives by\nProviding high quality English language subjects and other learning opportunities\nDeveloping and implementing effective quality assurance mechanisms, and reliable and valid English language assessment\nSupporting students in the development of effective strategies for independent, life-long learning\nProviding a range of non-formal, student-centred activities with an English language focus\nAdvancing knowledge of language learning and teaching through research and scholarly activity\nEstablishing strong connections with the professions, other tertiary institutions and the school sector\nProviding a stimulating and fulfilling workplace that respects cultural and individual diversity",
  "url": "https://www.polyu.edu.hk/elc/about-elc/mission"
 },
 {
  "text": "The Centre is committed to developing students' English language skills. We also support students in the development of personal attributes and strategies for whole-person development and life-long learning. Through our carefully designed subjects and programmes, as well as our highly-qualified colleagues, we strive to ensure that PolyU students possess the language proficiency and skills they need for their studies at the University and for their future career. The introductory video on our homepage provides an overview of the Centre and its contribution to the education of PolyU students. These web-pages provide further information about the Centre, as well as a wide range of resources on the use of English for study and for the workplace. I hope you will find them useful and informative.\nDr Jane Robbins\nInterim Director, English Language Centre",
  "url": "https://www.polyu.edu.hk/elc/about-elc/message-from-director"
 },
 {
  "text": "FG307, Kinmay W. Tang Building \n+852 3400 8334 \nissa.ying@polyu.edu.hk \nEducation and Academic Qualifications\nBachelor of Arts, Zhejiang Normal University\nMaster of Arts, University of Central Lancashire\nDoctor of Philosophy, The University of Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/people/academic/issa-ying"
 },
 {
  "text": "Education and Academic Qualifications\nCertificate for the Teaching of English as a Foreign Language to Adults, University of Cambridge\nDiploma in the Teaching of English as a Foreign Language to Adults, University of Cambridge\nBachelor of Arts, The Victoria University of Manchester\nMaster of Arts in English for Specific Purposes, City University of Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/people/academic/andrew-mossman"
 },
 {
  "text": "Education and Academic Qualifications\nMaster of Arts, University of Southampton",
  "url": "https://www.polyu.edu.hk/elc/people/academic/abdulwahab-tahhan"
 },
 {
  "text": "Education and Academic Qualifications\nCertificate in Teaching English to Speakers of Other Languages, University of Cambridge ESOL examinations\nBachelor of Arts, University of California Davis",
  "url": "https://www.polyu.edu.hk/elc/people/academic/eric-tindall"
 },
 {
  "text": "Bachelor of Arts, York University\nMaster of Science in Education, Niagara University",
  "url": "https://www.polyu.edu.hk/elc/people/academic/john-oullette"
 },
 {
  "text": "A606, Chung Sze Yuen Building \n+852 2766 7895 \ncalum.page@polyu.edu.hk \nBiography\nI have worked as a teacher, teacher-trainer and professional skills trainer in the UK, the Netherlands, Italy, Spain, Burma, Sri Lanka, Colombia, and Peru.\nI returned to Hong Kong in 2016 to take up a teaching position at the PolyU where I have completed my Master's research looking into language and identity with Hong Kong undergraduate students.\nDiploma in Teaching English to Speaker of Other Language, University of Cambridge\nPostgraduate Certificate, London South Bank University\nBachelor of Arts (Honours) in English Literature, The Open University\nMaster of Education, The Open University",
  "url": "https://www.polyu.edu.hk/elc/people/academic/calum-page"
 },
 {
  "text": "AG643, Chung Sze Yuen Building \n+852 2766 7510 \ncarina.lam@polyu.edu.hk \nPostgraduate Diploma in Education, Hong Kong Baptist University\nBachelor of Arts in English Language and Literature, Hong Kong Baptist University\nMaster of Arts, The Chinese University of Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/people/academic/carina-lam"
 },
 {
  "text": "Higher Diploma in Translation and Interpretation, City University of Hong Kong\nMaster of Science in Teaching English to Speakers of Other Languages, The University of Stirling\nMaster of Arts in Translating and Interpreting, University of Newcastle Upon Tyne",
  "url": "https://www.polyu.edu.hk/elc/people/academic/denise-cheung"
 },
 {
  "text": "AG656, Chung Sze Yuen Building \n+852 2766 7520 \ndean.a.f.gui@polyu.edu.hk \nMaster of Arts, University of Illinois, Chicago Campus\nProfessional Qualifications\nNCATE English Secondary School Teaching",
  "url": "https://www.polyu.edu.hk/elc/people/academic/dean-gui"
 },
 {
  "text": "Certificate in Teaching English to Speakers of Other Languages, Trinity College London\nInternational Diploma in Language Teaching Management, University of Cambridge ESOL Examinations/ University of Queensland\nCambridge RSA Diploma in English Language Teaching to Adults, University of Cambridge Local Examinations Syndicate\nBachelor of Arts in Scandinavian Studies, University of Newcastle Upon Tyne\nMaster of Arts in Teaching English to Speakers of Other Languages, The University of Lancaster",
  "url": "https://www.polyu.edu.hk/elc/people/academic/james-evans"
 },
 {
  "text": "Certificate in English Language Teaching to Adults, University of Cambridge\nPostgraduate Certificate in Teaching English as Foreign Language (TEFL), University of Birmingham\nBachelor of Arts, Saint Mary's University\nMaster of Education (TESOL), The University of Tasmania",
  "url": "https://www.polyu.edu.hk/elc/people/academic/dawn-gillis"
 },
 {
  "text": "Teacher Certificate, Education Department, Hong Kong (Sir Robert Black College of Education)\nBachelor of Education, University of Nottingham\nMaster of Arts in Special Applications of Linguistics, The University of Birmingham\nMaster of Arts, The University of Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/people/academic/grace-lim"
 },
 {
  "text": "Dr Jane ROBBINS\nInterim Director of English Language Centre \nA610a, Chung Sze Yuen Building \n+852 2766 7535 \njane.robbins@polyu.edu.hk \nDiploma in Teaching English as a Foreign Language, The English Language Centre, London\nBachelor of Arts, The University of Sheffield\nDoctor of Philosophy, The University of Sheffield",
  "url": "https://www.polyu.edu.hk/elc/people/academic/jane-robbins"
 },
 {
  "text": "Ms Anna HO\nAssociate Director of English Language Centre \nAG655, Chung Sze Yuen Building \n+852 2766 7494 \nanna.ho@polyu.edu.hk \nTeacher Certificate, Education Department, Hong Kong (Sir Robert Black College of Education)\nBachelor of Arts, The Chinese University of Hong Kong\nMaster of Philosophy, The Chinese University of Hong Kong",
  "url": "https://www.polyu.edu.hk/elc/people/academic/anna-ho"
 },
 {
  "text": "1 / 1\nAre you interested in better connecting with your audience at 3MT?\nRegister this workshop to learn more (for students from FCE, FENG, FH, & FHSS ONLY).",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/polyu-3mt-workshop2"
 },
 {
  "text": "Adam does not like a “say no” attitude. In the 21st century, not wanting, or not knowing how to do something is never an excuse. If you don't know how to do something, learn - we are in the age of life-long learning! Someone else will more than likely be able to do it faster and better than you, but the knowledge you have gained will enable the end result to be much better, even if in the end you get someone to do that thing for you. If you don't want to do something, be careful. While in the past people could spend a lifetime sitting behind a desk doing a minimum of work, in today's world you can be easily found out.\nFind out about AI and education in Adam's video.\nSee Adam's publications here.\n☛ Adam supports all projects which lead to better teaching and learning. This is the key question that should be asked behind any new initiative. Does it lead to improved teaching and learning? If not, what is the purpose of the initiative?\n☛ Adam started and is now part of the team creating the ELC Open Online Courses.\n☛ Adam is leading the team integrating multimodality in the ELC's HD subjects\n☛ Adam led the ELC's VR/AR Job interviews project.\n☛ Adam led the PolyU team on the HKCPD Hub.",
  "url": "https://www.polyu.edu.hk/elc/people/academic/adam-forrester"
 },
 {
  "text": "Watch our new videos and improve your writing skills.\nLatest videos include:\nKnow Your Topic Sentences: watch the video and find out how to write better topic sentences. This will improve the organisation of your writing and make your writing clearer! Watch the video here: https://youtu.be/JNomyh_3VDk\nAll About Referencing: this video covers the basics of refencing. What is referencing, why should you reference, and how you can reference! Watch the video here: https://youtu.be/iUagtkLBiWk\nWhen to Hedge: You might know a little about academic style and using formal English in your essay, but do you know about hedging and the use of tentative language? Watch this video to find out more! https://youtu.be/-VI7JZdKIkQ",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/new-elc-videos"
 },
 {
  "text": "Join us and transform your research into a thrilling three-minute pitch! \nMake a registration (for students from FCE, FENG, FH, & FHSS ONLY).",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/polyu-3mt-workshop-1"
 },
 {
  "text": "This page contains a list of free tools and resources for language teachers to use in their classrooms:\nTeaching Tools - a list of tools that can be used for interactive language learning\nResources - a list of media sources such as audio, video, and images that can be used for language teaching and learning\nREADING\nNewsela - tool that allows teachers to find articles with appropriate reading levels for their students\nRead Works - good quality text with a wide range, can help facilitate targeted reading instruction in your class\nPerusall - a tool that allows teachers to upload texts for collaborative reading, annotation and discussion\nWRITING\nGoogle Docs - for writing, editing and collaborating\nOneDrive (Office 365 Word) - similar to Google Docs, but you need to use your PolyU Connect account for students to have editing access\nBRAINSTORMING AND SHARING IDEAS\nMicrosoft Whiteboard - a freeform, digital canvas\nPadlet - lets users post notes on a digital wall\nGoogle Jamboard - another whiteboard alternative; user friendly, but needs a google account\nQUIZZES\nKahoot - basic multiple-choice quiz tool for synchronous or asynchronous use (Basic free version is fine)\nSocrative - a quiz-based, formative assessment tool with multiple features (Basic free version is fine)\nQuizizz - basic multiple-choice quiz for synchronous or asynchronous use (Only free version available)\nMentimeter - an easy to use poll/quiz tool with multiple features (Questions limited on free version)\nPoll Everywhere - an audience response tool (Basic free version for audience up to 25)\nGoogle Forms - a survey tool that can be adapted to a quiz\nMS Forms - similar to Google Forms; part of Office 365; if you use a PolyU Connect account you can limit replies to students\nLESSON DELIVERY\nPixton - make comics, get your students to create their own comics, and experiment with alternate ways of content delivery\nResources\nVIDEOS\nELC YouTube - ELC videos available to the public\nELC Panopto - ELC videos on a platform available in China\nVIDEO EDITING\nMS Photos comes with Windows 10 and installed on your PolyU computer - make simple edits to videos so that you can put them on ELCAS; look for Windows Movie Maker if you have an older version of Windows on your computer\nIELTS\nELC IELTS - comprehensive resource covering all parts of the test\nIELTS - official resource for IELTS\nHONG KONG CONTINUING PROFESSIONAL DEVELOPMENT RESOURCES (SIGN-IN NEEDED)\nMain Resources - videos and PowerPoints from Hub talks, journals and teacher organizations\nTeaching Resources - resources that help you to teach better",
  "url": "https://www.polyu.edu.hk/elc/teacher-area/teaching-tools-and-resources"
 },
 {
  "text": "Join Big Mouth Corner at CILL A305. Enjoy games, challenges, activities and free chat with our 8 student hosts. New themes each week! Mix and mingle in a relaxed and diverse English-speaking environment.\nAll PolyU students are welcome - no registration required. Thursdays, 6:30 - 8:30 PM, through March 23.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/big-mouth-corner"
 },
 {
  "text": "Home \nAbout ELC \nNews and Events \nTry out the metaverse in the ELC's VR Space. Go to Room A305a in the ELC's Centre for Independent Language Learning to find the Space. No booking required. Try out different activities and simulations with our state-of-the-art equipment. Immerse yourself in new environments and give a boost to your language skills.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2023/join-the-metaverse-in-the-elc"
 },
 {
  "text": "Home \nAbout ELC \nNews and Events \nThe English Competition has been extended until January 7. Don't miss the opportunity to express yourself using your communicative abilities to share your insights and stories to the PolyU community.\nPrizes include cash, iPad, Apple Watch, GoPro, and more! Visit https://elc.polyu.edu.hk/EnglishCompetition/ to learn more.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/english-competition--extended-until-jan-7"
 },
 {
  "text": "The ELC has produced five new videos to help you with your essay writing. \nThey include:\nHow to brainstorm and research topics \nTop Tips for Organising YOUR Essay \nHow to write Effective Essay Introductions \nHow to write Effective Essay Paragraphs \nHow to write Effective Essay Conclusions\nFind the videos on the ELC's YouTube channel: https://www.youtube.com/@elcpolyu\nSubscribe to our channel so that you are always notified when we upload new videos.\nWe have hundreds of videos that help you improve your English. Topics include academic presentations, workplace English, IELTS, vocabulary, speaking skills and much, much more! All our videos have English subtitles. Subscribe now, start watching, and get a boost to your English skills.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/five-new-videos-to-help-you-with-your-essay-writing"
 },
 {
  "text": "Home \nAbout ELC \nNews and Events \nThere are two upcoming events for the ELC Drama Club.\nThe Red Brick Nightmare\nWednesday 2 November, from 20:00.\nFollow the clues on the Drama Club's Instagram Account to find the final venue.\nhttps://www.instagram.com/polyuenglishdramaclub/\nCostume Makeup Workshop\nTuesday 15 November, 19:00-21:00, BC202.\nTransform yourself into your favourite characters.\nClick here to sign up",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/upcoming-elc-drama-club-events"
 },
 {
  "text": "Take a study break by enjoying a performance by the PolyU SAO Philharmonic Orchestra. Join us at CILL, A305, for some uplifting music and a refreshing atmosphere on Thursday November 3, at 6pm. ",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/polyu-sao-philharmonic-orchestra-at-cill"
 },
 {
  "text": "CILL is pleased to host a cello performance presented by the PolyU SAO Philharmonic Orchestra. Be there at 6:00 sharp, October 27, because this music will be gone in a flash!",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/cello-performance-at-cill"
 },
 {
  "text": "Go to Room A305 to enter the Halloween Photo Contest at CILL. Win prizes for different categories of entries. Competition ends Thursday 3 November. ",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/halloween-photo-contest"
 },
 {
  "text": "The ELC is pleased to announce the return of Big Mouth Corner. Staring from Thursday 6 October, there will be weekly sessions from 18:30-20:30 in CILL, Room A305 until Thursday 17 November. Students are encouraged to come to Big Mouth Corner to relax, practise, and improve their English! ",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/big-mouth-corner"
 },
 {
  "text": "Congratulations to the English Across the Curriculum (EAC) Team for winning the 2022 UGC Teaching Award! More details are here: https://www.ugc.edu.hk/eng/ugc/about/press_speech_other/press/2022/pr20220926.html \nEAC is led by Julia Chen and Grace Lim. Current team members of EAC are Eric Ho, Mary Cheng, Frankie Har, Bonnie Wu and Jane Robbins with past members including Felicia Fang, Denise Cheung, Hannah Lai, Pinna Wong, Vickie Li, Mitchell Mak, Kay Chan and Jessica Xia. \nEAC initiatives over the past few years include workshops for discipline teachers on students’ writing problems, briefings for students to guide them on writing and speaking assignments, organising and co-organising conferences, publishing papers with discipline teachers and the development of a mobile app (Capstone Ninja) with language/writing/ speaking resources for students. \nWell done to the EAC team - past and present - for their continued hard work. Their recognition is well-deserved.",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/2022-ugc-teaching-award"
 },
 {
  "text": "Would you like to get better grades in your assessments? Are you planning to take IELTS or Chinese language tests? Will you be applying for internships or jobs in the coming months? \nIf your answer is yes to any of these questions, then eLanguage 易語學 is for you! Watch these 6 students to find more reasons to join eLanguage 易語學 now.\neLanguage 易語學 provides you with language input and practice in both English and Chinese. You can find materials on writing essays, workplace English and Chinese, and general vocabulary to help you in your studies, your future employment and language tests. During semester 1 you can also win fabulous prizes including tablets, bluetooth earphones and book vouchers by completing the activities in eLanguage 易語學.\nFor more information and joining details, please look here: https://www.polyu.edu.hk/fh/news-and-events/news/2022/launch-of-polyu-elanguage/\nGood luck with your studies and enjoy eLanguage 易語學!",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/join-elanguage-and-improve-your-language-skills"
 },
 {
  "text": "Home \nAbout ELC \nNews and Events \nLaunch of PolyU’s eLanguage 易語學\nLaunch of PolyU’s eLanguage 易語學\nA new language learning eplatform created by FH is ready for students this semester. The eplatform, called eLanguage 易語學, has been created by colleagues in the CLC and ELC. Students are encouraged to join eLanguage 易語學 to improve their language proficiency in Chinese and English self-enrol instructions.pdf. The platform includes learning modules on writing essays, general vocabulary and workplace English and Chinese as well as an introduction to pinyin. The best performing students on eLanguage 易語學 will have the chance to win great prizes including tablets, bluetooth earphones and book vouchers. Find out more details in this video: https://youtu.be/Lea6tPytOks\n",
  "url": "https://www.polyu.edu.hk/elc/about-elc/news-and-events/2022/launch-of-polyu-elanguage"
 }
]