[
 {
  "text": "Skip to main content\nStart main content\nWe collaborate with Education Bureau to organize workshops for teachers of Science Education Key Learning Area — Physics & Combined Science (Physics Part). It aims\nTo enhance teachers’ knowledge and skills on teaching Physics (S4-6) curriculum with hands-on and mind-on learning activities for physics students with the use of IT tools and tailor-made teaching aids; and\nTo provide teachers with hands-on experience to use the IT tools and tailor-made teaching aids in learning activities related to Physics (S4-6) curriculum. \nStay tuned with us or the training calendar of Education Bureau for future workshops! \n",
  "url": "https://www.polyu.edu.hk/ap/services/teacher-training-platform"
 },
 {
  "text": "Keywords \n2023 Departmental Outstanding PolyU Young Alumni Award in Entrepreneurial Achievement\nWe are delighted to share that Dr. HUI Yeung Yu has been awarded the 2023 Outstanding PolyU Young Alumni Award in Entrepreneurial Achievement of the Department of Applied Physics. He… \n23 May, 2023\nNews \n2023 Departmental Outstanding PolyU Alumni Award in Professional Achievement\nIt is our great honour to announce that Mr. SIN Tak Yin won the 2023 Outstanding PolyU Alumni Award in Professional Achievement of the Department of Applied Physics. Mr. SIN Tak Yin… \n22 May, 2023\nNews \nOutstanding Student Award and Presidential Student Leadership Award 2022\nCongratulations to Mr. Ong Chin Yuan and Mr. Tsao Yu-jui, students of BSc (Hons) in Engineering Physics, on receiving the Outstanding Student Award of Faculty 2022 and the Presidential Student… \n23 Mar, 2023\nNews \nProf Yang CHAI's research was recognized as one of the Top Ten Hong Kong Innovative Technology News 2022\nProf. Yang CHAI, Associate Dean of the Faculty of Science and Professor of the Department of Applied Physics, led a research project to develop new vision sensors that emulate and even… \n10 Mar, 2023\nResearch \nPolyU research discovers nanoscale ferroelectric new materials exhibiting potential for making computer memory with low cost and low energy consumption\n19 Jan, 2023\nResearch \nPolyU AP Sets Up the \"Department of Applied Physics Retiree Scholarship\" for excellent undergraduates\nOur Department is honoured to receive a donation of HK$ 1 million for establishing the \"Department of Applied Physics Retiree Scholarship\". AP wishes to expresses sincere gratitude to the donor for… \n4 Jan, 2023\nNews \nProf. Jianhua Hao awarded Key Programme Funding Support from the National Science Foundation of China (NSFC)\nProf. Jianhua HAO, Chair Professor of Materials Physics and Devices of AP received Key Programme Funding Support from the National Science Foundation of China (NSFC). Prof Hao's team… \n11 Oct, 2022\nResearch \n關於我校曾遠康、曾龍輝參與申報2022年度廣東省科學技術獎的公示\n10 Oct, 2022\nJohnson Matthey launches UK-China low carbon research consortium accelerating a green future in China\n28 Jul, 2022\nPolyU develops advanced vision sensors that emulate human visual adaptability\n31 May, 2022\nResearch \n1\n2\n3\n4\n5\n...\n11\nNext\nJump to",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news"
 },
 {
  "text": "Introduction:\nPhysical science plays an essential role in our daily lives, ranging from our smartphones to transportation, electricity and even medical health. In encouraging our potential teenagers in Hong Kong to discover and share the wonders of physical science with the public, the Department of Applied Physics at the Hong Kong Polytechnic University organizes the PolyU Physics Short Video Competition 2023. The competition aims at not only fostering your initiatives in exploring knowledge of theoretical physics in your daily lives with the development of critical thinking skills, but also lending your helping hands to spark public interest in physical science. \nThe competition is open to all full-time secondary school students in Hong Kong. Interested students are required to create short videos (maximum 5 minutes) that explain and describe a complicated physics-related scientific concept or phenomenon in a creative, accurate, engaging and understandable way. We don't care if you are dancing, acting, or using props to get your point across – as long as you are using your scientific smarts and creativity to make it happen! So, get your cameras ready, put on your thinking caps, and let's see what you can do!\nLanguage:\nEnglish or Chinese\nFormat:\nThe duration of the video should not be exceeding 5 minutes. Upload to YouTube as an unlisted video (i.e. can only be seen and shared by anyone with the link).\nEligibility:\nAll secondary school students in Hong Kong are welcome. \nIndividual or a team with a maximum of 4 students from the same school\nParticipants / Teams will be assigned to one of the following categories: \nJunior Secondary Division: Students of S1 to S3\nSenior Secondary Division: Students of S4 or above\nTeams cannot have a mixture of junior and senior division students.\nNo duplicate entries are allowed.\nThere is no limit on the number of teams / students from one school. \nRequirements:\nAny physics principles and concepts that you want to explain and drill down or a physics phenomenon that you are interested in\nIt is a plus if the video has any AI components.\nThe video entry must be original and comply with YouTube’s Terms of Service.\nAwards: \nThe following awards will be presented: \nChampion (Senior Secondary Division): Gift coupons of HKD 5000 and a certificate\nChampion (Junior Secondary Division): Gift coupons of HKD 5000 and a certificate\n1st Runner-up (Senior Secondary Division): Gift coupons of HKD 3000 and a certificate\n1st Runner-up (Junior Secondary Division): Gift coupons of HKD 3000 and a certificate\n“Most-liked Video” Award: Gift coupons of HKD 1000 and a certificate\nAll participants will receive a certificate of participation.\nAwardees under Senior Secondary Division will have a chance in receiving favourable consideration for admission to PolyU. \nSubmission Deadline:\nComplete this Online Submission Form by 9 Dec 2023 23:59 (Hong Kong Time) \n\nEvaluation Criteria:\nThe judging panel will be formed by a group of representatives from the Department of Applied Physics, the Hong Kong Polytechnic University.\nThe entry must relate to the knowledge of physics. If the entry can demonstrate and illustrate the knowledge and concepts of artificial intelligence (AI), it will be awarded a 10% bonus on the overall score.\nAll the entries will be evaluated and judged based on the following criteria.\nCriteria\n\t\nDetails\n\t\nContent and Accuracy (40%)\n\t\nDepth of knowledge in physics and the accuracy of the information\n\t\nCreativity and Attractiveness (40%)\nResonating ideas in daily life which can arouse public interest.\nInnovative concepts, unique presentation.\nTechnical Appeal (20%)\nFilmmaking techniques; Animation; Video Effect\nProfessional Academic (Bonus: 10%) \nKnowledge in Artificial Intelligence (AI) \nAwards Presentation Ceremony:\nAll winners will be invited to attend an awards presentation ceremony to be held at the PolyU campus in April 2024 tentatively.\nEnquiry:\napdept@polyu.edu.hk\nTerms and Conditions:\nThe entry must be original and must not infringe any copyright laws. It must also be the entrant's first published work and not have been previously exhibited, submitted to other competitions, or related events.\nThe entry must not contain any inappropriate or controversial content such as obscenity, violence, pornography, defamation, insults or objectionable material.\nThe entrant must provide genuine and accurate information, and any dishonest or incorrect information will result in disqualification. The entrant should hold full responsibility for any loss caused to the Department of Applied Physics, the Hong Kong Polytechnic University or any third party.\nAfter submission, the entry should not be modified, exchanged or returned.\nThe entrant shall get permission from the copyright owner(s) or relevant venue owner(s) if the entry contains authorized material(s) or does video recording(s) in the privately-owned venue(s). The entrant may be requested to show their approval documents.\nAll parents of participants should provide their acknowledgment of their children's participation in the competition.\nAll individuals who appear in the video entry have given their informed consent and acknowledged that their images and audio may be edited and used for the sole purpose of participating in the competition.\nThe Department of Applied Physics, the Hong Kong Polytechnic University retains the right to use, rename, copy, edit, distribute and broadcast all or parts of the entries. \nAll decisions made by the judging panel are final.\nThe Department of Applied Physics, the Hong Kong Polytechnic University has the full authority to make final decisions in all matters related to this competition, including the terms and conditions, prizes and other arrangements without prior notification.\nBy submitting an entry, the entrant is deemed to have accepted the aforementioned terms and conditions. Any breach of the terms and conditions may result in disqualification from the competition, subject to the final discretion of the Department of Applied Physics. There is no appeal mechanism in this competition.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/polyu-physics-short-video-competition-2023"
 },
 {
  "text": "Established in 1987, the Department of Applied Physics has experienced rapid growth to be a world-class centre for research and education in applied physics. The Department has over 30 faculty members, 16 support staff, 100 research staff, 100 graduate students pursuing MPhil or PhD degrees and 250 undergraduate and sub-degree students. Our graduates have served society in key positions and significantly contributed to Hong Kong’s development from an industrial-based to a knowledge-based economy. In addition, we have over 30 laboratories with advanced equipment and facilities supporting our teaching and research. We strive for excellence in teaching, research, and professional services. \nToday, we have a young and dynamic team of faculty members with diverse educational backgrounds from top-notch universities worldwide, dedicated to teaching and research. Our major research areas include Nanomaterials & Micro/Nanoelectronics, Machine Learning & Computational Physics, Green Energy & Carbon Neutrality, Photonic, Plasmonics & Optoelectronics, and Quantum Physics & Devices. Our faculty members published broadly in reputable journals, including Science, Nature Materials, Nature Nanotechnology, Nature Electronics, Nature Communications, Advanced Materials, Nano Letters, ACS Nano, Journal of the American Chemical Society, Angewandte Chemie, Physical Review Letters, and others. In addition, we have been awarded over $200 million in external research grants since 2013. Thanks to the efforts of our faculty members, researchers, alumni, and students. We continue to play a leading role in our discipline, both nationally and internationally.\nProf Daniel S. P. Lau \nHead, Department of Applied Physics\nChair Professor & Head of Department \nDirector of University Research Facility in Materials Characterization & Device Fabrication",
  "url": "https://www.polyu.edu.hk/ap/about-ap/message-from-head"
 },
 {
  "text": "Founded in 1987, the Department of Applied Physics (AP) has long been engaging in top-notch scientific research activities, as well as training high-quality graduates to serve society.\nWith its 80-strong team of academic staff and researchers, AP is specialized in the research of the following topics:\n(1) Nanomaterials & Micro/Nanoelectronics, (2) Machine Learning & Computational Physics, (3) Green Energy & Carbon Neutrality, (4) Photonics, Plasmonics & Optoelectronics, and (5) Quantum Physics & Devices. \nThe Department is well-equipped with more than 30 laboratories. In addition, it has benefited from the world-class research facilities in various university-managed research facilities such as Cleanroom and the Centre for Electron Microscopy. Our researchers are also actively involved in industrial collaborations and consultancy projects, contributing to the technological development locally and in the Greater Bay Area.\nAP is devoted to educating next-generation technological professionals, nurturing them with the best resources and opportunities. Every year, our students perform exchange studies and internships in renowned universities and institutions worldwide, broadening their horizons and gaining invaluable experience. Graduates of our Engineering Physics degree programme are highly sought-after and serve society over a broad spectrum of businesses and sectors. Our Department also plays a significant role in Physics Education in Hong Kong by working closely with local secondary schools through various STEM education projects and the Award-winning out-of-classroom physics experiment platform, LabXRA.",
  "url": "https://www.polyu.edu.hk/ap/about-ap/introduction"
 },
 {
  "text": "Advisory Committee on Applied Physics\nThe Departmental Advisory Committee (DAC) plays an important role as an interface between the Department and industry, commerce, education, service sectors and the community at large. Th DAC advices the Department on the scope and nature of our academic programmes, research and other scholarly activities in order to relate these to the needs of Hong Kong. The Advisory Committee also facilitates our collaboration with industry, commerce, education, the service sectors and the community.\nMembership of the Advisory Committee on Applied Physics is as follows:\nChairman\t\nMr Arthur LEE\nChairman, Kolinker Group\nEx-officio\tProf. Raymond WONG \nInterim Dean, Faculty of Applied Science and Textiles, The Hong Kong Polytechnic University\nConvener \tProf. Daniel S.P. LAU \nChair Professor & Head, Department of Applied Physics, The Hong Kong Polytechnic University\nInternal Members \tDr Dennis C.W. LEUNG \nAssociate Professor & Associate Head, Department of Applied Physics, The Hong Kong Polytechnic University\n\tDr Peter Y. H. TSANG \nAssociate Professor, Department of Applied Physics, The Hong Kong Polytechnic University\nExternal Members\t\nMr Stephen AU Ling Ming\nManaging Director & Founder, MTECH Engineering Co., Ltd\n\tMr Eugene CHAN \nManaging Director, Man Yue Technology Holdings Limited \n\tMs Winnie W.Y. CHEUNG \nCurriculum Development Officer (Science), Science Education Section, Education Bureau\n\tMs Y.S. CHOW \nSenior R&D Manager, GP Batteries International Ltd.\n\tMr Edwin HUI \nManaging Director, DreamsAI Limited \n\tMr Alfred NG \nChief Technology Officer & CEO of EMS Division, Suga International Holdings Limited\nSecretary \tMs Tiffany WONG \nExecutive Officer, Department of Applied Physics, The Hong Kong Polytechnic University",
  "url": "https://www.polyu.edu.hk/ap/about-ap/advisory-committee"
 },
 {
  "text": "YEAR Awardee Award Description \n2023\tX. M. ZHANG\tPolyU Medical Physics Teaching Award\t\n2022/23\tY. CHAI\tNSFC/RGC Collaborative Research Scheme 2022/23\t\n2022\tY.H. TSANG and Longhui ZENG\tSecond Class Award in Technology Invention, the Guangdong Province Science and Technology Awards 2022\t\n2022\tJ.H. HAO\tKey Program Funding from National Natural Science Foundation of China (NSFC)\t\n2021\tJ.H. HAO\tAwardee of Higher Education Outstanding Scientific Research Output Awards (Science and Technology)\t\n2021\tBiao ZHANG\tResearch and Scholarly Activities: Outstanding Young Researcher, Faculty Awards for Outstanding Achievement 2021 \t\n2021\tJ.H. HAO and Sin Yi PANG\t2021 TechConnect Innovation Award\t\n2021/22\tJ.H. HAO\tAwardee of RGC Senior Research Fellow Scheme (SRFS)\t\n2020/21\n\tJ.H. HAO\tRGC Collaborative Research Fund - Collaborative Research Project Grant (CRPG)\t\n2020\tJH HAO\t\nSecond-Class Award in Natural Science, the Ministry of Education’s Higher Education Outstanding Scientific Research Output Awards (Science and Technology) 2020\n2020\tY. CHAI\tThe President's Award for Outstanding Achievement 2019/2020 - Research and Scholarly Activities, PolyU\t\n2020\tJiyan DAI\tThe first-class prize in the 2019 Guangdong Province Science and Technology Award\t\n2019\tY. CHAI\tFaculty Awards for Outstanding Performance / Achievement 2018-19, Research and Scholarly Activities, PolyU\t\n2018\t\nJ.H. HAO and M.Y. TSE\n\t2018 TechConnect Global Innovation Awards for the project \"Composite Multilayers Capacitors with Colossal Permittivity for Electronics and Energy Storage Applications\"\t\n2017\n\tJ.H. HAO, M. YANG, M.K. TSANG. and W.W. YE\tSpecial Merit Award and Gold Medal with Congratulations of Jury for the invention \"Nano Biosensor for Rapid Detection of Flu Virus\", The 45th International Exhibition of Inventions of Geneva, 29 March - 2 April 2017\t\n2016\tC.L. MAK, C.W. LEUNG, Y.H. TSANG, S.H. CHOY and K.L. JIM\tRegional (Asia) Award in Wharton-QS STARS Reimagine Education 2016\t\n2016\tX.M. ZHANG, Y.J. ZHU and X.W. HUANG\tCHEMINAS Poster Award, 8th International Symposium on Microchemistry and Microsystems (ISMM 2016), (organized by Society for Chemistry and Micro-Nano Systems), 30 May - 1 June 2016, Hong Kong, China\t\n2015\tS.P. LAU, J.K. YUAN, and J.S. QIAN\tSilver Award, Seoul International Invention Fair 2015, 26-29 November 2015, Seoul, Korea\t\n2015\tS.P. LAU, J.K. YUAN and J.S. QIAN\tSpecial Merit Award from The National Research Council of Thailand, Seoul International Invention Fair 2015, 26-29 November 2015, Seoul, Korea\t\n2016\tC.L MAK, C.W. LEUNG, Y.H. TSANG, S.H. CHOY and K.L. JIM\tFaculty Award for Outstanding Performance/Achievement 2014/15 - Teaching (Team Award)\t\n2014\tY.H TSANG\t2014 Educational Bronze Award for Inspiring Optical Innovation Education (EO Edmund Optics, USA)\t\n2014\tX.M. ZHANG, N. WANG and F.R TAN\tBest Poster Award, The 4th International Conference of Optofluidics 2014 (Optofluidics 2014), (organized by South China Normal University), 28-30 August 2014, Guangzhou, China\t\n2013\tX.M. ZHANG and M.Y. LAM\tICMAT 2013 Best Poster Award, 7th International Conference on Materials for Advanced Technologies (ICMAT 2013), (organized by The Materials Research Society Singapore), 30 June - 5 July 2013, Suntec, Singapore\t\n2013\tJ.H. HAO, M.K. TSANG and H.L.W. CHAN \tBest Paper Award, The 3rd International Conference on Optofluidics 2013 (Optofluidics 2013), (organized by The Hong Kong Polytechnic University and Jinan University), 15-17 August 2013, Hong Kong, China\t\n2011\tK.W.B. LAM and H.L.W. CHAN\t2nd Prize, Best Paper on Materials 2011 Competition, (organized by the Materials Division of Hong Kong Institution of Engineers), 12 September 2011, Hong Kong, China\t\n2011\tL. SUN\t優秀壁報金獎, 2011 Chinese Material Annual Meeting (Chinese Materials Research Society) (CMRS) (2011 中國材料研討會), 17-20 May 2011, Beijing, China\t\n2011\tJ.H. LI\tBest Poster Award - Second Place, The Engineering Conferences International (ECI) (Program: Semiconductor Technology for Ultra Large Scale Integrated Circuits and Thin Film Transistors III), 26 June - 1 July 2011, Hong Kong, China\t\n2011\tY.H. TSANG, X.M. ZHANG, A.Q. JIAN, N. WANG, K. ZHANG and Y. WANG\tBest Paper Award, The 1st International Conference on Optofluidics (Optofluidics 2011), 11-13 December 2011, Xi'an, China\t\n2009\t(S.W. OR), H.L.W. CHAN, (H.C. WONG and S.Y. WONG)\tNew Techniques and Products: Gold Award, 37th International Exhibition of Inventions, 1-5 April 2009, Geneva, Switzerland\t\n2009\tS.T.F. LEE\t2nd Prize, Best Paper on Materials 2009 Competition, (organized by the Materials Division of Hong Kong Institution of Engineers), 4 December 2009, Hong Kong, China\t\n2007\tW.C. LIU \tBest Poster, Steering Committee of the 2008 Magnetism and Magnetic Materials Conference, 52nd Magnetism and Magnetic Materials Conference (MMM 2007), 5-9 November 2007, Tampa, Florida, USA\t\n2007\t(E.K.W. CHENG), Y.W. WONG, (K. DING, J. HO, B. HO, C.K. CHEONG and T.K. CHEUNG)\tGold with Mention, Brussels Eureka 2007, 22-25 November 2007, Brussels, Belgium\t\n2006\tS.W. OR and H.L.W. CHAN\tBronze Award, International Trade Fair: Ideas-Inventions-New Products, 2-5 November 2006, Nuremberg, Germany\t\n2005\tH.L.W. CHAN, S.W OR and C.L. CHOY\tNational Exhibition of Inventions: Silver Medal, 15th China National Invention Expo, 12-15 September 2005, Beijing, China\t\n2005\tS.W. OR, Y.Q. NI and Y.F. DUAN\tNational Exhibition of Inventions: Silver Medal, 15th China National Invention Expo, 12-15 September 2005, Beijing, China\t\n2003\tC.L. MAK, S.G. LU, X.H. ZHU, K.H. WONG, H.L.W. CHAN and C.L. CHOY\t東莞市第三屆青年科技學術交流會優秀論文一等獎, (主辦: 東莞市科學技術協會, 共青團東莞市委員會, 東莞市婦女聯合會), November 2003, Dongguan, China\t\n2003\tH.L.W. CHAN H.L.W. and C.L. CHOY\t國家技術發明獎二等獎, (主辦: 中華人民共和國國務院), February 2003, Beijing, China\t\n2003\tC.L. MAK, S.G. LU and K.H. WONG\t廣東省自然科學優秀學術論文叁等獎, (organized by 廣東省科學技術協會), June 2003, Guangdong, China\t\n2002\tC.L. MAK, A.D. LI, Y.P. ZHU, D. WU, Y.D. YE, Z.G. LIU and N.B. GUAN\t中國分析測試協會科學技術獎 (CAIA 獎) 一等獎, (主辦: 中國分析測試協會), July 2002, Beijing, China\t\n2002\tH.L.W. CHAN, S.W. OR, K.C. CHENG and C.L. CHOY\tGold Award, Seoul International Invention Fair 2002, (organized by Korea Invention Promotion Association), December 2002, Seoul, Korea\t\n2001\tC.L. MAK, S.G. LU and K.H. WONG\t東莞市第二屆青年科技學術交流會優秀論文一等獎, (organized by 東莞市科協, 東莞團市委, 東莞市婦聯, 東莞市青聯), December 2001, Dongguan, China",
  "url": "https://www.polyu.edu.hk/ap/about-ap/awards-and-achievements"
 },
 {
  "text": "Department of Applied Physics, PolyU \nNews and Events \n1 / 1\nProf. Yang CHAI, Associate Dean of the Faculty of Science and Professor of the Department of Applied Physics, led a research project to develop new vision sensors that emulate and even surpass the human retina’s ability to adapt to various lighting levels. His research “Advanced Vision Sensor with Human Eye Adaptability” was publicly recognized as one of the \"Top Ten Hong Kong Innovation and Technology News 2022”. \nThe Beijing-Hong Kong Academic Exchange Centre is the organizer of selecting “The Top 10 Hong Kong Innovative Technology News 2022”. Universities in Hong Kong were invited to nominate research news related to local science and technology innovation. The Advisory Board which is composed of academicians in Hong Kong from the Chinese Academy of Sciences and the Chinese Academy of Engineering Sciences selected thirty of the most influential news for public voting.\nThe research was published in Nature Electronics.\nThe list of the Top 10 Hong Kong Innovative Technology News 2022 (Chinese Only)\n",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/eng_top-ten-innovation-and-technology-news-2022"
 },
 {
  "text": "Faculty of Science \nNews and Events \nPolyU Science in the News \nProf. Daniel LAU, Chair Professor of Nanomaterials and Head of Department of Applied Physics of PolyU\n1 / 3\nNew research from a team led by Prof. Daniel Lau, Chair Professor of Nanomaterials and Head of Department of Applied Physics of PolyU, achieves a sought-after type of electrical behaviour in nano-sized materials. Electronics manufacturers are expected to show a keen interest, as the valuable ferroelectric characteristics can be reproduced at large scales with unprecedented ease.\nProf. Daniel Lau said, “High-tech industries, such as the computer memory sector, will benefit from this new class of nano-scale ferroelectrics. When manufacture is scaled up, the low cost, low energy demand and faithful reproducibility of these atomically thin bilayers promises to advance the frontier of modern electronics.” \nPress release:\nEnglish | Chinese\n",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/eng_nanoscale-ferroelectric-new-materials"
 },
 {
  "text": "Prof. Jianhua HAO, Chair Professor of Materials Physics and Devices of AP received Key Programme Funding Support from the National Science Foundation of China (NSFC).\nProf Hao's team collaborates with researchers from Nankai University and Sichuan Normal University to perform the study of multifunctional ultrathin ferroelectric integrated materials and devices for neuromorphic computing and artificial visual system.\nThe study is to effectively integrate ferroelectric polarization with multifunctional characteristics of electronic properties of semiconductor, photodetection and rare-earth ion luminescence, to develop multimodal and novel synaptic devices. The developed materials and devices in this project will help overcome the bottleneck in information technology development.\n應用物理學系材料物理與器件講座教授郝建華教授所帶領的「面向神經形態計算和人工視覺的超薄鐵電多功能集成材料與器件」研究項目， 獲國家自然科學基金重點項目資助。\n郝教授團隊聯合合作單位南開大學及四川師範大學的研究人員，展開面向神經形態計算和人工視覺的超薄鐵電多功能集成材料與器件的研究。 此項目將鐵電極化與半導體電子特性、光電探測和稀土離子發光的多功能特性有機結合起來，從而發展具有多模式的新型神經突觸器件，所研發的材料和器件希望能有助于解決資訊科技發展的瓶頸問題。\nRead more: https://www.polyu.edu.hk/rio/news/2022/20220927-nsfc-key-program-prof-jianhua-hao/",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2022/key-programme-funding-support-from-the-nsfc"
 },
 {
  "text": "We are delighted to share that Dr. HUI Yeung Yu has been awarded the 2023 Outstanding PolyU Young Alumni Award in Entrepreneurial Achievement of the Department of Applied Physics. He graduated with a Doctor of Philosophy from the Department of Applied Physics, the Hong Kong Polytechnic University, in 2015. He is currently the Manager (Business Strategy & Success Delivery) of the Hong Kong Jockey Club and was the founder and project manager of Nanothink Limited (2015–2016) and DreamsAI Limited (2019–2022) respectively. He has taken on different roles in supporting AP, such as being a member of the Departmental Advisory Committee for AP since 2021. AP has developed a new undergraduate programme titled “BSc (Hons) in Physics with a Secondary Major in AI & Data Analytics (AIDA) or Innovation and Entrepreneurship (IE)” in 2021. Dr. Hui shared his insights in a video, highlighting the important features of the new programme as an industrial representative and creating a positive impact on admission.\nCongratulations to Dr. Hui for his significant contributions to AP, the Faculty, the University and the community!",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/outstanding-young-alumni-award---dr-hui"
 },
 {
  "text": "Department of Applied Physics, PolyU \nNews and Events \n1 / 1\nIt is our great honour to announce that Mr. SIN Tak Yin won the 2023 Outstanding PolyU Alumni Award in Professional Achievement of the Department of Applied Physics. Mr. SIN Tak Yin graduated from the Hong Kong Polytechnic in 1990 and is currently the Senior Sales Director in Synaptics. He was a contributor for 2.5G/3G Mobile Phone Solution product definition and Go-To-Market strategy development in Motorola from 2000 to 2006. He also worked as the Corporate VP of Sales in DSP Group, where he and his team leveraged deep expertise in DECT-based technologies, wireless chipset solutions, and converged communications to create market-leading products that provide HD-voice quality and value-added multi-line, multi-handset services for residential subscribers. Mr. Sin was invited as a guest speaker for the FAST1000 Freshers' Seminar at AP in 2017, where he generously shared his story and experiences with our students.\nCongratulations to Mr Sin for his significant contributions to AP, the Faculty, the University and the community!",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/outstanding-alumni-award---mr-sin"
 },
 {
  "text": "Department of Applied Physics, PolyU \nNews and Events \n1 / 1\nCongratulations to Mr. Ong Chin Yuan and Mr. Tsao Yu-jui, students of BSc (Hons) in Engineering Physics, on receiving the Outstanding Student Award of Faculty 2022 and the Presidential Student Leadership Award of Department 2022 respectively.\nThe Outstanding Student Award aims to motivate students to excel in their academic pursuits as well as to strive for personal development. We are pleased to announce that this award went to Mr. Ong Chin Yuan at the Faculty level.\nThe Presidential Student Leadership Award aims to recognise and honour outstanding student leaders who possess, display, and apply exemplary leadership qualities and skills, demonstrated in both the University and the wider community. Mr. Tsao Yu-jui received the Departmental Award in recognition of his impressive leadership capabilities.\nLet's applaud them for their excellent work and contributions to the PolyU so far!",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/eng_outstanding-student-and-leadership-award-2022"
 },
 {
  "text": "Department of Applied Physics, PolyU \nEvents \nVenue\nCD620, 6/F, Wing CD, PolyU Map \nSpeaker\nDr. Yun-Feng Xiao\nSummary\nConfinement and manipulation of photons using microcavities have triggered intense research interest in both fundamental and applied photonics for more than one decade. Prominent examples are ultrahigh-Q whispering gallery microcavities which confine photons by means of continuous total internal reflection along a curved and smooth surface. The long photon lifetime and strong field confinement characteristics make them promising candidates for enhancing light-matter interactions on a chip. In this talk, I will focus on microcavity sensing mechanisms and their practical applications in single nanoparticle detection, single-cell tracking and environmental monitoring.\nKeynote Speaker\nDr. Yun-Feng Xiao\nProfessor\nSchool of Physics\nPeking University\nView Speaker's Website\nDr. Yun-Feng Xiao received the B.S. and Ph.D. degrees in physics from University of Science and Technology of China in 2002 and 2007, respectively. After a postdoctoral research at Washington University in St. Louis, he joined the faculty of Peking University in 2009, and was promoted a tenured associated professor in 2015 and a full professor in 2019. His research interests lie in the fields of whispering-gallery microcavity optics and photonics. He has authored or co-authored more than 100 refereed journal papers in Science, Nature Photonics, PNAS, PRL, Advanced Materials et al. He has delivered over 100 plenary/keynote/invited talks/seminars in international/national conferences/universities. He is the Fellow of OSA, SPIE and COS, and has served as the committee member for more than 30 international conferences. ",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/jun/23_ap-seminar---microcavity-enhanced-optical-sensing"
 },
 {
  "text": "Prof. Qihua Xiong\nProfessor\nDepartment of Physics\nTsinghua University\nQihua Xiong, Professor of Physics at Tsinghua University. He received his B.Sc. degree from Wuhan University in 1997, and Ph.D. degree from Penn State University in 2006. During 2006-2009, he worked as a postdoctoral fellow at Harvard University. From 2009 to 2020, he worked in the Division of Physics and Applied Physics at Nanyang Technological University, where he was tenured in 2014 and promoted to full professor in 2016. From 2014-2019, he served as Associate Chair for the School of Physical and Mathematical Sciences at NTU, taking charge of research, PhD education and faculty matters. In early 2021, he relocated to Tsinghua University full time. Qihua Xiong’s research is concerning the light-matter interactions in quantum materials in reduced dimensionality by optical spectroscopy. He has published more than 300 papers, including 5 in Nature/Science and 35 in their sister journals, with a total citation of >25,000 and an H-index of 87. He is elected fellow of APS, MRS and OSA, and academician of Asian Pacific Academy of Materials. He is recognized as highly cited researchers worldwide in cross-field for many years. Currently, he serves as associated editor for Nano Letters and advisory board member for several internationally recognized journals.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/jun/23_ap-seminar_manipulating-quantum-fluids-of-light-at-room-temperature"
 },
 {
  "text": "漢臻顧問有限公司正招聘Assistant Environmental Consultant。如對此職位有興趣，請即報名參加就業講座!\n關於漢臻顧問有限公司\n漢臻顧問有限公司是一家於2002年在香港創立的環境諮詢公司。公司提供多元化的環保諮詢, 環境管理, 環境監測, 和能源管理服務。附屬公司提供環境工程，和化驗服務。\nCINOTECH Consultants Limited is now hiring Assistant Environmental Consultant. If you are interested in this job post, please do not hesitate to register for the career talk now!\nAbout CINOTECH Consultants Limited\nCINOTECH Consultants Limited was established in Hong Kong in early 2002 as an environmental consultancy firm providing its clients with consultancy services in environmental management, environmental studies, environmental monitoring & audit and assessment/certification of green buildings.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/jun/14_cinotech-career-talk"
 },
 {
  "text": "Events \nVenue\nCD620, 6/F, Wing CD, PolyU Map \nSpeaker\nProf. Jinfeng Kang\nSummary\nVarious magical and wonderful physical effects and properties have been demonstrated in the HfO2-based thin films and devices such as high K gate dielectrics in CMOS, resistive switching in resistance random access memory (RRAM), the robust ferroelectricity in ferroelectric devices, and so on. Those excellent characteristics have triggered the extensive research interests of both the fundamentals and applications for the HfO2-based thin films. However, the underlying physical mechanisms that dominate those demonstrated characteristics in the HfO2-based thin films and devices are still argued. Various theoretical and experimental results showed that the observed fantastic properties in HfO2-based thin films and devices are strongly correlated with the behaviours of oxygen vacancy defects existed in HfO2-based thin films. In this talk, we will try to understand the fantastic characteristics observed in HfO2-based thin films from the unified viewpoint, which is related to the essential microscopic natures of oxygen vacancy defects such as the features of the vacancy defect states and distributions, and the evolution behaviours. From the unified viewpoint, the various observed characteristics such as the Fermi-level pinning effect in high-K/metal gate stacks, the resistive switching behaviours can be well quantified. Moreover, we may expect that much more newly physical properties are measured in HfO2-based devices.\nKeynote Speaker\nProf. Jinfeng Kang\nProfessor\nSchool of Integrated Circuits \nPeking University\nJinfeng Kang is Full Professor of Integrated Circuits School, Peking University. He received his Ph.D degrees in solid-state electronics from Peking University in 1995. His research interests focus on novel oxides and nano devices for sensor, computing & data storage. He has published over 300 conference and journal papers, and was speaker of 30+ invited talks to international conferences, societies, academia, and industry such as IEDM, ESSDERC, ASP-DAC, SSDM, MRS. He is Editor of IEEE Trans. Electron Devices and J. Semiconductors (IOP) and Member of IEEE EDS TCAD Committee. ",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/may/23_prof-kang_research-seminar"
 },
 {
  "text": "Events \nVenue\nCD620, 6/F, Wing CD, PolyU Map \nSummary\nWith the development of information technology, the number of interconnected devices is rapidly increasing, accompanied by the problem of processing large amounts of unstructured data generated by these devices. Deep neural networks have shown an excellent ability to handle unstructured data. However, traditional processors based on von Neumann architecture face limitations in improving their computing speed and energy efficiency ratio when dealing with deep neural networks that have increasing numbers of parameters and operations due to the so-called von Neumann bottleneck. New computing paradigms, including computation-in-memory and in-senor computing, can achieve high-speed, low-energy consumption via in-situ computing. In this talk, I will introduce our recent research on RRAM-based CIM and FDSOI-based in-senor computing, including the device and circuit design, hardware implementation of the system, and EDA tool development.\nKeynote Speaker\nDr. Peng Huang\nAssistant Professor\nSchool of Integrated Circuits\nPeking University\nDr. Huang is the assistant professor of the integrated school of Peking University, and a senior member of IEEE since 2023. He is a recipient of the Excellent Young Scholars of the National Natural Science Foundation of China, and IEEE Electron Devices Society PhD Student Fellowship. He was the technical program committee of the IEEE International Workshop on future computing and IEEE Electron Devices Technology and Manufacturing Conference. He was the author of more than 150 papers about the new computing paradigms based on emerging devices including computation in memory, in-senor computing, and neuromorphic computing. ",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/may/23_dr-huang_research-seminar"
 },
 {
  "text": "Outbound Exchange\nIn line with the Strategic Objective of The Hong Kong Polytechnic University to enhance the all-roundedness of students, AP encourages our students to gain additional learning, research and life experiences outside Hong Kong. Over the years, our students have experienced their study at various universities in the worldwide such as University of Oxford, University of Cambridge, University of Toronto, Nagoya University and University of Technology Sydney. We committed to make our global opportunities financially accessible to our students. \nThe credits they earned from the exchange programme are transferable. AP also provides internships for students to gain working experience overseas. Almost every student in the AP has been offered at least one opportunity to undertake these activities.\nFor details of other exchange programmes, please visit the Global Engagement Office.\nCurrent options of Summer exchange programme\nUniversity of Science and Technology of China (USTC), Hefei\nDuration: 6weeks (Late of May – Early of July)\nTarget Participants: \nYear 1, 2, and 3 students of “BSc (Hons) in Engineering Physics” programme [code: 11439] &\nYear 3 students of “BSc (Hons) in Engineering Physics (Optoelectronics)” programme [code: 11439-OPT]\nNumber of Places: 26\nWIE: Yes, 80 hours \nCredit Transferrable Subjects:\nAP30012 Thermal and Statistical Physics\nAP40009 Advanced Photonics Laboratory\nFinancial Support: \nPolyU will provide financial support (UGC Exchange Sponsorship) for the qualified exchange students.\n“WIE Training” will be provided during the exchange study and you may apply for the Offshore WIE sponsorship. \nStudent feedback:\nLIU Yu, BSc (Hons) in Engineering Physics\nIt is an excellent place. USTC is one of the best researching workplace in China. The equipment there is really advanced. We did the topic-related research with the PHD students there. Our topic is to discover a special material's properties in high pressure. It is hard at the first time because we barely have grade 1 knowledge. We tried to read the papers and textbook. We read it again and again and finally figure out the problem. Although I didn't discover something extraordinary, I truly learnt a lot. I discovered the nice feelings of studying new thing. I learnt to operate the equipment. The exchange programme provide me a chance to learn the scientist’s daily life. It helps me alter my future plan.",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/student-exchange-programmes/outbound-exchange"
 },
 {
  "text": "Inbound Exchange\nAP is technical focus and strong in engineering field. Our programme is moving with the times that helps our students obtain latest knowledge and adapt to the ever-changing society. Our advanced research facilities and strong connection with industrial partners could assist you to gain a favorable experience. \nWe offer Incoming Exchange, Study Aboard and PolyU International Summer School. For details, please visit here.",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/student-exchange-programmes/inbound-exchange"
 },
 {
  "text": "Events \nVenue\nFJ303, 3/F, Wing FJ, PolyU Map \nSummary\nDear AI developers:\nJoin us for an exciting journey as we embrace a new era of industrial transformation! Artificial intelligence, the driving force of this change, has brought about incredible innovations in our daily lives. In recent years, Huawei has been deeply involved in various information fields such as AI, operating systems, and mobile Internet. We warmly invite you to our DevFest in Hong Kong, where we'll explore the AI industry and dive into cutting-edge AI technologies.\nProgramme Highlights:\nDiscover the power of Huawei Ascend AI full-stack technology and the progress of the Ascend AI industry.\nFamiliarize yourself with PyTorch development and optimization on Huawei Ascend AI hardware, enabling you to create more efficient and effective AI solutions.\nExperience the versatility of the all-scenario AI framework MindSpore, as we delve into its real-world applications across various industries.\nIntroduction of Robot Arm Experiment",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/may/17_ap-x-huawei-ai-bootcamp"
 },
 {
  "text": "We are closed with Universities in Mainland and overseas. We empower students to organize the study tour for themselves to enhancing independence, leadership and organizational skills. Students can widen their international exposure, meet and with peers from other cities and countries and also enhance their competitiveness in the industry. \nCurrent options of study tour \nNankai University, Tianjin \nDuration: 5 days \nTarget participants: All undergraduate students (especially for Year 2 and Year 3) \nNumber of Places: 15\nAllowance: Yes, HK$1,500 per student\nWIE: Yes, 40 hours \nActivities: Physics class, lab visit, lab preparation, student forum, sports competition, tour of cultural attractions and visit of museums \nStudent Feedback\nLI Lai Wah, Student of BSc (Hons) in Engineering Physics [Optoelectronics] \nThe study tour enabled me to visit the TEDA Institute of Applied Physics of Nankai University and know more about the academic programs for postgraduate in Nankai U. During the opening ceremony, professors from Nankai U gave us a brief introduction about the history and modern development in science and technology aspect in mainland China. The visit to Nankai University headquarters also gave us a real experience of university life in the mainland.\nThe internship at TEDA allowed me to learn more about the working principle of devices like SEM and some coating equipment. The laboratory visits also helped me to get a preliminary understanding of most of their research area. Besides, the study visit provided a good platform for us to communicate with mainland students and to build up a friendship with them.",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/study-tour"
 },
 {
  "text": "Alumni members are important assets of our Department. Our alumni are well received and placed in different disciplines and sectors, ranging from engineering and technical to business and marketing. The diversified nature of employment of our alumni reflects success of the generalist and versatile education that our Department has been aiming to provide in order to produce graduates that are capable of facing the challenge of the rapidly changing and demanding job market in Hong Kong.\nThroughout the years, our alumni members have been actively contributing to the development of our academic programmes on different occasions. Alumni members give career talks to our undergraduates every year, sharing their experiences in job hunting and in their career path, and updating the scenario of the current job market. More importantly, alumni members express unanimously that their present career is strongly benefited, either directly or indirectly, by the education they received in our programmes. Direct benefit comes from the professional and broad-based knowledge acquired, while indirect benefit comes from generic skills, such as problem-solving skills that they have built up in studying physics. Some alumni members also volunteer to act as mentors in the mentorship programme, guiding our undergraduates to achieve fuller personal development. The input of ideas from our alumni from time to time has also helped the Department in improving our academic programmes in curriculum revision.",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/alumni"
 },
 {
  "text": "The Alumni Association of the Department of Applied Physics, PolyU (AAAP), was founded in 1996 with a broad aim of facilitating networking among fellow graduates and communication between graduates and the Department. It is a local association under the Federation of The Hong Kong Polytechnic University Alumni Associations (FHKPUAA). The objectives of AAAP are to enhance the relations and liaison amongst all AP alumni and to assist in the development and to promote activities organized by the Department.\nGraduates from all programmes parented by the Department of Applied Physics shall be admitted to Ordinary Membership upon payment of the membership fee [$20, included the Membership fee of FHKPUAA, payable once only at the time of joining the Association]. These programmes include Higher Diploma in Applied Physics, BSc (Hons) in Engineering Physics, BSc (Hons) in Engineering Physics [Optoelectronics], MPhil in Applied Physics and PhD in Applied Physics. \nEach member will receive a FHKPUAA membership card. You are entitled to a range of benefits. \nExecutive Committee of AAAP\t\nPresident\tMr. WONG Man Hon, Matthew \t\nVice-president\tMr. CHENG Wang Fai, Raymond\t\nHonorary Secretary\tMiss WONG Ka Lai, Kathy \t\nHonorary Treasurer\tMr. WONG Hon Fai\t\nCommittee Members:\t\nMr. LEUNG Siu Kan, Ken\nMiss. HO Man Tak, Melanie\nMr. TANG Chun Yin, Jimmy\nMr. TSANG Ming Kiu, Bobi",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/alumni/alumni-association-of-applied-physics"
 },
 {
  "text": "Award Categories \nEntrepreneurial Achievement \nCommunity Service Achievement \nAward Level \nOutstanding PolyU Alumni Award 2023 \nOutstanding PolyU Alumni Award is now open for nomination.\nThe Award is to promote championship of recognition and engagement of alumni at Department, Faculty and University levels. \nNomination period: from February to March 2023\nHow to nominate: Send the completed nomination form to Dr. Albert CHOY\nAward List \nName of Awardee Year of Award Award Award Category \nMr. SIN Tak Yin\t2023\tDepartmental Outstanding PolyU Alumni Award\tProfessional Achievement\t\nDr. HUI Yeung Yu\t2023\tDepartmental Outstanding PolyU Young Alumni Award\tEntrepreneurial Achievement\t\nMr Samson Leong\t\n2022\n\tDepartmental Outstanding PolyU Alumni Award\tProfessional Achievement\t",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/alumni/outstanding-polyu-alumni-award"
 },
 {
  "text": "Date Company Position Deadline \n8 Jun 2023\tInstitutional Planning and Analytics Office (IPAO), PolyU\tProject Officer\tOpen until filled\t\n2 Jun 2023\tIntertek Hong Kong\tAssistant Engineer (Electrical Laboratory)\tOpen until filled\t\n2 Jun 2023\tIntertek Hong Kong\tEngineer (Toys & Hardlines)\tOpen until filled\t\n19 May 2023\tDimap HK Pty Limited\tData Scientist / AI Specialist\tOpen until filled\t\n12 May 2023\tHong Kong Science & Technology Parks Corporation (HKSTP)\t\nJC PROcruit C\n(One-year Professional Traineeship Programme)\n\t21 May 2023\t\n14 Apr 2023\tCINOTECH Consultants Limited\t\nAssistant Environmental Consultant\n\tOpen until filled\t\n21 Mar 2023\tMedHealth Diagnostic MRI Centres\tAssistant MRI Physicist (2 posts)\tOpen until filled\t\n20 Mar 2023\tHong Kong Science & Technology Parks Corporation (HKSTP)\tTalent Game On 2K23 Programme: The Hong Kong I&T Career Expo (2500+ job posts)\t17 Apr 2023\t\n17 Mar 2023\tHong Kong Science & Technology Parks Corporation (HKSTP)\tTechnology Leaders of Tomorrow Programme 2023\t14 Apr 2023\t\n21 Dec 2022\tHuawei International Co. Limited\t\nGraduate Job Openings (3 roles)\n\tOpen until filled\t",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/career/career-opportunities_general-listing"
 },
 {
  "text": "Industry\tEmployers \t\nTechnical testing\tASM Pacific Technology Ltd. \nAvaron Technologies\nBureau Veritas Hong Kong Ltd\nCMA Testing and Certification Laboratories\nIntertek Testing Services Hong Kong Ltd.\nPROVA Inspection & Testing Co. (Hong Kong) Ltd.\nQIMA Testing (Hong Kong) Ltd.\nUL International Ltd.\nElectricity\tJohnson Electric Industrial Manufactory Ltd.\t\nHealth and Medical Services \tCentrum MRI Centre \nMedHealth Diagnostic (MD) MRI Centre\nEngineering\t\nElectronic Scientific Engineering Ltd.\nControl Automation Ltd.\nAviation\tCathay Pacific Airways Ltd. \nJardine Aviation Services\nHong Kong Air Cargo Terminals Ltd\nTelecommunication\t\nAPT Satellite Company Ltd.\nM800 Limited\nVega Technology Ltd.\nLogistics\tMorrison Express Co. Ltd\t",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/career/list-of-employer"
 },
 {
  "text": "Machine learning builds models based on available sample data to make predictions and decisions on unexplored regions. In material science, machine learning has proved to have unprecedented abilities to find new stable materials, calculate numerous material properties, and speed up first-principle calculations. Our machine learning focuses on material component/structure discovery, material properties’ prediction, and physics-informed machine learning.\nComputational physics studies various kinds of computational calculations, including \nfirst-principles DFT, effective medium theory, molecular dynamics, analytical modeling, and numerical simulations\nto predict materials properties and structures for 2D materials, interfaces and heterostructures; \nglass transition, flow of glassy polymer nanofilms; electron transport in solid-state quantum devices; formation of nanostructures in strained thin films; \nmachine learning and high-throughput calculations; photonic crystals, topological photonics, plasmonic nanostructures, metamaterials, transformation optics, optomechanics of structured nanomaterials, and phononic crystals.\nResearch Members\nName\tResearch Interest \t\nProf. Chai YANG\tIn-sensor neuromorphic computing, photonic AI accelerators\t\nDr. Chi Hang LAM\tGlass transition, flow of glassy polymer nanofilms; electron transport in solid-state quantum devices; formation of nanostructures in strained thin films\nDr. Ming YANG\tHigh-throughput first-principle calculations/experiments, machine-learning accelerated materials innovation, perovskite oxide interface, physical vapor deposition, electrochemical/photo-catalysts\nDr. Jun YIN\nMultiscale Modelling of Materials, Density Functional Theory (DFT) and Its Applications, Machine Learning and Data Mining in Physics and Materials Science",
  "url": "https://www.polyu.edu.hk/ap/research/research-theme/machine-learning-and-computational-physics"
 },
 {
  "text": "Green energy investigates various kinds of energy conversion and storage technologies and devices. It covers batteries, ferroelectric/dielectric materials, electro-caloric colling and catalysts, down- and up-conversion phosphors for photovoltaics and lighting, triboelectric nanogenerators, metal-ion batteries and supercapacitors, organic photovoltaics, and perovskite solar cells.\nCarbon neutrality research develops new materials and processes that reduce CO2 into energy-rich chemicals for practical uses. It includes electrochemical CO2 conversion, electrocatalysis, heterogeneous catalysis, CO2 capture, and utilization.",
  "url": "https://www.polyu.edu.hk/ap/research/research-theme/green-energy-and-carbon-neutrality"
 },
 {
  "text": "Nanomaterials studies various kinds of low-dimensional materials for devices. The key focus of this area includes \nadvanced materials synthesis\ncharacterization techniques at the atomic scale, in-situ, and operando;\nemerging devices such as memories for neuromorphic computing; \nlow-dimensional materials: quantum dots, nanowires, nanotubes, and two-dimensional materials; \nmicro/nanoelectronic devices; carbon-based electronics; nanomaterials for bioelectronics and flexible electronics.\nMicro/Nanoelectronics research aims at advanced electronic devices whose functions rely on the structures and phenomena at the microscale and nanoscale. The focused areas include memristors, lasers, phototransistors, imaging devices, bioelectronic sensors, neuromorphic microelectronics, and 2D heterogeneous electronics.\nResearch Members \nName\tResearch Interest \t\nProf. Daniel S. P. LAU\nTwo-dimensional materials and devices\nProf. Yang CHAI\nTwo-dimensional materials and devices, carbon-based electronics\nProf. Jiyan DAI\tMedical ultrasound transducers and imaging, nanomaterials fabrication and application, functional metal oxide thin films and devices\t\nProf. Kin Wing KWOK\tFerroelectric, piezoelectric & pyroelectric materials and devices\t\nDr. Jiong ZHAO\nIn situ TEM and low dimensional materials\nDr. Ye ZHU\nTEM and material characterization techniques at the atomic scale\nDr. Zhuangchai LAI\tControlled synthesis and characterization of novel 2D materials\t\nDr. Dianxiang JI\n\tSynthesis and characterization of functional metal oxide thin films, heterostructures and devices\t\nDr. Songhua CAI\tAdvanced STEM, in situ TEM, low dimensional materials and devices\t",
  "url": "https://www.polyu.edu.hk/ap/research/research-theme/nanomaterials-and-micro-or-nanoelectronics"
 },
 {
  "text": "This research theme studies exceptional quantum properties of 2D materials and related van-der-Waals heterostructures and their applications. It focuses on quantum nanostructures, spintronics, magnetic semiconductor heterostructures, 2D electron gases, non-linear Hall effect, and 2D ferroelectrics.\nResearch Members\nName\tResearch Interest \t\nProf. Kian Ping LOH\tQuantum 2D materials, spin-optoelectronics of 2D organic-inorganic hybrid perovskites, 2D covalent organic framework in catalysis and energy, catalysis for CO2 reduction\t\nProf. Jiyan DAI\nSpin field effect transistor, heterostructural 2D electron gas, polar oxide sensors\nDr. Dennis C.W. Leung\tMagnetism and spintronics, nanopatterning techniques\t\nDr. Kathy K. LENG\nMultiferroic materials and devices, 2D strongly correlated quantum phenomena, heterostructures based on 2D oxide thin films, oxide molecular beam epitaxy (Oxide-MBE), scanning tunneling microscopy (STM), transmission electron microscopy (TEM)\nDr. Dianxiang JI\t2D strongly correlated quantum states, Heterostructures of transition metal oxide thin films and 2D materials\t\nDr. Teng MA\n\tChemical vapor deposition growth of 2D materials and their heterostructures, 2D ferroelectrics and devices, Non-linear Hall effect of 2D materials \t",
  "url": "https://www.polyu.edu.hk/ap/research/research-theme/quantum-physics-and-devices"
 },
 {
  "text": "This research theme studies cutting-edge materials and advanced devices that rely on photons, electrons, and their strong interaction with matter. It covers high-power mid-infrared lasers and white-light LEDs, photodetectors, biomimetic optical imaging, plasmonic nanostructures, plasmon-enhanced photocatalysis, optofluidics, artificial photosynthesis, micro-/nano-optics, biophotonics, ultrafast optical spectroscopy, linear/non-linear optical properties of semiconducting materials and devices.",
  "url": "https://www.polyu.edu.hk/ap/research/research-theme/photonics-and-plasmonics-and-optoelectronics"
 },
 {
  "text": "Undergraduate student assistants\nThe department provides research opportunities for outstanding undergraduate students who have strong interest in postgraduate study. Financial supports will be provided to selected student assistants who are involved in research activities during summer. Interested parties may discuss with our academic staff by appointments. \nPhD fellowship scheme\nApplicants for admission to PhD programmes at PolyU via the Hong Kong PhD Fellowship Scheme established by the RGC will concurrently be considered for regular places assigned to the University through the award of Postgraduate Studentships. Outstanding candidates will be nominated by the University to compete for the Hong Kong PhD Fellowship Scheme. Get more details of PolyU PhD Fellowship Scheme at here. ",
  "url": "https://www.polyu.edu.hk/ap/research/research-projects/research-opportunities"
 },
 {
  "text": "Year Title Author \n2020\t2D ferroelectricity and piezoelectricity for electronic devices\tShuoguo YUAN\t\n2019\tA study on energy-storage materials for supercapacitor applications\tKun YU\t\n2019\tAmplified spontaneous emission and lasing from lead halide perovskites under multiple-photon excitation\tDecheng YANG\t\n2019\tAtomic scale structure variations at ferroelectric domain walls in multiferroic BiFeO₃\tMan Ho LEUNG\t\n2019\tCharacterization of 2D heterostructures\tKa Ho CHAN\t\n2019\tCo-precipitation synthesis of lanthanide-doped nanoparticles for sensing applications\tYuen Ting WONG\t\n2019\tDesign and fabrication of lanthanide-doped upconversion particles for optical applications\tTing WANG\t\n2019\tDesign and fabrication of low-loss plasmonic and upconversion lasers\tChun Kit SIU\t\n2020\tDesign and fabrication of perovskite based frequency-upconverted nano/micro lasers\tSiqi LI\t\n2019\tFabrication and characterization of transparent oxide thin film\tKa Kin LAM\t\n2019\tFast, broadband and self-driven photodetectors based on Pt or Pd-TMDs\tLonghui ZENG\t\n2020\tFerroelectric oxides with high piezoelectricity and low band gap for solar energy harvesting applications\tMan Kit CHAN\t\n2019\tGrowth and characterization of transition metal telluride thin films\tCheuk Ho CHAN\t\n2019\tIdentification of mechanically exfoliated graphene and applications of graphene impermeability\tXinpeng SHEN\t\n2020\tLanthanide near-infrared luminescence in layered semiconductor nanosheet hosts\tYongxin LYU\t\n2020\tMechanical energy harvesting and conversion based on utilization of luminescence materials and triboelectric nanogenerator\tMan Chung WONG\t\n2019\tMicrofluidic plasmonic packed-bed reactor (μPPBR) for photocatalytic water purification\tPui Hong YEUNG\t\n2019\tMicrofluidic reactors for artificial photosynthesis of carbohydrates using Calvin cycle\tYujiao ZHU\t\n2019\tNovel plasmonic metal-semiconductor hybrid photocatalysts for enhanced organic decomposition\tWillis, Kwun Hei HO\t\n2020\tOptical nonlinear properties of novel two dimensional transition metal dichalcogenides\tChun Yin TANG\t\n2020\tOptical performances of group-10 transition metal dichalcogenides materials\tXinyu WANG\t\n2019\tOptics in perovskites and low-mobility materials based solar cells and color vision in perovskite sensors\tMd Wayesh QARONY\t\n2019\tOrganic electrochemical transistors for wearable sensing\tAnneng YANG\t\n2019\tOxygen and hydrogen sensing effects of supersonic cluster beam deposited zinc oxide films\tKa Seng LAU\t\n2020\tPlasmonic nanohole array with strong mode coupling for hot carrier generation\tYat Lam WONG\t\n2019\tPorous materials for solar-thermal conversion and catalytic water splitting\tSainan MA\t\n2020\tScanning near-field optical microscopy study of PtSe₂ flakes\tKin Ping WONG\t\n2020\tSn-based organic-inorganic hybrid perovskite for high performance photodetectors\tChun Ki LIU\t\n2019\tStudy of photovoltaic effect in lead-free ferroelectric perovskite oxides\tHo Fung TING\t\n2019\tStudy of strain effect to the LaAlO₃/SrTiO₃ heterostructure\tFan ZHANG\t\n2020\tSurface engineering for efficient electrocatalytic water splitting and nitrogen reduction\tLejuan CAI\t\n2019\tSynthesis and characterization of violet phosphorus\tWai Kin LAI\t\n2019\tSynthesis of transition metal compounds for efficient electrocatalytic water splitting\tQingzhao HU\t\n2020\tSynthesis of two-dimensional layered materials for electrocatalysis and photodetection applications\tChun Hin MAK\t\n2019\tThe study of inorganic perovskite solar cells\tKai Chi TANG\t\n2019\tThe study on high performance inorganic-organic hybrid perovskite solar cells\tGuanqi TANG\t\n2020\tTheoretical study of Lorentz non-reciprocal cylinder gratings\tWai Chun WONG\t\n2020\tTheoretical study of topological gyrotropic lattices with dynamic long-range interactions\tRaymond, Pak Hong WU\t\n2019\tTransmission electron microscopy characterizations with in situ electrical manipulations on two-dimensional materials\tLok Wing WONG\t\n2019\tVertical graphene tunnelling heterostructures with ultrathin ferroelectric film as a tunnel barrier\tHung Lit CHAN\t",
  "url": "https://www.polyu.edu.hk/ap/research/research-projects/rpg-student-projects"
 },
 {
  "text": "PolyU Research Office offers \nAdvise on regulations, procedures and arrangements on research administration matters\nCoordinate applications for research funding from external sources and the submission of reports\nCoordinate the internal competitive research grant exercise\nCoordinate the exercise on research monitoring",
  "url": "https://www.polyu.edu.hk/ap/research/research-projects/research-grants"
 },
 {
  "text": "Year of Publication Name of Journal Category Title Author \n2022\tAmerican Association for the Advancement of Science\tMaterials Science\tFerroelectricity in untwisted heterobilayers of transition metal dichalcogenides\tShu Ping LAU\t\n2022\tNature Communications\tCondensed Matter\tRoom-temperature valley transistors for low-power neuromorphic computing\tYang CHAI\t\n2019\tNature\tGeneral\tFreestanding crystalline oxide perovskites down to the monolayer limit\t\nDianxiang JI, Songhua CAI\n2021\tNature Materials\tMaterials Science\tLarge-scale growth of few-layer two-dimensional black phosphorus\t\nShu Ping LAU, Jianhua Hao\n2019\tNature\tGeneral\tReal-space charge-density imaging with sub-ångström resolution by four-dimensional electron microscopy\t\nDianxiang JI\n2021\tEnergy and Environmental Science\tEnvironmental Chemistry\tRecent progress in tin-based perovskite solar cells\t\nFeng YAN\n2020\tJoule\tEnergy\tVisualizing the Invisible in Perovskites\t\nSonghua CAI\n2020\tNature Reviews Materials\tElectronic, Optical and Magnetic Materials\tFrom bulk to molecularly thin hybrid perovskites\t\nLeng KAI\n2019\tAdvanced Functional Materials\tCondensed Matter Physics\tRoom-Temperature Meniscus Coating of >20% Perovskite Solar Cells: A Film Formation Mechanism Investigation\tDangyuan LEI\n2020\tMaterials Today Nano\tElectronic, Optical and Magnetic Materials\tHybrid heterostructures and devices based on two-dimensional layers and wide bandgap materials\t\nJianhua HAO\n2020\tNature Communications\tChemistry(all)\tWater-resistant perovskite nanodots enable robust two-photon lasing in aqueous environment\tYe ZHU\n2020\tMaterials Science and Engineering: R: Reports\tMaterial Science\tRecent progress in group III-nitride nanostructures: From materials to applications\t\nShu Ping LAU\n2020\tAdvanced Materials\tMaterials Science(all)\tCreating an Eco-Friendly Building Coating with Smart Subambient Radiative Cooling\tDangyuan LEI\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tEnhanced Performance of Planar Perovskite Solar Cells Induced by Van Der Waals Epitaxial Growth of Mixed Perovskite Films on WS2 Flakes\tFeng YAN,\nJiong ZHAO\n2020\tAdvanced Science\tMaterials Science(all)\tA Ternary Dumbbell Structure with Spatially Separated Catalytic Sites for Photocatalytic Overall Water Splitting\tYang CHAI\n2020\tAngewandte Chemie - International Edition\tCatalysis\tMethanol Synthesis at a Wide Range of H2/CO2 Ratios over a Rh-In Bimetallic Catalyst\tMeng-jung LI\t\n2020\tSmall Methods\tMaterials Science(all)\tElectrical and Optical Properties of Nickel-Oxide Films for Efficient Perovskite Solar Cells\tYuen Hong TSANG\n2020\tACS Energy Letters\tCatalysis\tIn Situ Phase Transformation on Nickel-Based Selenides for Enhanced Hydrogen Evolution Reaction in Alkaline Medium\tShu Ping LAU\t\n2020\tNature Communications\tChemistry(all)\tSite-specific electrical contacts with the two-dimensional materials\tJiong ZHAO\n2020\tAngewandte Chemie - International Edition\tCatalysis\tA Surface-Oxide-Rich Activation Layer (SOAL) on Ni2Mo3N for a Rapid and Durable Oxygen Evolution Reaction\tYe ZHU\t\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tGaining Insight into the Effect of Organic Interface Layer on Suppressing Ion Migration Induced Interfacial Degradation in Perovskite Solar Cells\tFeng YAN\t\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tFabrication of MAPbBr3 Single Crystal p-n Photodiode and n-p-n Phototriode for Sensitive Light Detection Application\tYuen Hong TSANG\t\n2020\tJournal of Materials Chemistry A\tRenewable Energy, Sustainability and the Environment\tBoosting the anchoring and catalytic capability of MoS2 for high-loading lithium sulfur batteries\tNicolas ONOFRIO\n2020\tJournal of Materials Chemistry A\tMaterials Science(all)\tStabilizing the cationic/anionic redox chemistry of Li-rich layered cathodes by tuning the upper cut-off voltage for high energy-density lithium-ion batteries\tHaitao HUANG\n2020\tAngewandte Chemie - International Edition\tCatalysis\tNanoimprint Lithography-Directed Self-Assembly of Bimetallic Iron–M (M=Palladium, Platinum) Complexes for Magnetic Patterning\tChi Wah LEUNG\n2020\tAdvanced Science\tMedicine (miscellaneous)\tGradient 2D/3D Perovskite Films Prepared by Hot-Casting for Sensitive Photodetectors\t\nFeng YAN,\nYe ZHU\n2020\tAdvanced Energy Materials\tRenewable Energy, Sustainability and the Environment\tLaser-Assisted Ultrafast Exfoliation of Black Phosphorus in Liquid with Tunable Thickness for Li-Ion Batteries\tShu Ping LAU\n2020\tAdvanced Energy Materials\tRenewable Energy, Sustainability and the Environment\tElectrospinning-Based Strategies for Battery Materials\tHaitao HUANG\t\n2020\tACS Nano\tMaterials Science(all)\tHigh-Temperature Anomalous Hall Effect in a Transition Metal Dichalcogenide Ferromagnetic Insulator Heterostructure\tJiyan DAI,\nChi Wah LEUNG\n2020\tACS Nano\tMaterials Science(all)\tPlasmonic and superhydrophobic self-decontaminating n95 respirators\tFeng YAN\t\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tπ-Extended Spiro Core-Based Nonfullerene Electron-Transporting Material for High-Performance Perovskite Solar Cells\tFeng YAN\n2020\tJournal of Materials Chemistry A\tMaterials Science(all)\tMultifunctional nanostructures of Au-Bi2O3fractals for CO2reduction and optical sensing\tYe ZHU\n2020\tACS Energy Letters\tChemistry (miscellaneous)\tHighly Air-Stable Tin-Based Perovskite Solar Cells through Grain-Surface Protection by Gallic Acid\tFeng YAN,\nYe ZHU\n2020\tACS Energy Letters\tChemistry (miscellaneous)\tUnravelling the Mechanism of Ionic Fullerene Passivation for Efficient and Stable Methylammonium-Free Perovskite Solar Cells\tHaitao HUANG\t\n2020\tApplied Physics Reviews\tPhysics and Astronomy(all)\t2D transition metal dichalcogenides, carbides, nitrides, and their applications in supercapacitors and electrocatalytic hydrogen evolution reaction\tJianhua HAO\t\n2020\tACS Nano\tMaterials Science(all)\tEnhanced Electrocatalytic Hydrogen Evolution Activity in Single-Atom Pt-Decorated VS2 Nanosheets\tYang CHAI\t\n2020\tACS Nano\tMaterials Science(all)\tReusable and Recyclable Graphene Masks with Outstanding Superhydrophobic and Photothermal Performances\tFeng YAN\t\n2020\tAdvanced Science\tMaterials Science(all)\tEfficient Energy Conversion and Storage Based on Robust Fluoride-Free Self-Assembled 1D Niobium Carbide in 3D Nanowire Network\t\nJianhua HAO,\nJiong ZHAO\n2020\tACS Nano\tMaterials Science(all)\tInfrared Nanoimaging of Surface Plasmons in Type-II Dirac Semimetal PtTe2 Nanoribbons\t\nKin Hung FUNG,\nShu Ping LAU,\nYe ZHU\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tPerovskite-Based Phototransistors and Hybrid Photodetectors\tFeng YAN\t\n2020\tNano Letters\tBioengineering\tNon-periodic epsilon-near-zero metamaterials at visible wavelengths for efficient non-resonant optical sensing\tYe ZHU\t\n2020\tNano Energy\tRenewable Energy, Sustainability and the Environment\tUltrasonic-assisted ultrafast fabrication of polymer nanowires for high performance triboelectric nanogenerators\tJianhua HAO\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tSelf-Healing, Flexible, and Tailorable Triboelectric Nanogenerators for Self-Powered Sensors based on Thermal Effect of Infrared Radiation\tJianhua HAO\t\n2020\tAdvanced Materials\tMaterials Science(all)\tLocalized Electrons Enhanced Ion Transport for Ultrafast Electrochemical Energy Storage\tYang CHAI\t\n2020\tNano Letters\tMaterials Science(all)\tA General Wet Transferring Approach for Diffusion-Facilitated Space-Confined Grown Perovskite Single-Crystalline Optoelectronic Thin Films\tJianhua HAO,\nFeng YAN,\nJiong ZHAO\t\n2020\tEnergy and Environmental Science\tEnergy\tUltrafast laser-annealing of perovskite films for efficient perovskite solar cells\t\nFeng YAN\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tOptoelectronic Perovskite Synapses for Neuromorphic Computing\tYang CHAI\t\n2020\tApplied Physics Reviews\tPhysics and Astronomy(all)\tElectrolyte-gated transistors for synaptic electronics, neuromorphic computing, and adaptable biointerfacing\tFeng YAN\t\n2020\tACS Nano\tMaterials Science(all)\tCritical Stable Length in Wrinkles of Two-Dimensional Materials\tJiong ZHAO\t\n2020\tAngewandte Chemie - International Edition\tChemistry(all)\tHighly Efficient Porous Carbon Electrocatalyst with Controllable N-Species Content for Selective CO2 Reduction\tHaitao HUANG\t\n2020\tNature\tGeneral\tLi metal deposition and stripping in a solid-state battery via Coble creep\t\nHaitao HUANG \n2020\tSmall Methods\tMaterials Science(all)\tApplications of ESEM on Materials Science: Recent Updates and a Look Forward\tHaitao HUANG\t\n2020\tAdvanced Functional Materials\tCondensed Matter Physics\tAtomic-Level Passivation of Individual Upconversion Nanocrystal for Single Particle Microscopic Imaging\tSiu Fung YU\t\n2020\tAdvanced Materials\tMaterial Science\tSmart Textile-Integrated Microelectronic Systems for Wearable Applications\t\nYang CHAI\n2020\tJournal of the American Chemical Society\tCatalysis\tBulk-Heterojunction with Long-Range Ordering: C60 Single-Crystal with Incorporated Conjugated Polymer Networks\tYe ZHU\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tEnhanced performance of tin-based perovskite solar cells induced by an ammonium hypophosphite additive\tFeng YAN\n2019\tAngewandte Chemie - International Edition\tCatalysis\tHot π-Electron Tunneling of Metal–Insulator–COF Nanostructures for Efficient Hydrogen Production\tXuming ZHANG\t\n2019\tAdvanced Functional Materials\tCondensed Matter Physics\tMicroplasma-Discharge-Based Nitrogen Fixation Driven by Triboelectric Nanogenerator toward Self-Powered Mechano-Nitrogenous Fertilizer Supplier\tJianhua HAO\n2019\tACS Catalysis\tCatalysis\tLattice Expansion in Optimally Doped Manganese Oxide: An Effective Structural Parameter for Enhanced Thermochemical Water Splitting\tYe ZHU\t\n2019\tSmall\tMaterials Science(all)\tPhosphorus Incorporation into Co9S8 Nanocages for Highly Efficient Oxygen Evolution Catalysis\tYang CHAI,\nYuen Hong TSANG\t\n2019\tAdvanced Science\tMedicine (miscellaneous)\tPEDOT:PSS for Flexible and Stretchable Electronics: Modifications, Strategies, and Applications\tFeng YAN\t\n2019\tAdvanced Science\tMedicine (miscellaneous)\tMultilayered PdSe2/Perovskite Schottky Junction for Fast, Self-Powered, Polarization-Sensitive, Broadband Photodetectors, and Image Sensor Application\t\nShu Ping LAU,\nYuen Hong TSANG\n2019\tNature Materials\tMaterial Science\tEnhanced sieving from exfoliated MoS2 membranes via covalent functionalization\t\nNicolas ONOFRIO\n2019\tAdvanced Energy Materials\tRenewable Energy, Sustainability and the Environment\tRemarkably Enhanced Hydrogen Generation of Organolead Halide Perovskites via Piezocatalysis and Photocatalysis\tYang CHAI,\nShu Ping LAU\n2019\tAdvanced Science\tMaterials Science(all)\tSn-Based Perovskite for Highly Sensitive Photodetectors\tFeng YAN\n2019\tNature Communications\tChemistry(all)\tContinuous artificial synthesis of glucose precursor using enzyme-immobilized microfluidic reactors\tXuming ZHANG\n2019\tAdvanced Materials\tMaterial Science\tIntrinsic Conductance of Domain Walls in BiFeO3\tShu Ping LAU\t\n2019\tACS Nano\tMaterials Science(all)\tValence Engineering via Dual-Cation and Boron Doping in Pyrite Selenide for Highly Efficient Oxygen Evolution\tYang CHAI,\nYuen Hong TSANG\n2019\tNational Science Review\tGeneral\tLog-periodic quantum magneto-oscillations and discrete-scale invariance in topological material HfTe5\tJiyan DAI,\nShu Ping LAU\n2019\tNano Energy\tRenewable Energy, Sustainability and the Environment\tHigh efficiency bi-harvesting light/vibration energy using piezoelectric zinc oxide nanorods for dye decomposition\tHaitao HUANG\t\n2019\tNano Energy\tRenewable Energy, Sustainability and the Environment\tInterfacial engineering of front-contact with finely tuned polymer interlayers for high-performance large-area flexible perovskite solar cells\tHaitao HUANG\n2019\tNature Nanotechnology\tMaterial Science\tOptoelectronic resistive random access memory for neuromorphic vision sensors\t\nYang CHAI\n2019\tEnergy and Environmental Science\tEnergy\tRecent progress of inorganic perovskite solar cells\t\nFeng YAN\n2019\tACS Nano\tMaterials Science(all)\tProbing the in-Plane Near-Field Enhancement Limit in a Plasmonic Particle-on-Film Nanocavity with Surface-Enhanced Raman Spectroscopy of Graphene\tDangyuan LEI,\nYe ZHU\n2019\tAdvanced Functional Materials\tCondensed Matter Physics\tColossal Permittivity Materials as Superior Dielectrics for Diverse Applications\tJianhua HAO\t\n2019\tNano-Micro Letters\tElectronic, Optical and Magnetic Materials\tPerovskite/Silicon Tandem Solar Cells: From Detailed Balance Limit Calculations to Photon Management\tYuen Hong TSANG\n2019\tSmall\tMaterials Science(all)\tSchottky Barrier-Controlled Black Phosphorus/Perovskite Phototransistors with Ultrahigh Sensitivity and Fast Response\tFeng YAN\n2019\tACS Catalysis\tCatalysis\tCeO2-Induced Interfacial Co2+ Octahedral Sites and Oxygen Vacancies for Water Oxidation\tYang CHAI\n2019\tJournal of the American Chemical Society\tCatalysis\tUniversal Strategy for HF-Free Facile and Rapid Synthesis of Two-dimensional MXenes as Multifunctional Energy Materials\t\nJianhua HAO,\nHaitao HUANG,\nWing Tak WONG\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tFlexible dielectric nanocomposites with simultaneously large discharge energy density and high energy efficiency utilizing (Pb,La)(Zr,Sn,Ti)O3 antiferroelectric nanoparticles as fillers\tHaitao HUANG\t\n2019\tAdvanced Materials\tMaterials Science(all)\tSolution-Phase Epitaxial Growth of Perovskite Films on 2D Material Flakes for High-Performance Solar Cells\tFeng YAN,\nJiong ZHAO\n2019\tJournal of Materials Chemistry A\tRenewable Energy, Sustainability and the Environment\tHealable and shape-memory dual functional polymers for reliable and multipurpose mechanical energy harvesting devices\tJianhua HAO\n2019\tACS Nano\tMaterials Science(all)\tPlasmonic Metal Nanoparticles with Core-Bishell Structure for High-Performance Organic and Perovskite Solar Cells\tHaitao HUANG\t\n2019\tACS Nano\tMaterials Science(all)\tMagnetotransport Properties of Layered Topological Material ZrTe2 Thin Film\tJiyan DAI,\nShu Ping LAU\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tSea urchin-like Ni-Fe sulfide architectures as efficient electrocatalysts for the oxygen evolution reaction\tYe ZHU\t\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tA high-power wearable triboelectric nanogenerator prepared from self-assembled electrospun poly(vinylidene fluoride) fibers with a heart-like structure\tHaitao HUANG\t\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tPredicting two-dimensional pentagonal transition metal monophosphides for efficient electrocatalytic nitrogen reduction\tHaitao HUANG\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tRealization of ultra-long columnar single crystals in TiO2 nanotube arrays as fast electron transport channels for high efficiency dye-sensitized solar cells\tHaitao HUANG\t\n2019\tAngewandte Chemie - International Edition\tCatalysis\tFiber-in-Tube Design of Co 9 S 8 -Carbon/Co 9 S 8: Enabling Efficient Sodium Storage\tHaitao HUANG\t\n2019\tEnergy and Environmental Science\tEnergy\tNanostructures of solid electrolyte interphases and their consequences for microsized Sn anodes in sodium ion batteries\t\nBiao ZHANG, \n2019\tEnergy and Environmental Science\tEnergy\tPhase-transition induced giant negative electrocaloric effect in a lead-free relaxor ferroelectric thin film\t\nHaitao HUANG\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tEfficiency enhancement of organic photovoltaics by introducing high-mobility curved small-molecule semiconductors as additives\tFeng YAN\n2019\tAdvanced Energy Materials\tRenewable Energy, Sustainability and the Environment\tMonolithic Integration of All-in-One Supercapacitor for 3D Electronics\tYang CHAI\t\n2019\tNano Letters\tBioengineering\tPhase Identification and Strong Second Harmonic Generation in Pure ϵ-InSe and Its Alloys\tYang CHAI\t\n2019\tNature Communications\tChemistry(all)\tRoom-temperature ferroelectricity in MoTe 2 down to the atomic monolayer limit\tJianhua HAO\t\n2019\tNano Energy\tRenewable Energy, Sustainability and the Environment\tThree-terminal memtransistors based on two-dimensional layered gallium selenide nanosheets for potential low-power electronics applications\tJianhua HAO\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tTiO 2 -B nanowires Via topological conversion with enhanced lithium-ion intercalation properties\tHaitao HUANG\t\n2019\tJoule\tEnergy(all)\tFullerene-Anchored Core-Shell ZnO Nanoparticles for Efficient and Stable Dual-Sensitized Perovskite Solar Cells\tHaitao HUANG\t\n2019\tAccounts of Chemical Research\tChemistry(all)\tFunctionalized Organic Thin Film Transistors for Biosensing\tFengYAN\t\n2019\tACS Nano\tMaterials Science(all)\tNon-Invasive Optical Guided Tumor Metastasis/Vessel Imaging by Using Lanthanide Nanoprobe with Enhanced Down-Shifting Emission beyond 1500 nm\tJianhua HAO\t\n2019\tACS Nano\tMaterials Science(all)\tObservable Two-Step Nucleation Mechanism in Solid-State Formation of Tungsten Carbide\t\nChi Wah LEUNG,\nChee Leung MAK\n2019\tAngewandte Chemie - International Edition\tChemistry\tAntioxidant Grain Passivation for Air-Stable Tin-Based Perovskite Solar Cells\tFeng YAN,\nYe ZHU\t\n2019\tAdvanced Functional Materials\tCondensed Matter Physics\tControlled Synthesis of 2D Palladium Diselenide for Sensitive Photodetector Applications\t\nYang CHAI,\nShu Ping LAU,\nYuen Hong TSANG\n2019\tEnergy Storage Materials\tRenewable Energy, Sustainability and the Environment\tK3V2(PO4)2F3as a robust cathode for potassium-ion batteries\tBiao ZHANG\t\n2019\tNano Energy\tRenewable Energy, Sustainability and the Environment\tStrategies and progress on improving robustness and reliability of triboelectric nanogenerators\tJianhua HAO\t\n2019\tNano Energy\tRenewable Energy, Sustainability and the Environment\tReversible and nonvolatile tuning of photoluminescence response by electric field for reconfigurable luminescent memory devices\tKin Wing KWOK\n2019\tAngewandte Chemie - International Edition\tChemistry\tHarvesting the Vibration Energy of BiFeO3 Nanosheets for Hydrogen Evolution\t\nChi Hang LAM,\nHaitao HUANG\n2019\tACS Nano\tMaterials Science(all)\tHighly Polarization-Sensitive, Broadband, Self-Powered Photodetector Based on Graphene/PdSe2/Germanium Heterojunction\tYuen Hong TSANG\n2019\tJournal of the American Chemical Society\tCatalysis\tValence Engineering via Selective Atomic Substitution on Tetrahedral Sites in Spinel Oxide for Highly Enhanced Oxygen Evolution Catalysis\tHaitao HUANG\n2019\tJournal of Materials Chemistry A\tMaterials Science(all)\tHollow Au nanorattles for boosting the performance of organic photovoltaics\tJiyan DAI,\nDangyuan LEI,\nFeng YAN",
  "url": "https://www.polyu.edu.hk/ap/research/research-publication_general-listing"
 },
 {
  "text": "Science is influential. We encourage students and research personnel to be creative and innovative. Our Department is equipped with many advanced research facilities facilitate the learning needs of our students and research personnel. We have over 20 laboratories and University Research Facilities in Materials Characterization and Device Fabrication.\nUniversity Research Facilities in Materials Characterization and Device Fabrication (UMF) was established in 2014. It aims to provide leadership in materials community, be a catalyst for multidisciplinary education and innovations and foster collegial exchanges of expertise. \nBook the laboratory at AP laboratory booking system or UMF! ",
  "url": "https://www.polyu.edu.hk/ap/research/research-facilities"
 },
 {
  "text": "Research Facilities Location \n2D Materials Laboratory \tFG708\t\nBiosensors Laboratory\tDE703\t\nChemical Vapour Deposition Laboratory \tFG705b\t\nClean Room\tGH715\t\nEnergy Materials Laboratory\tFG707\t\nFemtosecond Laser Laboratory \tFJ703a\t\nField Emission SEM Laboratory \tCD707\t\nFoundation Physics Laboratory\tCD704\t\nIntermediate Physics Laboratory\tCD705\t\nLaser Laboratory\tDE703c\t\nLaser-MBE Laboratory\tDE702\t\nMagnetoelectric Laboratory\tDE703a\t\nMaterial Processing Laboratory\tCD701, CD701a\t\nMaterial Science Laboratory\tFJ705\t\nMaterials Chemistry Laboratory \tGH712\t\nMulti-purpose Laboratory \tFJ704\t\nMultimedia Physics Laboratory \tDE705, DE705a\t\nNano-materials Laboratory\tDE701\t\nNanomaterials Processing laboratory \tFJ702\t\nOptoelectronics Laboratory\tDE704\t\nOrganic Electronic Laboratory\tFG705\t\nPhotoluminescence Laboratory \tDE703b\t\nPlasmonics & Metamaterials Laboratory\tDE703d\t\nPulsed Laser Deposition Laboratory \tDE702c\t\nSensor and Transducer Laboratory \tCD702, CD703\t\nSpectroscopy Microscope Laboratory\tDE702a\t\nThin Film Fabrication Laboratory\tDE702d\t\nUltrafast Spectroscopy Laboratory\tFJ703\t\nVSM Laboratory\tFG704\t",
  "url": "https://www.polyu.edu.hk/ap/research/research-facilities/list-of-facilities"
 },
 {
  "text": "AP bas been well-recognized by both academics and industries. It continuously provides high quality tertiary education and undertakes high level application-oriented research. It is active in consultancy with local industries both as a service to the community and an extension of our research activities. The major areas include, but are not limited to, the following:\nMaterials testing and characterization\nMagnetics, optics, lasers, acoustics and ultrasonics, electrical and electronics, mechanical and vibrations, thermal and radiation measurements\nCorrosion, reliability and failure analysis\nInnovative products and technologies\nRenewable energy and water treatment\nFor enquiry, please contact our Industrial and Consultancy Liaison Officer:\nDr. Yuen Hong TSANG\nTel: (852) 2766 - 5676\nFax: (852) 2333 - 7629 \nEmail: Yuen.Tsang@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/ap/services/consultancy"
 },
 {
  "text": "The project envisions mobile and easily accessible physical measurement with the use of built-in sensors in mobile devices, such as smart phones and tablets. It aims to encourage students to make observations to daily environment. It also encourages teachers to co-create experiments with students.\nAvailable on Android and iOS. \nAndroid\niOS\nSeven in ONE ",
  "url": "https://www.polyu.edu.hk/ap/services/labxra/ap-sensor"
 },
 {
  "text": "Laboratory teaching is an indispensable part of science education. The processes of making observations, performing systematic and quantitative investigations, data collection, analysis and logical interpretation of results and drawing relevant conclusions, are the skills fundamental to the training of all science subjects. Performing experiments also serve to reinforce students’ classroom learning experiences.\nLabXRA is a web-based remote laboratory platform developed by Department of Applied Physics, PolyU. It is the first-of-its-kind in Asia, and has enabled students to conduct experiments everywhere at all times. By registering the desired experiment on this website, users are able to real-timely and remotely control the setup residing in PolyU.\nThe project is initiated and developed by our academic staff, Dr. Albert CHOY, Dr. Michael JIM, Dr. Dennis LEUNG and Dr. C. L. MAK , Dr. Peter TSANG with sponsorship from Quality Education Fund of Education Bureau. \nAll services provided on LabXRA are free of charge to local schools.\nAwards\nAsia Gold Award, Wharton-QS Stars Reimgaine Education Competition 2016\nShortlisted Best Educational APP Award, Reimgaine Education Competition 2020",
  "url": "https://www.polyu.edu.hk/ap/services/labxra"
 },
 {
  "text": "A web-based remote laboratory platform for anyone to perform experiments anytime, anywhere. All experiments are centralized in the Department of Applied Physics of PolyU, qualified and maintained by our professors and university staffs. \nThrough the PolyU server, the remote experiment setups residing in PolyU receive commands from users and make responses. The users can in return monitor the experiment via live cameras, as well as retrieve data obtained by the sensors.\nBook NOW\nBenefits \nHighly flexible for adaptation in different learning and teaching modes (class demonstrations, individual/ group assignments, systematic investigations), as deemed suitable by instructors.\nStudents and/or teachers can operate such setups in a way similar to running the experiment in school laboratories, at any time and from everywhere (as long as internet access is available).\nAutomated data acquisition provides a scaffold for students to take and analyze a large number of good quality data, gives students a chance to learn how to analyze many data points and draw a reasonable conclusion.\nExperiment Modules \nElectromagnetic Induction ",
  "url": "https://www.polyu.edu.hk/ap/services/labxra/borderless-lab"
 },
 {
  "text": "Overview of PolyU AP Programmes\nUnique Features of PolyU AP Programmes \nUnique in Hong Kong\nWe provide training in Applied Physics as well as Engineering at honours degree level.\nNurture future scientists\nWe train students who command a wide range of professional, technical and generic skills to cope with the globalization in world-wide communities and rapid growth of technology.\nVersatility and flexibility\nGraduates would appreciate the versatility and flexibility that this programme provides, knowing how to apply what they have learned from classroom.\nMoving with the times\nWe constantly update new subjects that helps our students obtain latest knowledge and adapt to the ever-changing society. Recently, new subjects about Artificial Intelligence (AI) and medical imaging are introduced into the BSc programmes.",
  "url": "https://www.polyu.edu.hk/ap/study/study-at-ap"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code JS3985 \nProgramme Intake 25 \nFund Type Government-Funded \nCredits Required for Graduation \n125\nProgramme Leaders \nDr Y.H. Tsang\nBSc, PhD\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nEngineering Physics is a unique programme that focuses on the application of physics to engineering. This combination of physics with engineering enables our graduates to function flexibly and effectively in various careers.\nStudents gain the ability to analyse and solve practical/engineering problems, which prepares them for complex workplace situations, technological advances and change.\nProgramme Characteristics\nEngineering Physics is the only programme in Hong Kong that amalgamates applied physics and engineering. We produce versatile graduates who can comfortably cope with the multifaceted global economy and fast-paced high technology.\nStudents benefit from training in both physics and engineering and from familiarisation with sophisticated equipment, including electron microscopes, lasers, solar simulator, surface coating equipment and LED characterisation instruments.\nStudent exchange programmes with academic institutions in the Chinese mainland and overseas are available. In addition, students will perform Work-Integrated Education (WIE) in the form of short-term placements, many of which are outside PolyU.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bachelor-of-science-honours-in-engineering-physics"
 },
 {
  "text": "Entrance Year September 2023 \nProgramme Code JS3030 \nMode of Study Full Time \nNormal Duration 4 years \nFund Type Government-Funded \nCredits Required for Graduation 133 \nProgramme Leaders \nDr Y.H. Tsang\nBSc, PhD\nRemarks\nEntry scholarships are available for students who attain level 5** in HKDSE subjects and aggregate HKDSE score of 27 or above for the best 5 subjects. \nAims and Characteristics\nAcquire a Major with a Secondary Major degree in 4 years \nThis programme is a brand new Bachelor of Science programme of The Hong Kong Polytechnic University (PolyU). It cultivates students with knowledge spanning the disciplines of Physics and their chosen Secondary Major (AIDA or IE). By combing the strengths of the two fields, graduates will be ready to take on future challenges and excel in the contemporary workplace.\nStudents enrolled on the Physics X Secondary Major programmes follow a common curriculum in the first year before they choose either AIDA or IE in Year Two, according to their own preference. They will graduate with one of the following degrees upon successful completion of the corresponding graduation requirements:\n• BSc (Hons) in Physics with a Secondary Major in Artificial Intelligence and Data Analytics*\n• BSc (Hons) in Physics with a Secondary Major in Innovation and Entrepreneurship*\n*JUPAS code: JS3030\n4年時間 同步完成主修及副主修課程\n本課程為香港理工大學(PolyU)全新理學士課程，旨在培養學生在物理主修，以及相應副主修的跨學科知識。同學可選擇人工智能及數據分析(AIDA)，或創新及創業(IE)作為副主修科目。學生在畢業時將擁有兩大領域的優勢，為戰勝未來挑戰做好準備，以能在現今職場環境中脫穎而出。\n報讀物理及副主修課程的學生，將於首年修讀共同核心課程，到了二年級時再根據自己的喜好選讀AIDA或IE。學生在完成相應的畢業要求後，將可在畢業時獲授以下其中一個學位：\n• 物理學(榮譽)理學士副主修人工智能及數據分析*\n• 物理學(榮譽)理學士副主修創新及創業*\n*大學聯招課程編號: JS3030",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/js3030-bsc-physics-x-aida-or-ie"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code 11439-OPT \nMode of Study Full-time \nNormal Duration 2 years \nProgramme Intake 34 \nFund Type Government-Funded \nCredits Required for Graduation 65 \nProgramme Leaders \nProf. F. Yan \nBSc, PhD\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nThe principal aim of the programme is to provide students with solid and practical training in optoelectronics. Optoelectronics is one of the fastest growing sectors in the global market due to its vast applications, such as light emitting diodes (LEDs), organic LEDs, lasers, image sensors and optical fibres. Industries in Hong Kong and the Pearl River Delta region are particularly drawn to this rapidly developing sector, and are swiftly moving away from traditional manual labour intensive manufacturing to high-return and high-technology oriented production and R&D. To address the needs of such industries, the programme emphasises optoelectronic system design, processing and testing.\nThe programme also focuses on the application of physics to engineering. This combination of physics with engineering enables our graduates to perform flexibly and effectively in various careers.\nStudents gain the ability to analyse and solve practical engineering problems, which prepares them for complex workplace situations and technological advancements.\nProgramme Characteristics\nThis is a two-year articulation programme for Higher Diploma/Associate Degree graduates in Science or Engineering. On successful completion of the programme, students will be awarded a degree of Bachelor of Science (Honours) in Engineering Physics (Optoelectronics), i.e., a BSc(Hons) degree in Engineering Physics, with a specialism in optoelectronics.\nSimilar to the BSc degree programme in Engineering Physics, this articulation programme amalgamates applied physics and engineering. We produce versatile graduates who can comfortably cope with Hong Kong's fast-paced and multifaceted economy as it evolves into a high-tech and high value-added productivity centre.\nStudents benefit from training in both physics and engineering and from familiarization with sophisticated equipment, including electron microscopes, lasers, surface coating machines and material characterisation instruments.\nStudent exchange programmes with academic institutions in the Chinese mainland and overseas are available. In addition, students will perform Work-Integrated Education (WIE) in the form of short-term placements, many of which are outside PolyU.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bsc-ep-opto"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code JS3014 \nProgramme Intake 51 \nFund Type Government-Funded \nCredits Required for Graduation \n62\nProgramme Leaders \nDr C.H. Lam\nBSc, PhD\nAims and Characteristics\nProgramme Aims and Learning Outcomes\nStudents gain comprehensive foundational knowledge and skills in applied physics, instrumentation and materials technology.\nThe broad-based design of the programme enables graduates to seek promising careers in the following industries/sectors:\nIndustries that use advanced technology based on scientific instrumentation;\nIndustries that require the specification, selection and processing of metals, ceramics, plastics and advanced materials; and\nThe sales and service departments of commercial or trading companies that deal with high-technology equipment and materials.\nThe programme provides a route of articulation to degree programmes.\nProgramme Characteristics\nThis programme is unique in Hong Kong and has a long history, having been launched in 1978. Many of our graduates have already attained senior positions in the industrial and commercial sectors.\nThe broad-based design of the programme enhances graduates' competitiveness and adaptability in the dynamic economic and technological environment of Hong Kong.\nGraduates can also pursue further studies in many different fields at local and overseas universities.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/higher-diploma-in-applied-physics"
 },
 {
  "text": "Entrance Year Sep 2023 \nProgramme Code 11044 \nMode of Study Full-time \nNormal Duration 1 year \nCredits Required for Graduation 30 \nTuition Fees HK$195,000 (HK$6,500 per credit) \nProf. Siu Fung YU\nBEng, PhD\nThe Master of Science in Microelectronics Technology and Materials is designed to nurture high-calibre talents with knowledge and hands-on skills to contribute to the booming semiconductor industry’s development.\nBased on the expertise of the Department of Applied Physics in device physics and materials science research, the one-year programme provides students with unique and professional-oriented education in the process flow of microelectronics and integrated circuit design, simulation, fabrication and processing, characterization, and inspection.\n目标和特色\n微电子技术与材料理学硕士旨在培养具有专业知识和动手能力的高素质人才，为集成电路工业的蓬勃发展贡献力量。\n基于应用物理学系在器件物理和材料科学研究领域的专业知识，该学位课程在微电子和集成电路设计、制造加工、封装和检测工艺流程方向为学生提供独特且具有专业化导向的教育。",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code 11601 \nMode of Study Full-time / Part-time \nProf. Haitao HUANG\nAP treasures our tradition of maintaining strong links with local industries and offering application-oriented curricula. Our active engagement in research and consultancy work has been recognised by both academia and industry. The research quality of our staff members and postgraduate students has also received recognition through research awards, grants, fellowships and scholarships.\nAP is proud to report its outstanding performance in the latest Research Assessment Exercise 2020 (RAE 2020) of the University Grants Committee (UGC). Among our submitted research outputs, impact cases and research environment statement, 98% were rated “world-leading” or “internationally excellent” - a remarkable improvement from our performance in RAE 2014. AP has attained the highest percentage of “world-leading” research work in the Category “Materials Science & Materials Technology”. We also ranked first amongst all physics departments in local universities, with the highest percentage of “world-leading” research work.\nWorld Rankings: \n#79 in Best Universities for Materials Science of U.S. News & World Report Best Global Universities Ranking 2020\nA+ in Materials Science of The Times Higher Education China Subject Ratings 2020\n*New programme title in 2022",
  "url": "https://www.polyu.edu.hk/ap/study/rpg-prog/mphil-or-phd-in-physics-and-material-science"
 },
 {
  "text": "Subject Code Name of Subject \nAP10000\tFreshman Seminar – from atoms to the universe\t\nAP10001\tIntroduction to Physics\t\nAP10005\tPhysics I\t\nAP10006\tPhysics II\t\nAP10007\tApplied Physics Laboratory\t\nAP10008\tUniversity Physics I\t\nAP10009\tUniversity Physics II\t\nAP10011\tPhysics for Chemical and Biological Sciences\t\nAP1D02\tIntroduction to Astronomy\t\nAP1D03\tHow Things Work: the Physics of Everyday Life\t\nAP1D04\tIntroduction to Atmospheric Science\t\nAP1D05\tIntroduction to Physics\t\nAP20001\tElectromagnetism\t\nAP20002\tMaterials Science\t\nAP20003\tMechanics\t\nAP20005\tProgramming in Physics\t\nAP20006\tQuantum Mechanics for Scientists and Engineers\t\nAP20007\tFundamentals of Scientific Instrumentation\t\nAP20008\tWaves\t\nAP20009\tOptics 1\t\nAP20010\tOptics 2\t\nAP20012\tComputer-based Automation\t\nAP20014\tInnovation Project\t\nAP20015\tPhysics in Radiological Science\t\nAP20016\tElectromagnetism and Waves\t\nAP20017\tMechanics and Robotic Motion\t\nAP2S01\tEnhancing Scientific Literacy through Daily Physics\t\nAP30001\tApplied Acoustics\t\nAP30002\tComputational Physics\t\nAP30003\tDetectors & Imaging Devices\t\nAP30004\tElectromagnetic Fields\t\nAP30005\tAdvanced Scientific Instrumentation\t\nAP30007\tOptical Design\t\nAP30009\tLaser Principles and Applications\t\nAP30010\tRadiation Physics\t\nAP30011\tSolid State Physics\t\nAP30012\tThermal and Statistical Physics\t\nAP30013\tPhotonics Laboratory\t\nAP30014\tScience and Technology of Photovoltaics\t\nAP30016\tMaterials Science and Analysis\t\nAP30017\tMedical Imaging: Science and Technology\t\nAP30018\tAcoustics Principles and Intelligent Applications\t\nAP30019\tData Analysis Techniques for Scientists\t\nAP30020\tFrom Semiconductor to Intelligent Devices\t\nAP30021\tOptical Design with AI\t\nAP30022\tScientific Instrumentation and Automation\t\nAP30023\tSensors and Transducers for Internet of Things\t\nAP40002\tDisplay Technology\t\nAP40003\tSolid State Lighting\t\nAP40004\tProject\t\nAP40005\tOptoelectronic Packaging and Reliability\t\nAP40006\tSemiconductor Materials and Devices\t\nAP40009\tAdvanced Photonics Laboratory\t\nAP40010\tLighting Control Technology\t\nAP40011\tMaterials in Energy Conversion and Storage\t\nAP40012\tMachine Learning in Physics\t\nAP40013\tEnergy Conversion and Storage with Machine Learning\t\nAP40014\tImaging: Detector, Display and Processing\t\nAP40015\tIntelligent lighting\t\nAP40016\tLaser Processing and Applications\t\nAP40017\tExperiment X\t\nAP40018\tMedical Imaging: Science and Analytics\t\nAP40020\tIntegrated Capstone Project\t\nAP40021\tCapstone Project\t\nAP40023\tMaterials Modelling by Density Functional Theory\t\nAP50001\tRadiation Physics\nAP50002\tRadiation Protection and Radiation Safety",
  "url": "https://www.polyu.edu.hk/ap/study/subject-list/bachelor-programme"
 },
 {
  "text": "Subject Code Name of Subject \nAP601\tResearch Seminars I\t\nAP602\tResearch Seminars II\t\nAP603\tResearch Seminars III\t\nAP605\tPracticum\t\nAP616\tSmart Materials & Structures\t\nAP617\tAdvanced Instrumentation for Materials Analysis\t\nAP618\tScience and Technology of Micro- and Nano- systems\t\nAP619\tMicrofabrication Laboratory\t\nAP620\tAtomistic View of Matter: Modeling & Simulation\t\nAP621\tAdvanced Electron Microscopy: Theory and Practice\t\nAP622\tEmerging Memory Technologies\t\nAP6912\tGuided Study in Polymer Electronics\t\nAP6913\tGuided Study in Optical Properties of Luminescent Materials\t\nAP6914\tGuided Study in Ferroelectric Materials\t\nAP6915\tGuided Study on Research Topics in Applied Physics\t",
  "url": "https://www.polyu.edu.hk/ap/study/subject-list/postgraduate"
 },
 {
  "text": "Type of GUR Component\tSubject \tSubject Code \t\nService-Learning (SL)\tEnhancing Scientific Literacy through Daily Physics\tAP2S01\t\nCluster Areas Requirements (CAR -D)\tScience and Technologies of Economic Importance\tAP1D01\t\nCluster Areas Requirements (CAR -D)\tIntroduction to Astronomy\tAP1D02\t\nCluster Areas Requirements (CAR -D)\tHow Things Work: the Physics of Everyday Life\tAP1D03\t\nCluster Areas Requirements (CAR -D)\tIntroduction to Atmospheric Science\n\tAP1D04\t",
  "url": "https://www.polyu.edu.hk/ap/study/gur-of-offered-by-ap/cluster-area-requirements"
 },
 {
  "text": "Work-integrated Education (WIE) aims to provide students with an opportunity to gain valuable work-based learning experience in an organizational context relevant to their future professions, and develop generic skills that will be useful in those professions.\nIn principle, the objectives of WIE activities should enable students to:\napply knowledge and skills learnt in the classroom to real work situations; \nhave a better understanding of the workplace philosophy; \nappreciate the role of languages in professional workplaces; \nenhance their generic skills and nurture their personal development; and \nidentify their career interests and prepare for future employment. \nHow Department design WIE activities?\nthere would be intended learning outcomes set for work-based learning; \nthe work experience would be designed to aim at the attainment of the intended learning outcomes, instead of leaving learning to occur incidentally as a side effect of work; and \nthere would be appropriate support mechanisms to ensure that effective learning does take place.\nStructure of WIE \nWIE should be a cooperative venture between the Department and the work organization. It may take the following forms as long as the requirements of the academic programme concerned are satisfied: \nsummer placement (normally of two-month duration in Year 1, 2 or 3 of an academic programme) at a suitable participating organisation; \nplacement at a suitable participating organisation for a specified period of time;\nWIE programmes offered by CPS such as International WIE programmes, Local WIE programmes and Mainland WIE programmes; \nplacement in a collection of community service programmes of an acceptable aggregate duration; \nplacement found by the student him/herself at an external organisation and deemed to be suitable by the Department and the Dean in meeting the WIE requirements (such a placement must be declared by the student in advance so that the Department can assess its suitability); \nrelevant placement as student assistant at an administrative unit or the Industrial Centre of PolyU; \nplacement within the IAESTE (International Association for the Exchange of Students for Technical Experience) programme in which the student is attached to a workplace abroad during the training; and \nthe work of a student’s final-year degree project which involves an industrial partner or external client (the student needs not be placed at the company but should make frequent visits to ensure that the project will meet the specifications required by the company).\nWIE information for current students \nYou are required to fulfill 120 hours (11439 students) / 80 hours (11439-OPT) for WIE. \nPlease submit the application form/ WIE report via Intranet (please refer to the below category of WIE). \nHard copies are no longer accepted.\nApply now ",
  "url": "https://www.polyu.edu.hk/ap/study/gur-of-offered-by-ap/work-integrated-education"
 },
 {
  "text": "Aims of the Academic Advising System\nAcademic advising at PolyU aims to help students make informed and intelligent academic decisions/choices about their studies at PolyU that suit their intellectual, professional and personal goals. It is instrumental to promoting student success, and plays a vital role in enhancing students’ overall learning experience at PolyU.\nAcademic Advising @ AP\n(a) Arrangement\nEvery undergraduate and higher diploma student admitted to our department will be assigned to one academic staff member who will act as his/her Academic Advisor throughout his/her course of study at PolyU. The teaching team will introduce the Academic Advising System and the academic advisors to new students during the induction meetings.\n(b) Roles of Academic Advisor\nThe main responsibilities of an Academic Advisor include:\nBuilding rapport with the students;\nBeing accessible, available and responsive;\nHelping students to clarify their intellectual, professional and personal goals;\nHelping students to develop an appropriate study plan;\nAlerting students to academic regulations and requirements, particularly those relating to one’s Major;\nProviding early identification of students with special learning needs or signs of learning problems and making necessary referrals; and\nContacting with students regularly and have at least one face-to-face meeting (individually or in small groups) during the academic year. Students are expected to consult the advisors before subject registration.\n(c) Responsibilities of Students in Academic Advising\nThe advisee is an equal partner in the advising process. As advisees students are ultimately responsible for their educational choices and decisions. They are expected to:\nClarify personal abilities, interests, and goals for academics and life.\nContact and schedule regular appointments with their Departmental Academic Advisor and the Academic Advising Officer each year as required or when in need of assistance.\nPrepare for advising sessions. Understand and review their academic progress before meeting their Academic Advisor/Academic Advising Officer. Study the Programme Document (PD).\nBecome knowledgeable and adhere to institutional policies, procedures, and requirements.\nHave an open mind and be ready to consider advice given by teachers, Academic Advisors/ Academic Advising Officers and other staff.\nRead their PolyU e-mails and other important communications from the University and their Academic Advisor and Academic Advising Officer.\nAccess and use eStudent for academic updates, information updating, registration, and other purposes.\nAccept final responsibilityfor all decisions made and their graduation requirements.",
  "url": "https://www.polyu.edu.hk/ap/study/academic-advising"
 },
 {
  "text": "Post Date Company Programme Deadline \n21 Jun 2023\tAble Trillion Holdings Limited\n\tAble Trillion Summer Internship 2023\t4 Jul 2023\t\n9 May 2023\tSongshan Lake Materials Laboratory (SSLML)\tHong Kong Future S&T Talent Nurture Programme\t22 May 2023\t\n26 Apr 2023\tDepartment of Applied Physics, PolyU\t2023 AP Summer Internship\t2 Jun 2023\t\n11 Apr 2023\tIntertek Hong Kong\tIntertek Internship Trainee 2023\t1 May 2023\t\n30 Mar 2023\tUnilever China\t2023 Unilever Leadership Internship Programme-China\t3 Apr 2023\t\n21 Mar 2023\t\nAgriculture, Fisheries and Conservation Department, The HKSAR Government \n\tPost-Secondary Student Summer Internship Programme 2023 (5 posts)\t23 Mar 2023\t\n15 Mar 2023\tThe Hong Kong-Shanghai Youth Association\t2023 Shanghai-Hong Kong Tomorrow Leaders Internship Program (2023 滬港明日領袖實習計劃)\t26 Mar 2023, 6pm\t\n10 Jan 2023\tNano and Advanced Materials Institute (NAMI)\tNAMI Discovery Program 2023\t31 Mar 2023\t\n21 Dec 2022\tHuawei International Co. Limited\tICT Internship Trainee (Summer Intake)\tOpen until filled\t\n30 Jun 2022\tDepartment of Applied Physics, PolyU\t2022 PolyU AP STEM Intern\t3 Jul 2022\t\n4 May 2022\tDepartment of Applied Physics, PolyU\t2022 AP Summer Internship\t18 May 2022\t\n7 Apr 2022\tIntertek Hong Kong\tIntertek Internship Trainee 2022\t6 May 2022\t\n30 Mar 2022\tHong Kong Productivity Council\tHKPC Summer InnoTalent Programme 2022\t8 Apr 2022\t\n29 Mar 2022\tHKSTP\tHKSTP Summer Internship Programme (Commercial / Technical Stream)\t10 Apr 2022\t\n17 Mar 2022\tCyberport and the Home Affairs Bureau (HAB)\tYouth Start-up Internship Programme (YSIP)\tOpen until filled\t\n2 Mar 2022\tThe Hong Kong-Shanghai Youth Association\t2022 Shanghai-Hong Kong Tomorrow Leaders (Hong Kong) Internship Program\t30 Mar 2022\t\n27 May 2021\tDepartment of Applied Physics, PolyU\tSummer Intern - Marketing & Promotion\t1 Jun 2021\t\n27 May 2021\tDepartment of Applied Physics, PolyU\tSummer Intern - Research on Magnetic Materials\t1 Jun 2021\t\n25 Mar 2021\tHKSTP\tTechnology Leaders of Tomorrow Programme 2021\t15 Apr 2021\t\n1 Mar 2021\tIntertek Hong Kong\tInternship 2021\t16 Apr 2021\t\n13 Jan 2021\tPolytechnique Montreal\tSummer Research Internship Programme - Polytechnique Montreal\t15 Jan 2021\t\n11 Jan 2021\tASM Pacific Technology Limited\tInterns (2021 - 2022, 20+ Openings)\tOpen Until Filled\t\n17 Jun 2020\tDepartment of Applied Physics, PolyU\tIntern (Jun-Aug 2020)\tClosed\t",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/internship_general-listing-page"
 },
 {
  "text": "AP Entry Scholarships\nCategories of Entry Scholarships \nIn addition to the University Academic Scholarships given to outstanding HKDSE students (please refer to Study@PolyU for eligibility), Entry Scholarships from the Department will be granted if the admittee fulfills any of the categories blow: \nCategory I - Students attaining Level 5** in HKDSE subject(s)^@\nTier\nHKDSE Requirements\nScholarship Amount\n1\nLevel 5** in 3 or more subjects\nOne-off scholarship of HK$25,000\n2\nLevel 5** in 2 subjects\nOne-off scholarship of HK$20,000\n3\nLevel 5** in 1 subject\nOne-off scholarship of HK$15,000\nRemarks:\n^ The Extended Mathematics modules will also be taken into account for scholarship consideration. \n@ If one of the 5** subjects is Physics, the Department will provide HK$10,000 on top of the above scholarship amount.\nCategory II – Students with an aggregate HKDSE score of 27 or above for the Best 5 subjects#\nTier\nHKDSE Scores\nScholarship Amount\n1\n29 or above\nOne-off scholarship of HK$35,000\n2\n28\nOne-off scholarship of HK$30,000\n3\n27\nOne-off scholarship of HK$25,000\nRemarks:\n# For the purpose of calculating the admission scores, HKDSE level attainments will be converted to level points where Level 5**=8.5, 5*=7, 5=5.5, 4=4, 3=3, 2=2, 1=1 and Unclassified=0.\nStudents meeting the requirement for both categories I & II will get the Entry Scholarships ONCE for whichever category of higher value, being capped at the maximum amount received by a student per academic year as stipulated by the University guideline♦.\nRemarks:\n♦ A student can concurrently hold more than one scholarship administered by the University in an academic year if the total value of scholarships received by him/her does not exceed his/her annual tuition fee payable plus an allowance of HK$50,000 unless otherwise stipulated.\nDisclaimer: AP reserves the right to change the terms or withdraw the above scholarship. In case of any dispute/disagreement, AP’s decision is final.\nPost Entry Scholarships \nPost-entry Scholarships, Scholarships for Overseas Exchange/Internship and Service-Learning Scholarships are available at PolyU.\nYou could access to Student Affair Office for further details.",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/scholarships/entry-scholarships"
 },
 {
  "text": "Organization Programme Deadline \nDepartment of Applied Physics, PolyU\tRetiree Scholarship\tN/A\t\nChina Scholarship Council\tNewcastle University PhD Scholarships\t31 Jan 2021\t\nThe United Nations Academic Impact, Millennium Campus Network (MCN) \tMillennium Fellowship Class of 2021\t31 Jan 2021\t",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/scholarships/post-entry-scholarships"
 },
 {
  "text": "YEAR Awardee Award Description \n2023\tChi Chung TSOI\tDr Winnie S M Tang - PolyU Student Innovation and Entrepreneurship Scholarship\t\n2022\tChin Yuan ONG\tOutstanding Student Award 2022, Faculty of Science\t\n2022\tYu-jui TSAO\tPresidential Student Leadership Award 2022, Department of Applied Physics\t\n2022\n\tLonghui ZENG\tSecond Class Award in Technology Invention, the Guangdong Province Science and Technology Awards 2022\t\n2022\tLonghui ZENG\tThe World’s Top 2% Most-cited Scientists, Stanford University\t\n2022\t\nKa Chun LAM\n\tSilver Award - Global AI Challenge for Building E&M Facilities - AI Competition\t\n2021/22\tChinyuan ONG\tPresident Emeritus Professor Poon Chung-kwong Scholarship\t\n2021\tGOPINATH Gautham\tOutstanding Student Award 2021, Faculty of Applied Science and Textiles\t\n2020\tLouis Eng Hao TAN\tThe Greater Bay STEM Excellence Award - Bronze Award Winner\t\n2020\tYu LIU\tThe grantee of Hong Kong Jockey Club (HKJC) Scholarship\t\n2020\tRiver S.C. HO\tFAST Sponsorship for Internship Enhancement Programme, PolyU\t\n2019\tIr Arthur Lee Kam-hung\tOutstanding PolyU Alumni Award 2019\t\n2017\tStephen Ling-ming AU\tOutstanding PolyU Alumni Award 2017\t\n2016\tR. ZHONG \tOutstanding Student, Faculty of Applied Science and Textiles 2016\t\n2016\tY.D. ZHAO\tBest Student Poster Award, The 2nd International Conference on Two-dimensional Layered Materials, (organized by The Hong Kong Polytechnic University), 7-9 January 2016, Hong Kong\t\n2016\tC.W. LING\tLi Po Chun Charitable Trust Fund Scholarship in the academic year 2015/16\t\n2015\tT.H. CHUNG\tThe Best Student Poster Presentation Award, The 2015 E-MRS Fall Meeting and Exhibit (E-MRS 2015 Fall Meeting), (organized by European Materials Research Society), 15-18 September 2015, Warsaw, Poland\t\n2015\tC.W. LING\tBest Student Poster Award, The 18th Conference of The Physical Society of Hong Kong (18th PSHK), (organized by The Physical Society of Hong Kong), 13 June 2015, Hong Kong, China\t\n2015\tY.D. ZHAO\tBest Student Presentation Award, The 18th Conference of The Physical Society of Hong Kong (18th PSHK), (organized by The Physical Society of Hong Kong), 13 June 2015, Hong Kong, China\t\n2015\tC.C. TSOI \t二等獎, 第十四屆\"挑戰杯\"中航工業全國大學生課外學術科技作品競賽 (主辦單位：共青團中央、中國科辦、教育部、全國學聯、廣東省人民政府), November 2015, Hong Kong, China\t\n2014\tH.Y JIN\tBest Student Paper Award, 2014 IEEE Student Symposium on Electron Devices and Solid-State Circuits, (organized by IEEE ED/SSC Hong Kong Joint Chapter), 5 December 2014, Hong Kong, China\t\n2014\tK.W. LEUNG, L.W. TSOI, W.P. WONG and M.K. CHAN\tPASCO World Cup 2014 - Third Prize (Project: Research on Light Pollution in Hong Kong)",
  "url": "https://www.polyu.edu.hk/ap/experience-and-opportunities/student-awards-and-achievements"
 },
 {
  "text": "We are very pleased to inform all of you that our undergraduate student - LIU Yu, has received the Hong Kong Jockey Club (HKJC) Scholarship funded by the Hong Kong Jockey Club Charities Trust (the Trust). LIU has obtained the scholarship covering his tuition fee and living allowance for 2 years. Also, LIU is the only Chinese mainland students in Hong Kong who received the award this year.\nThe Hong Kong Jockey Club Scholarships\nEstablished in 1998, the Hong Kong Jockey Club Scholarships are dedicated to nurturing local talent. Under this Trust-Initiated Project, some HK$400 million in scholarships has so far been awarded to more than 500 young people to pursue their studies. The project has grown significantly over the past twenty years, expanding to include students with special educational needs, vocational education students and postgraduate students at the University of Oxford and Harvard University.\nThe Scholarships reward outstanding students, known as JC Scholars, for their intellect, character, leadership qualities and commitment to service. A Scholarship Secretariat has been set up to provide the Scholars with opportunities for learning, personal development and social service. It endeavours to help them become future community leaders.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2020/congratulations-our-student-obtained-the-hong-kong-jockey-club-scholarships/"
 },
 {
  "text": "Education and Academic Qualifications\nDoctor of Philosophy, Nanyang Technological University\nTeaching Area\nResearch Interests\nFirst-Principles Calculations \nNonadiabatic Molecular Dynamics \nPerovskite Materials \nPhotophysical Processes \nPolaron and Exciton, Surfaces and Interfaces \nMachine Learning in Materials Science ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-yin-jun/"
 },
 {
  "text": "Biography\nDr Zhuangchai LAI received his B.S. degree and M.E. degree from Sun Yat-sen University in 2009 and South China University of Technology in 2012, respectively. He got his Ph.D. degree from Nanyang Technological University (Singapore) in 2018. Prior to joining The Hong Kong Polytechnic University, he has published about 40 peer-reviewed journal papers with a H-index of about 28.\nEducation and Academic Qualifications\nDoctor of Philosophy, Nanyang Technological University\nMaster of Engineering, South China University of Technology\nBachelor of Science, Sun Yat-sen University\nResearch Interests\nControlled synthesis \nCharacterization of novel 2D materials ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-lai-zhuangchai/"
 },
 {
  "text": "Our Department is honoured to receive a donation of HK$ 1 million for establishing the \"Department of Applied Physics Retiree Scholarship\". AP wishes to expresses sincere gratitude to the donor for his generous support, and pledges to continue cultivating top talents for the society.\nThe \"Department of Applied Physics Retiree Scholarship\" aims at recognizing and encouraging undergraduate students with outstanding performances in any academic-related extracurricular activities or open competitions. Such activities include patent publications, being the lead authors on articles published in high-impact journals, receiving awards or funding from open competitions, etc. Each awardee will receive a scholarship up to HK$10,000.\nFor further information, please feel free to contact Dr. Peter Tsang via phone (+852 2766 5676) or email (yuen.tsang@polyu.edu.hk).\n香港理工大學應用物理學系衷心感激捐款人慷慨捐贈100萬元港幣，以作成立「應用物理學系退休員工獎學金」。本學系會繼續作育英才，培育頂尖畢業生，推進社會發展。\n「應用物理學系退休員工獎學金」旨在表揚和鼓勵本學系於學術性課外活動或公開比賽中表現超卓的本科生。該等活動包括：專利發表、以主要作者身份在著名期刊上發表文章、於重要公開競賽中獲得奬項/資助。每位獲奬學生將最多獲發一萬港元獎學金。\n如欲了解更多資訊，歡迎致電+852 2766 5676 或電郵至yuen.tsang@polyu.edu.hk，跟曾遠康博士查詢。",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/news/2023/ap-retiree-scholarship"
 },
 {
  "text": "All-state-state lithium batteries (ASSLBs) have gained worldwide attention because of the high ionic conductivity of SEs, intrinsic safety and increased energy density. In ASSLBs, solid-state electrolyte is a key component and interface is a big challenge. In this talk, I will talk about two types of solid-state electrolytes including sulfide-based electrolyte (focusing on interface) and halide-based electrolytes (focusing on synthesis and increase of ionic conductivity). \nIn the first part of this talk, I will demonstrate to apply atomic layer deposition/molecular layer deposition (ALD/MLD) for interface design between sulfide-based electrolyte and cathode material. Compared with polymer-based and oxide-based electrolytes, sulfide-based electrolyte generally exhibits the highest ionic conductivity (10-3 ~ 10-2 S/cm) and favorable mechanical property. However, the serious interfacial challenge, bad air stability, narrow electrochemical windows of sulfide-based electrolyte significantly impede development of sulfide-based ASSLBs. Generally, an artificial, uniform and ultrathin interfacial layer is critical to address these challenges. ALD) and MLD are unique coating techniques that can realize excellent coverage and conformal deposition with precisely controllable at the nanoscale level due to its self-limiting nature, which are ideal for addressing the challenges of interface in SSLBs. \nIn the second part of this talk, I will talk about halide-based electrolyte for ASSLBs. Compared with sulfide-based electrolyte, both experimental and theoretical results recently demonstrate that halide-based electrolytes have more advantages including high RT ionic conductivity (>10-3 S cm-1, theoretically possible 10-2 S cm-1), wide electrochemically stable window (possible up to 6 V), high air-stability, good stability toward oxide cathode materials, and even salable water synthesis strategy.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/may/16_dr-sun_research-seminar?sc_lang=en"
 },
 {
  "text": "Biography\nJianhua Hao received his BSc, MSc and PhD at Huazhong University of Science and Technology (HUST), China. After working at HUST, Penn State University, USA, University of Guelph, Canada and the University of Hong Kong, Jianhua Hao joined the faculty in the Hong Kong Polytechnic University in 2006. He is currently a Chair Professor of Materials Physics and Devices in Department of Applied Physics. Jianhua Hao has published more than 300 SCI papers, including the recently published high-impact journal papers as corresponding author in Nature Materials, Nature Commun., Adv. Mater., JACS, Angew. Chem. Int. Ed., Chem. Soc. Rev., Adv. Energy Mater., Nano Energy, ACS Nano, Adv. Funct. Mater., and Nano Lett.. He is the first inventor of 6 US patents. He serves as an Associate Editor of InfoMat (Wiley, IF: 25.405) and Editorial Board Member of several international journals, including Scientific Reports （NPG）and Advanced Optical Materials (Wiley). He is Member of Executive Board in Asian Electroceramics Association (AECA) and former Vice-President of Physical Society of Hong Kong (2015-2017). He has been General Chair/Lead Organizer/Symposium Chair/Organizing Committee Member for various international conferences. He was also invited to give a number of Plenary/Keynote/Tutorial/Invited Lectures in various international conferences. He serves reviewers for many journals such as Science, Nature Nanotech., Nature Reviews Materials, Nature Commun., Adv. Mater., JACS, Chem. Rev., Chem. Soc. Rev., Nano Energy., etc.. Prof. Hao is conferred as RGC Senior Research Fellow. He is selected as Chang Jiang Scholar Chair Professor by the Ministry of Education. He is elected as Fellow of the Optical Society (OSA Fellow), Fellow of Royal Society of Chemistry (FRSC), and Fellow of Institute of Physics (FInstP).",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-jh-hao"
 },
 {
  "text": "Education and Academic Qualifications\nDoctor of Philosophy, Institute of Metal Research, Chinese Academy of Sciences \nBachelor of Engineering, Tianjin University\nResearch Interests\nTwo-dimensional (2D) materials and device applications \nChemical vapor deposition of 2D materials and their heterostructures \n2D ferroelectrics \nNon-linear Hall effect of 2D materials ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-ma-teng"
 },
 {
  "text": "Biography\nProfessor Shu Ping Lau obtained his Ph.D degree in Materials Engineering from the University of Swansea in 1995. He joined Nanyang Technological University (NTU) as Assistant Professor in 1998. He joined the Hong Kong Polytechnic University (PolyU) in 2008 as a Professor. Prof Lau is a Chair Professor, and he has been the head of the Department of Applied Physics since 2013. He is also the Director of the University Research Facility in Materials Characterization and Device Fabrication and manages over US$20M worth of research facilities, including electrochemical atomic force microscopy, scanning transmission electron microscopy, and class 100 cleanroom. Prof Lau is a Fellow of the American Physical Society. He has published over 400 journal papers. He attracted over US$23 M in external research grants and completed over 25 research projects. Prof. Lau’s current research focuses on nanomaterials and energy materials, particularly the synthesis of 2D materials for optoelectronic, electrocatalysis, and energy storage applications. \nEducation and Academic Qualifications\nBachelor of Science, The Polytechnic of North London\nDoctor of Philosophy, University of Wales\nProfessional Qualifications\nFellow of the American Physical Society\nResearch Interests\nTwo-dimensional (2D) materials: graphene, graphene oxide, MoS2, SnS etc. \nOptoelectronic properties of graphene quantum dots \nStrain engineering in 2D materials ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-daniel-sp-lau"
 },
 {
  "text": "Prof Tom Tao WU\nChair Professor of Frontier Materials (Global STEM Professorship Scheme) \nCD624 \n2766 4616 \ntom-tao.wu@polyu.edu.hk \nBachelor of Science, Zhejiang University\nDoctor of Philosophy, University of Maryland, College Park\nHalide perovskite nanomaterials \nEpitaxial thin films of frontier materials \nFunctional mixed-dimensional heterostructures \nElectronics, iontronics, and optoelectronics ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-tom-wu"
 },
 {
  "text": "BSc(Hons) in Chemistry, National University of Singapore\nPh.D in Chemistry, Oxford University, Physical and Theoretical Chemistry Laboratory\nTwo dimensional materials for Quantum Technology \nSpin-optoelectronics of Two dimensional organic-inorganic hybrid perovskites \nTwo-dimensional covalent organic framework in Catalysis and Energy \nCatalysis for CO2 reduction ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-loh-kian-ping"
 },
 {
  "text": "Doctor of Philosophy, Nanjing University\nTeaching Area",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-feng-yan"
 },
 {
  "text": "Biography\nXuming Zhang is currently an associate professor with Department of Applied Physics, Hong Kong Polytechnic University. He received BEng degree in Precision Mechanical Engineering from the University of Science & Technology of China (USTC) in 1994, M.Eng. in Optical Engineering from Shanghai Institute of Optics and Fine Mechanics (SIOFM) in 1997, another M.Eng. in Microsystems from National University of Singapore (NUS) in 2000, and Ph.D. in Electrical & Electronic Engineering from Nanyang Technological University (NTU) in 2006. He has published about 100 journal papers with a H-index of about 30. He has filed 4 US patents and 6 China patents. \nBachelor of Engineering, University of Science and Technology of China\nMaster of Engineering, Shanghai Institute of Optics & Fine Mechanics\nMaster of Engineering, National University of Singapore\nDoctor of Philosophy, Nanyang Technological University\nTeaching Area\nMicrofluidics \nOptofluidics \nArtificial photosynthesis \nBiomimetics \nMicro-/nano-optics ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-xuming-zhang"
 },
 {
  "text": "Bachelor of Engineering (Mechanical Engineering), University of Hong Kong\nDoctor of Philosophy, Cambridge University\nTeaching Area",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-dennis-cw-leung"
 },
 {
  "text": "LEUNG, Chi Wah Dennis\nB.Eng (HKU); Ph.D (Cantab.)\nAssociate Head & Associate Professor\nDepartment of Applied Physics\nHong Kong Polytechnic University\nHung Hom, Hong Kong\nTel: (852) 2766 5670\nEmail: dennis.leung(a)polyu.edu.hk\nResearcher ID: D-2085-2012\nScopus ID: 22958301300 \nORCID: https://orcid.org/0000-0003-0083-6273",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Introduction.html"
 },
 {
  "text": "Professional Qualifications\nMember of Hong Kong Young Academy of Science ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-yang-chai"
 },
 {
  "text": "Bachelor of Science, The Chinese University of Hong Kong\nMaster of Philosophy, The Chinese University of Hong Kong\nDoctor of Philosophy, The Hong Kong Polytechnic University",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-kw-kwok"
 },
 {
  "text": "Bachelor of Science, Fudan University\nMaster of Science, Tsinghua University\nDoctor of Philosophy, Chinese Academy of Sciences",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-ji-yan-dai"
 },
 {
  "text": "Bachelor of Science, Shanghai Jiao Tong University\nMaster of Engineering, Shanghai Institute of Metallurgy\nDoctor of Philosophy, Nanyang Technological University",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-h-huang"
 },
 {
  "text": "Siu-Fung YU received B.(Eng.) from University College London, England in 1990 and Ph.D. from Cambridge University, England in 1993. He is now a professor in Department of Applied Physics, HKPU. His main research interest includes fundamental study, design and optimization of lasers. He has led to the design and fabrication of random laser diodes emitted at UV wavelength. He has published over 300 international technical papers including patents, journal and conferences papers, five book chapters and one book entitled 'Analysis and Design of Vertical-Cavity Surface-Emitting Lasers', 2003 Wiley, NY. \nBachelor of Engineering, University of London\nDoctor of Philosophy, University of Cambridge\nProfessional Qualifications\nSenior Member of the Institute of Electrical and Electronics Engineers\nRealization of ZnO random laser diodes and carbon-based lasers. \nAnalysis, design and fabrication of nanophotonics devices. \nAnalysis and design of semiconductor microcavity lasers. \nDesign and fabrication of perovskite based upconversion lasers. ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/prof-yu-siu-fung"
 },
 {
  "text": "Bachelor of Science, The University of Hong Kong\nDoctor of Philosophy, University of Michigan, Ann Arbor",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-lam-chi-hang"
 },
 {
  "text": "Bachelor of Science, The University of Manchester\nDoctor of Philosophy, The University of Manchester\nProfessional Qualifications\nMember of The Institute of Physics",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-yuen-hong-tsang"
 },
 {
  "text": "Dr. Ye Zhu is currently an assistant professor in the Department of Applied Physics, The Hong Kong Polytechnic University. He received his undergraduate degree from Tsinghua University in China, and his Ph.D from the University of Wisconsin-Madison in 2008. After graduation, he did postdoc in US and Australia, until joining The Hong Kong Polytechnic University in 2016. \nDr. Zhu has dedicated to developing cutting edge microscopy and spectroscopy techniques, and their applications on emerging materials. Applying these techniques, his team has made numerous breakthroughs, including the first discovery of novel 2D antiferroelectricity and ferroelasticity in indium selenide compound. He has published over 120 journal articles, including high-impact journals such as Nature, Nature Materials, Nature Energy, and Physical Review Letters. The impact of his publication is evidenced by over 6300 citations according to Scopus, with an H-index of 31. His strong track record has won him several professional awards such as the “Early Career Award” from the Hong Kong Research Grants Council in 2017, and the Young Scientist award from the International Federation of Societies for Microscopy (IFSM) in 2014.",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-ye-zhu"
 },
 {
  "text": "Doctor of Philosophy, National University of Singapore\n2D materials and device applications \nMolecularly thin 2D hybrid perovskites and their micro & nano device fabrications \n2D heterostructure studies (Molecularly thin 2D perovskite / TMDs / Graphene) \nStrain induced phenomena in soft molecularly thin perovskites and other 2D materials \nSpintronics study in 2D hybrid perovskites (Rashba effect and it coupled Ferroelectricity) ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-leng-kai"
 },
 {
  "text": "Dr Molly Li completed her PhD in Inorganic Chemistry in May 2018 from the University of Oxford. She has a broad foundation and experience in the chemistry of materials and applied catalysis in green energies and the environment, the focus of which has recently incorporated the design of efficient catalyst systems for turning waste to renewable fuels as well as the reversible hydrogen storage cycle based on methanol or ammonia conversion. \nBachelor of Science, National Cheng Kung University\nMaster of Science, National Cheng Kung University\nDoctor of Philosophy, University of Oxford\nHeterogeneous catalysis \nNanocatalysts \nRenewable fuel production \nChemical hydrogen storage ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-molly-meng-jung-li"
 },
 {
  "text": "Bachelor of Science, Lanzhou University\nMaster of Science, Lanzhou University",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-mingjie-li"
 },
 {
  "text": "Doctor of Philosophy, National University of Singapore\n2D materials \nElectrochemical/photo-catalysts \nHigh-throughput first-principle calculations/experiments \nPerovskite oxide interface \nPhysical vapor deposition \nMachine-learning accelerated materials innovation ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-yang-ming"
 },
 {
  "text": "Doctor of Philosophy, The Hong Kong University of Science and Technology ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-biao-zhang"
 },
 {
  "text": "Doctor of Philosophy, Nanjing University \nBachelor of Science, Nanjing University\nFunctional oxide thin films and interfaces \nMultiferroic materials and devices \nTwo-dimensional strongly correlated quantum phenomena \nHeterostructures based on two-dimensional oxide thin films \nOxide molecular beam epitaxy (Oxide-MBE), Scanning tunneling microscopy (STM), Transmission electron microscopy (TEM) ",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-ji-dian-xiang"
 },
 {
  "text": "The entry requirements are the University’s General Minimum Entry Requirements for Bachelor’s degree programmes, as specified below: \n1. For those applying on the basis of HKDSE results: \nLevel 3 in English Language and Chinese Language Level \nLevel 2 in Mathematics, Liberal Studies \nLevel 3 in one elective subject (Preference will be given to: a single physics subject/combined science with physics component)\nDiscover more details at: http://www51.polyu.edu.hk/eprospectus/ug/jupas/2020/js3985\n2. For those applying on the basis of other local qualifications:\nAn Associate Degree in Applied Science or Engineering, or a Higher Diploma in Applied Physics, Applied Optics, Optical Technology or Engineering in relevant areas.\nFor further detail: http://www51.polyu.edu.hk/eprospectus/ug/jupas/2021/js3985\n3. Other non-local qualifications deemed to be acceptable for admission purpose\nFor overseas students, please refer to:https://www51.polyu.edu.hk/eprospectus/ug/international/guidelines-on-non-local-qualifications\nApplicants attaining good results in Mathematics and Physics are preferred.\nFor Mainland students, please refer to: \nhttp://www51.polyu.edu.hk/eprospectus/ug/jee/2020/js3985",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bachelor-of-science-honours-in-engineering-physics/bsc-ep_entrance-req"
 },
 {
  "text": "Introduction\nEntrance Requirement\nProgramme Structure\nSummary of the credit requirements for different subject areas:",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bachelor-of-science-honours-in-engineering-physics/bsc-ep_prog-structure"
 },
 {
  "text": "Introduction\nSharing from Our Industrial Partners\nEntrance Requirement\nProgramme Structure\nProgramme Flyer\n\"如果有同時修讀物理及AI的畢業生，下一個項目，我一定不會放過這類人材。\" \n\"建築行業未來對應用物理及AI人才需求很大，大家不要等，盡快加入深層次的數碼世界。\" \n\"電子科技和新能源科技是未來無爭議性的全世界最大發展機遇。\" \n\"AI 是未來大趨勢。\" ",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/js3030-bsc-physics-x-aida-or-ie/bsc-phy-ai-ie_partners-sharing"
 },
 {
  "text": "The entry requirements are the University’s General Minimum Entry Requirements for Bachelor’s degree programmes, as specified below: \n1. For those applying on the basis of HKDSE results: \nLevel 3 in English Language and Chinese Language Level \nLevel 2 in Mathematics, Liberal Studies \nLevel 3 in one elective subject (Preference will be given to: a single physics subject/combined science with physics component)\nMore details at: https://www51.polyu.edu.hk/eprospectus/ug/jupas/general-entrance-requirements \n2. Other non-local qualifications deemed to be acceptable for admission purpose\nFor overseas students, please refer to:https://www51.polyu.edu.hk/eprospectus/ug/international/guidelines-on-non-local-qualifications\nApplicants attaining good results in Mathematics and Physics are preferred.\nFor Mainland students: Application details will be announced shortly.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/js3030-bsc-physics-x-aida-or-ie/bsc-phy-ai-ie_entrance-req"
 },
 {
  "text": "Introduction\nSharing from Our Industrial Partners\nEntrance Requirement\nProgramme Structure\nProgramme Flyer\nBSc (Hons) in Physics with a Secondary Major in AI & Data Analytics (AIDA) \nGUR + Physic DSR + AIDA DSR = Total 133 credits\nCAR\t12 credits\t\nLanguage & Communication Subjects\t9 credits\t\nFreshman Seminar - From Matters to Intelligence\t3 credits\t\nLeadership and Intra-Personal Development \t3 credits\t\nService Learning \t3 credits\t\nHealthy Lifestyle \t0 credit\t\nTOTAL\t30 credits\t\n\tCredit\tProgramme Booklet\t\nCore subjects\t52 credits\tP. 7-9 \t\nTOTAL\t67 credits\n\t\t\n\tCredit\tProgramme Booklet\t\nCore subjects\t30 credits\tP. 7-9\t\nElective subjects\t6 credits\tP. 7-9; P. 36-37\t\nTOTAL\t36 credits\n\t\t\nBSc (Hons) in Physics with a Secondary Major in Innovation and Entrepreneurship (IE) \nGUR + Physic DSR + IE DSR = Total 133 credits\nCAR\t12 credits\t\nLanguage & Communication Subjects\t9 credits\t\nFreshman Seminar - From Matters to Intelligence\t3 credits\t\nLeadership and Intra-Personal Development \t3 credits\t\nService Learning \t3 credits\t\nHealthy Lifestyle \t0 credit\t\nTOTAL\t30 credits\t\n\tCredit\tProgramme Booklet\t\nCore subjects\t67 credits\tP. 10-12\t\nTOTAL\t67 credits\n\t\t\n\tCredit\tProgramme Booklet\t\nCore subjects\t21 credits\tP. 10-12\t\nElective subjects\t15 credits\tP. 10-12; P. 38-39\t\nTOTAL\t36 credits\n\t\t\nProgramme Booklet \nFull document showing programme requirement and information for 2022/23 intake cohort ",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/js3030-bsc-physics-x-aida-or-ie/bsc-phy-ai-ie_prog-structure"
 },
 {
  "text": "Introduction\nEntrance Requirement\nProgramme Structure\nEntry Requirements\nThe minimum entrance requirement is an Associate Degree in Applied Science or Engineering, a Higher Diploma in Applied Physics, Applied Optics, Engineering of relevant areas, or the equivalent. Alternatively, a student who is in the programme of BSc (Hons) in Engineering Physics (EP) and has completed the first 2 years of study can opt for entering this study route.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bsc-ep-opto/bsc-ep-opto_entrance-requirement"
 },
 {
  "text": "Summary of the credit requirements for different subject areas:\nLanguage and Communication Requirements (LCR)\n4 credits\nService-Learning\n3 credits\nCluster Area Requirements (CAR)\n- Complete at least one subject in two of the four cluster areas, among which you have to fulfill the Reading and Writing Requirements in Chinese and English, and China Studies Requirement (CSR).\n6 credits\nDiscipline-Specific Requirement (DSR)\n52 credits\nTotal\n65 credits\nProgramme Booklet\n2021/2022 (Updated as of Sep 2021)\n2020/2021 \n2019/2020\n2018/2019\n2017/2018\n2016/2017",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/bsc-ep-opto/bsc-ep-opto_prog-structure"
 },
 {
  "text": "Summary of the credit requirments for differenct subject areas\nHigher Diploma Language and Communication Requirements (HDLCR) \t9 credits\t\nHigher Diploma Language and Communication Requirements (HDLCR) \t9 credits\t\nCluster Areas Requirement (CAR) \n- As a Higher Diploma student, you are required to take at least two CARs. In addition, you shall also fulfill the China Studies Requirement (CSR) embedded in some CAR subjects that helps you understand aspects of Chinese culture, history and contemporary developments.\n\t6 credits\nDiscipline-Specific Requirement (DSR) \t47 credits\t\nTotal\tMin. 62 credits \t\nProgramme Booklet\n2021/2022 (Updated as of Sep 2021)\n2020/2021\n2019/2020\n2018/2019\n2017/2018\n2016/2017\n2015/2016",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/higher-diploma-in-applied-physics/hd-ap_prog-structure"
 },
 {
  "text": "In addition to the General Minimum Entrance Requirements of The Hong Kong Polytechnic University for 2-year full-time Higher Diploma programme, the specific requirements of this programme are as follows:\n1. For those applying on the basis of HKDSE, the subject requirements are:\n5 subjects at level 2 including English Language and Chinese Language.\nThe elective subjects should preferably be Physics, Mathematics, Chemistry and Combined Science.\nApplicants should preferably have studied any one of the extended modules in mathematics.\n2. For those applying on the basis of other qualifications, the specified qualifications are:\nDiploma in Computer & Communications Engineering, Computer & Information Engineering, Electrical Engineering, Electronic & Communications Engineering, Industrial Engineering & Information Management, Manufacturing Engineering, Manufacturing Engineering Management, Mechanical Engineering, Product Engineering Design & Technology Management, Production & Industrial Engineering, Telecommunications Engineering or equivalent.",
  "url": "https://www.polyu.edu.hk/ap/study/undergraduate-programmes/higher-diploma-in-applied-physics/hd-ap_entry-requirement"
 },
 {
  "text": "A Bachelor’s degree with honours in science, engineering or equivalent qualifications. Preference will be given to applicants with relevant work experience in microelectronics industries.\nIf you are not a native speaker of English, and your Bachelor’s degree or equivalent qualification is awarded by institutions where the medium of instruction is not English, you are expected to fulfil the University’s minimum English language requirement for admission purpose. Please refer to the “Admission Requirements” section for details.\nAdditional documents required:\nTranscript / Certificate \tRequired \t\nEmployer's recommendation\tOptional\t\n有理学、工学荣誉学士学位或同等学历。有微电子工业相关工作经验的申请者优先。\n如果您的母语不是英语，并且您的学士学位或同等学历是由教学语言不是英语的机构授予的，需要满足大学入学的最低语言要求。细节请参考“入学要求”相关部分。\n其他需要的文件：",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials/msc-microelectronics-entrance-requirement"
 },
 {
  "text": "Career Scope\nAlumni Sharing\nFeatured Research\nPhysicists/Engineers for Semiconductor/Material Development, Material/Manufacture Process, Process Technical Development, Microelectronics, IC Design, Optimized Operations, Packaging, Validation and Applications\nFurther education\n半导体材料开发、集成电路设计、半导体工艺工程师、器件工程师、微电子封装与测试\n继续进修\nNon-local graduates are eligible to apply Immigration Arrangements for Non-local Graduates (IANG) to stay and work in the HKSAR. \n非本地毕业生合资格申请非本地毕业生留港/回港就业安排(IANG)申请留港/回港工作。\nCompanies that provide IC design\n\tLocation \t\t\nHuawei Tech. Investment Co., Ltd \n\tHong Kong\t\t\nHong Kong Applied Science and Technology Research Institute (ASTRI)\n\tHong Kong\t\t\nASI - Advanced Semiconductor Integrations Ltd\n\tHong Kong\t\t\nSolomon Systech Limited\n\tHong Kong\t\t\nAppoTech Ltd \nHiSilicon (华为海狮)\n\tMainland China\t\t\nCompanies that provide IC packaging equipment \tLocation \t\nASMPT Limited\n\tHong Kong\t\nAtom Semiconductor\n\tHong Kong\t\nCompanies that provide IC manufacturing\tLocation \t\nSemiconductor Manufacturing International Corporation (SMIC)\n\tMainland China\t\nHuahong group\n\tMainland China \t",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials/msc-microelectronics-career-scope"
 },
 {
  "text": "Career Scope\nAlumni Sharing\nFeatured Research\n1-year MSc programme｜Total 30 credits \n18 credits of Core Subjects \nSubject Code Name of Subject Subject Description Credit \nAMA503\tStatistics and Data Analytics\tFundamental theories of statistics and data analysis, find patterns in data to improve processes in electronic design automation and semiconductor manufacturing.\t\n3\nAP5001\tSemiconductor Materials and Processing\tDetailed knowledge and understanding of materials science and the processing of semiconductor materials.\t\nAP5002\tSemiconductor Devices and Systems\tStudy the operational principles and underlying physical characteristics of silicon-based semiconductor electronic devices such as diodes, and transistors as well as their integrations.\t\nAP5003\tIntegrated Circuits Design\tDigital and analogue integrated circuit design. Simulation, and optimization of electronics integrated circuits.\t\nAP5004\tIntegrated Circuit Processing and Laboratory\tTo make familiar with the microfabrication concepts, materials, and methods that are typically used in a cleanroom especially for the fabrication of integrated circuits.\t3\t\nAP5017\tAdvanced Materials Analysis and Characterization\tAdvanced instrumentation for materials analysis to students from microelectronics and material science disciplines.\t3\t\n12 credits of Elective Subjects \nSubject Code Name of Subject Subject Description Credit \nAP5011\tMachine Vision for Semiconductor Manufacturing and Inspections\tIntroduction of machine vision for semiconductor manufacturing inspection such as microstructural inspection of wafers and IC packaging inspection.\t3\t\nAP5006\tThin Film Materials and Preparation Technologies\tFundamental knowledge on modern syntheses of thin films. Detailed descriptions of various thin-film deposition techniques used in industrial processing are given. Some important industrial applications of dielectric thin-film technologies are explained.\t3\t\nAP5007\tMEMS (microelectromechanical systems) and Sensors\tRecent progress on the design and fabrication of MEMS. Understanding the detection and actuation principles of MEMS. The applications of MEMS in sensing of motional, thermal, optical, chemical, and biological characteristics. Integration of MEMS with CMOS integrated circuits.\t3\t\nAP5008\tMicroelectronics Packaging and Reliability\tKnowledge of materials and techniques for integrated circuit packaging, an understanding of different failure mechanisms, the study of testing techniques, and reliability requirements for the assembly and packaging of integrated circuits.\t3\t\nAP5009\tEmerging Memory Technologies\tIntroduce concepts of the memory sub-system from the device cell structures to the array and architecture design, emphasizing the industry trend and cutting-edge technologies. The concept of the memory hierarchy is used as an outline throughout the whole course. The in-memory computing and in-sensor computing for artificial intelligence will be also covered.\t3\t\nAP5010\tArtificial Intelligence for Materials Science\tFundamentals of artificial intelligence algorithms and their applications in materials science.\t3\t\nAP5020\tProject\tIndependent project carried out under the supervision of a faculty member with a topic to be proposed by the students.\t6\t\nProgramme Requirement Document \nFull document showing programme requirement and information for 2023/24 intake cohort ",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials/msc-microelectronics-programme-structure"
 },
 {
  "text": "Career Scope\nAlumni Sharing\nFeatured Research\nMicroelectronics has become the spine of the modern world that one can hardly imagine the life without mobile phones, computers, TVs and other electronic devices. Yet the field is still developing fast, enabling more and more functions and applications, and of course, with a lot of opportunities for career. To enter such a field, you will need a good guide providing sound knowledge but also fostering interest. \nGraduate of PhD in Applied Physics\nSenior Engineer, Huawei technologies Co Ltd\nDr WANG Xianhan\nI was lucky to meet the remarkable faculty at Department of Applied Physics in PolyU. They not only have strong expertise in the related fields, but also a strong emphasis on innovation and research. The professors are willing to provide support and advices to students anytime. They inspired me the interest on the field, which I found beneficial in my later endeavor. I have learnt not only practical knowledge and physical nature, but also analytical thinking, communication, and interpersonal skills. For me it was a great practice as the beginning of my career. \nNot to mention the beautiful and vivid campus, located in the center of Hong Kong directly feeling the pulse of modern life. Thinking all of this are enabled by the technologies in the microscopic world, while sitting in the campus and starting a career in this field, how exciting it is.\nThe extensive training in the PhD program equips me with the cutting-edge knowledge of microelectronic devices, the creative science thinking, the problem-solving skills, and most importantly, the passion for exploring nature, which benefit me all my life. \nGraduate of PhD in Applied Physics\nAssistant Professor\nSchool of Micro-Nano Electronics, Zhejiang University\nDr ZHAO Yuda\nPolyU is the starting point to pursue my goal of being a scientist. The extensive training in the PhD program equips me with the cutting-edge knowledge of microelectronic devices, the creative science thinking, the problem-solving skills, and most importantly, the passion for exploring nature, which benefit me all my life. As an Assistant Professor in Zhejiang University, I dedicate myself to the frontier research in the field of integrated circuits and I hope to develop worthwhile technologies to benefit the whole society.",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials/msc-microelectronics-alumni-sharing"
 },
 {
  "text": "Career Scope\nAlumni Sharing\nFeatured Research\nBioinspired in-sensor visual adaptation for accurate perception\nNature Electronics, 2022\nHyperlink\nExploring the potential of near-sensor and in-sensor computing systems\nTech Xplore, 2020\nHyperlink\nIn-sensor computing for machine vision\nNovel optoelectronic device works like human retina\nNature Nanotechnology, 2020\nHyperlink",
  "url": "https://www.polyu.edu.hk/ap/study/taught-postgraduate-progromme/master-of-science-in-microelectronics-technology-and-materials/msc-microelectronics-featured-research"
 },
 {
  "text": "To register for the degree of MPhil, a student must hold:\nA Bachelor’s degree with first or second class honours from a recognised university; OR\nOther academic qualifications which are deemed to be equivalent.\nTo register for the degree of PhD, a student must normally hold a postgraduate degree containing a significant research component, such as a dissertation, conferred by a recognised university.\nIn exceptional circumstances, applicants other than those stipulated above may be admitted directly to the PhD programme. For example, applicants with a Bachelor’s degree with First Class Honours, or the equivalent. Such applicants may be required to pass an examination.\nPolyU may accept other equivalent qualifications. The decision is made on an individual basis.\nEnglish Language Requirements\nThe requirements for those who do not have a degree for which English was the language of instruction at a recognised university are:\nAn overall score of at least 6.5 in the International English Language Testing System (IELTS); OR\nA Test of English as a Foreign Language (TOEFL) score of 80 or above for the Internet-based test or 550 or above for the paper-based test.\nAll English language test scores are considered valid for two years after the date of the test.",
  "url": "https://www.polyu.edu.hk/ap/study/rpg-prog/mphil-or-phd-in-physics-and-material-science/mphil-phd_entrance-req"
 },
 {
  "text": "With effect from 2021/22 cohort onwards, all RPg students shall be required to take the Research Language Skills Assessment (RLSA) in their first semester of study at PolyU to be arranged by ELC. Based on their performance of the RLSA, students will need to take relevant subjects according to the following arrangement.\nRLSA performance1\tRequired English enhancement subjects \t\nBand 1 in both Writing, and Speaking tasks\texempted\t\nBand 2 or above in both Writing, and Speaking tasks\tENGL6016: Advanced Academic English for Research Students: Publishing and Presenting\t\nBand 3 or below in either Writing, or Speaking tasks\t\nELC6011 and ELC6012\nELC6011: Presentation Skills for Research Students ELC6012: Thesis Writing for Research Students\nNote 1: Band 1 is the highest grade and Band 5 the lowest.\nBefore thesis submission, students are required to take and pass the above English enhancement subjects.\n4-Year PhD\nCoursework Components\tCredits \tResearch Components \t\nEthics: Research, Professional & Personal Perspectives \t1 \t\nStudents are required to submit a thesis when their study is completed. The thesis should summarize the findings of the student’s original and independent research.\nAn oral examination on the submitted thesis is required for the student. The oral examination comprises the following parts where the sequence is to be determined by individual board of examiners (BoE).\nResearch Seminars III\t4 \t\nPracticum \t2 \t\n5 Elective Subjects\t15 \t\nTotal \t22\t\n3-Year PhD\nCoursework Components\tCredits\tResearch Components\t\nEthics: Research, Professional & Personal Perspectives\t1\t\nStudents are required to submit a thesis when their study is completed. The thesis should summarize the findings of the student’s original and independent research.\nAn oral examination on the submitted thesis is required for the student. The oral examination comprises the following parts where the sequence is to be determined by individual board of examiners (BoE).\nResearch Seminars II\t3\t\nPracticum\t2\t\n3 Elective Subjects\t9\t\nTotal\t15\n2-Year MPhil\nCoursework Components\tCredits\tResearch Components\t\nEthics: Research, Professional & Personal Perspectives\t1\t\nStudents are required to submit a thesis when their study is completed. The thesis should summarize the findings of the student’s original and independent research.\nAn oral examination on the submitted thesis is required for the student. The oral examination comprises the following parts where the sequence is to be determined by individual board of examiners (BoE).\nResearch Seminars I\t2\t\n2 Elective Subjects\t6\t\nTotal\t9\t\nProgramme Booklet\n2022/2023\n2021/2022\n2020/2021\n2019/2020\n2018/2019\n2017/2018\n2016/2017\n2015/2016",
  "url": "https://www.polyu.edu.hk/ap/study/rpg-prog/mphil-or-phd-in-physics-and-material-science/mphil-phd_prog-structure"
 },
 {
  "text": "Dennis Leung’s Page\nIntroduction \nTeaching \nProfessional \nPersonal \nTeaching philosophy\nCourse Taught\nTeaching grants",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Teaching.html"
 },
 {
  "text": "Dennis Leung’s Page\nIntroduction \nTeaching \nProfessional \nPersonal \nBibliography\nServices",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Professional.html"
 },
 {
  "text": "Introduction \nTeaching \nProfessional \nPersonal \n-Hiking tracks in Hong Kong\n-PhD Comics: “Piled Higher and Deeper”\n-Materials Science Teaching and Learning Packages (Cambridge University)\n-Naxos Music Library (PolyU only)\n-List of academic journals\nUseful forms for download:\n-Room access form\n-Petty cash claims form\n-Student helper application form\n-Part time payment form (research project)\n- Part time payment form (teaching project)",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Personal.html"
 },
 {
  "text": "Dennis Leung’s Page\nTeaching \nProfessional \nPersonal \nResearch interest\nPublications\nStudents/\nGrants",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Research.html"
 },
 {
  "text": "-Encourages self-motivated learning\nStudents should take a pro-active approach in obtaining knowledges that are of importance, relevance and interest to them. An important attribute of a successful graduate, apart from the professional knowledge acquired at school, is the ability to adapt to the change of the work environment; these have to be achieved through a self-motivated learning process.\nDuring the learning process, teachers should provide a close guidance and sufficient encouragement to the students. It is through such a process students can build a solid foundation of knowledge. Spoon-feeding type of education can hardly cultivate learning incentive for most students, and is not of the benefit for their future development.\n-Develops critical thinking of students\nSecondary school teaching in Hong Kong has puts undue emphases on the memorization of facts. While such an education style provided students with solid knowledge foundations, further exploration and utilization of these knowledges would require higher-level learning skills (assimilation of knowledges, application in unfamiliar situations, for example). Students should be encouraged to think critically on what they are taught in the class.\n-Cater for the needs of students\nThere is usually a spectrum of abilities among students of the same class, and it is unrealistic to expect them to achieve the same standard by the end of the course. However, it is unfair for any students to be neglected because of their abilities, be it superior or inferior compared with the average students. A successful teacher, I believe, should motivate all of the students by providing them with encouragement throughout the study, while also giving them challenges so as to raise their interests. A range of strategies should be utitlized so all students can be benefited from the learning process.",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/TeachingPhlio.html"
 },
 {
  "text": "Semester 1:\nAP30001 Applied Acoustics\nSemester 2:\nAP10006 Physics II\nCourses taught:\nAP102 College Physics II\nAP10005 Physics I\nAP10006 Physics II\nAP10009 University Physics II\nAP208 Engineering Science in Products\nENG240 Materials Technology for Design\nCC2404 Applied Physics and Instrumentation in Health Care",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/courses.html"
 },
 {
  "text": "Doctor of Engineering, Tsinghua University",
  "url": "https://www.polyu.edu.hk/ap/people/academic-staff/dr-zhao-jiong"
 },
 {
  "text": "- 'Alumni sharing for 1st-year degree and higher-diploma students' (CoP:AA Academic Advising Funding AY17/18, 2018, 10k).\n- 'Laboratory in your pocket - Real-time hand-on experiments on Arduino-Smartphone Platform' (as Co-I) (Quality Education Fund, HKSAR, 2018, 1.99M)\n- 'Developing Active Learning Pedagogies and Mobile Applications in University STEM Education' (as Co-I) (UGC Teaching and Learning Related Proposals 2016 - 2019, 2017, 15M). \n- 'Augmented Reality Models for Enhanced Learning Experience of Physics Concepts' (Departmental TDG 2016-19, PolyU, 2017, 180k)\n- 'Basic Experimental Skill Sets for Science Undergraduates Through a Blended Learning Approach', (Cross-department LTC Project, 2016, 400k)\n- 'Flipped Classrooms and Interactive video lectures in Mathematics, Engineering and Physics' (as Co-I) (Cross-department LTC Project, 2016, 450k)\n- 'Secondary School Science Laboratory utilizing smart phones as detectors: Physics Experimental Apps for Flipped Classroom Learning' (as Co-I) (Quality Education Fund, HKSAR, 2016, 1.56M).\n- 'HK Jockey Club \"PolyU Serves\" Community Service Project (YTM&KC)' (as Co-I) (Hong Kong Jockey Club, 2016, 120k).\n- 'Online physics helpdesk via blackboard collaborate for enhanced effectiveness of off-class tutoring' (eLearning and Blended Learning Development Grants 2014-17, PolyU, 2016, 100 k).\n- 'Short Video Clips for Self-Paced Learning of Physics-Related Maths Techniques' (as Co-I) (Quality Education Fund, HKSAR, 2016, 150k).\n- 'Blended physics tutorials via interactive screencasting step-by-step problem set solutions' (as Co-I) (eLearning and Blended Learning Development Grants 2014-17, PolyU, 2015, 100 k).\n- 'Laboratory with no limits: AnyTime, Anywhere (Real-time access Remote Laboratory Platform for S4-6 students)' (as Deputy PI) (Quality Education Fund, HKSAR, 2014, 1.93M).\n- 'Real-time remote physics experiments for secondary school students via Internet' (as Co-I) (JP Morgan STEM Service Learning Project Funding, PolyU, 2014, 145k).\n- 'Writing mobile Apps for physics experiments' (as Co-I) (JP Morgan STEM Service Learning Project Funding, PolyU, 2014, 107k).\n- 'eLearning-based Physics Laboratory course' (eLearning and Blended Learning Development Fund 2013-16, PolyU, 2014, 498k).\n- 'Complementary Laboratory Experience for Science Service Teaching via Remote Accessible Experiments' (Faculty-wide TDG 2012-15, PolyU, 2013, 483k)\n- 'Blackboard-Based Math Bridging Module for Physics Service-Teaching Subjects' (Departmental TDG 2012-15, PolyU, 2013, 120k)\n- 'Development of an Institutional-wide e-Learning Platform with Diagnostic e-Assessment and e-Learning Packages using Learn@PolyU (理學網) to Enhance Entry Students’ Underpinning Skills and Knowledge' (as Co-I) (Institutional TDG 2012-15, PolyU, 2013, 1.53 M)\n- 'Physics Experiments Utilizing Smart Phones as Detectors' (as Co-I) (Departmental TDG 2012-15, PolyU, 2013, 119k)\n- LabAway: Remote-Controlled Physics Laboratory' (Departmental LTC, PolyU 2010, 120k). (See here for a video demonstration).",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/innovations.html"
 },
 {
  "text": "Sep 17 – now: \nAssociate Head, Department of Applied Physics, \nHong Kong Polytechnic University\nJul 15 – now: \nAssociate Professor, Department of Applied Physics, \nHong Kong Polytechnic University\nJul 09 – Jun 2015: \nAssistant Professor, Department of Applied Physics, \nHong Kong Polytechnic University\nSept 05 – Jun 09: \nLecturer, Department of Applied Physics, \nMay 05 – Jun 05: \nVisitor, Inorganic Materials Science Group, \nUniversity of Twente, the Netherlands\nApr 03 – Mar 05:\nCroucher Foundation Research Fellow, \nDepartment of Materials Science & Interdisciplinary Research Centre in Nanotechnology, \nUniversity of Cambridge, UK\nOct 99 – Dec 02:\nPh.D candidate, Department of Materials Science, \nUniversity of Cambridge, UK",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Bibliography.html"
 },
 {
  "text": "-IEEE\nMember (2008 - now)\nMagnetic Society Hong Kong Chapter: \n- Chairperson (2015 - now)\n- Founding Vice Chairperson (2009 - 2014)\n-Physical Society of Hong Kong:\nMember (2005 - now)\nCouncil member (2006 - 2008) \nExecutive Committee member (2007 - 2011)\n- Editor:\nProceedings for the 2013 Asia-Pacific Data Storage Conference (APDSC'13), Hualien, Taiwan.\nProceedings for the 3rd International Symposium on Advanced Magnetic Materials and Applications (ISAMMA 2013), Tainan, Taiwan. \n- Reviewer:\nEuropean Journal of Physics D\nIEEE Transactions on Magnetics\nInternational Journal of Modern Physics B\nJournal of Applied Physics\nJournal of Physics: Condensed Matter\nJournal of Physics D: Applied Physics\nNew Journal of Physics\nOptics & Laser Technology\nPhilosophical Magazine A\nScientific Reports\nSemiconductor Science and Technology\nSensors and Actuators A: Physical\n- Public Services:\nMember of School Management Committee, N.T. Heung Yee Kuk Yuen Long District Secondary School, Hong Kong.",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Profservice.html"
 },
 {
  "text": "ACS Journals\n-ACS Nano\n-ACS Applied Materials & Interfaces\n-Chemical Reviews\n-Journal of American Chemical Society\n-Journal of Physical Chemistry A / B /C / Letters \n-Langmuir \n-Nano Letters",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Journals.html"
 },
 {
  "text": "[2022]\n174. 'Comparison of topotactic and magnetic structures for manganite oxide films', Yukuai Liu, Sixia Hu, Boyang Zhao, Xinrong Shi, Xiezong Zeng, Chi Wah Leung, Chuanwei Huang, Ceram. Int. 48, 12515 (2022).\n173. 'Multistep nucleation visualized during solid-state crystallization', Zhouyang Zhang, Yujie Tang, Yiran Ying, Junqing Guo, Min Gan, Yateng Jiang, Chunxian Xing, Shanshan Pan, Ming Xu, Yangbo Zhou, Haitao Zhang, Chi Wah Leung, Haitao Huang,� Chee Leung Mak and Linfeng Fei, Mater. Horiz., 9, 1670 (2022).\n172. 'The Effectiveness of Data Augmentation of SEM Images on a Small Database Based on Deep-Learning Intelligence', C.H. Wong, S.M. Ng, C.W. Leung, A.F. Zatsepin, Braz. J. Phys., 52, 59 (2022).\n171. 'Plasmonic Nanocavity Induced Coupling and Boost of Dark Excitons in Monolayer WSe2 at Room Temperature', Tsz Wing Lo; Xiaolin Chen; Zhedong Zhang; Qiang Zhang; Chi Wah Leung; Anatoly V. Zayats; Dangyuan Lei, Nano. Lett., 22, 1915 (2022).\n170. 'Modulating Antiferromagnetic La0.35Sr0.65 MnO3 via Low-Voltage Pulsing Across a Ferroelectric Copolymer Gate Dielectric', X.W. Zhao, H.F. Wong, Y,K. Liu, S.M. Ng, J.M. Liang, K.K. Lam, W.F. Cheng, C.L. Mak, C.W. Leung, IEEE Trans. Magn., 58, 4200205 (2022).\n169. 'Observation of Interfacial Antiferromagnetic Coupling Between Ferrimagnetic Garnet Thin Films', J.M. Liang, X.W. Zhao, S.M. Ng. H.F. Wong, Y.K. Liu, C.L. Mak, C.W. Leung, IEEE Trans. Magn., 58, 2200205 (2022).\n[2021]\n168. 'Probing electron transport in plasmonic molecular junctions with two-photon luminescence spectroscopy', Qiang Zhang, Danjun Liu, Qun Ren ORCID logo, Nicolae C. Panoiu, Li Lin, Jian Ye, Yang Huang, Shao-Ding Liu, Chi Wah Leung and Dangyuan Lei, Nanophotonics, 10, 2467 (2021).\n167. 'Strain dependent structure and anomalous Hall effect in Pt/Tb3Fe5O12/Ga3Gd5O12 heterostructure grown on Y3Al5O12 substrates', Y.K. Liu, J.M. Liang, H.F. Wong, S.M. Ng, C.L. Mak, C.W. Leung, J. Magn. Magn. Mater., 536, 168130 (2021).\n166. 'Tunable piezoresistivity of low percolation threshold micro-nickel wires/PDMS conductive composite regulated by magnetic field', Shaoyu Niu, Shan Wang, Qilong Yan, Zheyi Han, Xiang Lou, Qiyang Li, Zongrong Wang, Chi Wah Leung, Shaoxing Qu, J. Mater. Chem. C, 9, 5908 (2021). \n165. 'Visualization of Bubble Nucleation and Growth Confined in 2D Flakes', Zhouyang Zhang, Jun Qiang, Shensong Wang, Ming Xu,Min Gan, Zhenggang Rao, Tingfang Tian, Shanming Ke, Yangbo Zhou, Yongming Hu, Chi Wah Leung, Chee Leung Mak, Linfeng Fei, Small, 17, 2103301 (2021).\n164. 'Upside-Down Molding Approach for Geometrical Parameter-Tunable Photonic Perovskite Nanostructures', Lebin Nie; Wai Kit Ng; ZhiFu Liang; Xingang Ren; Tingbin Yang; Guanding Mei; Chi Wah Leung; Kam Sing Wong; Wallace C.H. Choy, ACS Appl. Mater. Interface, 13, 27313 (2021).\n163. 'Extending the near-infrared band-edge absorption spectrum of silicon by proximity to a 2D semiconductor', V. Apicella, T.A. Fasasi, H.F. Wong, D.C.W. Leung and A. Ruotolo, Appl. Surf. Sci., 538, 147803 (2021).\n[2020]\n162. 'Modulating Magnetism in Ferroelectric Polymer-Gated Perovskite Manganite Films with Moderate Gate Pulse Chains', H.F. Wong, S.M. Ng, W. Zhang, Y.K. Liu, P.K.J. Wong, C.S. Tang, K.K. Lam, X.W. Zhao, Z.G. Meng, L.F. Fei, W.F. Cheng, D. von Nordheim, W.Y. Wong, Z.R. Wang, B. Ploss, J.Y. Dai, C.L. Mak, A.T.S. Wee and C.W. Leung, ACS Appl. Mater. Inter., 12, 56541 (2020).\n161. 'Plasmon-Induced Optical Magnetism in an Ultrathin Metal Nanosphere-Based Dimer-on-Film Nanocavity', Y.J. Meng, Q. Zhang, D.Y. Lei, Y.L. Li, S.Q. Li, Z.Z. Liu, W. Xie and C.W. Leung, Laser Photon. Rev., 14, 2000068 (2020).\n160. 'High-Temperature Anomalous Hall Effect in a Transition Metal Dichalcogenide Ferromagnetic Insulator Heterostructure' S.M. Ng, H.C. Wang, Y.K. Liu, O.A. Wong, H.M. Yau, C.H. Suen, Z.H. Wu, C.W. Leung and J.Y. Dai, ACS Nano, 14, 7077 (2020).\n159. 'Nanoimprint Lithography-Directed Self-Assembly of Bimetallic Iron-M (M=Palladium, Platinum) Complexes for Magnetic Patterning', Z.G. Meng, G.J. Li, S.C. Yiu, N.Y. Zhu, Z.Q. Yu, C.W. Leung, I. Manners and W.Y. Wong, Angew. Chem. 59, 11521 (2020).\n158. 'Exchange bias effect in epitaxial La0.35Sr0.65MnO3/La0.7Sr0.3MnO3 bilayers: Impact of antiferromagnet growth conditions', X.W. Zhao, H.F. Wong, Y.K. Liu, S.M. Ng, W.F. Cheng, C.L. Mak and C.W. Leung, Vacuum, 175, 109280 (2020).\n157. 'Interfacial Tm3+ moment-driven anomalous Hall effect in Pt/Tm3Fe5O12 heterostructure', Y.K. Liu, H.F. Wong, S.M. Ng, C.L. Mak and C.W. Leung, J. Magn. Magn. Mater., 501, 166454 (2020).\n156. 'Effect of Thickness on the Optical and Electrical Properties of ITO/Au/ITO Sandwich Structures', K.K. Lam, S.M. Ng, H.F. Wong, L.F. Fei, Y.K. Liu, K.H. Chan, H. Ye, C.W. Leung and C.L. Mak, ACS Appl. Mater. Inter., 12, 13437 (2020).\n[2019]\n155. 'Magnetic-Assisted Transparent and Flexible Percolative Composite for Highly Sensitive Piezoresistive Sensor via Hot Embossing Technology', S. Wang, G.R. Chen, S.Y. Niu, K.F. Chen, T. Gan, Z.R. Wang, H.Z. Wang, P.Y. Du, C.W. Leung and S.X. Qu, ACS Appl. Mater. Inter., 11, 48331 (2019).\n154.'Synthesis and controlled morphology of Ni@Ag core shell nanowires with excellent catalytic efficiency and recyclability', S. Wang, S.Y. Niu, H.S. Li, K.K. Lam, Z.R. Wang, P.Y. Du, C.W. Leugn and S.X Qu, Nanotechnology, 30, 385603 (2019).\n153. 'Enhanced Anomalous Hall Effect in Pt/CoO Heterostructures by Ferrimagnetic Insulator Gating', Y.K. Liu, H.F. Wong, X.Y. Guo, S.M. Ng, K.K. Lam, Y. Zhu, C.L. Mak and C.W. Leung, ACS Appl. Electron. Mater., 1, 1099 (2019).\n152. 'Photo-induced anomalous Hall effect in nickel thin films', T. A. Fasasi, A. Ruotolo, X.W. Zhao, C.W. Leung and K.W. Lin, J. Magn. Magn. Mater. 485, 82 (2019).\n151. 'Fabrication and Characterization of Epitaxial Gd-Doped SBN Thin Films', K.K. Lam, K.H. Chan, S.M. Ng, H.F. Wong, Y.K. Liu, C.W. Leung and C.L. Mak, Phys. Stat. Sol. A, 216, 1800660 (2019).\n150. 'Lithographic patterning of ferromagnetic FePt nanoparticles from a single-source bimetallic precursor containing hemiphasmidic structure for magnetic data recording media', Z.G. Meng, C.L. Ho, H.F. Wong, Z.Q. Yu, N.Y. Zhu, G.J. Li, C.W. Leung and W.Y. Wong, Sci. China: Mater., 62, 566 (2019).\n149. 'Tuning ferromagnetic properties of LaMnO3 films by oxygen vacancies and strain', Y.K. Liu, H.F. Wong, K.K. Lam, C.L. Mak and C.W. Leung, J. Magn. Magn. Mater., 7/4, 85 (2019).\n148. 'Thermal Redistribution of Exciton Population in Monolayer Transition Metal Dichalcogenides Probed with Plasmon−Exciton Coupling Spectroscopy', T.W. Lo, Q. Zhang, M. Qiu, X.Y. Guo, Y.J. Meng, J.J. Xiao, W. Jin, C.W. Leung and D.Y. Lei, ACS Photonics, 6, 411 (2019).\n147. 'Rectify Effect of Pedot:PSS/WS2 Heterostructure' K.H. Chan, S.M. Ng, H.F. Wong, C.W. Leung and C.L. Mak, Phys. Sol. St. A, 216, 1800829 (2019).\n146. 'Magnetoresistive Sensor Development Roadmap (non-recording applications)', C. Zheng, K. Zhu, S.C. de Freitas, J.Y. Chang, J.E. Davies, P. Eames, P.P. Freitas, O. Kazakova, C.G. Kim, C.W. Leung, S.H. Liou, A. Ognev, S.N. Piramanayagam, P. Ripka, A. Samardak, K.H. Shin, S.Y. Tong, M.J. Tong, S.X. Wang, S.S. Xue, X.L. Yin and P.W.T. Pong, IEEE Trans. Magn., vol. 55, 0800130 (2019).\n145. 'Observable Two-Step Nucleation Mechanism in Solid-State Formation of Tungsten Carbide', L.F. Fei, X.L. Gan, S.M. Ng, H. Wang, M. Xu, W. Lu, Y.C. Zhou, C.W. Leung, C.L. Mak and Y. Wang, ACS Nano, 13, 681 (2019).\n[2018]\n144. 'In Situ Observation of Ice Formation from Water Vapor by Environmental SEM', Z.Y. Zhang, L.F. Fei, Z.G. Rao, D.J. Liu, C.W. Leung and Y. Wang, Cryst. Growth Design, 18, 6602 (2018).\n143. 'Gate-Controlled Transport Properties in Dilute Magnetic Semiconductor (Zn, Mn)O Thin Films', H.F. Wong, S.M. Ng, Y.K. Liu, K.K. Lam, K.H. Chan, W.F. Cheng, D. von Nordheim, C.L. Mak, B. Ploss and C.W. Leung, IEEE Trans. Magn., 54, 4200104 (2018).\n142. 'Edge decoration of MoS2 monolayer with ferromagnetic CoFe nanoparticles', Z.G. Meng, C.L. Ho, G.J. Li, S.M. Ng, H.F. Wong, C.W. Leung, W.Y. Wong, Mater. Res. Exp., 5, 115010 (2018).\n141. 'Anomalous Hall effect in Pt/Tb3Fe5O12 heterostructure: Effect of Compensation Point', Y.K. Liu, H.F. Wong, K.K. Lam, K.H. Chan, C.L. Mak and C.W. Leung, J. Magn. Magn. Mater., 468, 235 (2018).\n140. 'Raman studies of MoS2 under strain at different uniaxial directions', C.K. Tan, W.C. Wong, S.M. Ng, H.F. Wong, C.W. Leung and C.L. Mak, Vacuum, 153, 274 (2018).\n139. 'Effect of post-annealing on laser-ablation deposited WS2 thin films', H. Wang, S.M. Ng, H.F. Wong, W.C. Wong, K.K. Lam, Y.K. Liu, L.F. Fei, Y.B. Zhou, C.L. Mak, Y. Wang and C.W. Leung, Vacuum, 152, 239 (2018).\n138. 'Controllable synthesis of nickel nanowires and its application in high sensitivity, stretchable strain sensor for body motion sensing', S. Wang, K.F. Chen, M. Wang, H.S. Li, G.R. Chen, J. Liu, L.H. Xu, Y. Jian, C.D. Meng, X.Y. Zheng, S.Y. Liu, C. Yin, Z.R. Wang, P.Y. Du, S.X. Qu and C.W. Leung, J. Mater. Chem. C, 6, 4737 (2018).\n137. 'Percolative multi-susceptible PVDF/NZFO composite films with triply controlled high dielectric and magnetic properties', W.J. Zhao, J.Q. Gong, H.F. Wong, Z.R. Wang, C.W. Leung, N. Ma and P.Y. Du, J. Appl. Phys., 123, 104104 (2018).\n136. 'A ferroelectric relaxor polymer-enhanced p-type WSe2 transistor', C. Yin, X.D. Wang, Y. Chen, D. Li, T. Lin, S. Sun, H. Shen, P.Y. Du, J.L. Sun, X.J. Meng, J.H. Chu, H.F. Wong, C.W. Leung, Z.R. Wang and J.L. Wang, Nanoscale, 10, 1727 (2018).\n135. 'Development of orthogonal resilient materials for tuned mass dampers', P.L. Tam, C.W. Leung, C.L. Mak, W. Ho and T. Cai, Notes Num. Fluid Mech. Multi. Des. 139, 585 (2018).\n134. 'Three-dimensional macroporous graphene monoliths with entrapped MoS2 nanoflakes from single-step synthesis for high-performance sodium-ion batteries', L.F. Fei, M. Xu, J. Jiang, S.M. Ng, L.L. Shu, L. Sun, K.Y. Xie, H.T. Huang, C.W. Leung, C.L. Mak and Y. Wang, RSC Adv., 8, 2477 (2018).\n133. 'Magnetotransport properties of Ca0.8La0.2IrO3 epitaxial films', Y.K. Liu, H.F. Wong, S.M. Ng, K.K. Lam, C.L. Mak and C.W. Leung, Mater. Lett. 213, 135 (2018)\n[2017]\n132. 'Spin-Valve Junction with Transfer-Free MoS2 Spacer Prepared by Sputtering', W.C. Wong, S.M. Ng, H.F. Wong, C.L. Mak and C.W. Leung, IEEE Trans. Magn. 53, 1600205 (2017).\n131. 'Ni antidot structure via single-step anodization of Al/Ni films' S.M. Ng, W.C. Wong, X. Fang, H. Ye and C.W. Leung, Solid St. Electron. 138, 73 (2017).\n130. 'Enhanced Tunability of Electrical and Magnetic Properties in (La,Sr)MnO3 Thin Films via Field-assisted Oxygen Vacancy Modulation', H.F. Wong, S.M. Ng, W.F. Cheng, Y.K. Liu, X.X. Chen, D. von Nordheim, C.L. Mak, J.Y. Dai, B. Ploss and C.W. Leung, Solid St. Electron. 138, 56 (2017).\n129. 'Effect of Post-Annealing on Sputtered MoS2 films', W.C. Wong, S.M. Ng, H.F. Wong, W.F. Cheng, C.L. Mak and C.W. Leung, Solid St. Electron. 138, 62 (2017).\n128. 'CoFe2O4 Nanoparticle-Integrated Spin-Valve Thin Films Prepared by Interfacial Self-Assembly', C.P. Jiang, P.H. Chan, C.W. Leung and P.W.T. Pong, J. Phys. Chem. C, 121, 22508 (2017).\n127. 'One-pot synthesis of ferromagnetic FePd nanoparticles from single-source organometallic precursors and size effect of metal fraction in polymer chain', Z.G. Meng, G.J. Li, N.Y. Zhu, C.L. Ho, C.W. Leung and W.Y. Wong, J. Organomet. Chem., 849 - 850, 10 (2017).\n126. 'Exchange bias study of sub-100 nm-diameter CoFeB/IrMn antidot and nanodot arrays fabricated by nanosphere lithography', X. Li, C.W. Leung, C.C. Chiu, K.W. Lin, M.S. Chan, Y. Zhou and P.W.T. Pong, Phys. Lett. A, 381, 2709 (2017).\n125. 'Observation of Room-Temperature Magnetoresistance in Monolayer MoS2 by Ferromagnetic Gating', W.J. Jie, Z.B. Yang, F. Zhang, G.X. Bai, C.W. Leung and J.H. Hao, ACS Nano, 11, 6950 (2017).\n124. 'Self-assembled thin films of Fe3O4-Ag composite nanoparticles for spintronic applications', C.P. Jiang, C.W. Leung and P.W.T. Pong, Appl. Surf. Sci., 419, 692 (2017).\n123. 'Structural, magnetic and transport properties of fully epitaxial LaMnO3/LaAlO3 multilayers', Y.K. Liu, H.F. Wong, S.Z. Huang, S.X. Hu, S.M. Ng, K.K. Lam, C.L. Mak and C.W. Leung, Mater. Lett., 205, 230 (2017). \n122. 'Reduced magnetic coercivity and switching field in NiFeCuMo/Ru/NiFeCuMo synthetic-ferrimagnetic nanodots', X. Li, C.W. Leung, C.C. Chiu, K.W. Lin, M. Chan, Y. Zhou and P.W.T. Pong, Appl. Sur. Sci., 410, 479 (2017).\n121. 'Patterning of L10 FePt nanoparticles with ultra-high coercivity for bit-patterned media', Z.G. Meng, G.J. Li, H.F. Wong, S.M. Ng, S.C. Yiu, C.K. Lam, C.W. Leung, I. Manners and W.Y. Wong, Nanoscale, 9, 731 (2017).\n120. 'Magnetically assembled iron oxide nanoparticle coatings and their integration with pseudo-spin-valve thin films', C.P. Jiang, C.W. Leung and P.W.T. Pong, J. Mater. Chem.C, 5, 252 (2017).\n[2016]\n119. 'Atomic-scale mechanism on nucleation and growth of Mo2C nanoparticles revealed by in-situ transmission electron microscopy', L.F. Fei, S.M. Ng, W. Lu, M. Xu, L.L. Shu, W.B. Zhang, Z.H. Yong, T.Y. Sun, C.H. Lam, C.W. Leung, C.L. Mak and Y. Wang, Nano. Lett. 16, 7875 (2016).\n118. 'WS2 nanotube formation by sulphurization: Effect of precursor tungsten film thickness and stress', S.M. Ng, H.F. Wong, W.C. Wong, C.K. Tan, S.Y. Choi, C.L. Mak, G.J. Li, Q.C. Dong and C.W. Leung, Mater. Chem. Phys., 181, 352 (2016).\n117. 'Porphyrin-based metallopolymers: synthesis, characterization and pyrolytic study for the generation of magnetic metal nanoparticles', Q.C. Dong, W.S. Qu, W.Q. Liang, F.F. Tai, K.P. Guo, C.W. Leung, Y.H. Lo and W.Y. Wong, J. Mater. Chem. C, 4, 5010 (2016).\n116. 'Nanopatterned L10-FePt nanoparticles from single-source metallopolymer precursors for potential application in ferromagnetic bit-patterned media magnetic recording', Z.G. Meng, G.J. Li, S.M. Ng, H.F. Wong, S.C. Yiu, C.L. Ho, C.W. Leung and W.Y. Wong, Polymer Chem. 7, 4467 (2016).\n115. 'Magnetic-Field-Assisted Assembly of Anisotropic Superstructures by Iron Oxide\nNanoparticles and Their Enhanced Magnetism', C.P. Jiang, C.W. Leung and P.W.T. Pong, Nano Res. Lett., 11, 189 (2016).\n114. 'Facile fabrication of highly ordered poly(vinylidene fluoride-trifluoroethylene) nanodot arrays for organic ferroelectric memory', H.J. Fang, Q.F. Yan, C. Geng, N.Y. Chan, K. Au, J.J. Yao, S.M. Ng, C.W. Leung, Q. Li, D. Gao. H.L.W. Chan and J.Y. Dai,, J. Appl. Phys., 119, 014104 (2016).\n113. 'Metallopolymer precursors to L10-CoPt nanoparticles: synthesis, characterization, nanopatterning and potential application', Q.C. Dong, W.S. Qu, W.Q. Liang, K.P. Guo, H.B. Xue, Y.Y. Guo, Z.G. Meng, C.L. Ho, C.W. Leugn and W.Y. Wong, Nanoscale, 8, 7068 (2016).\n112. 'Magnetism as a tool for band-gap narrowing of zinc oxide films prepared by sol-gel method', Q. Shao, C.S.Q. Qi, O.L. Yeung, Y.S. Foo, S.M. Ng, J.A. Zapien, C.W. Leung and A. Ruotolo, J. Sol-Gel Sci. Technol., 77, 240 (2016).\n[2015]\n111. 'Effect of Synthesis Conditions on Physiochemical Properties of Lauric Acid Coated Superparamagnetic Iron Oxide Nanoparticles', L. Li, C.W. Leung and P.W.T. Pong, IEEE Trans. Magn., 51, 1001405 (2015).\n110. 'Characterization and bio-binding ability study on size-controllable highly monodisperse magnetic nanoparticles', L. Li, A. Ruotolo, C.W. Leung, C.P. Jiang and P.W.T. Pong, Microelectron. Eng., 144, 61 (2015).\n109. 'Low-field Switching Four-state Nonvolatile Memory Based on Multiferroic Tunnel\nJunctions', H.M. Yau, Z.B. Yan, N.Y. Chan, K. Au, C.M. Wong, C.W. Leung, F.Y. Zhang, X.S. Gao and J.Y. Dai, Sci. Rep., 5, 12826 (2015).�\n108. 'Microstructural and magnetic characterization of ion-beam bombarded [Ni80Fe20-Cr]50 thin films', C. Zheng, K.W. Lin, C.H. Liu, H.F. Hsu, C.W. Leung, W.H. Chen, T.H. Wu, R.D. Desautels, J. van Lierop and P.W.T. Pong, Vacuum, 118, 85 (2015).\n107. 'Ferromagnetism in Ti-doped ZnO thin films', Q. Shao, C. Wang, J.A. Zapien, C.W. Leung and A. Ruotolo, J. Appl. Phys., 117, 17B908 (2015).\n106. 'Investigation of pyrolysis temperature in the one-step synthesis of L10 FePt nanoparticles from a FePt-containing metallopolymer', Q.C. Dong, G.J. Li, H. Wang, P.W.T. Pong, C.W. Leung, I. Manners, C.L. Ho, H. Li and W.Y. Wong, J. Mater. Chem. C, 3, 734 (2015).\n[2014]\n105. 'Capacitance effect on the oscillation and switching characteristics of spin torque oscillators', T. Zeng, Y. Zhou, C.W. Leung, P.P.T. Lai and P.W.T. Pong, Nano. Res. Lett., 9, 597 (2014).\n104. 'ITO/Au/ITO sandwich structure for near-infrared plasmonics', X. Fang, C.L. Mak, J.Y. Dai, K. Li, H. Ye and C.W. Leung, ACS Appl. Mater. Inter., 6, 11543 (2014).\n103. 'Nanostructured Iron-Doped Indium Tin Oxide Films: Synthesis and Characterization', Q. Shao, P.S. Ku, J.A. Zapien, C.W. Leung and A. Ruotolo, IEEE Trans. Magn., 50, 2400604 (2014).\n102. �Influence of LaNiO3 Buffer Layer on the Magnetic Properties of Thin Perovskite Manganites�, Y.K. Chan, S.M. Ng, W.C. Wong and C.W. Leung, IEEE Trans. Magn., 50, 2503404 (2014).\n101. �Investigating the Uneven Current Injection in Perovskite-Based Thin Film Bipolar Resistance Switching Devices by Thermal Imaging�, Z. Luo, H.K. Lau, P.K.L. Chan and C.W. Leung, IEEE Trans. Magn., 50, 3000804 (2014).\n100. �Resistive Switching in Perovskite-Oxide Capacitor-Type Devices�, Z. Luo, H.K. Lau, P.K.L. Chan and C.W. Leung, IEEE Trans. Magn., 50, 3000904 (2014).\n99. �Magnetoresistance of Manganite-Cobalt Ferrite Spacerless Junctions�, H.F. Wong, K. Wang, C.W. Leung and K.H. Wong, IEEE Trans. Magn., 50, 4400204 (2014).\n98. 'Impedance analysis of secondary phases in a Co-implanted ZnO single crystal', M. Younas, L. L. Zou, M. Nadeem, Naeem-ur-Rehman, S. C. Su, Z. L. Wang, W. Anwand, A. Wagner, J. H. Hao, C. W. Leung, R. Lortz and F. C. C. Ling, Phys. Chem. Chem. Phys., 16, 16030 (2014). \n97. 'Thermal stability of sectorial split-drain magnetic field-effect transistors', W.S. Tam, C.W. Kok, S.L. Siu, W.M. Tang, C.W. Leung and H. Wong, Microelectron. Reilab., 54, 1115 (2014).\n96. 'Chemical states and ferromagnetism in heavily Mn-substituted Zinc Oxide thin films', Q. Shao, P.S. Ku, X.L. Wang, W.F. Cheng, J.A. Zapien, C.W. Leung, F. Borgatti, A. Cambardella, D. Valentin, R. Ciprian and A. Ruotolo, J. Appl. Phys. 115, 153902 (2014).\n95. 'Influence of center fractal patterns on the transmission spectrum and electric field intensity enhancement in gold/glass plasmonic nanostructures', K.F. Ng, K.L. Jim and C.W. Leung, Microelectron. Eng. 119, 79 (2014).\n94. 'Facile Generation of L10-FePt Nanodot Arrays from a Nanopatterned Metallopolymer Blend of Iron and Platinum Homopolymers', Q.C. Dong, G.J. Li, C.L. Ho, C.W. Leung, P.W.T. Pong, I. Manners and W.Y. Wong, Adv. Funct. Mater. 24, 857 (2014).\n93. 'Split-Drain Magnetic Field-Effect Transistor Channel Charge Trapping\nand Stress Induced Sensitivity Deterioration', Z.Y. Yang, S.L. Siu, W.S. Tam, C.W. Kok, C.W. Leung, P.T. Lai, H. Wong, W.M. Tang and P.W.T. Pong, IEEE Trans. Magn., 50, 4000304 (2014).\n92. 'Synthesis and Morphology Control of Gold/Iron Oxide Magnetic\nNanocomposites via a Simple Aqueous Method', L. Li, K. Y. Mak, C. W. Leung, C. H. Leung, A. Ruotolo, K.Y. Chan, W. K. Chan, and P. W. T. Pong, IEEE Trans. Magn., 50, 2300505 (2014).\n91. 'Novel Hybrid Au/Fe3O4 Magnetic Octahedron-like Nanoparticles with Tunable Size', L. Li, Y.m. Du, K.Y. Mak, C.W. Leung and P.W.T. Pong, IEEE Trans. Magn., 50, 2300405 (2014).\n90. 'Synthesis and Characterization of Silica-Encapsulated Iron Oxide Nanoparticles', Y.M. Du, L. Li, C.W. Leung, P.T. Lai and P.W.T. Pong, IEEE Trans. Magn., 50, 2000404 (2014).\n89. 'Non-volatile, electric control of magnetism in Mn-substituted ZnO', X.L. Wang, Q. Shao, C.W. Leung, R. Lortz and A. Ruotolo, Appl. Phys. Lett.104, 062409 (2014) .\n88. 'Growth and characterization of nonpolar, heavily Mn-substituted ZnO films', Q. Shao, P. S. Ku, X. L. Wang, W. F. Cheng, C. W. Leung, and A. Ruotolo, J. Appl. Phys, 115, 17D703 (2014).\n[2013]\n87. 'Pressure effect on the Raman and photoluminescence spectra of Eu3+- doped Na2Ti6O13 nanorods', Q.G. Zeng, G.T. Yang, F. Chen, J.Y. Luo, Z.M. Zhang, C.W. Leung, Z.J. Ding and Y.Q. Sheng, High Press. Res., 33, 734 (2013).\n86. 'Magnetism as a probe of the origin of memristive switching in p-type antiferromagnetic NiO', X. L. Wang, P. S. Ku, Q. Shao, W. F. Cheng, C. W. Leung, and A. Ruotolo, Appl. Phys. Lett., 103, 223508 (2013).\n85. 'Enhanced charge extraction in organic solar cells through electron accumulation effects induced by metal nanoparticles', F.X. Xie, W.C.H. Choy, W.E.I. Sha, D. Zhang, S.Q. Zhang, X.C. Li, C.W. Leung and J.H. Hou, Energy Environ. Sci., 6, 3372 (2013).\n84. 'Magnetism of Iron Oxide Nanoparticles and Magnetic Biodetection', L. Li, C.W. Leung and P.W.T. Pong, J. Nanoelectron. Optoelectron., 8, 397 (2013).\n83. 'Effect of Oxygen Stoichiometry on Microstructural and Magnetic Properties of FePt/TaOx Bilayer Fabricated by Ion-Beam-Bombardment Deposition', G.J. Li , C.W. Leung , Y.C. Chen, J.H. Hsu , A.C. Sun , K.W. Lin and P.W.T. Pong, IEEE Trans. Magn., 49, 3310 (2013).\n82. 'Detection of 10-nm Superparamagnetic Iron Oxide Nanoparticles Using Exchange-Biased GMR Sensors in Wheatstone Bridge', L. Li, K.Y. Mak, C.W. Leung, S.M. Ng, Z.Q. Lei and P.W.T. Pong, IEEE Trans. Magn., 49, 4056 (2013).\n81. 'Transient Sensitivity of Sectorial Split-Drain Magnetic Field-Effect Transistor', Z.Y. Yang, S.L. Siu, W.S. Tam, C.W. Kok, C.W. Leung, P.T. Lai, H. Wong and P.W.T. Pong, IEEE Trans. Magn., 49, 4048 (2013).\n80. 'Effect of annealing temperature on microstructure and magnetism of FePt/TaOx bilayer', G. Li, C.W. Leung, Y.-C. Chen, K.-W. Lin, A.-C. Sun, J.-H. Hsu and P.W.T. Pong, Microelectron. Eng., 110, 241 (2013).\n79. 'Enhanced structural and magnetic ordering of FePt/TiOx bilayers by ion-beam deposition and annealing', G. Li, C.W. Leung, Y.-J. Wu, A.-C. Sun, J.H. Hsu, P.T. Lai, K.-W. Lin and P.W.T. Pong, Microelectron. Eng., 110, 250 (2013).\n78. 'Quantitative analysis of hepatic cell morphology and migration in response to nanoporous and microgrooved surface structures', K.Y. Mak, L. Li, C.M. Wong, S.M. Ng, C.W. Leung, J. Shi, H.K. Koon, X. Chen, C.S.K. Mak, M.M. Chan and P.W.T. Pong, Microelectron. Eng., 111, 396 (2013).\n77. 'Sterilization on dextran-coated iron oxide nanoparticles: Effects of autoclaving, filtration, UV irradiation, and ethanol treatment', L. Li, K.Y. Mak, J. Shi, C.H. Leung, C.M. Wong, C.W. Leung, C.S.K. Mak, K.Y. Chan, N.M.M. Chan, E.X. Wu and P.W.T. Pong, Microelectron. Eng., 111, 310 (2013).\n76. 'Effect of synthesis conditions on the properties of citric-acid coated iron oxide nanoparticles', L. Li, K.Y. Mak, C.W. Leung, K.Y. Chan, W.K. Chan, W. Zhong and P.W.T. Pong, Microelectron. Eng., 110, 329 (2013).\n75. 'Feature Development on Prepatterned Elastomer Surface upon Ion Implantation', Y. Sun, H.Y. Wang, T. Xiong, P.K. Chu and C.W. Leung, Microelectron. Eng., 110, 346 (2013) (Highlighted in Advances in Engineering) .\n74. 'Patterning Micro- and Nano- Structured FePt by Direct Imprint Lithography', G.J. Li, Q.C. Dong, J.Z. Xin, C.W. Leung, P.T. Lai, W.Y. Wong and P.W.T. Pong, Microelectron. Eng., 110, 192 (2013).\n73. 'Oxygen-Stoichiometry-Dependent Microstructural and Magnetic properties of CoPt Capped with Ion-Beam-Assisted Deposited TiOx', G.J. Li, C.W. Leung, C. Shueh, Y.J. Wu, K.W. Lin, A.C. Sun, J.H. Hsu, P.T. Lai and P.W.T. Pong, Surf. Coat. Tech., 228, S354 (2013).\n72. 'Exchange bias effects of NiFe/NiO bilayers through ion-beam bombardment on the NiO surface', G.J. Li, C.W. Leung, C. Shueh, H.F. Hsu, H.R. Huang, K.W. Lin, P.T. Lai and P.W.T. Pong, Surf. Coat. Tech., 228, S437 (2013).\n71. ' Investigation of interface states in single-negative metamaterial layered structures based on the phase properties', J.A. Zheng, Y.H. Chen, Z.F. Chen, X.G. Wang, P. Han, Z.H. Yong, Y. Wang, C.W. Leung and C. M. Soukoulis, Opt. Express, 21, 16742 (2013).\n70. 'Polarization-independent efficiency enhancement of organic solar cells by using 3-dimensional plasmonic electrode', X.H. Li, W.C.H. Choy, X.G. Ren, J.Z. Xin, P. Lin and C.W. Leung, Appl. Phys. Lett., 102, 153304 (2013).\n69. 'Semitransparent organic solar cells with hybrid monolayer graphene/metal grid as top electrodes', P. Lin, W.C.H. Choy, D. Zhang, F.X. Xie, J.Z. Xin and C.W. Leung, Appl. Phys. Lett. 102, 113303 (2013).\n68. 'Effect of the magnetic order on the room-temperature band-gap of Mn-doped ZnO thin films', X.L. Wang, C.Y. Luan, Q. Shao, A. Pruna, C.W. Leung, R. Lortz, J.A. Zapien and A. Ruotolo, Appl. Phys. Lett., 102, 102112 (2013). (One of the Most Accessed Articles in APL in Year 2014)\n67. 'Hierarchical nanoporous alumina by soft ultraviolet nanoimprint preparttering-assisted anodization', S.M. Ng, J.Z. Xin, H.F. Wong, H.K. Lau, H.T. Huang and C.W. Leung, J. Nanoeng. Nanomanuf. 3, 126 (2013).\n66. 'High Dynamic Range Organic Temperature Sensor ', X.C. Ren, P.K.L. Chan, J.B. Lu, B.L. Huang and D.C.W. Leung, Adv. Mater. 25, 1291 (2013)(See Frontispiece picture). \n65. 'Non-volatile, reversible switching of the magnetic moment in Mn-doped ZnO films', X.L. Wang, Q. Shao, C.W. Leung and A. Ruotolo, J. Appl. Phys. 113, 17C301 (2013).\n64. 'A UV-ozone treated amorphous barium-strontium titanate dielectric thin film for low driving voltage flexible organic transistors', Z.R. Wang, X.C. Ren, C.W. Leung, S.Q. Shi and P.K.L. Chan, J. Mater. Chem. C, 1, 3825 (2013).\n63. 'Temporal modulation of light intensity via 1D time-variant photonic crystal structure', Z.H. Yong, Z.F. Chen, Y.H. Chen, C.W. Leung, H.L.W. Chan. B. Li and Y. Wang, Prog. Electromagn. Res. 135, 627 (2013).\n[2012]\n62. 'Comparative In Vitro Cytotoxicity Study on Uncoated Magnetic Nanoparticles: Effects on Cell Viability, Cell Morphology, and Cellular Uptake', L. Li, K. Y. Mak, J. Shi, H. K. Koon, C. H. Leung, C. M. Wong, C. W. Leung, C. S. K. Mak, N. M. M. Chan, W. Zhong, K. W. Lin, E. X. Wu, and P. W. T. Pong, J. Nanosci. Nanotechno., 12, 9010 (2012).\n61. 'Synthesis and Characterization of Self-assembled Monolayer and Bilayer Carboxyl-group Functionalized Magnetic Nanoparticles', L. Li, K. Y. Mak, C. W. Leung, K.Y. Chan, W.K. Chan, W. Zhong and P. W. T. Pong, IEEE Trans. Magn. 48, 3299 (2012). \n60. 'Understanding the formation of ultrafine spinel CoFe2O4 nanoplatelets and their magnetic properties', W.C. Liu, Y.K. Chan, J.Z. Cai, C.W. Leung, C.L. Mak, K.H. Wong, F.M. Zhang, X.S. Wu, and X. D. Qi, J. Appl. Phys. 112, 104306 (2012).\n59. 'Time-variant 1D photonic crystals using flowing microdroplets', Z.F. Chen, Z.H. Yong, C.W. Leung, X.M. Zhang, Y.H. Chen, H.L.W. Chan and Y. Wang, Opt. Express 20, 24330 (2012)\n58. 'Controlled performance of an organic transistor memory device with an ultrathin LiF blocking layer', S.M. Wang, P.K.L. Chan, C.W. Leung and X.R. Zhao, RSC Adv., 2, 9100 (2012)\n57. 'Study of optical Tamm states based on the phase properties of one-dimensional photonic crystals', Zefeng Chen, Peng Han, Chi Wah Leung, Yu Wang, Mingzhe Hu, and Yihang Chen, Opt. Express 20, 21618 (2012).\n56. 'Large-area anodized alumina nanopore arrays assisted by soft ultraviolet nanoimprint prepatterning', S.M. Ng, H.F. Wong, H.K. Lau and C.W. Leung, J. Nanosci. Nanotech. 12, 6315 (2012).\n55. 'Low power flexible organic thin film transistors with amorphous Ba0.7Sr0.3TiO3 gate dielectric grown by pulsed laser deposition at low temperature', Z.R. Wang, J.Z. Xin, X.C. Ren, X.L. Wang, C.W. Leung, S.Q. Shi, A. Ruotolo and P.K.L. Chan, Org. Electron. 13, 1223 (2012).\n54. 'Experimental investigation of photonic band gap in one-dimensional photonic crystals with metamaterials', Y.H. Chen, X.G. Wang, Z.H. Yong, Y.J. Zhang, Z.F. Chen, L.X. He, P.F. Lee, H.L.W. Chan, C.W. Leung, Y. Wang, Phys. Lett. A 376, 1396 (2012).\n53. 'Thermal Tuning of Surface Plasmon Resonance: Ag Gratings on Barium Strontium Titanate Thin Films', J.Z. Xin, K.C. Hui, K. Wang, H.L.W. Chan, D.H.C. Ong and C.W. Leung, Appl. Phys. A 107, 101 (2012).\n52. 'Strontium Titanate/Silicon Based Terahertz Photonic Crystal Multilayer Stack', J.Z. Xin, K.L. Jim, J. Yang, X.J. Gong, L.Q. Chen, F. Gao, Y.H. Tsang, H.L.W. Chan and C.W. Leung, Appl. Phys. A 107, 109 (2012).\n51. 'Liver cancer immunoassay with magnetic nanoparticles and MgO-based magnetic tunnel junction sensors', Z.Q. Lei, L. Li, G.J. Li, C.W. Leung, J. Shi, C.M. Wong, K.C. Lo, W.K. Chan, C.S.K. Mak, S.B. Chan, N.M.M. Chan, C.H. Leung, P.T. Lai and P.W.T. Pong, J. Appl. Phys. 111, 07E505 (2012).\n50. 'A Polyferroplatinyne Precursor for the Rapid Fabrication of L10-FePt-type Bit Patterned Media by Nanoimprint Lithography', Q.C. Dong, G.J. Li, C.L. Ho, M. Faisal, C.W. Leung, P.W.T. Pong, K. Liu, B.Z. Tang, I. Manners and W.Y. Wong, Adv. Mater. 24, 1034 (2012) (See Frontispiece picture).\n49. 'Short circuit current improvement in planar heterojunction organic solar cells by multijunction charge transfer', J.C. Wang, S.Q. Shi, C.W. Leung, S.P. Lau, K.Y. Wong and P.K.L. Chan, Appl. Phys. Lett. 100, 053301 (2012).\n48. 'Nonlithographic Fabrication of Crystalline Silicon Nanodots on Graphene', G.A. Tai, K. Wang, Z.H. Sun, J. Yin, S.M. Ng, J.X. Zhou, F. Yan, C.W. Leung, K.H. Wong, W. L. Guo and S.P. Lau, J. Phys. Chem. C 116, 532 (2012).\n[2011]\n47. 'Detection of iron oxide magnetic nanoparticles using magnetic tunnel junction sensors with Conetic alloy', Z. Q. Lei, C. W. Leung, L. Li, G. J. Li, G. Feng, A. Castillo, P. J. Chen, P. T. Lai, and P. W. T. Pong, IEEE Trans. Magn., 47, 2577 (2011) .\n46. 'Studies of Rare-Earth-Doped BiFeO3 Ceramics', Y.B. Yao, W.C. Liu, Y.K. Chan, C.W. Leung, C.L. Mak and B. Ploss, Int. J. Appl. Ceram. Technol., 8, 1246 (2011).\n45. 'Patterning of FePt for Magnetic Recording', G.J. Li, C.W. Leung. Z.Q. Lei, K.W. Lin, P.T. Lai and P.W.T. Pong, Thin Solid Films, 519, 8307 (2011).\n44. 'Thermal annealing and temperature dependences of memory effect in organic memory transistor', X.C. Ren, S.M. Wang, C.W. Leung, F. Yan and P.K.L. Chan, Appl. Phys. Lett., 99, 043303 (2011).\n43. 'Identification of pigments from the Shrine of Kaiping Diaolou by micro-Raman spectroscopy', Q.G. Zeng, G.X. Zhang, C.W. Leung and J. Zuo, J. Raman. Spectrosc., 42, 1311 (2011).\n42. 'Transfer imprint lithography using a soft mold', J.Z. Xin, F.K. Lee, S.Y.W. Li, K.S. Chan, H.L.W. Chan and C.W. Leung, Microelectron. Eng., 88, 2632 (2011).\n41. 'Multiple-mode excitation in spin-transfer nanocontacts with dynamic polarizer', N. Wang, X.L. Wang, W. Qin, S.H. Yeung, D.T.K. Kwok, H.F. Wong, Q. Xue, P.K. Chu, C.W. Leung and A. Ruotolo, Appl. Phys. Lett., 98, 242506 (2011).\n40. 'Transport properties of Pr0.7Ca0.3MnO3/Nb:SrTiO3 heterojunctions', Z. Luo, P.K.L. Chan and C.W. Leung, Physica B, 406, 3104 (2011).\n39. 'Composition dependence of structural and optical properties of Ba(Zrx,Ti1-x)O3 thin films grown on MgO substrates by pulsed laser deposition', J.Z. Xin, C.W. Leung and H.L.W. Chan, Thin Solid Films, 519, 6313 (2011).\n38. 'Photonic gap vanishing in one-dimensional photonic crystals with single-negative metamaterials', Y.H. Chen, Y. Wang, C.W. Leung. M.Z. Hu and H.L.W. Chan, Phys. Lett. A, 375, 2465 (2011).\n37. 'Charge accumulation induced S-shape J-V curves in bilayer heterojunction organic solar cells', J.C. Wang, X.C. Ren, S.Q. Shi, C.W. Leung and P.K.L. Chan, Org. Electron. 12, 880 (2011).\n[2010]\n36. 'Photonic crystal cavity embedded barium strontium titanate thin-film rib waveguide prepared by focused ion beam etching', K.L. Jim, C.W. Leung, H.L.W. Chan, Thin Solid Films, 518, e110 (2010).\n35. 'Studies of wall painting fragments from Kaiping Diaolou by SEM/EDX, micro Raman and FT-IR spectroscopy', Microchem. J., 96, 330 (2010).\n34. 'Formation of core/shell structured cobalt/carbon nanoparticles by pulsed laser ablation in toluene', H.Y. Kwong, M.H. Wong, C.W. Leung, Y.W. Wong and K.H.Wong, J. Appl. Phys., 108, 034304 (2010).\n33. 'Nonvolatile organic transistor-memory devices using various thicknesses of silver nanoparticle layers', S.M. Wang, C.W. Leung and P.K.L. Chan, Appl. Phys. Lett. 97, 023511 (2010). (Highlighted in ScienceDaily.com)\n32. 'The attachment of Fe3O4 nanoparticles to graphene oxide by covalent bonding', F.A. He, J.T. Fan, D. Ma, L.M. Zhang, C.W. Leung and H.L.W. Chan, Carbon, 48, 3139 (2010).\n31. 'Fabrication of nano-scaled patterns on ceramic thin films and silicon substrates by soft ultraviolet nanoimprint lithography', K.L. Jim, F.K. Lee, J.Z. Xin, C.W. Leung, H.L.W. Chan and Y. Chen, Microelectron. Eng., 87, 959 (2010)\n30. 'Enhanced memory effect in organic transistor by embedded silver nanoparticles', S.M. Wang, C.W. Leung and P,K.L. Chan, Org. Electron. 11, 990 (2010).\n[2009]\n29. 'Resistance switching properties of epitaxial Pr0.7Ca0.3MnO3 thin films with different electrodes', H.K. Lau, C.W. Leung and Y.K. Chan, Phys. Status Solidi A 206, 2182 (2009).\n28. 'Interfacial defects in resistive switching devices probed by thermal analysis', H.K. Lau, C.W. Leung, W.H. Hu and P.K.L. Chan, J. Appl. Phys. 106, 014504 (2009).\n27. 'Thermal tuning of phononic bandstructure in ferroelectric ceramic/ epoxy phononic crystal', K.L. Jim, C.W. Leung, S.T. Lau, S.H. Choy and H.L.W. Chan, Appl. Phys. Lett,.94, 193501 (2009).\n26. 'All wavelengths and directions hybrid guidance photonic crystal fiber and its property of Bragg grating resonance', H.J. Zhang, S.G. Li, C.W. Leung and H.L.W. Chan, Appl. Optics, 48, 2468 (2009).\n[2008]\n25. 'Nonvolatile multilevel memory effect by resistive switching in manganite thin films', H.K. Lau and C.W. Leung, J. Appl. Phys., 104, 123705 (2008).\n24. 'Unification of bulk and interface electroresistive switching in oxide systems', A. Ruotolo, C.W. Leung, C.Y. Lam. W.F. Cheng, K.H. Wong and G.P. Pepe, Phys. Rev. B, 77, 233103 (2008).\n23. 'Spacerless metal-manganite pseudo-spin-valve structure', W.F. Cheng, A. Ruotolo, Y.K. Chan, K.H. Wong and C.W. Leung, J. Appl. Phys., 103, 103903 (2008).\n22. 'One-dimensional tunable ferroelectric photonic crystals based on Ba0.7Sr0.3TiO3/MgO multilayer thin films', K.L. Jim, D.Y. Wang, C.W. Leung, C.L. Choy and H.L.W. Chan, J. Appl. Phys., 103, 083107 (2008).\n[2007]\n21. 'High-quality all-oxide Schottky junctions fabricated on heavily doped Nb:SrTiO3 substrates', A. Ruotolo, C.Y. Lam, W.F. Cheng, K.H. Wong and C.W. Leung, Phys. Rev. B,76, 075122 (2007).\n20. 'Exchange bias and blocking temperature in Co/FeMn/CuNi trilayers', M.G. Blamire, M. Ali, C.W. Leung, C.H. Marrows and B.J. Hickey, Phys. Rev. Lett., 98, 217202 (2007)\n19. 'Effect of post annealing on La0.7Sr0.3MnO3 thin films', W.F. Cheng and C.W. Leung, Acta Phys. Pol. A, 111, 117 (2007).\n[2006]\n18. 'Magnetoresistance of spin valve structures based on the full Heusler alloy Co2MnSi', L. J. Singh, C.W. Leung, C. Bell, J.L. Prieto, and Z.H. Barber, J. Appl. Phys. 100, 013910 (2006).\n17. 'Universal time relaxation behavior of the exchange bias in ferromagnetic/ antiferromagnetic bilayers', J. Dho, C.W. Leung and M.G. Blamire, J. Appl. Phys. 99, 033910 (2006).\n[2005]\n16. 'Current-perpendicular-to-plane giant magnetoresistance in submicron pseudo-spin-valve devices', C.W. Leung, C.Bell, G. Burnell and M.G. Blamire, Phys. Rev. B, 72, 212409 (2005).\n15. 'Interaction between exchange-bias systems in Ni80Fe20/Fe50Mn50/Co trilayers', C.W. Leung, and M.G. Blamire, Phys. Rev. B 72, 054429 (2005).\n14. 'Modulation of the dc Josephson current in pseudo-spin-valve Josephson multilayers', A. Ruotolo, G..P. Pepe, C. Bell, C.W. Leung, and M.G. Blamire, Supercon. Sci. Tech. 18, 921 (2005).\n13. 'Giant-magnetoresistive/superconducting contacts and Josephson junction devices', G. Burnell, C.W. Leung, C. Bell and M.G. Blamire, IEEE Trans Appl. Supercon. 15, 904 (2005).\n12.' Spin valve Josephson Junctions', C. Bell, G. Burnell, C.W. Leung, E.D. Tarte and M.G. Blamire, IEEE Trans Appl. Supercon. 15, 908 (2005).\n11. 'Controlling the exchange interaction using the spin-flip transition of antiferromagnetic spins in Ni81Fe19/α-Fe2O3', J. Dho, C.W. Leung, Z.H. Barber and M.G. Blamire, Phys. Rev. B 71, 180402(R) (2005).\n[2004]\n10. 'Perpendicular magnetic anisotropy and structural properties of NiCu/Cu multilayers', A. Ruotolo, C. Bell, C.W. Leung and M.G. Blamire, J. Appl. Phys, 96, 512 (2004).\n9. 'In situ fabrication of a cross-bridge Kelvin resistor structure by focused ion beam microscopy', C.W. Leung, C. Bell, G. Burnell and M.G. Blamire, Nanotechnology 15, 786 (2004).\n8. 'Epitaxial and oriented YMnO3 film growth by plused laser deposition', J. Dho, C.W. Leung, J.L. MacManus-Driscoll and M.G. Blamire, J. Cryst. Growth, 267, 548 (2004).\n7. 'Controllable Josephson current through a pseudo spin valve structure', C. Bell, G. Burnell, C.W. Leung, E.J. Tarte, D.J. Kang and M.G. Blamire, Appl. Phys. Lett. 84, 1153 (2004).\n6. 'A study of conventional top spin valve structure through the built-up samples technique', C.W. Leung, M.E. Vickers, J.D.R. Buchanan and M.G. Blamire, J. Magn. Magn. Mater., 269, 15 (2004).\n[2003]\n5. 'Interaction between ferromagnetic/antiferromagnetic systems across a common antiferromagnetic spacer', C.W. Leung and M.G. Blamire, J. Appl. Phys., 94, 7373 (2003).\n4. 'Proximity and Josephson effects in superconductor - antiferromagnetic Nb/ γ-Fe50Mn50 heterostructures', C. Bell, E.J. Tarte, G. Burnell, C.W. Leung, D.J. Kang, M.G. Blamire, Phys. Rev. B, 68, 144517 (2003).\n[2002]\n3. 'Development of structural, magnetic and transport properties in Ni80Fe20/Co- based top spin-valve: Studies by sequential addition of constituent layers', C.W. Leung and M.G. Blamire, J. Appl. Phys. 91, 8572 (2002).\n2. 'In situ magnetoresistance measurements during patterning of thin films and spin valve devices', D. Morecroft, J.L. Prieto, C.W. Leung, G. Burnell and M.G. Blamire, J. Appl. Phys. 91, 8575 (2002).\n[2001]\n1. 'Control of the switching properties of magnetic thin films and spin valve devices by patterning', D. Morecroft, C.W. Leung, N.A. Stelmashenko, J.L. Prieto, D.B. Jardine and M.G. Blamire, IEEE Trans. Magn., 37, 2079 (2001).",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/publications.html"
 },
 {
  "text": "-Magnetism and Spintronics\n-Nanofabrication Techniques: Nanoimprint lithography; anodization techniques\n-Photonic and Plasmonic Devices\n-Organic Thin Film Devices (Memory, Transistors, Photovoltaic)",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/Researchint.html"
 },
 {
  "text": "RGC-CERG/GRF\n- 'Non-volatile field effect modulation of magnetism in dilute magnetic oxide thin films': 2014, HKD 352k.\n-‘Nanofabrication of Ferroelectric and Multiferroic Tunnel Junctions for Nonvolatile Memory Application’: (as Co-I) 2012, HKD 725k.\n-‘Magneto-optical and Magneto-transport Properties of Carbon-doped Zinc Oxide Thin Films and Nanostructures’ (as Co-I): 2009, HKD 1.22M.\n-‘Large-Area Regular Anodized Alumina Channel Array Fabrication Assisted by Nanoimprint Lithography’: 2009, HKD 634k.\n-‘Influence of Resistive Switching Effect on Transport Properties in Epitaxial Manganite/Titanate Junctions’: 2008, HKD 294k.\n-‘Realization of Simultaneous Magneto- and Electro-switching in Oxide Diode Spin Valve’ (as Co-I): 2008, HKD 344k.\n-‘All-oxide Giant Magnetoresistive Heterostructures’: 2006, HKD 426k.\nOther Grants\n- 'Memory Devices for Abundant Data Computing: Basic Science and Technology Development' (PolyU Project of Strategic Importance, as Co-I): 2015, HKD 2.50 M.\n- 'Two Dimensional Materials: Graphene and Beyond' (PolyU Project of Strategic Importance, as Co-I): 2014, HKD 5.03 M.\n- 'An Investigation of Multilevel Organic Memory Transistors based on Ferroelectric Copolymers' (PolyU internal grant): 2014, HKD 105k.\n- 'Atomic Force Microscope (AFM)-based Near-field Scanning Optical Microscope System' (PolyU AoE large equipment grant): 2013, HKD 2.88 M.\n- 'ESD Device Characterization and Performance Measurement' (Supported by Canaan Semiconductor Ltd.): 2013, HKD 150k.\n-‘Porous Anodized Alumina for Surface Enhanced Raman Spectroscopy Application' (PolyU internal grant): 2013, HKD 105k.\n-‘Electrical Modulation of Metal/binary Oxide Thin Film Interfaces' (PolyU internal grant): 2012, HKD 72k.\n-‘Modulation of Surface Plasmon Polariton via Active Dielectric Layer' (PolyU internal grant): 2012, HKD 105k.\n-‘Patterned Dielectric/metal Surfaces for Surface Plasmon-enhanced Photocatalytic Studies' (PolyU internal grant): 2012, HKD 150k.\n- 'Ferroelectric Copolymer-Gated Organic Thin Film Transistors for Memory Applications’ (Germany/Hong Kong Joint Research Scheme): 2012, HKD 57.4k.\n-‘Nano-photocatalytic Devices for Water Purification’ (PolyU internal grant): 2011, HKD 153 k.\n-‘ZnO and Patterned Nanostructures for Stable and High-efficiency Inverted Organic Solar Cells’ (PolyU Postdoctoral Fellowship Scheme, as Co-I): 2011, HKD 624k.\n-‘Device Fabrication via Transfer Printing of Metal Films’ (PolyU internal grant): 2011, HKD 105k.\n-‘Investigation of Nanotechnologies for Highly Efficient Solar Cells’ (PolyU internal grant, as Co-I): 2010, HKD 200k.\n-‘Photonic Materials Research: The Development of Tunable Photonic Crystals for Optical Device Applications’ (PolyU Niche Area Grant, as Co-I): 2007, HKD 1.15M.\n-‘Resistive Switching Behaviour in Oxide Thin Films and Devices’ (PolyU internal grant): 2007, HKD 300k.\n-‘Oxide Planar Device Fabrication by Focused Ion Beam Nanopatterning’ (PolyU Grant): 2006, HKD 105k.\n9. 'Spintronic devices based on metal dichlalcogenides materials' W.C. Wong, M. Phil.\n8. 'Plasmonic Structures for Photonics Applications', K.F. Ng, M.Phil.\n7. ‘Surface Modification of Polydimethysiloxane through Plasma Ion Implantation’, Y. Sun, M.Phil. (graduated 2014).\n6. ‘Large-Area Regular Anodized Alumina Channel Array Fabrication Assisted by Nanoimprint Lithography’, S.M. Ng, M.Phil. (graduated 2012).\n5. ‘Tunable Photonic Devices in Ferroelectric-Based Layered Structures’, J.Z. Xin, Ph.D. (graduated 2012).\n4. ‘Resistive Switching Behaviour in Oxide Thin Films and Devices’, H.K. Lau, M.Phil. (graduated 2010).\n3. ‘Barium Strontium Titanate Ferroelectric Tunable Photonic and Phononic Crystals’, K.L. Jim, Ph.D. (as co-supervisor) (graduated 2009).\n2. ‘All-oxide Giant-magnetoresistive Devices’, Y.K. Chan, M.Phil. (graduated 2009).\n1. ‘Oxide-based Giant Magnetoresistive Heterostructures’, W.F. Cheng, M.Phil.(graduated 2008)",
  "url": "https://www.polyu.edu.hk/ap/profile/apleung/student%26grant.html"
 },
 {
  "text": "Prof. Cheng-Wei Qiu\nDean’s Chair Professor\nDepartment of Electrical and Computer Engineering\nNational University of Singapore\nProf. Cheng-Wei Qiu was appointed Dean’s Chair Professor twice (2017-2020 & 2020-2023) in College of Design and Engineering, NUS. He was Fellow of Optica, SPIE and The Electromagnetics Academy, US. He is well known for his research in structured light and interfaces. He has published over 460 peer-reviewed journal papers. He was the recipient of the SUMMA Graduate Fellowship in Advanced Electromagnetics in 2005, IEEE AP-S Graduate Research Award in 2006, URSI Young Scientist Award in 2008, NUS Young Investigator Award in 2011, MIT TR35@Singapore Award in 2012, Young Scientist Award by Singapore National Academy of Science in 2013, Faculty Young Research Award in NUS 2013, SPIE Rising Researcher Award 2018, Young Engineering Research Award 2018, and Engineering Researcher Award 2021 in NUS, and World Scientific Medal 2021 by Institute of Physics, Singapore, Achievement in Asia Award (Robert T. Poe Prize) by International Organization of Chinese Physicists and Astronomers in 2022. He was Highly Cited Researchers in 2019, 2020, 2021, 2022 by Web of Science. As an overseas partner, he has been awarded 中国光学十大进展 for 4 times (2019, 2020, 2021(one in Fundamental Research, and one in Applied Research)). He has been serving in Associate Editor for various journals such as JOSA B, PhotoniX, Photonics Research, and Editor-in-Chief for eLight. He also serves in Editorial Advisory Board for Laser and Photonics Review, Advanced Optical Materials, and ACS Photonics.",
  "url": "https://www.polyu.edu.hk/ap/news-and-events/events/2023/apr/20_prof-qiu_research-seminar?sc_lang=en"
 }
]