[
 {
  "text": "The Outstanding Alumni Award aims to give public recognition to outstanding graduates of FSN for their professional achievements and significant contributions to the community and their alma mater. Awards will be conducted at three levels: Department level, Faculty/School level and University level.\nEligibility\nThe nominated candidate must be a bona fide graduate who has successfully completed full-time or part-time programme offered by PolyU (or its forerunners: Hong Kong Government Trade School, Hong Kong Technical College, Hong Kong Polytechnic; and its constituent units: School of Professional Education & Executive Development and Hong Kong Community College) which led to academic award accredited by the respective Institution.\nThe proposer can be PolyU graduate, Honorary Graduate, University Fellow, PolyU staff, current PolyU Council and Court member and current Advisory Committee member. There is no limit to the number of nominations to be submitted by each proposer. However, the proposer cannot be the candidate himself/ herself.\nAward Categories and Selection Criteria\nThere are two award streams and four award categories. Candidate who is aged under 40 by the end of the award year can be considered under Young Alumni stream:\nOutstanding Alumni Award of PolyU FSN (nominees aged 40 or above)\nOutstanding Young Alumni Award of PolyU FSN (nominees aged under 40) \nThe four award categories and their selection criteria are listed below. Selection is based on the nominee’s accomplishments in his/her personal achievements in the field, contributions to the community, and support and contributions to PolyU.\nAward Category\nDescription \nProfessional Achievement \n\tThis category recognises alumni who have attained distinguished achievements, demonstrated exemplary leadership and made a strong impact on their profession/industry.\t\nEntrepreneurial Achievement \n\tThis category recognises alumni who have demonstrated outstanding innovation and entrepreneurship, founded and advanced business or technology ventures with social impact.\t\nScholarly Achievement \n\tThis category recognises alumni scholars who have made notable scholarly or research contributions in their disciplines, with proven track record and excellent reputation in the field.\t\nCommunity Service Achievement \n\tThis category recognises alumni who have made impactful contributions to the communities, or demonstrated an extraordinary level of commitment, volunteerism and/or philanthropy for promoting the wellbeing of the communities.\n\t\nNominations\nNomination deadline: 28 February 2023\nEach nomination must be submitted by a proposer.\nThe proposer should have obtained nominees’ consent before the submission of nominations. There is no limit to the number of nominations to be submitted by each proposer. Proposer can also be nominated. However, the proposer cannot nominate himself/herself.\nNomination Procedure\nPlease submit the completed nomination form (as attached) together with any supporting documents to Ms. Hilary Tsoi (hilary.tsoi@polyu.edu.hk) on or before the nomination deadline.\nTo join the Outstanding Alumni Award of PolyU FSN 2023, please download and complete the Nomination Form here.\nFor more details of the OPAA, please visit the AADO website.",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/alumni/outstanding-alumni-award-of-fsn"
 },
 {
  "text": "Areas of Research\nOur mission is to deliver high-quality 'impactful research' that address societal challenges and enhance consumer confidence in food safety, nutritional health, and related matters in Hong Kong.\nThe research area for the Department of Food Science and Nutrition (FSN) is to enhance health by focusing on different aspects of food science and human health.\nIn terms of food science, our research embraces the bifacial side of food in human health, including:\nfood nutrition, functional foods and Chinese medicine in promoting human health;\nharmful materials in food causing human diseases like food allergens, foodborne pathogens and harmful chemical contaminants;\nfood security to ensure a sufficient supply of food for humans\nIn terms of human health, we will conduct research to:\nunderstand the interaction between food and human microbiome and the human immune system;\nadvance food processing, preservation methods and food contaminants detection methods to ensure food safety;\ndevelop therapy treatment and moderate immune response to food allergens to safeguard human health.\nOur research directions are:\nFood Safety and Bacterial Antimicrobial Resistance under one health framework;\nMicrobiome in Nutrition and Human Health;\nFood Sustainability;\nFunctional Foods & Chinese Medicine;\nNutrition and Human Health: The Emergence of Precision Nutrition\nApart from cutting-edge research, FSN works hand-in-hand with the recently established Research Institute for Future Food (RiFood), Research Centre for Chinese Medicine Innovation (RCMI) and Food Safety and Technology Research Centre (FSTRC) to provide interdisciplinary solutions for major social challenges through advanced research and knowledge transfer. Efforts will be made to create societal impact through partnerships and interactions with academia, industry and government, with a particular focus on the Greater Bay Area (GBA).",
  "url": "https://www.polyu.edu.hk/fsn/research/research-overview"
 },
 {
  "text": "The State Key Laboratory of Chinese Medicine and Molecular Pharmacology (Incubation), Shenzhen (SKL Incubation) under The Hong Kong Polytechnic University Shenzhen Research Institute is a laboratory that focuses on modernized Chinese medicine research. SKL Incubation is located at the Shenzhen Hi-tech Industrial Park with an area of 2,000m2. There are various functional laboratories for the pre-clinical studies of drugs or health food, such as the Specific Pathogen Free (SPF) Animal Laboratory, Pharmacology Laboratory, Tissue Culture Laboratory, Analytical Chemistry Laboratory and NMR Laboratory. These laboratories are equipped with state-of-the-art equipment.\n「深圳市中药药学及分子药理学研究重点实验室」(重点实验室) 成立于2005年，主要研究现代中药。重点实验室位于深圳市高新科技园，占地2,000平方米。按照药物/保健食品临床前研究的需要，设有多个功能实验室，包括无特定病原级（SPF级）动物实验室、药理实验室、细胞培养室、化学分析仪器室、核磁共振实验室，并配套先进的仪器设备。\nMission and Vision\nOur Key Laboratory focuses on the study of classical Chinese medicine formulae and single herbs on geriatric and chronic diseases. We aim at elucidating the chemical composition and action mechanism responsible for the efficacy of Chinese medicine on the prevention and treatment of such diseases. By multidisciplinary researches comprising analytical chemistry, pharmacology, system biology, etc. Our goal is to demonstrate the science of traditional Chinese medicine using modern scientific means, and further, to provide scientific evidence for its clinical application. Our vision is to improve the global acceptance of Chinese medicine and thus expanding its influence worldwide.\n重点实验室针对老年及慢性疾病，以中医理论指导下的中药经典方剂和单味中药为主要研究对象，利用分析化学、药理学、系统生物学等跨学科的现代科学手法，阐明中药防治老年及慢性疾病的物质基础和作用机理。重点实验室的发展目标是利用现代科学方法阐释传统中医药的科学内涵，为其临床应用提供科学依据，提升中医药在国际的认受性，扩大中医药的影响力。\nContact us (联络我们)\nMs. Ho Chui-kwan, Joyce 何翠君小姐 Ms. Yuen Chui-ying, Ailsa 袁翠盈小姐 \nEmail\tjoyce.ho@polyu.edu.hk\tailsa.yuen@polyu.edu.hk\t\nTel\t+86 755-26737462\t+852 3400 8694\t\nFax\t+86-755-26737462\t\nAddress\n地址\t6/F, Block R2-A, Southern Area of the Shenzhen Hi-Tech Park, Nanshan District, Shenzhen City, China\n中国深圳市南山区高新科技园南区R2-A栋6楼 邮编：518057\n\t\nMap\thttp://ditu.amap.com/place/B02F37UFWP",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/state-key-laboratory-of-chinese-medicine-and-molecular-pharmacology---incubation"
 },
 {
  "text": "Food safety has been a major concern in Hong Kong and the Mainland. Reports on food poisoning and unsafe food have repeatedly made headlines in recent years, making food safety one of the top priorities locally and internationally. Addressing the importance of food safety, the HKSAR Government established the Centre for Food Safety (CFS) in 2006 under the Food and Environmental Hygiene Department (FEHD) with an aim to prevent food safety-related incidents through food hazard control measures and tighter laws and regulations.\nAn authority on food science and chemistry in Hong Kong, the Department of Applied Biology and Chemical Technology (ABCT Department) has developed expertise in food engineering and food technology. Operating under the Department, FSTRC serves as a platform to strengthen local and international collaborations. Our vision and mission are as follows:\nVision\nFSTRC aims to become a world-class food safety and food technology authority and offer one-stop services to safeguard public health.\nMission\nThrough an extensive range of research, consultancy and training programs supported by government grants and funding, FSTRC will be a hub of food safety in Hong Kong and the Mainland.\nSix Key Research Areas\nFSTRC actively promotes the research and development of food safety and technology in six key areas, namely 1) testing and certification, 2) risk analysis and toxicology, 3) functional food development, 4) innovative technology development, 5) nutrition and public health and 6) education and professional development. Combining the findings and solid scientific research experience of its team, FSTRC has developed various innovative food technologies to address the issue. It also aims to raise public awareness of food safety through education programs, information sharing and related risk analytical research.\nProjects",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre"
 },
 {
  "text": "Keywords \nPolyU Scholar Appointed Food Hygiene Advisor\nCongratulations to Dr Wong Ka-hing, Associate Professor of the Department of Food Science and Nutrition (FSN) cum Director of Research Institute for Future Food, on being appointed as a… \n26 Apr, 2023\nNews \nHKTKWW Interview: Helping Local Trade to Develop Modernised and Sustainable Mariculture Practices\nThe Hong Kong Government has been investing in sustainable and modernized fish farming through the Sustainable Fisheries Development Fund (SFDF) since 2014, with a budget of HKD 500 million… \n16 Mar, 2023\nNews \nPromoting Modernized and Sustainable Mariculture\nThe Hong Kong Government has been investing in sustainable and modernized fish farming through the Sustainable Fisheries Development Fund (SFDF) since 2014. With a budget of HKD 500 million… \n3 Mar, 2023\nNews \nFSN Departmental Retreat 2023\nThe Department of Food Science and Nutrition (FSN) hosted its first Departmental Retreat on 5-6 January 2023 in Sai Kung. The event has successfully brought together our field experts for ideas… \n13 Jan, 2023\nNews \nFSN researchers find breastfeeding moms need more fruits and veggies\nThe breastfeeding rate in Hong Kong has been increasing steadily over the past 20 years. As the source of a variety of nutrients, breast milk plays a vital role in the healthy growth and development… \n14 Dec, 2022\nThe Best Early Career Researcher Poster Award in the International Congress on Obesity 2022\nThe International Congress on Obesity (ICO) is the pre-eminent global gathering for obesity experts and was held on 18-22 October 2022 in Melbourne, Australia. The congress opened to approximately… \n9 Dec, 2022\nPolyU researchers are listed as Top 2 Percent Scientists Worldwide by Stanford University\nPolyU has achieved an encouraging milestone of having more than 200 PolyU scholars ranked among the world’s top 2% most-cited scientists in the newly released metrics compiled by Stanford… \n24 Oct, 2022\nDr Kevin Kwok Wing-hin was interviewed by the RTHK Programme to share his research insight\nThe problem of global food imbalance is imminent. Human food is mainly produced by animal husbandry and agricultural activities. There is one-third of the world's land is currently used for… \n4 May, 2022\nDr Chang Jinhui Gail of ABCT has won a silver medal at 2022 Inventions Geneva Evaluation Days\nCongratulations to Dr Chang Jinhui Gail, Research Assistant Professor of ABCT and the Co-founder of Bo InnoHealth Biotechnology Company Limited (a PolyU GBA Start-up PostDoc and PolyU… \n4 Apr, 2022\nProf. Wing-tak Wong appointed as the Chairman of the Hong Kong Council for Testing and Certification\nWe are delighted to announce that Prof. Wing-tak Wong, Deputy President and Provost of PolyU, was appointed by the Chief Executive as the Chairman of the Hong Kong Council for Testing and… \n30 Dec, 2021\n1\n2\nNext\nJump to",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards"
 },
 {
  "text": "The Department of Food Science and Nutrition (FSN), based on the key pillars in Food Safety, Food Technology, Human Nutrition, and Chinese Medicine, meeting the requirements of the growing public awareness of food sustainability and safety. \nWith the vision of becoming a world-leading department advancing the Food Science and Nutrition industry, FSN is committed to creating societal impacts, training professional talents, leading innovative research, and facilitating knowledge transfer for better public health and well-being of mankind. \nWith the hope of cultivating our graduates to meet the needs of the ever-changing world and contribute to society, we will update our programmes regularly to follow the pace of social change; actively schedule exchange programmes and organize field visits to prepare our students with international insights; set up the Work-Integrated Education programme to provide on-the-job training to the students and provide consultancy to offer technical solutions to the industry. \nFSN will continue to focus on talent grooming, pursue impactful research and maintain a strong partnership with other businesses, industries and associations for translating knowledge into product development. \n食品科學及營養學系（FSN）致力於食品安全、技術、人類營養學和中醫多個學術領域，提供高質素教育，並發展優質的基礎及應用研究，以滿足公眾對食品可持續性和安全性的認識與社會需求。 \n以推動食品科學和營養行業為願景，本系致力於創造社會影響、培養專業人才、領導創新研究和促進健康知識轉移。 \n我們冀盼本系的畢業生能在這個日新月異的世界中學以致用，以他們的專業才能貢獻社會。因此, 我們將定期更新我們的課程以緊跟社會變革的步伐；積極安排交流計劃並組織實地考察，讓我們的學生具備國際視野；設立WIE教育計劃，為學生提供在職培訓, 以及提供諮詢服務與技術解決方案給其他行業。 \n本系會持續進行培訓專業人材、尖端科研、並與工商業界及協會保持良好合作伙伴關係, 將知識應用到產品開發上 。 \n食品科学及营养学系（FSN）致力于食品安全、技术、人类营养学和中医多个学术领域，提供高质素教育，并发展优质的基础及应用研究，以满足公众对食品可持续性和安全性的认识与社会需求。 \n以推动食品科学和营养行业为愿景，本系致力于创造社会影响、培养专业人才、领导创新研究和促进健康知识转移。 \n我们冀盼本系的毕业生能在这个日新月异的世界中学以致用，以他们的专业才能贡献社会。因此, 我们将定期更新我们的课程以紧跟社会变革的步伐；积极安排交流计划并组织实地考察，让我们的学生具备国际视野；设立WIE教育计划，为学生提供在职培训, 以及提供咨询服务与技术解决方案给其他行业。 \n本系会持续进行培训专业人材、尖端科研、并与工商业界及协会保持良好合作伙伴关系, 将知识应用到产品开发上 。",
  "url": "https://www.polyu.edu.hk/fsn/about-fsn/message-from-department"
 },
 {
  "text": "The International Conference\nThe Department of Food Science and Nutrition (FSN) at The Hong Kong Polytechnic University (PolyU) was newly established on 1 January 2023 based on the key pillars in Food Safety, Food Technology, Human Nutrition and Traditional Chinese Medicine. Coming as the first academic department in Food Science and Nutrition in Hong Kong, FSN is dedicated in the cultivation of food specialists with professional qualifications, and has paid concerted efforts to address health-related issues and pursue impactful research for innovative and sustainable development that benefits the world and mankind.\nTo celebrate the grand inauguration of FSN, we are organizing a 1.5-day PolyU FSN cum International Conference on Food and Human Health (ICFHH) on 13 - 14 July 2023 in Hong Kong. The event aims to bring together renowned experts from around the world to share the state-of-the-art scientific knowledge, showcasing research breakthrough and advancements in food-, nutrition- and health-related fields, and cultivating scientific exchange and collaboration between the public sector, industry and academia.",
  "url": "https://www.polyu.edu.hk/fsn/grand-opening"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \nNews and Events \nNews and Awards \n1 / 1\nThe Hong Kong Government has been investing in sustainable and modernized fish farming through the Sustainable Fisheries Development Fund (SFDF) since 2014. With a budget of HKD 500 million, this fund is helping the local fisheries and agriculture industries adapt to new challenges. Recently, the Agriculture, Fisheries and Conservation Department (AFCD) held a briefing on February 28, 2023 to share its progress with stakeholders.\nWe are proud to be part of a project that promotes modernized and sustainable mariculture at the demonstration farm, providing hands-on training and lectures to help the local trade develop modernized and sustainable mariculture practices. With previous support from the SFDF, more than 100 participants have completed the training and produced 7,200 kilograms of high-quality fish certified by the Government Accredited Fish Farm Scheme. \nCheck out the link below to watch the report by Hong Kong 01: https://reurl.cc/Q4LADZ.\n香港政府在2014年成立了5億元的「漁業持續發展基金」去協助漁業社群應對新挑戰，推動本地漁業發展與轉型至可持續或高增值的作業模式，提高整個漁業的競爭力。漁農自然護理署最近在2月28日舉辦了「漁業持續發展基金 - 優化簡介及成果分享會」，分享基金推動本地漁業多元化及可持續發展的成果。\n其中一個項目是由香港理工大學負責的，獲得基金約680萬元的支持，協助漁民和養殖戶進行海產養殖培訓，提供養殖技術理論及實習課程。在過去兩屆的課程中，已經有超過100名學員完成實習，成功出產約7,200公斤獲「優質養魚場計劃」認證的優質魚。這些魚被命名為「東龍鯛」，成為了一個香港獨有的漁獲品牌。\n歡迎透過以下連結，觀賞香港01的報道： https://reurl.cc/Q4LADZ \n\n",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2023/promoting-modernized-and-sustainable-mariculture"
 },
 {
  "text": "The breastfeeding rate in Hong Kong has been increasing steadily over the past 20 years. As the source of a variety of nutrients, breast milk plays a vital role in the healthy growth and development of infants. The Research Institute for Future Food (RiFood) of The Hong Kong Polytechnic University (PolyU) has conducted a study to analyse the three-day dietary records and breast milk samples of Hong Kong lactating women. \nThe research has revealed that only 4% of lactating women had dietary habits that met the recommendation from the Department of Health to consume at least two servings of fruits and three servings of vegetables per day, or the recommended intake of vitamin A, according to the “Chinese Dietary Reference Intake” which was established by the Chinese Nutrition Society. There was a significant correlation between dietary intake and the nutrient levels of breast milk, especially the carotenoid and polyphenol contents.\nAs explained by the research team, the first 1,000 days from pregnancy to a two-year-old infant is the basis for establishing long-term health. Breast milk contains a variety of nutrients and plays an important role in their healthy growth.\nProf. WONG Man-sau, Steering Committee Member of RiFood and Professor of the Department of Food Science and Nutrition of PolyU said, “Apart from commonly known nutrients, such as protein and fatty acids, breast milk also contains phytonutrients such as carotenoids and polyphenols. These phytonutrients are important in the physical development of infants and can reduce the level of inflammation. Lacking one or more nutrients may weaken the immune system of infants, and may also increase their risk of getting chronic diseases in the future.”\nThe PolyU research team collected breast milk samples and a three-day dietary record of about 90 lactating women and analysed the levels of carotenoid and polyphenol content.\nThe level of carotenoids in breast milk was higher in lactating women who had a higher intake of fruits and vegetables. Dr Christine LI, Teaching Fellow of FSN, said some carotenoids can be converted to vitamin A to promote the development of infants’ brain, vision and immunity, and can also protect the retina from damage by strong light.\nDr Daisy ZHAO, Assistant Professor of FSN, said polyphenol is a powerful antioxidant and anti-inflammatory compound, which can prevent cardiometabolic diseases and reduce the risk of bacterial infection.\nBased on the research findings, Dr Kenneth LO, Assistant Professor of FSN, suggested lactating women should enhance the levels of carotenoids and polyphenols in breast milk through increasing their fruit and vegetable intake. Common dark green vegetables, including Chinese flowering cabbage, spinach, Chinese kale, Indian lettuce, sweet potatoes, carrots, pumpkins, papayas, mangoes etc., are rich in phytonutrients.\nA new research project “Feeding mom feeding infants” has been launched by the research team, recruiting about 100 pairs of lactating women and infants for a one-year study, to further investigate the relationship between the dietary habits of lactating women and the nutrients of breast milk, gut microbiota composition of infants and their growth.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/fsn-researchers-find-breastfeeding-moms-need-more-fruits-and-veggies"
 },
 {
  "text": "Skip to main content\nStart main content\n1 / 5\nThe Department of Food Science and Nutrition (FSN) hosted its first Departmental Retreat on 5-6 January 2023 in Sai Kung. The event has successfully brought together our field experts for ideas sharing and interactive discussions. This sets a wonderful commencement of the new Department with great minds for strategic planning and development.\nIt is hoped our young team could join hand-in-hand to nurture field professionals and create impactful research contributing to the society!\n食品科學及營養學系於今年1月5至6日於西貢進行了為期兩天的研討會議，奠定學系未來的發展方針，並確立相關專業人才培訓和研究的基礎規劃。希望我們年輕的團隊可以攜手開創未來 ，培育人才並創造有影響力的研究，為社會做出貢獻！\n\n",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2023/fsn-departmental-retreat-2023"
 },
 {
  "text": "Introduction\nFAQs\nEntrance Year Sept 2023 \nProgramme Code JS3010 \nMode of Study Full-time \nNormal Duration 4 years (including 1.5 years with common curriculum) \nProgramme Intake 77 \nFund Type Government-Funded \nCredits Required for Graduation Minimum of 122 credits. The number of credits required is dependent on individual HKDSE attainment. \nRemarks\nStudents will gain one of the following awards upon successful completion of the programme:\n> BSc (Hons) in Applied Biology with Biotechnology\n> BSc (Hons) in Chemical Technology\n> BSc (Hons) in Food Safety and Technology\nStudents are subject to further selection criteria for the admission to a major, i.e. their own preference, GPA and interview performance, during Semester 1 of Year Two.\nThe option of a Secondary Major in Innovation and Entrepreneurship is available to students taking the BSc (Hons) in Applied Biology with Biotechnology. Admission to the Secondary Major is competitive and subject to a different credit requirement for graduation. Please see Secondary Major Details for further information.\nEntry Scholarship\nIn recognition of high academic attainment, the Department will grant entry scholarships to eligible students with outstanding HKDSE scores admitted to the Scheme via JUPAS. The award criteria for the scholarship are listed in the information sheet. The criteria are subject to change and awardees will be announced on the same website in due course.\n\nAims and Characteristics\nScheme-based Admission\nThe following programmes are offered under the above scheme:\nBSc (Hons) in Applied Biology with Biotechnology\nBSc (Hons) in Chemical Technology\nBSc (Hons) in Food Safety and Technology\nCharacteristics\nThis Scheme-based admission serves as an undeclared track offering flexible major selection. The 1.5-year common curriculum gives students an opportunity to identify their area(s) of interest and career aspirations. The subjects in this common curriculum provide science foundation for the three major programmes which prepare students for the proceeding years of study.\nThe decision to admit a student to a Major will be made by the department in consideration of the student’s preference, GPA, and/or interview result. Students will be asked to rank their Major choices (in order of preference) during Semester 1 of Year Two for the department’s consideration and approval.\nBSc (Hons) in Applied Biology with Biotechnology\nProgramme Aims & Learning Outcomes\nThe programme aims to produce competent professionals in biotechnology to meet the needs of related sectors in Hong Kong, China and the world.\nIn this programme, students gain a thorough understanding of the principles, concepts and applications of biotechnology. Through learning the principles of modern biotechnology, students develop analytical, creative and problem-solving abilities. Graduates from the programme are well prepared for careers in the rapidly expanding global bioscience/biotechnology industry. They also have the opportunity to pursue further study in postgraduate programmes locally or overseas.\nProgramme Characteristics\nThe ABB Programme is the first international degree programme accredited by the Royal Society of Biology (RSB), a recognized professional body that promotes and supports the advancement of skills and education in the biosciences. Focusing on the application of biotechnology, the programme is comprised of core subjects that include Human Physiology, Microbiology, Biochemistry, Biochemical Techniques, Molecular Biology, DNA Technology, Bioinformatics, Immunotechnology & Recent Developments in Medical Biotechnology, and Elective subjects, in which students can more deeply explore special topics such as Microbial Biotechnology, Metabolism and Diseases & Case Study in Biotechnology Companies. This programme integrates theory and practice, culminating in an individual in-depth scientific investigation in the final year. Students develop both local and global perspectives and have the opportunity to experience practice in relevant industries, research centres and commercial organisations. \nBSc (Hons) in Chemical Technology\nProgramme Aims & Learning Outcomes\nAs the most established applied chemistry programme in Hong Kong, our BSc (Hons) in Chemical Technology offers a broad and rigorous education in contemporary chemistry and training in laboratory practices. The programme emphasises the application of chemistry in technological innovation. Through this programme, students develop competence in problem-solving and communication, essential abilities for graduates to pursue careers in business and technical services in chemical and related industries.\nProgramme Characteristics\nFocusing on the technological application of chemistry, this programme comprises Core and Elective Subjects in chemical principles, applied/industrial chemistry and chemical process technology.\nThis is one of the most popular applied science programmes in Hong Kong, and it is specifically designed to enhance graduates’ career prospects in the governmental, business and industrial sectors.\nElective Subjects include: \nConsumer Behaviour\nEconomic Analysis for Process Technology\nEnvironmental Science\nFood Processing Technology\nManagement & Organisation\nMedicinal Chemistry\nNatural Products Chemistry\nPrinciples of Quality Assurance\nThese subjects broaden and enrich students’ knowledge and skills base, enhancing their career prospects in the commercial and industrial sectors. Our students gain further work experience through industrial visits, Work-Integrated Education schemes and summer placements in local and overseas companies.\nBSc (Hons) in Food Safety and Technology\nProgramme Aims & Learning Outcomes\nThis programme aims to provide a unique and profession-oriented education for aspiring food technologists and food safety officers to meet the needs of the community.\nThe objective is to develop all-round graduates whose intellectual abilities, professional knowledge and skills meet the international standards for Bachelor’s degrees in the field of food technology. The programme emphasises language and communication, social responsibility, analytical and critical thinking, creativity, problem-solving, teamwork and a global outlook. Graduates achieve the ultimate goal of contributing to the well-being of Hong Kong society at large, particularly to its economy, and to the assurance of food safety for the community.\nProgramme Characteristics\nThis programme meets the international undergraduate degree standards of both the Institute of Food Technologists (IFT) and the International Union of Food Science and Technology (IUFoST). It is an applied and practical programme. Balancing the development of core competency and breadth, the programme emphasises the professional, intellectual and all-round abilities of students. This is achieved through a specially designed curriculum, modern learning/teaching methodologies, multiple assessment tools, workplace learning experience, a caring and supportive learning environment and extra-curricular activities. Students benefit from experienced academic staff and modern equipment and instruments.\nUpon successful completion of the programme, students are ready to embark on careers in the food industry or enter into postgraduate programmes. Graduates utilise the skills and knowledge that they have gained from the programme for personal career development as well as for the benefit of the community.\nRecognition and Prospects \nProfessional Recognition\nGraduates qualify for membership of the Royal Society of Biology (RSB) in the UK.\nGraduates can pursue postgraduate studies at universities and research institutes worldwide.\nCareer Prospects\nGraduates are equipped to work in the rapidly expanding global biotechnology industry. They can pursue careers in the industrial, commercial, education and public sectors in technical, executive or managerial positions. Graduates can also enrol in postgraduate programmes locally or overseas.\nProfessional Recognition\nGraduates qualify for membership of the Hong Kong Chemical Society (HKCS) and the Royal Society of Chemistry (RSC) in the UK.\nCareer Prospects\nGraduates are able to pursue careers in industry, business or the public sector. Our graduates work as chemists, technologists and chemical and/or biochemical process engineers. Employment opportunities abound in various industries, such as plastics and toys, cosmetics and fragrances, drugs and pharmaceuticals, pollution control and the manufacture of printed circuit boards. Further career prospects for graduates can be found in sales and marketing or as management executives in various fields.\nGraduates may work as chemical analysts or environmental protection officials for the government or public utility companies. A career in education to inspire future generations is another possibility. Graduates who wish to pursue further studies have excellent opportunities both in Hong Kong and overseas.\nProfessional Recognition\nThis programme is accredited to the undergraduate degree standards of both the Institute of Food Technologists (IFT) and the International Union of Food Science and Technology (IUFoST). Graduates with 3 years of work experience in the food safety/technology area can apply for certification as food scientists under the IFT. In addition, students may seek the HACCP Intermediate Certificate upon completion of the core Food Sanitation and Safety Management module.\nCareer Prospects\nGraduates of this programme can work for local food manufacturers and traders, food testing laboratories, government departments (including the Food and Environmental Hygiene Department, the Government Laboratory, and the Agriculture, Fisheries and Conservation Department), catering companies, chain restaurants, supermarkets, hotels and education/research institutions. Graduates who wish to further explore food science may choose to pursue postgraduate studies at local or overseas universities.\nAdmission \nCurriculum\nThe three BSc Major programmes offered under this Scheme share some common subjects. Students are required to follow 11 common DSR Core Subjects in the first three semesters (excluding the Summer Term) as a minimum. These are… \nRead MoreHide\nSecondary Major Details\nThe option of Secondary Major in Innovation and Entrepreneurship is available to students of the BSc (Hons) in Applied Biology with Biotechnology.\nSelection Criteria\nStudying on a Secondary Major is not mandatory. Only students with a cumulative GPA of 2.70 or above may be considered for Secondary Major enrolment. Each Secondary Major may stipulate additional selection criteria for admission. Students must apply to and obtain approval from the programme-offering Department no later than the commencement of the second year of study to be admitted to the Secondary Major.\nCredit Requirement\nThe students of the BSc (Hons) Applied Biology with Biotechnology (ABB) with a Secondary Major in Innovation and Entrepreneurship (IE) are required to complete 141 credits for graduation.\n* Six credits from the core subjects of the Major [i.e. Commercialisation of Biotechnology Products (ABCT3104) and Recent Developments in Medical Biotechnology (ABCT4104)] can be double counted as the discipline-specific elective for the Secondary Major.\n>> Suggested Study Pattern for ABB+IE (2022 Year 1 entry)\nProfessional Accreditation\nThe BSc(Hons) Applied Biology with Biotechnology with a Secondary Major in Innovation and Entrepreneurship has been awarded interim accreditation by the Royal Society of Biology. Degree accreditation by the Royal Society of Biology acknowledges academic excellence in the biosciences, and highlights degrees that educate the research and development leaders and innovators of the future.",
  "url": "https://www.polyu.edu.hk/fsn/study/undergraduate-programmes/bachelor-of-science-honours-scheme-in-biotechnology-food-safety--and-chemical-technology"
 },
 {
  "text": "Entrance Year 2023 \nProgramme Code 12454-SY \nMode of Study Full-time \nNormal Duration 2 Years \nProgramme Intake 28 senior year places \nFund Type Government-Funded \nCredits Required for Graduation 60 (minimum)\nThe exact number of credits required for a student to gain a senior year place will depend on the number of transferred credits granted to that student. \nRemarks\nThe credit requirements of this programme are indicative only and subject to review.\nThe exact study duration and number of credits to be transferred will depend on the entry qualifications of individual AD/HD admittees.\nAims and Characteristics\nProgramme Aims\nThis programme aims to provide a unique and profession-oriented educational opportunity for students and to produce well-trained food technologists and food safety officers to meet the needs of the community.\nThe objective is to develop students into all-round exceptional graduates whose intellectual abilities, knowledge and skills are on a par with the international standards for a Bachelor's degree in food-related fields. The programme also emphasises the enhancement of students' language abilities, social responsibilities, analytical and critical thinking abilities, creativity, problem-solving skills, teamwork and global outlook. The ultimate goal is to contribute to the well-being of Hong Kong society at large, particularly to its economy, and to the assurance of food safety for the community.\nCharacteristics\nThis programme meets the international undergraduate degree standards of both the Institute of Food Technologists (IFT) and the International Union of Food Science and Technology (IUFoST). It is an applied and practical programme. Balancing the development of core competencies and broadness, the programme emphasises the professional, intellectual and all-round abilities of students. This is achieved through a specially designed curriculum, modern learning/teaching methodologies, multiple assessment tools, workplace learning experience, a caring and supportive learning environment and extra-curricular activities. Moreover, our department has very experienced academic staff and modern equipment and instruments.\nUpon successful completion of the programme, students should be ready to take up careers in the food industry or enter into postgraduate programmes. They can utilise the skills and knowledge that they have gained from the programme for personal career development as well as for the benefit of the community.",
  "url": "https://www.polyu.edu.hk/fsn/study/undergraduate-programmes/senior-year/bachelor-of-science-honours-in-food-safety-and-technology"
 },
 {
  "text": "Home \nStudy \nList of all Subjects ",
  "url": "https://www.polyu.edu.hk/fsn/study/list-of-all-subjects"
 },
 {
  "text": "Study \nResearch Postgraduate Programme \nAdmissions\nGeneral Entrance Requirements\nProgramme\tEntrance Requirements\t\n2-year full-time/ 4-year part-time MPhil programme\tat least hold a Bachelor’s degree with Second Class Honours or above (or equivalent qualification) conferred by a recognised university\t\n3-year full-time / 6-year part-time PhD programme\tnormally hold an MPhil or equivalent (a research postgraduate degree with a dissertation as an award requirement) conferred by a recognised university\n\t\n4-year full-time / 8-year part-time PhD programme\t\nnormally hold:\nA Master’s degree; OR\nA Bachelor’s degree with First Class Honours (or equivalent qualification), conferred by a recognised university.\n\t\nPolyU may accept other equivalent qualifications. The decision is made on an individual basis.\nEnglish-language requirements\nThe requirements for those who do not have a degree for which English was the language of instruction at a recognised university are:\nAn overall score of at least 6.5 in the International English Language Testing System (IELTS); OR\nA Test of English as a Foreign Language (TOEFL) score of 80 or above for the Internet-based test.\nAll English language test scores are considered valid for two years after the date of the test.\nProgramme \nFor detailed information on the programme offered by the Department of Food Science and Nutrition (FSN), please click for Definitive Programme Documents below.",
  "url": "https://www.polyu.edu.hk/fsn/study/research-postgraduate-programme"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 12058 \nStream Code MFT (Full-time) \nMode of Study Mixed Mode \nNormal Duration 1 year \nFund Type Self-Financed \nCredits Required for Graduation 30 \nInitial Registration Credits 6 for local students\n12 for non-local students \nTuition Fees HK$5,600 per credit for local and non-local students\nRemarks\nEarly applications are strongly encouraged. \nAims and Characteristics\nThis programme aims to provide a unique, professionally oriented education opportunity for Bachelor degree holders with relevant backgrounds, and to produce well-trained nutritionists capable of meeting the needs of the community, especially the elderly. The programme nurtures well-rounded and competitive graduates with excellent knowledge and skills. It includes a carefully designed curriculum, modern learning/teaching methodologies, multiple assessment tools, and workplace learning experiences, with the primary goal of contributing to the health and well-being of the ageing population.\nUpon the successful completion of the programme, students should be able to\nuse their professional skills and knowledge to provide nutrition services and assess the nutritional status of individuals, especially the elderly;\nprovide nutrition counselling and education for individuals, groups and communities to optimise health and well-being, with an emphasis on healthy ageing by applying specific principles of nutrition and communication strategies;\nunderstand the food chain and its impact on people’s food choices, as well as the role of nutrition and diet in healthy ageing;\nanalyse and apply research methods in various nutrition and healthy ageing studies and settings; and\ndemonstrate the critical thinking, communication and analytical skills required to identify and solve problems related to nutrition and healthy ageing.\nRecognition and Prospects\nRecognition\nThe curriculum design is based on the requirements of the UK Association for Nutrition (AfN) for programme accreditation. Graduates have the opportunity to apply to the UK Voluntary Register of Nutritionists (UKVRN) to become Registered Associate Nutritionists (ANutrs).\nProspects\nExcellent job prospects in public health and nutritional science are available to graduates­ – in health services, in academia or in the food and nutrition industry.\nScholarship and Continuing Education Fund\nScholarship\nTwo one-off entry scholarships of HK$10,000 each will be granted to applicants with excellent academic achievements.\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 5 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the scholarship at any time. In case of any dispute / disagreement, PolyU’s decision is final.\nContinuing Education Fund\n^ 'ABCT5023 Public Health Nutrition' (3 credits) offered in this programme has been included the list of reimbursable subjects under the Continuing Education Fund (CEF) [For course commencement after October 2022]. \nAdmission\nEntrance Requirement\nA Bachelor's degree with honours in food, nutrition or health-related disciplines, or other relevant science disciplines. \nEnglish Language Requirement\nIf you are not a native speaker of English, and your Bachelor's degree or equivalent qualification is awarded by institutions where the medium of instruction is not English, you are expected to fulfil the following minimum English language requirement for admission purpose, unless otherwise specified by individual programmes concerned:\nA Test of English as a Foreign Language (TOEFL) score of 80 for the Internet-based test or 550 for the paper-based test;\nOR\nAn overall Band Score of at least 6 in the International English Language Testing System (IELTS).\nEnglish language qualifications other than the above will be considered individually on their own merits by the departments concerned. Applicants may be required to attend interviews or tests to further demonstrate their language proficiency.\nCurriculum\nStudents need to complete the following subjects:\nAdvanced Human Physiology and Anatomy\nFood Preparation and Menu Planning… \nRead MoreHide\nSubject Code Subject Title Credits \nSemester 1\t\nABCT5021\tFood Preparation and Menu Planning\t3\t\nABCT5022\tNutritional Assessment\t3\t\nABCT5025\tNutrition Education and Counselling\t3\t\nABCT5026\n\tPracticum I\n\t1.5\t\nABCT5029\n\tAdvanced Human Physiology and Anatomy\n\t3\t\nSemester 2\t\nABCT5023^\tPublic Health Nutrition\t3\t\nABCT5024\tNutrition and Health for Older Adults\t3\t\nABCT5026\tPracticum I\t1.5\t\nABCT5027 /ABCT5028\tPracticum II / Capstone Project\t1.5\t\nAPSS533\tMental Health and the Aged\t3\t\nRS517\n\tResearch Methods & Data Analysis\t3\t\nSemester 3\t\nABCT5027 / ABCT5028\tPracticum II / Capstone Project\t1.5\t\nTotal\t30\t\n^ 'ABCT5023 Public Health Nutrition' (3 credits) offered in this programme has been included in the list of reimbursable subjects under the Continuing Education Fund (CEF) [For course commencement after October 2022].",
  "url": "https://www.polyu.edu.hk/fsn/study/taught-postgraduate-programmes/master-of-science-in-nutrition-and-healthy-ageing"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 12057 \nStream Code MFT (Full-time) \nMode of Study Mixed Mode \nNormal Duration 1 year \nFund Type Self-Financed \nCredits Required for Graduation 30 \nInitial Registration Credits 6 for local students\n12 for non-local students \nTuition Fees HK$5,600 per credit for local and non-local students\nRemarks\nOnly the full-time option will be offered for admission in 2023/24.\nEarly applications are strongly encouraged. \nAims and Characteristics\nTo provide unique, professionally oriented training in global food safety management and risk analysis for science/technology graduates who want to develop their expertise in food safety.\nTo provide students with advanced knowledge of the major and emerging hazards affecting food safety from a global perspective.\nUpon completion of this programme, students should be able to do the following:\nUnderstand international food standards, laws and regulations and critically evaluate food safety policies as well as legal and sector-specific frameworks for food safety management at local, national and international levels.\nUse their knowledge of risk analysis to critically evaluate the risk posed by major food hazards and address food safety issues worldwide.\nDemonstrate competence in developing risk-based food safety management strategies and implementing food safety management systems (e.g. ISO22000).\nDemonstrate competence in critical analysis, information technology and communication.\nWork effectively as individuals and in multi-disciplinary groups with a commitment to lifelong learning to enhance their professional development.\nRecognition and Prospects\nRecognition\nUpon graduation, students will receive PolyU’s official Graduate Certificate and be qualified to obtain the following certificates:\nAn official training certificate in risk analysis issued by The Joint Institute for Food Safety and Applied Nutrition, established by the US Food and Drug Administration and University of Maryland.\nOfficial certificates in major food safety management systems issued by an accredited certification body.\nProspects\nExcellent job prospects, particularly in food, health and agricultural industries, related government agencies and research institutes in Hong Kong, mainland China and the region, are available to graduates.\nScholarship and Continuing Education Fund\nScholarship\nTwo one-off entry scholarships of HK$10,000 each will be granted to applicants with excellent academic achievements.\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 5 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the scholarship at any time. In case of any dispute / disagreement, PolyU’s decision is final.\nContinuing Education Fund\n^ 'ABCT5012 Global Food Safety Management' (6 credits) offered in this programme has been included in the list of reimbursement subjects under the Continuing Education Fund (CEF) [For course commencement after October 2022]. \nAdmission\nEntrance Requirement\nA Bachelor’s degree with Honours in food safety, food science, food technology, food management, public health or another relevant science discipline.\nEnglish Language Requirement\nIf you are not a native speaker of English, and your Bachelor's degree or equivalent qualification is awarded by institutions where the medium of instruction is not English, you are expected to fulfil the following minimum English language requirement for admission purpose, unless otherwise specified by individual programmes concerned:\nA Test of English as a Foreign Language (TOEFL) score of 80 for the Internet-based test or 550 for the paper-based test;\nOR\nAn overall Band Score of at least 6 in the International English Language Testing System (IELTS).\nEnglish language qualifications other than the above will be considered individually on their own merits by the departments concerned. Applicants may be required to attend interviews or tests to further demonstrate their language proficiency.\nCurriculum\nStudents enrolled in the MSc in Global Food Safety Management and Risk Analysis are required to complete the following courses:\nRead MoreHide\nSubject Code Subject Title Credits \nSemester 1\t\nABCT5011\tFood Safety Risk Analysis\t6\t\nABCT5014\tInternational Food Standards, Laws and Regulations\t3\t\nABCT5015\tFoodborne Chemical and Microbial Hazards: Case Studies\t3\t\nTotal\t12\t\nSemester 2\t\nABCT5012^\t\nGlobal Food Safety Management\n\t6\t\nABCT5013\tFood Safety in Action\t3\t\nABCT5016\tGlobal Food Security\t3\t\nABCT5017\tCapstone Project\t6\t\nTotal\t18\t\n^'ABCT5012 Global Food Safety Management' (6 credits) offered in this programme has been included in the list of reimbursement subjects under the Continuing Education Fund (CEF) [For course commencement after October 2022].",
  "url": "https://www.polyu.edu.hk/fsn/study/taught-postgraduate-programmes/master-of-science-in-global-food-safety-management-and-risk-analysis"
 },
 {
  "text": "Academic Advising is a process through which you will be guided, supported, encouraged and empowered to make wise and realistic academic decisions consistent with your circumstances, interests and aspirations.\nGoals of Academic Advising\nThrough Academic Advising, you can...\nexplore your goals and values in both personal and academic aspects\nunderstand your academic strengths and weaknesses\nunderstand your graduation requirements\ndevelop a study plan to achieve your goals\nexplore solutions when you encounter problems\nAcademic Advising at FSN\nAll students who are admitted to the programs of the FSN Department will need to meet your Academic Advisor at least once a year to discuss your academic plan and aspirations.\nList of Academic Advisors of FSN for academic year 2022-23:\nBSc (Hons) Scheme in Biotechnology, Food Safety and Chemical Technology (12459)\nYear Intake Academic Advisor Contact \nYear 1 (2022 intake)\n- First alphabet of surname from \"A\" to \"C\"\n\tDr Cheung Ching-mei, Chartia\tEmail: chingmei.cheung@polyu.edu.hk\nPhone: 3400 8794\nOffice: Y829\t\nYear 1 (2022 intake)\n- First alphabet of surname from \"D\" to \"J\"\n\tDr Fang Kar-hei, James\tEmail: james.fang@polyu.edu.hk\nPhone: 3400 8703\nOffice: Y804\t\nYear 1 (2022 intake)\n- First alphabet of surname from \"K\" to \"LI\"\n\tDr Geng Ping, Sandy\tEmail: ping.geng@polyu.edu.hk\nPhone: 3400 8729\nOffice: Y857\t\nYear 1 (2022 intake)\n- First alphabet of surname from \"LIANG\" to \"R\"\n\tDr Lee Lawrence Yoon Suk\tEmail: lawrence.ys.lee@polyu.edu.hk\nPhone: 3400 8696\nOffice: Y849\t\n- First alphabet of surname from \"S\" to \"T\"\n\tDr So Chau-ming\tEmail: chau.ming.so@polyu.edu.hk\nPhone: 3400 8702\nOffice: Y843\t\n- First alphabet of surname from \"W\" to \"Z\"\n\tDr Tai Chi-shing, William\n\tEmail: william-cs.tai@polyu.edu.hk\nPhone: 3400 8722\nOffice: Y864\t\nBSc (Hons) in Food Safety and Technology (12454)\nYear Intake Academic Advisor Contact \nYear 2 (2021 normal intake)\n- First alphabet of surname from \"C\" to \"L\"\tDr Kwok Wing-hin, Kevin\tEmail: kwh.kwok@polyu.edu.hk\nPhone: 3400 8687\nOffice: Y823\t\nYear 2 (2021 normal intake)\n- First alphabet of surname from \"O\" to \"Z\"\tDr Zhu Yuyan\n\tEmail: yuyan.zhu@polyu.edu.hk\nPhone: 3400 8678\nOffice: Y865\t\nYear 3 (2020 normal intake)\n- First alphabet of surname from \"A\" to \"K\"\n\tDr Chiou Jiachi, Amber\tEmail: jiachi.amber.chiou@polyu.edu.hk\nPhone: 3400 8664\nOffice: Y807\t\nYear 3 (2020 normal intake)\n- First alphabet of surname from \"L\" to \"Z\"\n\tDr Zhao Danyue, Daisy \tEmail: daisydy.zhao@polyu.edu.hk\nPhone: 3400 8724\nOffice: Y848\t\nYear 4 (2019 normal intake)\n- First alphabet of surname from \"C\" to \"K\"\n\tDr Li Shi-ying, Christine \tEmail: christine.sy.li@polyu.edu.hk\nPhone: 3400 8735\nOffice: Y830\t\nYear 4 (2019 normal intake)\n- First alphabet of surname from \"L\" to \"Z\"\tDr Wong Ho-yin, Marcus \tEmail: marcus-ho-yin.wong@polyu.edu.hk\nPhone: 3400 8707\nOffice: Y831\t\nAcademic Advising at PolyU",
  "url": "https://www.polyu.edu.hk/fsn/study/academic-advising"
 },
 {
  "text": "Study \nWork-Integrated Education (WIE) \nFAQs \nDepartment strongly encourages students to seek job or internships related to major discipline or professions. We also accept placements in different business or job natures. Internship in Sales and Marketing, Government or Education sector can also be accepted. However, work in non-registered companies/organisations, private tutoring and virtual internships are NOT accepted as WIE in FSN. \nYou can accumulate the 120 training hours with at most 2 internships. \nBefore commencement of internship \nYes, all FSN students are required to attend the Pre-WIE training BEFORE the internship starts. \nStudent can complete ONE of the Pre-WIE Training BEFORE obtaining approval for any WIE activity. Please check here for more details. \nYou can search for internship via (1) SAO Careers and Placement Office; (2) PolyU Job Board; (3) Department or (4) by yourself. Virtual internship is not accepted as WIE fulfillment in our Department. \nWhen you obtain an internship offer and would like to use this internship to fulfill the WIE requirement: -\nMake sure that you have already completed pre-WIE training. If not yet, please complete the Pre-WIE Training via Blackboard or Student Affairs Office (SAO)\nSubmit the following information through the online submission form 7 days before you start the WIE to your corresponding WIE coordinator: - \nCompany name and address;\nAnticipated Duration of WIE;\nInternship title; \nInternship duties; \nPre-WIE Training Status; and\nNo Objection Letter (NOL) (for non-local students only)\nOnce you receive prior approval from WIE Coordinator, you may start the internship.\nYou SHOULD seek WIE Coordinator’s prior approval BEFORE taking-up any internships. \nInternship without prior approval would not be counted for the fulfillment of WIE.\nAfter completion of internship \nAfter WIE training (or accumulated 120 WIE hours) is completed, please apply for WIE completion endorsement by following the procedures below:\nDownload WIE Report on FSN Departmental website.\nFill in Parts A to C of the WIE Report by yourself, then invite your job or internship supervisor to complete Part D with the provision of company stamp. \nPlease submit the completed form to fsn.wie@polyu.edu.hk by yourself and copy (i.e. cc) your job/internship supervisor in the email for his/her information. The following documents are also required to attach in the submission email if company stamp is unavailable: \nReference letter/Completion of service with letterhead; or\nPayroll slip(s) indicating company’s name and working hours \nUpon receipt of all necessary documents, it normally takes 4 - 6 weeks to review and process your application.\nRecords in eStudent will be updated at the end of semester. \nStudent can complete WIE any time during their study period. To avoid delay in graduation, students are strongly advised to complete WIE activities before the end of Semester 2 of the final year study. ",
  "url": "https://www.polyu.edu.hk/fsn/study/work-integrated-education/faqs"
 },
 {
  "text": "Key Points in completing WIE (click here for full procedures)\nMUST obtain prior approval from WIE coordinator BEFORE the commencement of WIE.\nAttendance of Pre-WIE Training is required BEFORE the commencement of WIE.\nWIE Report can be downloaded in FSN website.\nUpon completion of WIE, a completed WIE Report should be submitted to fsn.wie@polyu.edu.hk, and cc. your job/internship supervisor.\nBackground of Work-Integrated Education\nWork-Integrated Education (WIE) is a mandatory component in the curriculum of all PolyU UGC-funded undergraduate degree programmes. WIE at PolyU aims to provide students with a work-based learning experience through internship that takes place in a real-life work environment which is relevant to the students’ chosen professions. On completion, students will be able to demonstrate one or more of the following WIE learning outcomes:\nappropriate knowledge, skills and techniques necessary for professional development;\ncompetency and effectiveness in delivering professional performance, or high ethical standards in the professional attributes; \neffective communication or information management skills, critical thinking, analytical ability and entrepreneurship or leadership;\ncare and concern for the community at a local, national and international level.\nWIE Requirement \nA completion of at least 120 working hours of full-time/part-time WIE activities before graduation is needed. Work in non-registered companies/organisations, private tutoring and virtual internships are not accepted.\nThe Pre-WIE training aims to cultivate students’ good work ethics and behavior. It is mandatory for FSN students to attend the training before the commencement of WIE internships. Students can complete ONE of the following Pre-WIE Training BEFORE obtaining approval for any WIE activities. Prior approval from WIE coordinator is also required before the commencement of WIE internships.\nOption 1: \nPre-WIE training organised by FSN which includes an optional face-to-face briefing session and a compulsory online Pre-WIE Training module via Blackboard. Departmental training is available and announced in Semester 2 of each academic year. \n\t\t\nOption 2: \nPre-WIE training workshop organised by SAO which is mandatory for offshore WIE activities. To take part, please find related information from https://www.polyu.edu.hk/sao/ > Careers and Placement Section (CPS) > Upcoming Activities and Events and make registration via PolyU Online Student Service (POSS).",
  "url": "https://www.polyu.edu.hk/fsn/study/work-integrated-education/guideline"
 },
 {
  "text": "Study \nWork-Integrated Education (WIE) \nInternship Opportunities \nCode Employer Job Title Application Deadline Information \n003-2023\tTüv Rheinland Hong Kong Ltd.\tIntern\tASAP\t\nPDF\nPlease send your CV, transcript and Cover Letter to Ms. Sinny Chen (recruitmenthk@tuv.com)\n\t\n002-2023 \tIntertek Testing Services HK Limited\tInternship Trainee\t30-Jul-23\t\nPDF\nPlease send your CV and transcript by email to Ms. Roella Tsang (roella.tsang@intertek.com)\n\t\n001-2023\tHKSAR-AFCD-Aquaculture Fisheries Division \tAFCD Summer Internship Programme 2023\t22-Mar-23\t\nPDF\nPlease submit your application in a cover letter and a 1-page CV to hilary.tsoi@polyu.edu.hk\n007-2022\tPolyU ABCT\tSIEP Summer Student Assistant Programme 2022\t15-May-22\tPDF\t\n006-2022\tIntertek Testing Services Hong Kong Ltd\tInternship Trainee\t25-Apr-22\tPDF\t\n005-2022\tCastco Testing Centre Limited\t\"Internship Trainee – Chemistry/ Food Internship Trainee – Testing and Certification\"\t30-Apr-22\tPDF\t\n004-2022\tIntertek Testing Services Hong Kong Ltd\tInternship Trainee\t25-Apr-22\tPDF\t\n003-2022\tHong Kong Productivity Council\tSummer Intern\t31-Mar-22\tPDF\t\n002-2022\tSGS Hong Kong Limited\tSummer Intern\t1-Apr-22\tPDF\t",
  "url": "https://www.polyu.edu.hk/fsn/study/work-integrated-education/internship-opportunities"
 },
 {
  "text": "Experience and Opportunities \nExchange Opportunities \nUndergraduate Exchange \nExchange Programme \nThe PolyU Global Student Exchange is an exchange programme for undergraduates. Students who participate in the exchange programme will benefit not only from enhancing educational experiences but also awareness of multi-culture and improving language skills.",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/exchange-opportunities/undergraduate-exchange"
 },
 {
  "text": "Experience and Opportunities \nExchange Opportunities \nUndergraduate Exchange \nInbound Exchange \nFSN emphasize both theories and applications, we aim to extend our students’ learning experience beyond the classroom, and to enhance their all-round development.\nWe welcome students from overseas institutions to join us.\nIncoming Exchange Study Abroad \nDefinition\nIf your Home institution has a valid Student Exchange Agreement with PolyU, you can apply to PolyU as an Incoming Exchange student through nomination by your Home institution.\nPartner list of PolyU\nIf your Home institution does not hold an Exchange collaboration with PolyU, you are regard as a Study Abroad student (not available to institutions in Chinese Mainland, Macau and Taiwan).\nPeriod\n\tUsually 1 semester (Sem1/Sem2/Summer)\nCourse\nIncoming students can choose their host Department, and will be enrolled as a Full-time student.\nEach student is required to study min. 9 credits and max. 18 credits per semester, in which subjects within the chosen Department must take up at least 50% of enrolled subjects (Subject list)\nRequirement\t\nNo proof of English proficiency is required for Incoming Exchange students (except from China/ Taiwan)\nRecommend an English proficiency equivalent to IELTS 6.0 or TOEFL 80 internet-based\nRecommend GPA point of at least 2.7/4.0\nFee\t\nWaived PolyU tuition fee (but students are still required to pay tuition fee at home institution)\nStudents have to pay for their own air tickets, accommodation, Visa, insurance and daily expenses etc.\nRequired to pay PolyU tuition fee\nStudents have to pay for their own air tickets, accommodation, Visa, insurance and daily expenses etc.\nApplication\tNominations are to be made by your home institution, please consult your Home institution on its requirements for exchange nomination.\tInterested students may apply directly via GEO.\t",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/exchange-opportunities/undergraduate-exchange/inbound-exchange"
 },
 {
  "text": "FSN offers exchange opportunities at renowned institutions in overseas countries such as the United States, Canada, England, Germany, Australia, Singapore, Taiwan and Mainland China. The overseas experience broaden students’ horizons, not only in their professional knowledge but also in their global outlook and cultural appreciation.\nPeriod\n\t1 or 2 semesters \t\nInstitution\nList of host institutions available differs each academic year. \nThe Department will call for applications via email annually based on the quotas and institutions available. \nRequirement\t\nFull-time undergraduate degree-seeking students (local/non-local) in UGC-funded programme\nCompleted at least 1 year of study before the proposed exchange\nCGPA > 2.75 (required by PolyU)\nFulfill min. requirements on CGPA and English language (as set by host institution)\nFee\t\nExchange students shall pay PolyU tuition fee and bear the costs of air tickets, accommodation, Visa, additional insurance and daily expenses etc.\nStudents may apply for Exchange Funding from GEO, please see GEO website for more information. \nInsurance\tFor the details of PolyU Travel Insurance, please click here.\t\nFor more details, please visit the Global Engagement Office (GEO) website.\nFSN Outbound Exchange - Host Institution\nCountry Institution \nAustralia\nUniversity of Technology Sydney\nBrunei\nUniversiti Brunei Darussalam\nCanada\nUniversity of Waterloo\nDenmark\nCopenhagen University of Applied Sciences\nFinland\nMikkeli University of Applied Sciences\nGermany\nUniversity of Stuttgart\nTaiwan\nNational Tsing Hua University\nUK\nPembroke College\nUS\nKansas State University\nNorth Carolina State University\nPurdue University\nUniversity of Maryland\nSingapore\nNational University of Singapore",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/exchange-opportunities/undergraduate-exchange/outbound-exchange"
 },
 {
  "text": "FSN Entry Scholarships for Outstanding HKDSE Students\nThe Department of Food Science and Nutrition (FSN) accords recognition to outstanding HKDSE students admitted to our undergraduate programmes via JUPAS from 2017/18 onwards. Awardees will be granted “FSN Entry Scholarships for Outstanding HKDSE Students” (Entry Scholarships) of various amounts.\nHow to apply for the Entry Scholarships?\nThere is no need for students to apply separately for entry scholarships. The Department will identify outstanding admittees, and notify them of the award, after the commencement of the academic year.\nWho is eligible?\nAll Year 1 students admitted to our undergraduate programmes via JUPAS will be considered for the Entry Scholarships.\nCategories of Entry Scholarships\nIn addition to the University Academic Scholarships given to outstanding HKDSE students (please refer to Study@PolyU for eligibility), Entry Scholarships from the Department will be granted if the admittee fulfills the following categories.\nCategory I - Students attaining Level 5** in HKDSE subject(s)^\nTier HKDSE Requirements Scholarship Amount \n1\tLevel 5** in 3 or more subjects\tOne-off scholarship of HK$25,000\t\n2\tLevel 5** in 2 subjects\tOne-off scholarship of HK$20,000\t\n3\tLevel 5** in 1 subject\tOne-off scholarship of HK$15,000\t\nCategory II – Students with an aggregate HKDSE score of 27 or above for the Best 5 subjects (for degree programmes) / Chinese & English Languages + Any Best 3 Subjects (for Higher Diploma programme) # (for 2020/21 intake onwards)\nTier HKDSE Scores Scholarship Amount \n1\t29 or above\tOne-off scholarship of HK$35,000\t\n2\t28\tOne-off scholarship of HK$30,000\t\n3\t27\tOne-off scholarship of HK$25,000\t\nStudents meeting the requirement for both categories will get the Entry Scholarships ONCE for whichever category of higher value, being capped at the maximum amount received by a student per academic year as stipulated by the University guideline◇.\nRemarks:\n^ The Extended Mathematics modules will also be taken into account for scholarship consideration.\n# For the purpose of calculating the admission scores, HKDSE level attainments will be converted to level points where Level 5**=8.5, 5*=7, 5=5.5, 4=4, 3=3, 2=2, 1=1 and Unclassified=0.\n◇ A student can concurrently hold more than one scholarship administered by the University in an academic year if the total value of scholarships received by him/her does not exceed his/her annual tuition fee payable plus HK$50,000 unless otherwise stipulated.\nDisclaimer: FSN reserves the right to change the terms or withdraw the above scholarship. In case of any dispute/disagreement, FSN’s decision is final.",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/scholarships/undergraduate--entry--scholarships"
 },
 {
  "text": "Hong Kong PhD Fellowship Scheme\nThe scheme is offered by the Research Grants Council (RGC) of Hong Kong which aims at attracting the best and brightest students in the world to pursue their PhD programmes in Hong Kong's institutions. \nSuccessful HKPFS awardees of PolyU will receive for the entire normal study period:\nAnnual Stipend: HK$325,200 (~US$41,690)\nResearch Excellence Scholarship: in the form of a tuition fee waiver\nAnnual Conference Grant: HK$13,600 (~US$1,740)\nCash Award: HK$40,000 (~US$5,120) for the first year, and HK$20,000 (~US$2,560) per year from the second year to the end of the normal study period\nUniversity Accommodation: a guaranteed place for 2 years\nNominated HKPFS candidates by PolyU to RGC will automatically be offered a PhD place with the award of: \nPolyU Presidential PhD Fellowship Scheme (PPPFS); or \nPolyU Research Postgraduate Scholarship (PRPgS).\nFor details, please visit https://www.polyu.edu.hk/gs/hkpfs/\nHKPFS Leaflet from GS: https://www.polyu.edu.hk/gs/docdrive/mktg/PolyU_Research_Studies_Booklet_23-24.pdf?fbclid=IwAR1dziQa8zr4yp98kbrQB4KQuZMdaHJ4tjtc3aC5zvx2mqryV6tDdcynu9M\nResearch Studentship\nPolyU offers Research Studentships to full-time PhD or MPhil students. The Studentship is a scholarship intended to be a means of financial support to allow full-time research students to fully focus on their studies. It shall be awarded on the basis of academic merit. The period of the Studentship is decided by the Department according to the student’s ability, academic background or experience.\nFor details, please visit https://www.polyu.edu.hk/gs/prospective-students/fellowship-scholarship-schemes/.\nScholarship\nAwards\nFor the 2020/21 academic year, each successful candidate will receive a one-off grant of HK$50,000.\nNomination Procedure\nHeads of institutions will be invited to make nominations in September each year. Candidates will be invited to attend an interview normally in December. Candidates who have not heard from the Sir Edward Youde Memorial Fund Council by the end of December should consider themselves not being selected.\nFor more information, please visit http://www.wfsfaa.gov.hk/sfo/seymf/en/whatwedo/fellowships_local.htm\nAwards\nTwo scholarships each valued at $8,000 stipulated to PolyU\nNomination Procedure\nNomination invited via Graduate School\nThe awardees are not allowed to concurrently hold other scholarship(s)administered by PolyU\nAwards\nEach HKAUW Postgraduate Scholarship recipient will receive a scholarship certificate and an award of HK$20,000.\nNomination Procedure\nValue of the award\nA Croucher Scholarship normally comprises the following:\nan annual maintenance allowance which is set at USD30,300 per annum;\na one-way economy class air fare at both the beginning and end of tenure;\ntuition fees and college fees (where applicable);\na one-off arrival allowance of USD1,000 to cover the costs of arriving in a new country during the first year of tenure;\nan academic development allowance of up to USD2,000 per annum to allow Croucher Scholarship recipients to attend conferences, workshops or courses during the tenure of their awards;\na medical insurance allowance of up to USD2,000 per annum to cover medical insurance costs;\na family allowance of up to USD16,000 per annum for the first child and up to USD6,800 per annum for every additional child who resides with the scholar during the entire duration of the award;\na commencement award of USD7,575 to be offered towards the end of doctoral studies to cover the cost of thesis preparation and travel expenses for scholars and their family members for attending their graduation ceremonies; and\na science education allowance to offer support to those Croucher award recipients particularly interested in science education through well-designed activities and projects in schools and in the wider community. Interested scholars are invited to submit proposals to the Foundation for consideration of a programme of activities designed to involve school students, teachers, families and/or other non-specialist audiences in dialogue and debate, within the tenure of their awards.\nFor more information, please visit https://www.croucher.org.hk/funding/study_awards/scholarships\nValue of the award\nEach award winner will receive a cash prize of $10,000 while honorable mention $5,000 and a certificate of recognition\nEligibility\nThe Awards are open to all postgraduate research students who are pursuing M.Phil. or Ph.D. degree in any of the tertiary institutions in Hong Kong. Those who have graduated recently (within 2 years of graduation) are also eligible.\nAll applicants should join HKIS as Student or Ordinary Members as applicable and enjoy free membership by completing the Membership Application Form.\nApplication Method\nOpen application For more information, please visit http://www.science.org.hk/index.php?action=awards\nThe Hong Kong Polytechnic University International Postgraduate Scholarships for PhD Studies will be awarded to academically strong applicants who can contribute to the internationalisation of PolyU and bring cultural diversity to the University.\nSubject to satisfactory progress in students' studies, the scholarship granting period will coincide with that of the tuition fee charging period. Scholarships are not for offsetting fee for extension of registration.\nValue of the award\nEach successful candidate will receive for a maximum of nine months at a monthly scholarship of €1,050 for conducting research in Austria in the fields of natural sciences, technical sciences, human medicine, health sciences, agricultural sciences, social sciences, humanities and arts.\nApplication Method\nNomination invited via Graduate School For more details, please visit https://grants.at/en/",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/scholarships/postgraduate-studentship-and-scholarship"
 },
 {
  "text": "Experience and Opportunities \nAlumni \nActivities ",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/alumni/activities"
 },
 {
  "text": "Experience and Opportunities \nExchange Opportunities \nPostgraduate Exchange \nOutbound\nThe Research Student Attachment Programme provides invaluable research experience and an opportunity for full-time PhD students to add a global dimension to university life. Successful applicants will continue to receive stipend, if applicable. Travel expenses will normally be supported based on the actual amount spent on going to and returning from the host institution only and will be capped at HK$10,000. A monthly subsistence allowance of HK$7,500 (a daily rate of HK$250) will be granted and the total amount for each PhD student will be capped at HK$45,000, i.e., support for a maximum of six months only. Students will continue to pay tuition fees, if applicable, as required by PolyU. \nMore information\nInbound\nIncoming research students will be provided with a financial support of HK$12,000/month (a daily rate of HK$400) for a maximum of six months. Incoming visiting PhD students will not be required to pay tuition fees at PolyU. However, they will continue to pay tuition fees, if applicable, to their home institutions. For enquiries, please contact the Graduate School by email at gs.jep@polyu.edu.hk. \nFAQ",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/exchange-opportunities/postgraduate-exchange"
 },
 {
  "text": "1. Quality evaluation of Chinese medicine\nThe quality of the raw material of Chinese materia medica is essential to its efficacy and the health and safety of the consumers. With the rapid development of the Chinese medicine industry and its wide application, there is a new demand on the quality control of the raw material. The quality evaluation of Chinese materia medica includes authentication, qualitative and quantitative analysis of marker components, detection of contaminants or residues, etc. \nWe are devoted to the development of novel and fast detection methods, including the application of near infra-red spectroscopy and direct mass spectrometry, which greatly reduce the time and sample loss in sample preparation. In addition, based on our strength in chemometrics, we are now developing bioactivity guided quality evaluation methods.\n2. Metabonomics study of Chinese medicine on the prevention and treatment of geriatric and chronic diseases\nMetabonomics is a high-throughput analytical method based on system biology for the analysis of metabolites. The application of metabonomics in efficacy evaluation, study of action mechanisms and metabolite fingerprint allows the monitoring of the metabolism of the drugs in the body; more importantly, by observing the change of endogenous metabolites, we can further predict the biochemical changes and status in the body. The action mechanism of Chinese medicine can thus be deduced and the target and receptors responsible for the drug response can be identified. \nWe have studied the effect of Chinese medicine on diseases like osteoporosis and cardiovascular diseases for years, where the animal models are very sophisticated and the chemical composition of some of the herbs we studied are well characterized. By the application of metabonomics, we are going to conduct more in-depth studies on the relationship of the chemical composition and the action mechanism.\n3. Study of anti-cancer activities of drug candidates derived from Chinese medicine and natural medicine.\nThe usage of Chinese medicine in treating cancer has a long history. It has an advantage in the alleviate tumor development, improving the quality of life, extending the residence time; Treating cancer with Chinese medicine can be divided into dispelling evil and righting complementing with combination of multiple drugs to achieve the comprehensive treatment results. In addition, traditional Chinese medicine and natural medicine has found to be a treasure trove of new compounds. It can combine with modern means of chemical synthesis and structure-activity relationship studies, to promote the development of anticancer drugs.\nWe are studying the traditional compound combined with Western medicine to treat estrogen receptor-negative breast cancer, understanding of its mechanism of action, and to provide a scientific basis for clinical treatment programs. In addition, we managed to isolate monomer from traditional Chinese medicine and natural medicine, and modify their structure or make synthetic dimer, in order to study their anti-tumor effect.",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/state-key-laboratory-of-chinese-medicine-and-molecular-pharmacology---incubation/research-direction"
 },
 {
  "text": "Research \nResearch Centres \nState Key Laboratory of Chinese Medicine and Molecular Pharmacology (Incubation) \nPeople \nProf. Wing-Tak WONG \nDirector\nProf. Wong obtained his Ph.D. in Cambridge University, UK and is the Dean of the Faculty of Applied Science and Textiles and Chair Professor of the Department of Applied Biology and Chemical Technology, The Hong Kong Polytechnic University. His major research interest includes lanthanide chemistry, nanomaterials, bio-imaging and clone delivery mechanism.\nProf. Wong has been promoting the research development in Chinese Medicine since he joined PolyU in 2009. He has published more than 420 papers and had successfully trained more than 42 PhD graduates in the past twenty years. \nHis research accomplishment has led him to the awards of Outstanding Young Researcher Award in 2001, Croucher Senior Research Fellowship in 2002, Outstanding Research Student Supervisor Award in 2003 by the University of Hong Kong and Outstanding Achievement Award in Scientific Research for Institutions of Higher Education of China.\nDr Daniel Kam-Wah MOK \nDeputy Director\nDr. Mok obtained his Ph.D. in The Hong Kong University and worked as a post-doc on theoretical chemistry in Cambridge University, UK. He is now an Assistant Professor in the Hong Kong Polytechnic University and Deputy Director of the Institute of Modern Chinese Medicine.\nDr. Mok's major research interest includes the application of chemometric technqiues in the identification of Traditional Chinese Medicine and herbal materials, chemical analysis of herbal materials and metabolomics studies. He is developing innovative techniques for quality control of Traditional Chinese Medicine, such as the application of Near-Infrared Spectroscopy. Dr. Mok participated in an Areas of Excellence project on Chinese Medicine funded by University Grants Committee and two other research projects related to authentication and analysis of herbal materials, which are Authentication Studies of Valuable Chinese Materia Medica funded by the Hong Kong Jockey Club Institute of Chinese Medicine and Hong Kong Chinese Materia Medica Standards funded by the Department of Health. He published more than 70 papers in various international scientific journals (Science citation Index) on Theoretical Chemistry, Chemical analysis of herbs, Chemometrics Techniques in Chemistry and Near-Infrared Spectroscopy.\nProf. Man-Sau WONG \nAssociate Director\nProf. Wong received her Ph.D. from The University of Chicago. Currently, she is Associate Professor in the Hong Kong Polytechnic University and Associate Director, Institute of Modern Chinese Medicine, The Hong Kong Polytechnic University Shenzhen Research Institute. \nProf. Wong engaged in molecular nutrition research and traditional Chinese medicine treatment of osteoporosis and breast cancer. She has many years of research phytoestrogens, estrogen receptor, breast cancer cells and biological wealth of research experience. Dr. Wong has received a number of domestic and foreign research funding. In the past five years, she has undertaken 11 projects including the cross-border Natural Science Foundation of China, the Shenzhen-Hong Kong Innovation Circle Program, the Hong Kong Research Grants Council (RGC) and Innovation & Technology Fund. She has issued over 80 publications in international journals.\nDr Shun-Wan CHAN\nAssociate Director\nDr. Chan obtained his bachelor degree in Biotechnology in The University of Hong Kong, Ph.D., in Pharmacology and Pg.Dip., in Epidemiology & Biostatistics in The Chinese University of Hong Kong. Dr. Chan has been teaching and undertaking research projects since 2000 in the Hong Kong Polytechnic University. Familiarizing himself with Chinese Medicine, Pathology and Pharmacology, Dr. Chan focuses on developing medicine and functional food. Currently, Dr. Chan has corporation projects with The University of Hong Kong, the Chinese University of Hong Kong and University of Macau. He has issued more than 50 International papers.\nProf. Zhongping YAO \nAssociate Director\nDr. Yao is an expert in mass spectrometry. His research interest is development of new ionization techniques and application of that to analytical problems.",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/state-key-laboratory-of-chinese-medicine-and-molecular-pharmacology---incubation/people"
 },
 {
  "text": "Joint course on Food Safety Risk Analysis\nWe are very pleased to announce the first round of food safety training courses in collaboration with the Joint Institute for Food Safety and Applied Nutrition (JIFSAN), a centre of excellence established by the United States Food and Drug Administration (FDA) and the University of Maryland, will start in December 2018. The program will be co-taught with JIFSAN trainers.\nThe courses Centre will offer food safety training on different aspects of risk analysis, covering basics like understanding terminology of food safety risk analysis, technical aspects such as how to use tools and techniques to conduct risk assessment (e.g. chemical and/or microbiological risks), and management aspects on decision process and risk communication.\nThis is in response to the increasing need to educate food safety and other public health professionals on the principles of risk analysis and the tools and in order to systematically address food safety issues worldwide. Risk analysis is a core practice of international organizations such as Codex Alimentarius Commission (Codex) and the World Trade Organization (WTO).",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre/jifsan"
 },
 {
  "text": "The Specific Pathogen Free (SPF) Grade Animal Laboratory\nThe Specific Pathogen Free (SPF) Grade Animal Laboratory ensures high quality and reproducibility of animal testing. The laboratory is designed according to the \"National Standard for the Quality of Laboratory Animal, PRC\". It is set up according to the barrier system, which imposes stringent controls on the flow of personnel and materials to prevent microbial contamination. The animal laboratory is inspected annually by the authority and granted with \"The Guangdong SPF Grade Laboratory Animal Facility Certificate\".\nThe laboratory mainly accommodates KM mice, NIH mice, C57 mice, SD rats and nude mice for preventive and therapeutic studies. The animal laboratory allows reliable investigation of pharmacology, efficacy and safety evaluation of drugs under in vivo conditions.\nThe Pharmacology Laboratory\nThe Pharmacology Laboratory is equipped with the clinical chemistry analyzer and hematology analyzer to analyze the metabolites. Other sophisticated equipments are used to trace the radioactive biomarkers in animal studies to study the metabolism. Paraffin sectioning of tissues and organs for pathological investigation, e.g. in chronic toxicity study, can also be carried out. Cryostat can be used for sectioning of fresh tissues.\nCell Culture Laboratory\nCell Culture Laboratory was well equipped for cellular investigations required in e.g. in vitro drug screening, study of action mechanisms, etc. With the equipment in the Molecular Pharmacology Laboratory, in-depth studies at the genetic and proteomic level can be carried out.\nMajor Equipment:\nAnalytical Chemistry and Preparation\nXevo TQD (Triple Quadrupole Mass Spectrometer)\nSynapt G2 HDMS (Ion-mobility Quadrupole Time-of-Flight Mass Spectrometer)\nBruker AVANCE 400 MHz NMR Spectrometer\nBruker HCT LC/MS\nNovasep Hipersep Lab Industrial Scale Preparative HPLC System\nAgilent 1100 Series HPLC System (DAD/ELSD)\nAgilent 1200 Series HPLC System\nShimadzu Prominence LC-20A HPLC Systems\nAgilent 1100 Series Purification System\nAgilent 6890/5973N GC/MSD\nAgilent 6890 GC System (FID/ECD)\nPerkin Elmer Polarimeter\nCAMAG Thin Layer Chromatography Analyzing System\nGeneVac Centrifugal Evaporator System\nHeidolph Laborota 4001 Series Rotary Evaporators\nMBRAUN Glove Box (with Gas Purification)\nMetrohm 787 Karl-Fisher Moisture Titrator\nSOTAX AT7 Off-line Semi-automated Dissolution Testing System\nBINDER KBF 115 Constant Climate Chamber\nHeto Drywinner DW8 Freeze Dryer System\nEfficacy/Safety Evaluation and Molecular Biology\nSpecific Pathogen Free (SPF) Animal Laboratory\nTecniplast Metabolic Cage (Mice & Rat)\nTecniplast Individually Ventilated Cage SealsafeTM\nADInstrument ML785 PowerLab/8SP\nRoche Midtron® Junior II Urine Analyzer\nTECO Coatron M1 Coagulation Analyzer\nESCO Equ/04 Class II Type A/B3 Biological Safety Cabinet\nShel Lab 2323TC CO2 Incubator\nThermolyne Locator JR Dewar Storage System\nLeica DM IL Inverted Microscope\nLeica DM L Binocular Microscope\nBio-Rad CFX96 Real-time PCR Detection System\nBMG LUMIstar Galaxy/FLUOstar Galaxy Microplate Reader\nBio-Rad ChemiDoc XRS Gel Documentation System\nHitachi 7100 automatic biochemical analyzer",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/state-key-laboratory-of-chinese-medicine-and-molecular-pharmacology---incubation/facilities"
 },
 {
  "text": "News and Events \nNews and Awards \n1 / 1\nThe International Congress on Obesity (ICO) is the pre-eminent global gathering for obesity experts and was held on 18-22 October 2022 in Melbourne, Australia. The congress opened to approximately 1,000 delegates from a range of disciplines; including clinicians, policy makers, scientists and UN representatives that bring together experts on a wide range of topics including obesity research and practice, pandemic preparedness, basic molecular and cellular science, clinical management and treatment, systems biology, public health and policy.\nMiss LIU Qing (Ph.D. student of Dr Zhu Yuyan) won the Best Early Career Researcher Poster Award titled “Role of SOAT1 in regulating intracellular cholesterol redistribution during adipogenesis” at the International Congress on Obesity 2022.Our warmest congratulations to Miss LIU Qing for her achievement!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/the-best-early-career-researcher-poster-award-in-the-international-congress-on-obesity-2022"
 },
 {
  "text": "PolyU has achieved an encouraging milestone of having more than 200 PolyU scholars ranked among the world’s top 2% most-cited scientists in the newly released metrics compiled by Stanford University.\nThere are 18 scholars from the Faculty of Science who are listed as the top 2% scientists in a global list compiled by Stanford University, reflecting our faculty’s excellent research performance. Three researchers from FSN are ranked as the most top 2% scientists globally including Prof. Wong Man-sau, Prof. Wu Jian-yong and Dr Lai Wing-fu.\nThis year’s data is based on the 1 September 2022 snapshot from Scopus, and it provides standardised information on citations, h-index, co-authorship-adjusted hm-index, citations to papers in different authorship positions, and a composite indicator.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/polyu-researchers-are-listed-as-top-2-percent-scientists-worldwide-by-stanford-university"
 },
 {
  "text": "Congratulations to Dr Chang Jinhui Gail, Research Assistant Professor of ABCT and the Co-founder of Bo InnoHealth Biotechnology Company Limited (a PolyU GBA Start-up PostDoc and PolyU Academic-led startup), has won a silver medal at the International Exhibition of Inventions of Geneva - Special Edition 2022 Inventions Geneva Evaluation Days – Virtual Event. The Exhibition is regarded as one of the most important annual global events devoted exclusively to inventions, with over 1,000 inventions being presented this year.\nThe award-winning project of Dr Chang Jinhui Gail is “AkkMore™: a Fungus and Plant Based Supplement Against Obesity or Prediabetes”. AkkMore™ is a nutritional supplements formula drink that aims to improve users’ body conditions by building a healthy microbiome. AkkMore™ formula precisely targets on promoting the abundance of Akkermansia muciniphila (Akk) in human guts. It is designed to reduce metabolic disorders and lose body weight.\nThe research team has recently completed animal studies as well as the phase 1 clinical trial in humans. \nLet us take this opportunity to congratulate Dr Chang on receiving the honor.\nPlease visit here for more details.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/dr-chang-jinhui-gail"
 },
 {
  "text": "We are delighted to announce that Prof. Wing-tak Wong, Deputy President and Provost of PolyU, was appointed by the Chief Executive as the Chairman of the Hong Kong Council for Testing and Certification (HKCTC) for two years with effect from January 1, 2022.\nProf. Wong served as Head of Department of ABCT in 2009-2015 and Dean of FAST in 2015-2020, as well as the Director of the University Research Facility in Chemical and Environmental Analysis in 2015 – 2020. He has played a vital part in establishing four state-of-the-art University Research Facilities, namely Materials Characterisation & Device Fabrication, Life Sciences, Big Data Analytics, and Chemical and Environmental Analysis. He was a key driver in setting up the Food Safety and Technology Research Centre in 2011 to address the societal need for professional advice on food related issues. Since 2020, he has been serving as a member of HKCTC.\nThe Secretary for Innovation and Technology, Mr Alfred Sit, welcomed the appointment of Prof. Wong, and said that the Council would benefit from his ample leadership experience and expert insights in chemical technology.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/prof-wing-tak-wong"
 },
 {
  "text": "Dr Kevin Kwok Wing-hin, Associate Director of Research Institute for Future Food and Assistant Professor of the Department of Applied Biology and Chemical Technology was interviewed by the RTHK Programme “Climate Watcher”.\nThe problem of global food imbalance is imminent. Human food is mainly produced by animal husbandry and agricultural activities. There is one-third of the world's land is currently used for animal husbandry and farming. Animal husbandry not only produce carbon dioxide or other greenhouse gases, which increasing the greenhouse effect. But also, the agriculture activities will damage the soil structure and quality, seriously damage the ecology of the earth.\nDr Kevin Kwok Wing-hin, Associate Director of Research Institute for Future Food and Assistant Professor of the Department of Applied Biology and Chemical Technology, introduced the development and trend of future food on RTHK radio programme “Climate Watcher”. Dr Kwok indicated that there are currently feasible methods of making future food, such as freezing method, mariculture and hydroponic cultivation.\nIn addition, urbanites live a busy life and may lack nutrients such as calcium and iron in their daily diet. Therefore, Dr Kwok is studying on the research to add the nutrients into prototype foods which enables urbanites to absorb comprehensive nutrition in a single food. It is expected to develop organic and environmentally-friendly food in line with the goals of sustainable development.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/dr-kevin-kwok-wing-hin"
 },
 {
  "text": "Sauce is one of the seven necessities in a Chinese household, and what if we get it out from the kitchen and put it in research? It has led to the winning of a merit prize in the 2016 Lee Kum Kee Innovation Competition by four PolyU undergraduate students. \nThe four students (Li Chung Pang and Cheng Shing Sau from Chemical Technology, Lai Sin Ting from Food Safety and Technology and Liu Chun Ming from Computing) have spent three months to research on the making of snack with distinctive regional flavor, and the winning snack, named the Magic Trio, is composed of scallop, pig ears and chicken tendons, representing creatures from the sea, land and air, respectively. \nThe Lee Kum Kee Innovation Competition was co-organized by CIFST and LKK (China) with the aim to provide a practical platform for undergraduates of food science or related subjects to conduct innovative research in food with the use of Chinese condiments. Students from 10 Universities took part in the competition, with the PolyU being the only representative from Hong Kong. \nLet us take this opportunity to congratulate the students on receiving the award!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/2016-lee-kum-kee-innovation-competition?sc_lang=en"
 },
 {
  "text": "1 / 5\nInnovative ideas led to the winning of first prize and merit prize in the 2017 Lee Kum Kee Innovation Competition by eight PolyU undergraduate students. \nStudents have spent six months to research on the making new food products targeted young adults in China. Innovative ideas have been added to existing products ingeniously brings refreshing sauce with cultural characteristics. The product \"Sampan Spicy Crab with Cheese Sauce\", developed by five students (Cheung Shun Yin, Cheung Wing, Mak Sin Yi and So Ka Ching from Food Safety and Technology, Ng Pui Yi from Management) awarded the first prize attended the award ceremony in Wuxi on 8 Nov 2017. The product of \"Hong Kong Style Teriyaki Sauce merit prize\", developed by three students (Ho Wing Wa Erica and Chan Yuen Man Food Safety and Technology and Sun Yiu Po from Building Technology and Management) was awarded the merit prize. Two groups of students added new elements to the. It. \nThe Lee Kum Kee Innovation Competition was co-organized by CIFST and LKK (China) with the aim to provide a practical platform for undergraduates of food science or related subjects to conduct innovative research in food with the use of Chinese condiments. This year was our fourth year took part in the competition, in which students from 10 Universities, with the PolyU being the only representative from Hong Kong. \nLet us take this opportunity to congratulate the students on receiving the award!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/2017-lee-kum-kee-innovation-competition?sc_lang=en"
 },
 {
  "text": "XO seafood sauce is commonly added for enhancing the umami of food. What if we add it to popcorn? A group of PolyU undergraduate students (Lu Zhou, Cheung Kit Yau Jana, Cheung Ka Yu, Hau Hiu Yin, Hung Lok Hin Ivan from Food Safety and Technology and Wong Hoi Chun from Enterprise Engineering with Management) have come up with this creative idea and invented a new product named \"XO Spicy and Cheesy Popcorn\" after researching for six month, for which they have been awarded the Third Prize in the 2018 Lee Kum Kee Innovation Competition. \nThe purpose of the Lee Kum Kee Innovation Competition, co-organized by CIFST and LKK (China), is to provide a practical platform for undergraduate students of food science or related subjects to conduct innovative research on food with the use of Chinese condiments. This was our fifth year for participating in the competition. Participants came from 10 universities, and the PolyU was the only representative of Hong Kong. \nThe award ceremony was held in Qingdao on 8 Nov 2018. Let us take this opportunity to congratulate our winning students!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/2018-lee-kum-kee-innovation-competition?sc_lang=en"
 },
 {
  "text": "XO seafood sauce is commonly added for enhancing the umami of food. What if we add it to popcorn? A group of PolyU undergraduate students (Lu Zhou, Cheung Kit Yau Jana, Cheung Ka Yu, Hau Hiu Yin, Hung Lok Hin Ivan from Food Safety and Technology and Wong Hoi Chun from Enterprise Engineering with Management) have come up with this creative idea and invented a new product named \"XO Spicy and Cheesy Popcorn\" after researching for six month, for which they have been awarded the Third Prize in the 2018 Lee Kum Kee Innovation Competition. \nThe purpose of the Lee Kum Kee Innovation Competition, co-organized by CIFST and LKK (China), is to provide a practical platform for undergraduate students of food science or related subjects to conduct innovative research on food with the use of Chinese condiments. This was our fifth year for participating in the competition. Participants came from 10 universities, and the PolyU was the only representative of Hong Kong. \nThe award ceremony was held in Qingdao on 8 Nov 2018. Let us take this opportunity to congratulate our winning students!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/2018-lee-kum-kee-innovation-competition/"
 },
 {
  "text": "PolyU and Yakult co-established the world’s first Joint Research Laboratory for Probiotics and Prebiotics in Human Health\nPolyU has received a generous donation of HK$2 million from Hong Kong Yakult Co. Ltd. (Yakult) to establish the “PolyU-Yakult Joint Research Laboratory for Probiotics and Prebiotics in Human… \nABCT students awarded the Third Prize in the 2018 Lee Kum Kee Innovation Competition\nXO seafood sauce is commonly added for enhancing the umami of food. What if we add it to popcorn? A group of PolyU undergraduate students (Lu Zhou, Cheung Kit Yau Jana, Cheung Ka Yu… \nBess Daeson-Hughes Poster Award in 10th International Symposium on Nutritional Aspects of Osteoporosis\nThe 10th International Symposium on Nutritional Aspects of Osteoporosis, which lasted four days, drew to a close on 1st December 2017 at Kerry Hotel, with the participation of over 100 health… \nABCT students awarded a First Prize and Merit Prize in the 2017 Lee Kum Kee Innovation Competition\nInnovative ideas led to the winning of first prize and merit prize in the 2017 Lee Kum Kee Innovation Competition by eight PolyU undergraduate students. Students have spent six months to research… \nABCT students awarded a Merit Prize in the 2016 Lee Kum Kee Innovation Competition\nSauce is one of the seven necessities in a Chinese household, and what if we get it out from the kitchen and put it in research? It has led to the winning of a merit prize in the 2016 Lee Kum Kee… \nABCT Postgraduate received the Young Investigator Award in the International Conference on Food Factors 2015 (22-25 November 2015)\nMr. Kar-him LUK, PhD student of Dr. Ka-hing WONG, received the Young Investigator Award in the International Conference on Food Factors 2015 (ICoFF2015) held in the Seoul, South Korea, from 22…",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/?page=2"
 },
 {
  "text": "People \nAdjunct, Honorary and Visiting Staff \nWong Wendy \nWong Wendy\nHonorary Fellow (Traditional Chinese Medicine) ",
  "url": "https://www.polyu.edu.hk/fsn/people/adjunct-honorary-and-visiting-staff/dr-wong-wendy"
 },
 {
  "text": "People \nAdjunct, Honorary and Visiting Staff \nChe Chun-tao \nChe Chun-tao\nHonorary Professor (Traditional Chinese Medicine) ",
  "url": "https://www.polyu.edu.hk/fsn/people/adjunct-honorary-and-visiting-staff/prof-che-chun-tao"
 },
 {
  "text": "People \nAdjunct, Honorary and Visiting Staff \nSu Yixiang \nSu Yixiang\nVisiting Professor (Nutrition/Maternal and Child Nutrition) ",
  "url": "https://www.polyu.edu.hk/fsn/people/adjunct-honorary-and-visiting-staff/prof-su-yixiang"
 },
 {
  "text": "Academic Staff \nDr Li Shi-ying, Christine \nResearch Overview\nMy research is focus on the maternal nutrition and developmental programming. A growing body of literature suggests a link between early nutrition and later disease risk. To optimize the infant health and growth as well as lower the risk of chronic disease, it is pertinent to investigate the role of early nutrition and explore potential intervening strategies. \nEducation and Academic Qualifications\nBachelor of Science, Jinan University\nMaster of Natural Science, Jinan University\nDoctor of Philosophy, The University of Hong Kong\nProfessional Qualifications\nRegistered Nutritionist",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-li-shiying-christine"
 },
 {
  "text": "Academic Staff \nDr Geng Ping, Sandy \nEducation and Academic Qualifications\nBachelor of Engineering in Chemical Engineering, Dalian University of Technology\nMaster of Science in Information Technology in Education, The University of Hong Kong\nDoctor of Philosophy in Chemical and Biomolecular Engineering, Hong Kong University of Science and Technology\nAcademic and Professional Experiences\nGuest editor, Separation and Purification Technology \nResearch Interests\nGreen food processing \nFood printing \nMetaverse in education \nActive learning pedagogy \nAchievements\nExcellent Paper Award in the 2022 International Conference on Open and Innovative Education, Hong Kong (2022)\nChan Tak Kei & Wong Kwai Ying Best Postgraduate Award for Excellent Research, HKUST (2015)\nChampion and People’s Choice Award in the Three Minutes Thesis Competition, HKUST (2015)\nBest Poster Award in the 65th Annual Meeting of the International Society of Electrochemistry, Switzerland (2014)\nJ-Y. Wu, K-C. Siu, and P. Geng*, “Bioactive Ingredients and Medicinal Values of Grifola frondosa (Maitake)”, Foods,10 (2021): 95.\nP. Geng, K-C. Siu, Z. Wang, J-Y. Wu*, “Anti-fatigue Functions and Mechanisms of Edible and Medicinal Fungi: A Review”, BioMed Research International, 2017 (2017): 1-16. \nP. Geng*, G. Chen, “Antifouling Ceramic Membrane Electrode Modified by Magnéli Ti4O7 for Electro-microfiltration of Humic Acid”, Separation and Purification Technology, 185 (2017): 61-67. \nP. Geng and G. Chen*, “Magnéli Ti4O7 Modified Ceramic Membrane for Electrically-assisted Filtration with Antifouling Property”, Journal of Membrane Science, 498 (2016): 302-314.\nP. Geng, J. Su, C. Miles, C. Comninellis and G. Chen*, “Highly-Ordered Magnéli Ti4O7 Nanotube Arrays as Effective Anodic Material for Electro-oxidation”, Electrochimica Acta, 153 (2015): 316-324.\nP. Geng and G. Chen*, “Electrically and Electrochemically-assisted Nanofiltration, A Promising Approach for Fouling Mitigation”, Chapter 7, Nanofiltration, IntechOpen Publisher, 2018.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-geng-ping-sandy"
 },
 {
  "text": "Adjunct, Honorary and Visiting Staff \nYao Xinsheng \nYao Xinsheng\nVisiting Chair Professor (Traditional Chinese Medicine) ",
  "url": "https://www.polyu.edu.hk/fsn/people/adjunct-honorary-and-visiting-staff/prof-yao-xinsheng"
 },
 {
  "text": "Academic Staff \nDr Wong Ho-yin Marcus \nEducation and Academic Qualifications\nBachelor of Science in Food Safety and Technology, The Hong Kong Polytechnic University\nMaster of Science, The University of Hong Kong\nDoctor of Philosophy, The Hong Kong Polytechnic University\nAcademic and Professional Experiences\nMember, American Society for Microbiologist (ASM)\nMember, Institute of Food Technologists (IFT)\nReviewer, Frontiers in Food Microbiology\nReviewer, Antimicrobial Agents and Chemotherapy",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-wong-hoyin-marcus"
 },
 {
  "text": "Academic Staff \nDr Chiou Jiachi, Amber \nResearch Overview\nWe are interested in the roles of probiotics and their metabolites in the microbial ecosystem as to affect health with focuses on metabolic disorders. \nEducation and Academic Qualifications\nBachelor of Science in Agriculture, National Taiwan University\nMaster of Science, National Taiwan University\nDoctor of Philosophy, Rutgers University\nAcademic and Professional Experiences\nSince 2016 Reviewer, Journal of Integrative Agriculture, Elsevier, China\nSince 2016 Reviewer, Antimicrobial Agents and Chemotherapy\nMember, Institute of Food Scientist (IFT)\nMember, American Society for Microbiologist (ASM)\nResearch Interests\nBacterial Toxins \nEnzymes \nProbiotics \nAchievements\n2020 Faculty Award for Outstanding Achievement– Research and Scholarly Activities (Team Award)\nWong KY, Chan TH, Chan KF, Chen S, Lui HK, Kan J. WY, Chiou JC, Yap HK. 3-Amino Benzamide Derivative Serving As B-Lactam Auxiliary Antibiotic, Preparation Method and Use Thereof. Patent number: US20170348258A1.\n简志伟, 叶晓云, 邱家琪. \"可重复使用的口罩\", Chinese Patent Office, Filing No.: 202010288466.1 [14 Apr 2020].\n简志伟, 叶晓云, 邱家琪. \"可重复使用的口罩\", Chinese Patent Office, Filing No.: 202010288578.1 [14 Apr 2020].\nKan CW, Yip YW, Chiou JC. \"Reusable Face Mask\", Hong Kong Patents Registry, HK Short-Term Patent Application No. 32020005718.2 [14 Apr 2020].\nKan CW, Yip YW, Chiou JC. \"Reusable Face Mask\", Hong Kong Patents Registry, HK Short-Term Patent Application No. 32020005725.7 [14 Apr 2020].\n\"Antimicrobial Fabric Face Mask\", US Patent Office, Filing No.: 62/991150 [18 Mar 2020].\nHC Wu, YC T. Lam, TF Shum, TY Tsai, JC Chiou*. Hypotensive effect of captopril on deoxycorticosterone acetate-salt hypertensive rat by altering gut microbiota. In review\nWen-Yi Wang, Jia-Chi Chiou, Joanne Yip, Ka-Fu Yung and Chi-Wai Kan. Development of Durable Antibacterial Textile Fabrics for Potential Application in Healthcare Environment. Coatings 2020, 10 (6), 520.\nAX Song, LQ Li, JY Yin, JC Chiou, JY Wu. Mechanistic insights into the structure-dependent and strain-specific utilization of wheat arabinoxylan by Bifidobacterium longum. Carbohydrate polymers 2020.\nKL Lam, WY Cheng, F Yang, SL Lin, LJ You, JC Chiou, HS Kwan, Peter CK Cheung. Framework as a Service, FaaS: Personalized Prebiotic Development for Infants with the Elements of Time and Parametric Modelling of in vitro Fermentation. Microorganisms 2020, 8(5): 623.\nWY Wang, JC Chiou, J Yip, KF Yung and CW Kan. Development of Durable Antibacterial Textile Fabrics for Potential Application in Healthcare Environment. Coatings 2020, 10 (6): 520.\nLui, HK, Gao W, Cheung KC, Jin WB, Sun N, Kan JWY, Wong ILK, Chiou J, Lin D, Chan EWC, Leung YC, Chan TH, Chen S, Chan KF, Wong KY. Boosting the efficacy of anti-MRSA β-lactam antibiotics via an easily accessible, non-cytotoxic and orally bioavailable FtsZ inhibitor. European J. Medicinal Chem 2019, 163: 95-115.\nLiu TH, Chiou J, Tsai TY. (2016) Effects of Lactobacillus plantarum TWK10-fermented soymilk on deoxycorticosterone acetate-salt -induced hypertension and associated dementia in rats. Nutrients. 8(5). Pii: E260.\nHe, D., Chiou, J., Zeng, Z., Chan, E.W.-C., Liu, J.-H., Chen, S. (2016) Comparative characterization of CTX-M-64 and CTX-M-14 provides insights into the structure and catalytic activity of the CTX-M class of enzymes. Antimicrob Agents Chemother. 60(10): 6084-6090.\nLi RC, Chiou JC, Chan WC, Chen S. A novel PCR-based approach for accurate identification of Vibrio parahaemolyticus. (2016) Frontier Microbiology 7:44 doi: 10.3389/fmicb.2016.00044. eCollection 2016.\nChiou JC*, Leung HH*, Lee HW*, Wong WT. (2015) Rapid testing methods for food contaminants and toxicants (Review). J Integr Agr 14(11): 2243-2264. *contribute to the paper equally.\nHe DD*, Chiou JC*, Zeng ZL, Liu LP, Chen XJ, Zhen L, Chan WC, Liu JH, Chen S (2015). Residues distal to the active site contribute to enhanced catalytic activity of variant and hybrid β-lactamases derived from CTX-M-14 and -15. Antimicrob Agents Chemother. 59(10): 5976-5983. *contribute to the paper equally\nChiou JC, Wan SB, Chan KF, So PK, He DD, Chan WC, Chan TH, Wong KY, Tao J, Chen S (2015). Ebselen as a potent covalent inhibitor for New Delhi Metallo β-lactamases (NDM-1). Chem Commun (Camb). 51(46): 9543-9546.\nChiou JC, Li RC and Chen S (2015). CARB-17 family of β-lactamases mediated intrinsic resistance to penicillins in Vibrio parahaemolyticus. Antimicrob Agents Chemother. 59(6): 3593-3595.\nWang Y, Chan FY, Sun N, Lui HK, So PK, Yan SC, Chan KF, Chiou J, Chen S, Abagyan R, Leung YC, Wong KY (2014). Structure-based Design, Synthesis, and Biological Evaluation of Isatin Derivatives as Potential Glycosyltransferase Inhibitors.Chem Biol Drug Des. 84(6): 685-696. (Grade B: top 44% in Chemistry, Medicinal, IF: 2.485)\nChiou J, Leung TY, Chen S (2014). Molecular Mechanisms of Substrate Recognition and Specificity of New Delhi Metallo-β-Lactamase. Antimicrob Agents Chemother. 58(9): 5372-5378.\nChiou JC, Li XP, Remacha M, Ballesta JP, Tumer NE (2011). Shiga toxin 1 is more dependent on the P proteins of the ribosomal stalk for depurination activity than Shiga toxin 2.Int J Biochem Cell Biol. 43(12): 1792-1801.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-chiou-jiachi-amber"
 },
 {
  "text": "Prof. Wong Man-kin \nResearch Overview\nOur research group uses Synthetic Chemistry as a core technology to address problems in Chemistry, Chemical Biology and Food Safety. \nBachelor of Science, The University of Hong Kong\nDoctor of Philosophy, The University of Hong Kong\nResearch Interests\nCatalysis \nBioconjugation \nMolecular Imaging \nFood Safety \nAchievements\nAsian Core Program Lectureship Awards: 2011 (Japan), 2014 (China), 2014 (Thailand), 2016 (Korea), and 2016 (Taiwan)\nMethod and Kit for Detecting Formaldehyde in Food based on Metal Catalysis Coupling Reaction.\nDa-Peng Xiang, Man-Kin Wong, Ching Liu, Xiao-Qun Wei, Ka-Hing Wong, Kong-Fan Wong and Shi-Ping Shao\nCN 104193672 A\nChiral Gold(III) Complexes Preparation and Applications.\nMan-Kin Wong and Jian-Fang Cui\n201610860285.5\nNew Quinolizinium Dyes Preparation and Application on Photoredox Catalysis.\nMan-Kin Wong, Jieren Deng and Chun Him Nathanael Lai\n201610915159.5\nDeng JR, Lai NCH, Kung KKY, Yang B, Chung SF, Leung ASL, Choi MC, Leung YC, Wong MK. N-Terminal selective modification of peptides and proteins using 2-ethynylbenzaldehydes. Communications Chemistry, 2020, 3(1), 67.\nDeng JR, Chung SF, Leung, ASL, Yip WM, Yang B, Choi MC, Cui JF, Kung KKY, Zhang Z, Lo KW, Leung YC, Wong MK. Chemoselective and photocleavable cysteine modification of peptides and proteins using isoxazoliniums. Communications Chemistry. 2019; 2(1): 93.\nSit HY, Yang B, Kung KKY, Tam JS-L, Wong MK. Fluorescent Labelling of Glycans with FRET-Based Probes in a Gold(III)-Mediated Three-Component Coupling Reaction. ChemPlusChem. 2019; 84(11):173943.\nJiang JJ, Cui JF, Yang B, Ning Y, Lai NCH, Wong MK. Chiral Cyclometalated Oxazoline Gold(III) Complex-Catalyzed Asymmetric Carboalkoxylation of Alkynes. Organic Letters. 2019; 21(16): 6289-94.\nDeng JR, Chan WC, Chun-Him Lai N, Yang B, Tsang CS, Chi-Bun Ko B, Lai-Fung Chan S, Wong MK. Photosensitizer-free visible light-mediated gold-catalysed cis-difunctionalization of silyl-substituted alkynes. Chemical Science. 2017;8(11):7537-44.\nCui JF, Ko HM, Shing KP, Deng JR, Lai NCH, Wong MK. C,O-Chelated BINOL/Gold(III) Complexes: Synthesis and Catalysis with Tunable Product Profiles. Angewandte Chemie - International Edition. 2017;56(11):3074-9.\nWong KF, Deng JR, Wei XQ, Shao SP, Xiang DP, Wong MK. Visual detection of formaldehyde by highly selective fluorophore labeling via gold(III) complex-mediated three-component coupling reaction. Organic and Biomolecular Chemistry. 2015;13(27):7408-11.\nKung KKY, Ko HM, Cui JF, Chong HC, Leung YC, Wong MK. Cyclometalated gold(III) complexes for chemoselective cysteine modification via ligand controlled C—S bond-forming reductive elimination. Chemical Communications. 2014;50(80):11899-902.\nKung KKY, Wong KF, Leung KC, Wong MK. N-terminal α-amino group modification of peptides by an oxime formation-exchange reaction sequence. Chemical Communications. 2013;49(61):6888-90.\nKo HM, Kung KKY, Cui JF, Wong MK. Bis-cyclometallated gold(III) complexes as efficient catalysts for synthesis of propargylamines and alkylated indoles. Chemical Communications. 2013;49(78):8869-71.\nBook Chapter Title: Asymmetric Epoxidation Catalyzed by Chiral Ketones.\nMan Kin Wong, Yiu Chung Yip and Dan Yang\nIn the book \"Asymmetric Catalysis from Chinese Perspective\"\nSpringer, 2011\nEditor: Prof. Shengming Ma",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/prof-wong-mankin"
 },
 {
  "text": "Academic and Professional Experiences\n2023.3-Present Director, Shenzhen Key lab for Food Biological Safety Control, The Hong Kong PolyU Shenzhen Research Institute, Shenzhen, China\n2021.6-Present Member of Advisory Council on Food and Environmental Hygiene, Food and Health Bureau, Hong Kong Government\n2022.6-Present Member of Expert Committee on Antimicrobial Resistance, Centre for Health Protection, Hong Kong Government\n2022.6-Present Admission Panel members for Incubation Programmes, Hong Kong Science and Technology Parks Corporation (HKSTP)\n2020-2023 Professor and Associate Dean, College of Veterinary Medicine and Life Science, City University of Hong Kong\n2020-2023 Director, Animal Health Research Center, Chendu Research Institute, City University of Hong Kong, Chendu, China\n2019-2020 Professor and Acting Head, Department of Infectious Diseases and Public Health, College of Veterinary Medicine and Life Science, City University of Hong Kong\n2017-2019 Professor, Applied Biology and Chemical Technology, The Hong Kong Polytechnic University, Hong Kong\n2014-2017 Associate Professor, Applied Biology and Chemical Technology, The Hong Kong Polytechnic University, Hong Kong\n2009-2014 Assistant Professor, Applied Biology and Chemical Technology, The Hong Kong Polytechnic University, Hong Kong\n2004-2009 Post-doctoral Fellow, Microbiology and Molecular Genetics, Medical College of Wisconsin, Milwaukee, WI, USA\n2012-2019 Distinguished Professor, The Hong Kong PolyU Shenzhen Research Institute, Shenzhen, P. R. China\n2015-2019 Director, Shenzhen Key lab for Food Biological Safety Control, The Hong Kong PolyU Shenzhen Research Institute, Shenzhen, China\n2015-2017 Chairman, Animal Subject Ethics Sub-Committee, The Hong Kong Polytechnic University, Hong Kong\n2015-2019 Director, Central Animal Facility, The Hong Kong PolyU Shenzhen Research Institute, Shenzhen, China\n2010-2019 Associate Director, Food Safety and Technology Research Center, The Hong Kong Polytechnic University, Hong Kong\n2010-2011 Ad Hoc working group on the microbial guidelines for ready-to-eat food, Food Safety Center, Department of Food and Environmental Hygiene, Hong Kong\n2010-2016 Shenzhen Expert Committee on pharmacology and biotechnology, Shenzhen, China",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/prof-chen-sheng"
 },
 {
  "text": "Prof. Wong Man-sau \nResearch Overview\nThe primary focus of our laboratory is to study the use of dietary factors (nutrients and phytochemicals) and Chinese medicinal herbs (its bioactive fractions and ingredients) for improving bone health and prevention of age-related diseases as well as to delineate the mechanisms involved in mediating their protective effects. \nBachelor of Science in Food Science, University of Illinois\nDoctor of Philosophy, The University of Chicago\n2021-2024 Member, Committee on Reduction of Salt and Sugar in Food, Food and Health Bureau, HKSAR (15 March 2021 to March 14, 2024) \n2019-2023 Member, Higher Education Review Board (HERB), Institute of Food Technologists (1 September 2019 to 31 August 2023)\n2019-2021 Member, Advisory Council on Food and Environmental Hygiene, Food and Health Bureau, HKSAR (1 April 2019 to 31 March 2021)\n2017-2023 Member, Chinese Medicine Industry Management Group, Chinese Medicine Council of Hong Kong, HKSAR\n2015-2021 Council Member, Council on Human Reproductive Technology, HKSAR. (1 April 2015 to 31 March 2021)\n2016-present Member, Steering Committee for \"FOOD-CO\" Intermediary Services for Building Capacity in Food Support Service, St. James' Settlement\n2015-present. Chairperson, Expert Group on Maternal and Child Nutrition, Hong Kong Nutrition Association\n2014-present Academic Advisor, The Hong Kong Nutrition Association Ltd.\n2013-2023 Certified Food Scientist, Institute of Food Technologist\n2008-present Council Member, Modernized Chinese Medicine International Association limited\n2005- present Advisor, The Hong Kong Health Food Association\n2017-2020 Visiting Professor, Shanghai University of Traditional Chinese Medicine, PRC\n2016-2019 Adjunct Professor, Department of Nutritional Sciences, Purdue University, Indiana, USA\n2016-2020 Executive Council Member, First Board of Specialty Committee of Osteoporosis of World Federation of Chinese Medicine Societies\n2012-2017 Expert Member, \"Chinese medicine new drug discovery and modernization professional platform\", 111 Project, supported by Ministry of Education and State Administration of Foreign Experts Affairs, the P.R. of China 由教育部和国家外专局资助高校创新引智计划（\"111计划\"）暨南大学姚新生院士主持的 \"中药创新药物发现与中药现代化创新引智基地\"（B13038）专家成员\n2008-2014 Member, Working Group on Diet and Physical Activity, A Strategic Framework for Prevention and Control of Non-Communicable Diseases, Department of Health, HKSAR\"\n2008-2014 Study Group Member, Study group on Childhood Nutrition (0-5), Subgroup 4, Department of Health, HKSAR\n2010-2016 Member, Expert Committee on Food Safety, Food and Health Bureau, HKSAR\n2006 summer Visiting Associate Professor, UIC/NOH Center for Botanical Dietary Supplement Research, College of Pharmacy, University of Illinois at Chicago\n2004-2009 Adjunct Professor, Shenyang Pharmaceutical University\nAssociate Editor Journal of Ginseng Research since 2015\nEditorial Board Member American Journal of Chinese Medicine, since 2006\nEditorial Board Member Journal of Traditional and Complementary Medicine, since 2011\nEditorial Board Member Longhua Chinese Medicine, Sept 2018-Sept 2020\nResearch Interests\nBone and Mineral Metabolism \nDiet and Diseases \nOsteoporosis \nPhytoestrogens \nPhytochemicals \nTraditional Chinese Medicine \nFunctional Food \nAchievements\n2017 Champion, Most Favorable PolyU Research News of 2016 \"Most Favorite PolyU Research News of 2016\" Facebook Campaign \"Breastfeeding Research Discovers inadequate Calcium, Iron and Iodine Intakes of Hong Kong Lactating Women\"\n2016 Champion, Most Favorable PolyU Research News of 2015 \"Most Favorite PolyU Research News of 2015\" Facebook Campaign \"Establishment of Hong Kong's First Breast Milk Nutrient Database\"\n2016 Faculty Service Award, Faculty of Applied Science and Textile, PolyU\n2015 ABCT Star Award\n2014 ABCT Star Award\n2014 Higher Education Outstanding Scientific Research Output Awards (Science and Technology) from the Ministry of Education 國家教育部2013年度高等學校科學研究優秀成果獎（科學技術） Second Class Prize in Scientific and Technological Progress Award (科技进步奖) with the award-winning project \"\"Modernization and Application of Traditional Chinese Medicine for Anti-osteoporosis, 抗骨質疏鬆傳統中藥現代化研究及其應用\n2012 Shenzhen Virtual University Park National Technology Project Pioneer Award, Shenzhen Technology and Innovation Committee \"Study of the pharmacokinetics and pharmacodynamics of the use of Sambucus Willimaii Hance for treatment of osteoporosis\"\n2011 Highest International Consultancy Award, Outstanding Professional Services Awards\n2011 PolyU Technology and Consultancy Co. Ltd.\"Effects of Fructus Ligustri Lucidi (FLL) and Puerariae Radix (PR) on calcium metabolism and bone properties in ovariectomized rats\"\n2006 Shandong Higher education Excellent Research Award Natural Science Award Third Prize \"山东高等学校优秀科研成果奖自然科学类三等奖\", Study of the molecular mechanism involved in mediating the estrogenic actions of ginsenoside Rg1 and genistein\n2005 Qingdao University Scientific Research Theoretical Results Second Prize青岛大学科学研究理论成果二等奖 \"Study of the molecular mechanism of phytoestrogens\"\nWang AYY, Wong MS and Lo SCL Method for detecting immune responses. US patent application No. 10/756,768, filed on 14/1/2004\nWong MS, Yao XS, Xiao HH Dai Yi. The active fraction of Sambucus Williamsii Hance that reduce the risk of menopause related disease and its application \", 2012112900083070 granted 04/12/2012 黄文秀，姚新生，肖辉辉，戴毅。具有降低绝经期妇女骨相关疾病发病风险的接骨木活性部位及其应用。中国专利。申请号：201010103723.6。公开号：CN 101773490A。\nWong MS, Yao XS, Xiao HH Dai Yi. Lignans from Sambucus Williamsii HANCE and its formulation and application. China patent application 201010113467.9, filed on 11/2/2010 黄文秀，姚新生，肖辉辉，戴毅。接骨木木脂素类化合物及其制备方法和应用。中国专利。申请号：201110113467.9。公开号：CN102153453A。\n陈舜宏，莫锦华，黄文秀，吴健虹，张焕。一种沙苑子乙醇提取物及其制备方法和应用。中国发明专利，已受理（申请号：201510306174.5）\nWong MS, Yao XS, Xiao HH, Dai Yi. Extraction methods for total lignans from Sambucus Williamsii黄文秀，姚新生，肖辉辉，戴毅。接骨木中总单倍木脂素的提取方法. HANCE, 201611060394.5, filed on 25/11/2016\nWong MS, XL Dong, SS Cao, Y Wang \" Application of oleanoic acid and urosolic acid as bioactive drug formulation for regulation of vitamin D metabolic enzymes\"黄文秀, 董晓莉, 曹思思, 王奕 齐墩果酸和熊果酸在制备调节维生素D3代谢酶活性的药物中的应用 中国专利，申请号：201711061004.0, filed on 02/11/2017\nWong M.S., Yao, X. S., Qiu, Z., Dong X & Dai, Y., 19 Nov 2019, IPC No. A23L33/10, Patent No. ZL201610102211.5, 24 Feb 2016 (黄文秀，姚新生，邱佐成, 董晓莉，戴毅。异戊烯基二氢黄酮类化合物在防治骨疾病领域的应用)\nLP Zhou, CCW Poon, KY Wong, SS Cao, WX YU, XL Dong, WYW Lee, Y Zhang, MS Wong 2020 Prenylflavonoid Icariin Induces Estrogen Response Element–Independent Estrogenic Responses in a Tissue-Selective Manner J Endocrine Society 4 (2): 1-17 doi: 10.1210/jendso/bvz025\nVWC Wong, YF Ng, SM Chan, YX Su, KWH Kwok, LHM Chan, CL Cheung, HW Lee, WY Pak, , SY Li, MS Wong 2019 Positive relationship between consumption of specific fish type and omega-3 polyunsaturated fatty acids in milk of Hong Kong lactating mothers Brit J Nutr. 121(12):1-3\nZeng J, Yu W, Dong X, Zhao S, Wang Z, Liu Y, Wong MS, Wang Y. 2019 A nanoencapsulation suspension biomimetic of milk structure for enhanced maternal and fetal absorptions of DHA to improve early brain development. Nanomedicine. 15(1):119-128. doi: 10.1016/j.nano.2018.09.006. \nQG Gao, LP Zhou, VHY Lee, HY Chan, CWY Man, MS Wong 2019 Ginsenoside Rg1 activates ligand-independent estrogenic effects via rapid estrogen receptor (ER) signaling pathway J Ginseng Res 43(4):527-538. https://doi.org/10.1016/j.jgr.2018.03.004\nCao S, Wastney ME, Lachcik PJ, Xiao HH, Weaver CM, MS Wong 2018 Both oleanolic acid and a mixture of oleanolic and ursolic acids mimic the effects of Fructus ligustri lucidi on bone properties and circulating 1,25-dihydroxycholecalciferol in ovariectomized rats. J Nutr. 2018;148:1895–1902.doi: 10.1.1093/jn/nxy242\nXiao HH, Sham TT, Chan CO, Chen X, Mok DKW, Yao XS and MS Wong 2018 A metabolomics study on the bone protective effects of a lignan-rich fraction from Sambucus Williamsii Ramulus in aged rats Pharmacol. 9:932. doi: 10.3389/fphar.2018.00932.\nLP Zhou, KY Wong, HT Yeung, XL Dong, GW Gong, HH Xiao, KWK Tsim, MS Wong 2018 Bone protective effects of Danggui Buxue Tang alone and in combination with tamoxifen or raloxifene in vivo and in vitro. Pharmacol. 9:779. doi: 10.3389/fphar.2018.00779\nMX Ho, CW Poon KC Wong, ZC Qiu and MS Wong 2018 Icariin, but Not Genistein, Exerts Osteogenic and Anti-apoptotic Effects in Osteoblastic Cells by Selective Activation of Non-genomic ERα Signaling. Pharmacol 11;9:474. doi: 10.3389/fphar.2018.00474\nCao S, Dong XL, Ho MX, Yu WX, Wong KC, Yao XS, Wong MS. 2018 Oleanolic Acid Exerts Osteoprotective Effects and Modulates Vitamin D Metabolism Nutrients. 10(2). pii: E247\nY Zhang, LP Zhou, XL Li, YJ Zhao, MX Ho, ZC Qiu, DF Zhao, KW Mok, Q Shi, YJ Wang, MS Wong 2018 8-Prenylgenistein, a prenylated genistein derivative, exerted tissue selective osteoprotective effects in ovariectomized mice. Oncotarget 9(36):24221-24236.\nMS Wong, Y Zhang Flavonoids of Herba Epimedii and bone metabolism in experimental ovarian deficiency. In: Victor R. Preedy, eds. Handbook of Nutrition and Diet in Menopause. New York, NY: Springer Science+ Business Med; 2013\"\nHH Xiao, XS Yao and MS Wong. A lignan-rich bioactive fraction of Sambucus williamsii Hance exerts oestrogen-like bone protective effects in aged ovariectomized rats and osteoblastic cells. In Connie M. Weaver, Robin M. Daly, Heike A. Bischoff-Ferrari eds. Nutritional Influences on Bone Health. 9th International Symposium. Springer International Publishing AG, Cham, 2016.\nSS Cao, XL Dong, Y Zhang and MS Wong Bone Protective Chinese Herbs: The Story of Fructus Ligustri Lucidi . In Connie M. Weaver, Robin M. Daly, Heike A. Bischoff-Ferrari Man-Sau Wong eds. Nutritional Influences on Bone Health. 10th International Symposium. Springer International Publishing AG, Cham, 2018.\nMS Wong, CCW Poon, LP Zhou, HH Xiao. Natural products as potential bone therapies. In: Paula H Stern, eds. Handbook of Experimental Pharmacology. Springer Nature Switzerland AG, 2019\"",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/prof-wong-mansau"
 },
 {
  "text": "Dr Kwok Wing-hin, Kevin \nWe are interested in understanding how nanomaterials impact biology and find potential implication in environmental and food context. \nBachelor of Science, The University of Hong Kong\nDoctor of Philosophy, The University of Hong Kong\nNanotoxicology \nEnvironmental Quality \nFood Authentication \nFood Contaminants \nKwok KWH, Leung KMY*, Lui GCS, Chu VKH, Lam PKS, Morritt D, Maltby L, Brock TCM, Van Den Brink PJ, Warne MSJ, Crane M (2007) Comparison of tropical and temperate freshwater animal species acute sensitivity to chemicals: implication for deriving safe extrapolation factor. SETAC/ Integrated Environmental Assessment and Management 3: 49-67.\nRaisuddin S, Kwok KWH, Leung KMY, Schlenk D, Lee JS (2007) The copepod Tigriopus: a promising marine model organism for ecotoxicology and environmental genomics. Aquatic Toxicology 83: 161-173.\nKwok KWH, Leung KMY*, Flahaut E, Cheng J, Cheng SH* (2010) Chronic toxicity of double-walled carbon nanotubes to three marine organisms: influence of different dispersion methods. Nanomedicine 5: 951-961.\nKwok KWH, Auffan M, Badireddy AR, Nelson CM, Wiesner MR, Chilkoti A, Liu J, Marinakos SM, Hinton DE* (2012) Uptake of Silver nanoparticles and Toxicity to Early Life Stages of Japanese Medaka (Oryzias latipes): Effect of Coating Materials. Aquatic Toxicology 120-121: 59-66.\nKwok KWH, Dong W, Marinakos SM, Liu J, Chilkoti A, Wiesner MR, Chernick M, Hinton DE* (2016) Silver nanoparticle toxicity is related to coating materials and disruption of sodium concentration regulation. Nanotoxicology, 10(9):1306-1017\nYung MMN, Kwok KWH, Djurisic AB, Giesy JP, Leung KMY* (2017) Influences of temperature and salinity on physicochemical properties and toxicity of zinc oxide nanoparticles to the marine diatom Thalassiosira Scientific Reports 7: 3662.\nShi M, Zhang C, Xia IF, Cheung ST, Wong KS, Wong K-H, Au DWT, Hinton DE, Kwok KWH* (2018) Maternal dietary exposure to selenium nanoparticle led to malformation in offspring. Ecotoxicology and Environmental Safety 156: 34-40.\nYu SM, Luk KH, Cheung ST, Kwok KWH, Wong KH*, Chen TF* (2018) Polysaccharide-protein complex-decorated selenium nanosystem as an efficient bone-formation therapeutic. Journal of Materials Chemistry B: 6, 5215.\nXia IF, Cheung JS, Wu M, Wong KS, Kong HK, Zheng XY, Wong KH, Kwok KWH* (2019) Dietary chitosan-selenium nanoparticle (CTS-SeNP) enhance immunity and disease resistance in zebrafish. Fish and Shellfish Immunology 87: 449-459\nLi M, Yao L, Chen H, Ni X, Xu Y, Dong W, Fang M, Chen D, Aowuliji, Xu L, Zhao B, Deng J, Kwok KWH*, Yang J*, Dong W* (2020) Chiral toxicity of muscone to embryonic zebrafish heart. Aquatic Toxicology 222: 105451.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-kwok-winghin-kevin"
 },
 {
  "text": "Prof. Wu Jian-yong \nMy major research interests are bioprocess engineering and technology with medicinal fungi and plant tissue cultures; food science and engineering; functional foods; and ultrasound-assisted extraction and processing of food and medicinal products. \nBachelor of Science, Hebei Institute of Chemical Engineering\nMaster of Science, Tianjin University\nDoctor of Philosophy, Queen's University at Kingston\nGuest Editor for: Carbohydrate Polymers (Elsevier) (2019-2020); International Journal of Biological Macromolecules (Elsevier) (2019-2020)\nAsian Editor for Food Quality and Safety (Oxford Academic).\nBioprocesses \nFood Science and Engineering \nFunctional Foods (Medicinal Fungi, Bioactive Polysaccharides, Prebiotics and Microbiota) \nMao YH, Song AX, Li LQ, Siu KC, Yang Y, Yao ZP, Wu JY* (2020) A high-molecular weight exopolysaccharide from the Cs-HK1 fungus: Ultrasonic degradation, characterization and in vitro fecal fermentation. Carbohydrate Polymers 246, Article number 116636.\nLi LQ, Song AX, Yin JY, Siu KC, Wong WT, Wu JY* (2020) Anti-inflammation activity of exopolysaccharides produced by a medicinal fungus Cordyceps sinensis Cs-HK1 in cell and animal models. Int'l J Biol Macromol 149: 1042-1050.\nMao YH, Song AX, Li LQ, Siu KC, Yao ZP, Wu JY* (2020) Effects of exopolysaccharide fractions with different molecular weights and compositions on fecal microflora during in vitro fermentation. Int'l J Biol Macromol 144: 76–84.\nZhang X, Niu J, Wu JY* (2019) Development and characterization of novel and stable silicon nanoparticles-embedded PCM-in-water emulsions for thermal energy storage. Applied Energy, 238(15):1407-1416.\nCheng WY, Wei XQ, Siu KC, Song AX, Wu JY* (2018) Cosmetic and skincare benefits of cultivated mycelia from the Chinese caterpillar mushroom, Ophiocordyceps sinensis (Ascomycetes). Int'l J Med Mushrooms, 20(7):623–636.\nSong AX, Mao YH, Siu KC, Tai CS, Wu JY* (2019) Protective effects of exopolysaccharide of a medicinal fungus on probiotic bacteria during cold storage and simulated gastrointestinal conditions. Int'l J Biol Macromol 133: 957–963.\nMao YH, Song AX, Yao ZP *, Wu JY* (2018) Protective effects of natural and partially degraded konjac glucomannan on Bifidobacteria against antibiotic damage. Carbohydrate Polymers 181: 368-375.\nGeng P, Siu KC, Wang ZM, Wu JY (2017) Antifatigue Functions and Mechanisms of Edible and Medicinal Mushrooms (Review). BioMed Research International Article ID 9648496.\nLi J, Li B, Geng P, Song AX, Wu JY* (2017) Ultrasonic degradation kinetics and rheological profiles of a food polysaccharide (konjac glucomannan) in water. Food Hydrocolloids 70: 14-19.\nChen X, Yan JK, Wu JY* (2016) Characterization and antibacterial activity of silver nanoparticles prepared with a fungal exopolysaccharide in water. Food Hydrocolloids 53:69-74.\nSiu KC, Chen X, Wu JY*. (2016) Molecular properties and antioxidant activities of polysaccharides isolated from alkaline extract of wild Armillaria ostoyae mushrooms Carbohydrate Polymers 137 739–746.\nSiu KC, Chen X, Wu JY*. (2014) Constituents actually responsible for the antioxidant activities of crude polysaccharides isolated from mushrooms. J Functional Foods, 11, 548–556.\nWu JY (2019) Power Ultrasound for Extraction and Modification of Polysaccharides from Medicinal Fungi. In Jingdun Jia, Donghong Liu, Haile Ma et al. (Eds.) Advances in Food Physical Processing Technology, Chapter 4, pp101-123, Springer Nature Singapore Pte Ltd. and Zhejiang University Press, Hangzhou.\nWu JY (2014) Polysaccharide-protein complexes from edible fungi and applications. In: K.G. Ramawat, J.-M. Mérillon (Eds): Polysaccharides Bioactivity and Biotechnology, Springer International Publishing Switzerland, pp 1-10.\nYan JK and Wu JY* (2014) Submerged Fermentation of Medicinal Fungus Cordyceps sinensis for Production of Biologically Active Mycelial Biomass and Exopolysaccharides. Chapter 5 In K.-Y. Paek, H.N. Murthy, J-J Zhong (eds.), Production of Biomass and Bioactive Compounds Using Bioreactor Technology, Springer Science+Business Media Dordrecht, pp93-120.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/prof-wu-jian-yong"
 },
 {
  "text": "Dr Mok Kam-wah, Daniel \nOur research focuses on Metabolomics to understand Chronic Disease and Traditional Chinese Medicine; Quality control of Traditional Chinese Medicine; and Theoretical calculations to study reactions in the atmosphere.\nAcademic and Professional Experiences \nBachelor of Science, The University of Hong Kong\nDoctor of Philosophy, The University of Hong Kong\nProfessional Qualifications\nMember of The Royal Society of Chemistry\nMember of The Royal Society of Chemistry (MRSC) 2022 to present\nMember of the Advisory Committee of the Government Chinese Medicines Testing Institute.\nMember of Panel on Promoting Testing and Certification Services in Chinese Medicine Trade, Hong Kong Council for Testing and Certification, Hong Kong.\nAcademic Advisor, Hong Kong Chinese Medicine Industry Association, Hong Kong.\nMember of the Executive Committee, Modernized Chinese Medicine International Association, Hong Kong.\nTheoretical Calculations \nChemometrics \nMetabolomics \nChinese Medicine \nS.-j. Xiang, M.-h. Li, C.-o. Chan, Q. Shen, S.-b. Chen, B.-c. An, A.C.-y. Yuen, W.-f. Wu, H.-h. Tang, S.-w. Cao, S.-f. Ruan, Z.-x. Wang, L.-d. Weng, H.-x. Zhu, H.-j. Chen, M.Y.-M. Wong, Y. Zhang, D.K.-W. Mok*, and Q. Liu, 'Altered metabolites in guinea pigs with allergic asthma after acupoint sticking therapy: New insights from a metabolomics approach'. Phytomedicine, 54 (2019) 182-194.\nC.O. Chan, X.J. Xie, S.W. CWan, G.L. Zhou, A.C.Y. Yuen, D.K.W. Mok*, and S.B. Chen, 'Qualitative and quantitative analysis of sesquiterpene lactones in Centipeda minima by UPLC–Orbitrap–MS & UPLC-QQQ-MS' Journal of Pharmaceutical and Biomedical Analysis, 174 (2019) 360-366.\nH.H. Xiao, T.T. Sham, C.O. Chan, M.H. Li, X. Chen, Q.C. Wu, D.K.W. Mok, X.S. Yao and M.S. Wong, \"A Metabolomics Study on the Bone Protective Effects of a Lignan-Rich Fraction From Sambucus Williamsii Ramulus in Aged Rats\" Frontiers in Pharmacology, 9 (2018), Article 932.\nH.Y. Wong, M.Y.M. Wong, B. Hu, P.K. So, C.O. Chan, D.K.W. Mok*, and Z.P. Yao, \"Rapid differentiation of Ganoderma species by direct ionization mass spectrometry\". Analytica Chimica Acta, 999 (2018) 99-106.\nT.T. Sham, M.H. Li, C.O. Chan, H. Zhang, S.W. Chan and D.K.W. Mok*, \"Cholesterol-lowering effects of piceatannol, a stilbene from wine, using untargeted metabolomics\" Journal Functional Foods, 28 (2017) 122-137.\nM. Ng, D.K.W. Mok, E.P.F. Lee, and J.M. Dyke, ' The Atmospherically Important Reaction of Hydroxyl Radicals with Methyl Nitrate: A Theoretical Study Involving the Calculation of Reaction Mechanisms, Enthalpies, Activation Energies, and Rate Coefficients' Journal Physical Chemistry A, 121 (2017) 6554-6567\nR. Chow, D. K. W. Mok, E. P. F. Lee, J. M. Dyke, \"A theoretical study of the atmospherically important radical-radical reaction BrO + HO2; the product channel O-2(a(1)Delta(g)) + HOBr is formed with the highest rate.\" Physical Chemistry Chemical Physics 18 (2016), 30554-30569.\nY.F. Xing, Z. Zhang, W.J. Fu, D.Q. Zhou, A. C. Y. Yuen, D.K.W. Mok, C.O. Chan, G.D. Tong, \"Shugan Xiaozhi Decoction Attenuates Non-alcoholic Steatohepatitis (NASH) by enhancing PPARα and L-FABP expressions in High-fat-fed Rats\" Evidence-Based Complementary and Alternative Medicine, (2016) Article no. 7870789.\nM. Ng, D.K.W. Mok*, E.P.F. Lee, and J.M. Dyke, A theoretical study of the mechanism of the atmospherically relevant reaction of chlorine atoms with methyl nitrate, and calculation of the reaction rate coefficients at temperatures relevant to the troposphere' Physical Chemistry Chemical Physics, 17 (2015) 7463-7476.\nN.P. Dong, Y.Z. Liang, Q.S. Xu, D.K.W. Mok, L.Z. Yi, H.M. Lu, M. He, and W. Fan, 'Prediction of Peptide Fragment Ion Mass Spectra by Data Mining Techniques' Analytical Chemistry, 86 (2014) 7446-7454.\n陳新滋、楊大堅、區靖彤、莫錦華、陳四保，《名貴藥材鑑別》(2013)天地圖書公司 ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-mok-kamwah-daniel"
 },
 {
  "text": "Dr Wong Ka-hing \nOur lab is interested in developing natural bio-resources into novel functional foods for prevention and/or treatment of chronic diseases. \nBachelor of Science, The Chinese University of Hong Kong\nMaster of Philosophy, The Chinese University of Hong Kong\nDoctor of Philosophy, The Chinese University of Hong Kong\nAppointment in Government Department / Professional Organization:\n2020-2023 Committee Member, Advisory Committee on Sustainable Fisheries Development Fund, Agriculture, Fisheries and Conservation Department, The Government of Hong Kong SAR \n2019-2021 Honorary Advisor, Hong Kong Health Food Association \n2018-2022 Honorary Advisor, Institution of Dining Art \n2018-2022 Committee Member, Expert Committee on Food Safety, Centre for Food Safety, Food and Environmental Health Department, The Government of Hong Kong SAR \n2017-2021 Committee Member, Advisory Committee on Agriculture and Fisheries, Agriculture, Fisheries and Conservation Department, The Government of Hong Kong SAR \n2016-2020 Admission Panel Member, Technology Business Incubation Programme, Hong Kong Science and Technology Parks Corporation \n2016-2022 Mainland Fishermen Deckhands Scheme Appeal Committee Member, Agriculture, Fisheries and Conservation Department, The Government of Hong Kong SAR \n2016-2022 Marine Fish Scholarship Fund Advisory Committee Member, Agriculture, Fisheries and Conservation Department, The Government of Hong Kong SAR \n2014-2020 Standard Board Member, Hong Kong Organic Resource Centre Certification Ltd. \n2014-2021 Technical Expert (Food Category), Hong Kong Q-Mark Council, Federation of Hong Kong Industries \n2011-2021 HKCAS Technical Expert, ISO 22000:2005 Food Safety Management System - Hong Kong Accreditation Service, Innovation and Technology Commission, The Government of Hong Kong SAR\nFunctional Food Development Using Natural Bio-resources \nFoodomics and Food Sustainability \nSmart Technology for Future Food Industry \n2021 2020年度高等学校科学研究优秀成果奖（科学技术）: 技术发明奖二等奖, 教育部, 中國 \n2015 Technology Transfer Award-Merit, Outstanding Professional Services Awards 2014, PolyU, Hong Kong \n2014 Gold Medal Invention Award, 42nd International Exhibition of Inventions of Geneva, Geneva, Switzerland. \n2014 Thailand Award for the Best International Invention, 42nd International Exhibition of Inventions of Geneva, National Research of Thailand, Thailand \n2014 深圳市科技项目奖, 深圳, 中国 \n2013 Material Invention Order of Merit, 2013 Korea Inventor Award Festival, Seoul, Korea. \n2013 Special Gold Medal Award, 2013 World Inventor Award Festival, Seoul, Korea. \n2013 Food and Material Invention Order of Merit, 2013 World Inventor Award Festival, Seoul, Korea. \n2012 Gold Medal Invention Award, 40th International Exhibition of Inventions of Geneva, Geneva, Switzerland. \n2012 Prize of the Chinese Delegation of the Exhibition, 40th International Exhibition of Inventions of Geneva, China Patent Information Center of SIPO, PRC \n2011 Winner of Young Investigator Award, 2011 International Conference on Food Factors, Taipei, Taiwan \n黄家兴，董晓莉, 陆家谦, 张兆滔. 一种纳米硒水溶胶及其制备方法与应用. 2019.12, 中国, CN201911215358.5.\n夏凡, 郭颖轩, 黄家兴，陆家谦, 张兆滔. 有免疫增强功效的壳聚糖纳米硒水溶胶及制备、保存和应用, 2019.01, 中国, CN201910027253.0.\n黄家兴，陈填烽. 有抗肿瘤活性的纳米硒水溶胶及制备、保存方法和应用, 2016.02, 中国，CN201610086666.2\nTianfeng Chen, Kahing Wong, Hualian Wu, Wenjie Zheng, Man Kin Wong, Wing Yin Cornelia Man. Pleurotus tuber-regium polysaccharide functionalized nano-selenium hydrosol with anti-tumor activity and preparation method thereof. 2015.07, USA, US9,072,669B2 [Granted].\n陈填烽，黄家兴，吴华莲, 郑文杰，黄文健，文咏贤. 具有抗肿瘤活性的虎奶菇多糖功能化纳米硒水溶胶及其制备方法, 2011.07, 中国, CN201110208539 [Licensed].\n相大鹏，黄文健，刘青，韦晓群，黄家兴，黄茳钒，邵仕萍. 一种基于金属催化偶联反应的食品中甲醛的检测方法及其试剂盒, 2014.08, 中国，CN201410409453.X [Granted].\n王奕，黄家兴，邓惠华. 一种包衣组合物以及由其制备的包衣药物制剂和制备方法, 2014.03，中国, CN201410130730.3.\n陈填烽，郑文杰，蒋洁，杨芳，黄家兴.同时分离高纯度的藻蓝蛋白和别藻蓝蛋白的方法与应用, 2011.9, 中国, CN201110268917 [Granted].\nZhang Z, Du Y, Liu T, Wong KH, Chen T (2019). Systematic acute and subchronic toxicity evaluation of polysaccharide-protein complexes-functionalized selenium nanoparticles with anticancer potency. Biomater Sci 7, 5112-5123\nZhao J, Luk KH, Cheung ST, Wong KH, Chen T (2019). Potentiation of in vivo anticancer efficacy of selenium nanoparticles by mushroom polysaccharides surface decoration. J Agric Food Chem 67, 2865–2876.\nMei C, Wang N, Zhu X, Wong KH, Chen T (2018). Photothermal-controlled nanotubes with surface charge flipping ability for precise synergistic therapy of triple-negative breast cancer. Adv Funct Mater\nHuang G, Liu Z, He L, Luk KH, Cheung ST, Wong KH, Chen T (2018). Autophagy is an important action mode for functionalized selenium nanoparticles to exhibit anti-colorectal cancer activity. Biomater Sci 6, 2508-2517.\nYu S, Luk KH, Cheung ST, Kwok, KWH, Wong KH, Chen T (2018). Polysaccharide-protein complex-decorated selenium nanosystem as efficient bone-formation therapeutics. J Mater Chem B 6, 5215-5219.\nNie T, Wu H, Wong KH, Chen T (2016). Facial synthesis of highly uniform selenium nanoparticles using glucose as reductant and surface decorator to induce cancer cell apoptosis. J Mater Chem B, 4, 2351-2358.\nWang Y, Li W, Yang Y, Zeng Q, Wong KH, Li X, Chen T (2015). An integrin-targeting nanosystem as the carrier of selenadiazole derivative to induce ROS-mediated apoptosis in bladder cancer cells, from rational design to action mechanisms. J Mater Chem B, 3, 9374-9382.\nYip J, Liu L, Wong KH, Leung PHM, Yuen MCW, Cheung MC (2014). Investigation of antifungal and antibacterial effects of fabric padded with highly stable selenium nanoparticles. J Appl Polym Sci, 131, 8886-8893.\nWu H, Zhu H, Li X, Liu Z, Zheng W, Chen T, Yu B, Wong KH (2013). Induction of apoptosis and cell cycle arrest in A549 human lung adenocarcinoma cells by surface-capping selenium nanoparticles: an effect enhanced by polysaccharides-protein complexes from Polyporus rhinocerus. J Agric Food Chem, 61, 9859-9866.\nWu H, Li X, Liu W, Chen T, Li Y, Zheng W, Man C, Wong MK, Wong KH (2012). Surface decoration of selenium nanoparticles by mushroom polysaccharide-protein complexes to achieve enhanced cellular uptake and anti-proliferative activity. J Mater Chem 22, 9602-9610.\nWong KH, Cheung PCK (2008). Sclerotia: Emerging functional food derived from mushrooms. In: Mushrooms As Functional Foods. PCK Cheung (ed.). NJ, USA: John Wiley & Sons, Inc. pp.111-146.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-wong-kahing"
 },
 {
  "text": "Dr Hui Lai-ling, Connie \nnutritional epidemiology of chronic diseases, assessment of biological age, biobanking and cohort studies, early origin of health and diseases, child growth monitoring, determinants and consequences of breastfeeding, and health economic evaluations. \nBachelor of Science, The Chinese University of Hong Kong\nMaster of Philosophy, The Chinese University of Hong Kong\nNutritional epidemiology \nAgeing \nHealthspan \nType II diabetes \nCardiovascular disease \nMetabolic syndrome \nBreastfeeding \nMicronutrients \nDioxins \nHuman growth \nGrowth charts \nHealth economics \nHui LL, Kwok MK, Nelson EAS, Lee SL, Leung GM, Schooling CM. Breastfeeding in Infancy and Lipid Profile in Adolescence. Pediatrics. 2019 May;143(5).\nHui LL, Li AM, Nelson EAS, Leung GM, Lee SL, Schooling CM. In utero exposure to gestational diabetes and adiposity from infancy to adolescence: Does breastfeeding make a difference? International Journal of Obesity 2018. Int J Obes (Lond). 2018 Jul;42(7):1317-1325. \nHui LL, Nelson EAS, Wong MY, Chung TM, Lee KK, Leung GM, Schooling CM. The association of intergenerational mismatch with adiposity and blood pressure in childhood and adolescence. Journal of Adolescent Health. 2018. 62:100-106 \nHui LL, Kwok MK, Nelson EAS, Lee SL, Leung GM, Schooling CM. The association of breastfeeding with insulin resistance at 17 years: Prospective observations from Hong Kong’s ‘‘Children of 1997’’ birth cohort. Maternal and Child Nutrition. 2018. 14 (1) \nHui LL, Lam HS, Leung GM, Schooling CM. Duration of puberty in Chinese preterm girls. American Journal of Human Biology. 2017. 29 (4) \nHui LL, Lam HS, Lau EY, Nelson EA, Wong TW, Fielding R. Prenatal dioxin exposure and neurocognitive development in Hong Kong 11-year-old children. Environmental Research 2016. 150:205-12.\nHui LL, Leung GM, Schooling CM. Social patterning in Adiposity in adolescence: Prospective observations from the Chinese birth cohort “Children of 1997”. PLoS One. 2016. 11(1):e0146198. \nHui LL, Chan MH, Lam HS, Chan PH, Kwok KM, Chan IH, Li AM, Fok TF. Impact of fetal and childhood mercury exposure on immune status in children. Environmental Research. 2016. 144:66-72. \nSchooling CM, Hui LL, Ho LM, Lam TH, Leung GM. Cohort profile: “Children of 1997”: a Hong Kong Chinese birth cohort. International Journal of Epidemiology. 2012. 41: 611-20. \nHui LL, Schooling CM, Cowling BJ, Leung SS, Lam TH, Leung GM. Are universal standards for optimal infant growth appropriate? Evidence from a Hong Kong Chinese birth cohort. Arch Dis Child. 2007. 162: 515-8.\nNutritional epidemiology\nAgeing \nHealthspan \nType II diabetes \nCardiovascular disease \nMetabolic syndrome \nBreastfeeding \nMicronutrients Dioxins \nHuman growth \nGrowth charts \nHealth economics ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-hui-lailing-connie"
 },
 {
  "text": "Dr Seto Sai-wang \nOur group is interested in the discovery of novel therapeutic targets for complex and multi-factorial health problems. \nBachelor of Science, The University of Liverpool\nDoctor of Philosophy, The Chinese University of Hong Kong\nProfessional Qualifications\nBritish Pharmacological Society - Member\nRoyal Pharmacological Society - SRPharmS\nNICM Health Research Institute, Western Sydney University - Adjunct Fellow\nPharmacology \nBone-derived Proteins and Vascular Diseases \nChinese Herbal Medicine for Cerebrovascular Diseases \nYoung Investigator Award (2008) - Institute of Cardiovascular Science and Medicine - 12th Annual Scientific Meeting, Hong Kong\nAustralian Government National Health and Medical Research Council (NHMRC) Training Fellowship (2011-2012)\nNational Heart Foundation (NHF) Postdoctoral Fellowship (2013-14)\nNational Heart Foundation (NHF) of Australia – Exchange and Collaboration Award (2013)\nCardiac Health Institute Research Fellowship (2015-2020)\nHe L, Shi X, Seto SW, Chang D, Wang H, Zhang S, Chen W, Wang J (2019) Using 3D-UPLC-DAD and a new method-verification by adding mixture standard compounds to determine the fingerprint and eight active components of Naoluoxintong decoction. J Pharm Biomed Anal. 169: 60-69.\nKazzem M, Sun YT, Low M, ^Seto SW, Chang D, Lee S, Suresh H, Khoo CS, Bensoussam A, Kiat H (2019) Chromatographic Analysis and Anti-oxidative Property of Naoxinqing Tablet, a Proprietary Preparation of Diospyros Kaki Leaves. Molecules. 24(6) pii:E1101 (^: Corresponding author)\nWu S, Wang N, He Q, Chang G, Seto SW, Chang D, Liang H (2018) The Establishment of the Method of Cell Biochromatograpy and Analysis of the Active Ingredients from TongQiaoHuoXue Decoction Acting on the Neurocytes. Chem Pharm Bull (Tokyo). 66(10): 983-991\nYang G, Wang N, Seto SW, Chang D, & Liang H. (2018). Hydroxysafflor yellow a protects brain microvascular endothelial cells against oxygen glucose deprivation/reoxygenation injury: Involvement of inhibiting autophagy via class I PI3K/Akt/mTOR signaling pathway. Brain Research Bulletin. 140: 243-257.\nSeto SW, Chang D, Kiat H, Wang N, Bensoussan A (2018) Chinese Herbal Medicine as a Potential Treatment of Abdominal Aortic Aneurysm. Frontiers in Cardiovascular Medicine. doi: 10.3389/fcvm.2018.00033.\nLi Z, Zhang J, Zou L, Lee SMY, Yang C, Seto SW, Leung GPH (2017) Pro-angiogenic effecets of ilexsaponin A on human umbilical vein endothelial cells in vitro and zebrafish in vivo. Phytomedicine 36: 229-237\nSeto SW, Chang D, Ko WM, Zhou X, Kiat H, Bensoussan A, Lee SM, Hoi MP, Steiner GZ, Liu J. (2017) Sailuotong Prevents Hydrogen Peroxide (H₂O₂)-Induced Injury in EA.hy926 Cells. Int J Mol Sci 18(1) E95 (First and Corresponding author)\nKrishna SM, ^Seto SW, Jose RJ, Li J, Morton SK, Biros E, Wang Y, Nsengiyumva V, Lindeman JH, Loots GG, Rush CM, Craig JM, Golledge J (2017) Wnt Signaling Pathway Inhibitor Sclerostin Inhibits Angiotensin II-Induced Aortic Aneurysm and Atherosclerosis. Arterioscler Thromb Vasc Biol. 37(3): 553-566 (^: Co-first authorship)\nMoran CS, ^Seto SW, Krishna S, Sharma S, Jose RJ, Biros E, Wang Y, Morton SK, Golledge J (2017) Parenteral administration of factor Xa/IIa inhibitors limits experimental aortic aneurysm and atherosclerosis. Scientific Reports 7:43079. (^: Co-first authorship)\nKrishna SM, Seto SW, Jose R, Li J, Moxon J, Clancy P, Crossman DJ, Norman P, Emeto TI, Golledge J (2017) High serum thrombospondin-1 concentration is associated with slower abdominal aortic aneurysm growth and deficiency of thrombospondin-1 promotes angiotensin II induced aortic aneurysm in mice. Clin Sci (Lond). 131(12):1261-1281.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-seto-saiwang"
 },
 {
  "text": "Dr Lo Ka-hei, Kenneth \nDr. Lo is interested in how dietary patterns may associate with cardio-metabolic and mental health. \nBachelor of Science, The Chinese University of Hong Kong\nDoctor of Philosophy, The Chinese University of Hong Kong\nRegistered Nutritionist in Public Health of Association for Nutrition (2021-present)\nReviewer for multiple academic journals, including American Journal of Clinical Nutrition and Scientific Reports (2018-present)\nInternal Affairs Officer of Hong Kong Nutrition Association (2019-present)\nMember of Hong Kong Nutrition Association (2019-present)\nMember of American Society for Nutrition (2019-present)\nDisease Prevention \nNutrition \nNutritional Epidemiology \nMetabolic Diseases \nAJCN 2021 Top Reviewer Award (The American Journal of Clinical Nutrition) United States, 2022\nAJCN 2020 Top Reviewer Award (The American Journal of Clinical Nutrition) United States, 2021\nBest Abstract Award for Young Researchers (The 14th China Nutrition Science Congress) China 2019\nYoung Investigator Award (The Inaugural Clinical and Translational Cardiology Conference) Hong Kong 2018\nReaching Out Award (HKSAR Government Scholarship Fund) Hong Kong 2018\nGolden Jubilee Ms. Manda Young Scholarship (CUHK) Hong Kong 2018\nPhD Student Exchange Scholarship (CUHK) Hong Kong 2017\nResearch Postgraduate Student Grants for Overseas Academic Activities (CUHK) Hong Kong 2017\nClinton Global Initiative University Network 2017 Seed Funding (CUHK) Hong Kong 2017\nYonsei Fund (49th APACPH Conference) Hong Kong 2017\nOutstanding Oral Presentation Award (49th APACPH Conference) Hong Kong 2017\nLo K (corresponding), Glenn AJ, Yeung S, Kendall CWC, Sievenpiper JL, Jenkins DJA, Woo J. Prospective Association of the Portfolio Diet with All‐Cause and Cause‐Specific Mortality Risk in the Mr. OS & Ms. OS Study. Nutrients 2021, 13, 4360. (2021 Impact factor: 6.706)\nWong J, Chan KY, Lo K (corresponding). Sodium glucose co-transporter 2 inhibitors on weight change and cardiometabolic profiles in individuals with overweight or obesity and without diabetes: A meta-analysis. Obes Rev. 2021; e13336. (2021 Impact factor: 10.867)\nWong MMH, Chan KY, Lo K (corresponding). Manganese Exposure and Metabolic Syndrome: A Systematic Review and Meta-Analysis. Nutrients 2022, 14, 825. (2021 Impact factor: 6.706)\nLo K, Yang JL, Chen CL, Liu L, Huang YQ, Feng YQ, Ying Q, Yang AM. Associations between blood and urinary manganese with risk of metabolic syndrome and its components: cross-sectional analysis of National Health and Nutrition Examination Survey 2011-2016. Sci Total Environ. 2021; 780: 146527. (2021 Impact factor: 10.753)\nChan V, Lo K (corresponding). Efficacy of dietary supplements on improving sleep quality: a systematic review and meta-analysis. Postgrad Med J. 2021; available online. doi: 10.1136/postgradmedj-2020-139319 (2021 Impact factor: 4.973)\nLo K, Huang YQ, Shen G, Huang JY, Liu L, Yu YL, Chen CL, Feng YQ. Effects of waist to height ratio, waist circumference, body mass index on the risk of chronic diseases, all-cause, cardiovascular and cancer mortality. Postgrad Med J. 2021; 97(1147): 306-11.(2021 Impact factor: 4.973)\nGong JH, Lo K (co-first), Liu Q, Li J, Lai S, Shadyab AH, Arcan C, Snetselaar L, Lui S. Dietary Manganese, Plasma Markers of Inflammation, and the Development of Type 2 Diabetes in Postmenopausal Women: Findings From the Women’s Health Initiative. Diabetes Care. 2020; 43: 1344–51. (2021 Impact factor: 17.152)\nLo K, Liu Q, Allison M, Feng YQ, Chan K, Phillips L, Manson J, Liu S. Prospective Associations of Waist-to-Height Ratio With Cardiovascular Events in Postmenopausal Women: Results From the Women’s Health Initiative. Diabetes Care. 2019;42(9): e148–9. (2021 Impact factor: 17.152)\nLo K, Liu Q, Madsen T, Rapp S, Chen J-C, Neuhouser M,Shadyab A, Pal L, Lin X, Shumake S, Manson J, Feng YQ, Lui S. Relations of magnesium intake to cognitive impairment and dementia among participants in the Women’s Health Initiative Memory Study: a prospective cohort study. BMJ Open. 2019; 9(11): e030052. (2021 Impact factor: 3.017)\nLo K, Wong M, Khalechelvam P, Tam W. Waist-to-height ratio, body mass index and waist circumference for screening paediatric cardio-metabolic risk factors: a meta-analysis. Obes Rev. 2016;17:1258–75. (2021 Impact factor: 10.867)",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-lo-kahei-kenneth"
 },
 {
  "text": "Dr Fang Kar-hei, James \nI am a marine physiologist and toxicologist who cares about ocean health and seafood sustainability. I lead the Marine Ecology and Aquaculture Laboratory (MEAL; www.seafoodmeal.today), in which research topics include [1] seafood nutrition and contamination, for example, how the physiology and nutritional profiles of seafood species, and their uptake of contaminants, would change under climate change and ocean acidification; [2] a special focus on the monitoring of microplastics, an emerging contaminant in food and the environment, and the impacts of these particles on human health and animal health; [3] marine aquaculture technologies, such as feed formulation for fish and shellfish, and the use of seaweed aquaculture for extra food production and carbon sequestration; and [4] conservation of coral reefs and oyster reefs, which sustain biodiversity and provide important nurseries for seafood species, and ecological restoration of these habitats using 3D printing technology. \nBachelor of Science, The University of Plymouth\nMaster of Philosophy, City University of Hong Kong\nDoctor of Philosophy, The University of Queensland\nProfessional Qualifications\nChartered Biologist and Member, UK Royal Society of Biology\nDirector, Hong Kong Marine Ecological Association\nMember, US Institute of Food Technologists\nMember, US International Coral Reef Society\nMember, UK Marine Biological Association\nOccupational Scientific Diver, Australian Diver Accreditation Scheme\nOpen Water Diver, Professional Association of Diving Instructors, Hong Kong\nPrincipal Investigator, State Key Laboratory of Marine Pollution, China, a consortium of eight universities led by City University of Hong Kong (2017–Present)\nAssociate Editor, Environmental Geochemistry and Health, Springer (2022–Present)\nAssociate Editor, Regional Studies in Marine Science, Elsevier (2022–Present)\nReview Editor, Frontiers in Toxicology, Frontiers (2022–Present)\nGuest Editor, Journal of Visualized Experiments, JoVE (2022–Present)\nGuest Editor, Journal of Sea Research, Elsevier (2022–Present)\nGuest Editor, Toxics, MDPI (2021–2022)\nGuest Associate Editor, Frontiers in Physiology, Frontiers (2019–2021)\nPeer-Reviewers for 36 international scientific journals\nManagement Committee Member, Fisheries Enhancement Fund, Airport Authority Hong Kong, Government of Hong Kong (2022–Present)\nMarine Park Committee Member, Agriculture, Fisheries and Conservation Department, Government of Hong Kong (2019–Present)\nScientific Committee Member, Ocean Park Conservation Foundation Hong Kong (2019–Present)\nFaculty of Science Board Member, The Hong Kong Polytechnic University (2022–Present)\nAnimal Subjects Ethics Sub-Committee Member, Research Committee, The Hong Kong Polytechnic University (2021–Present)\nOrganising Committee Chairman, East Asia Regional Training Workshop on Monitoring and Assessment of Microplastics in Marine Environments, co-organised by the State Key Laboratory of Marine Pollution, China, and Partnerships in Environmental Management for the Seas of East Asia, 19 December 2022, virtual\nOrganising Committee Member and Session Chair, The 2nd International Conference on Biodiversity, Ecology and Conservation of Marine Ecosystems, 2–8 January 2022, Hong Kong\nSession Chair, The State Key Laboratory of Marine Pollution Annual and Academic Committee Meetings, 6–7 April 2022, and 29–30 March 2021, Hong Kong\nMember, Research Institute for Future Food, The Hong Kong Polytechnic University (2021–Present)\nMember, Research Institute for Land and Space, The Hong Kong Polytechnic University (2021–Present)\nMember, Research Institute for Sustainable Urban Development, The Hong Kong Polytechnic University (2021–Present)\nAdjunct Fellow, Global Change Institute, The University of Queensland (2018–2020)\nPostdoctoral Scientist, Institute of Marine Research, Norway (2013–2017)\nVisiting Research Fellow, University of Bergen (2013–2016)\nVisiting Scientist, Royal Netherlands Institute for Sea Research (2014)\nSeafood Nutrition and Sustainability \nSeafood Contamination and Risk Assessments \nMicroplastics and Nanoplastics \nCoral Reefs and Oyster Reefs \nImpacts of Ocean Warming and Acidification \nMarine Ecophysiology and Ecotoxicology \nMarine Aquaculture Technology \n3D Scanning and Printing Technologies for Ecological Applications \nGraduate Fellowship, International Society for Reef Studies (ISRS, currently International Corel Reef Society; an annual global award in coral reef research, 2010)\nResearch Scholarship and International Research Tuition Award, The University of Queensland (2009)\nPrize for Outstanding Presentation, The 5th International Conference on Marine Pollution and Ecotoxicology, 3–6 June 2007, Hong Kong\nZhang E, Stocchino A, De Leo A, Fang JKH (2022) Performance assessment of bubbles barriers for microplastic remediation. Science of the Total Environment, 844, 157027\nLiang T, Lei ZY, Fuad MTI, Wang Q, Sun SC, Fang JKH, Liu XS (2022) Distribution and potential sources of microplastics in sediments in remote lakes of Tibet, China. Science of the Total Environment 806, 150526\nLeung MML, Ho YW, Lee CH, Wang Y, Hu M, Kwok KWH, Chua SL, Fang JKH (2021) Improved Raman spectroscopy-based approach to assess microplastics in seafood. Environmental Pollution 289, 117648\nLeung MML, Ho YW, Maboloc EA, Lee CH, Wang Y, Hu M, Cheung SG, Fang JKH (2021) Determination of microplastics in the edible green-lipped mussel Perna viridis using an automated mapping technique of Raman microspectroscopy. Journal of Hazardous Materials 420, 126541\nLiu SY, Leung MML, Fang JKH, Chua SL (2021) Engineering a microbial ‘trap and release’ mechanism for microplastics removal. Chemical Engineering Journal 404, 127079\nFang JKH, Rooks CA, Krogness CM, Kutti T, Hoffmann F, Bannister RJ (2018) Impact of particulate sediment, bentonite and barite (oil-drilling waste) on net fluxes of oxygen and nitrogen in Arctic-boreal sponges. Environmental Pollution 238, 948–958\nFang JKH, Schönberg CHL, Mello-Athayde MA, Hoegh-Guldberg O, Dove S (2014) Effects of ocean warming and acidification on the energy budget of an excavating sponge. Global Change Biology 20, 1043−1054\nFang JKH, Mello-Athayde MA, Schönberg CHL, Kline DI, Hoegh-Guldberg O, Dove S (2013) Sponge biomass and bioerosion rates increase under ocean warming and acidification. Global Change Biology 19, 3581−3591\nFang JKH, Wu RSS, Zheng GJ, Lam PKS, Shin PKS (2010) Seasonality of bioaccumulation of trace organics and lysosomal integrity in green-lipped mussel Perna viridis. Science of the Total Environment 408, 1458−1465\nFang JKH, Wu RSS, Zheng GJ, Au DWT, Lam PKS, Shin PKS (2009) The use of muscle burden in rabbitfish Siganus oramin for monitoring polycyclic aromatic hydrocarbons and polychlorinated biphenyls in Victoria Harbour, Hong Kong and possible human health risk. Science of the Total Environment 407, 4327−4332\nDellisanti W, Seveso D, Fang JKH (2022) Nutrition of corals and their trophic plasticity under environmental conditions. In: Chimienti G (Ed). Corals – Habitat Formers from the Shallow to the Deep. IntechOpen, London, DOI: 10.5772/intechopen.104612\nSchönberg CHL, Fang JKH, Carballo JL (2017) Excavating sponges and the future of coral reefs. In: Carballo JL, Bell J (Eds). Climate Change, Ocean Acidification and Sponges. Springer, Berlin-Heidelberg, pp. 179–372\nWu RSS, Chan AKY, Richardson B, Au DWT, Fang JKH, Lam PKS, Giesy J (2008) Measuring and monitoring POPs: a critique. In: Murakami Y, Nakayama K, Kitamura SI, Iwata H, Tanabe S (Eds). Interdisciplinary Studies on Environmental Chemistry: Biological Responses to Chemical Pollutants. TERRAPUB, Tokyo, pp. 1−6",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-fang-karhei-james"
 },
 {
  "text": "Dr Zhao Danyue, Daisy \nWe are interested in studying the interactions between bioactive phytochemicals and gut microbiota, and the novel approaches to extend the bioefficacy of phytochemicals in disease prevention. \nPhD, The University of Hong Kong\nBachelor (Hons.), Hong Kong Baptist University\nPostdoctoral Associate, Rutgers - The State University of New Jersey, New Brunswick\nAcademic Membership\nMember of The American Society for Nutrition (ASN)\nMember of The Metabolomics Society\nMember of The Institute of Food Technologists (IFT) \nMember of The International Society for Nutraceuticals and Functional Foods\nAcademic Services (Editorial)\nAssociate Editor, Food Safety and Health (forthcoming - Summer 2023, on Wiley)\nReviewer Editor, Frontiers in Nutrition (Nutrition and Microbes)\nGuest Associate Editor, Frontiers in Nutrition \nPolyphenols \nPhytonutrients \nGut Microbiota \nProbiotics \nMetabolomics \nMass Spectrometry \nNatural Product Chemistry \nPrecision Nutrition \nOutstanding Contribution Award, 6th International Symposium on Phytochemicals in Medicine and Food 2022. \nThe Best Presentation Award, Virtual Podium Asia Pacific 2021 - Proteomics, Metabolomics and Lipidomics. \nAmerican Society for Nutrition (ASN) Postdoctoral Research Award - Nutrition 2019. \nASN Travel Award-Dietary Bioactive Component Research Interest Section - Nutrition 2019. \nMetabolomics Society Early Career Travel Award - Metabolomics 2018. \nChan, Y.-T., Huang, J., Wong, H.-C., Li, J., & Zhao, D.* Metabolic fate of black raspberry polyphenols in association with gut microbiota of different origins in vitro. Food Chemistry (2023); 404 Part B, 134644. (*Corresponding author)\nLu, Z., Chan, Y.-T., Lo, K., Wong, V. W.-S., Ng, Y.-F., Li, S.-Y., Ho, W. W., Wong, M.-S.*, & Zhao, D.* Levels of polyphenols and phenolic metabolites in breastmilk and its associations with plant-based food intake in Hong Kong lactating women. Food and Function (2021); 12, 12683-12695. (*Corresponding author)\nYuan, B., Zhao, D.*, Lyu W., Yin Z., Kshatriya, D., Bello, N.T., Simon, J.E., & Wu, Q.* Development and validation of a micro-QuEChERS method with high-throughput enhanced matrix removal followed with UHPLC-QqQ-MS/MS for analysis of raspberry ketone-related phenolic compounds in adipose tissues. Talanta (2021); 235; 122716. (*Corresponding author)\nZhao, D.; Yuan, B.; Kshatriya, D.; Polyak, A.; Simon, J.E., Wu, Q.L. & Bello, N.T. (2020). Influence of diet-induced obesity on the bioavailability and metabolism of raspberry ketone (4-(4-hydroxyphenyl)-2-butanone) in mice. Molecular Nutrition and Food Research, 64, 1900907.\nWang, J., Zhao, D., Tiano, S., Esteban-Fernández, A., Yuan, B., Smith, C., Brathwaite, J., Jlayer, Z., Wu, Q., Simon, J.E., Trageser, K.J., Pasinetti, G.M. (2020). Prophylactic effect of flavanol rich preparation metabolites in promoting resilience to a mouse model of social stress. Translational Psychiatry, 10, 183.\nWestfall, S., Caracci F., Zhao D., Wu, Q.L., Frolinger, T., Simon, J.E., Pasinetti, G.M. (2020). Microbiota metabolites modulate the T helper 17 to regulatory T cell (Th17/Treg) imbalance promot-ing resilience to stress-induced anxiety-and depressive-like behaviors. Brain, Behavior, and Immunity, in press (Available online 21 October 2020).\nHo, L.(#1); Zhao, D.(#1); Ono, K.; Ruan, K.; Mogno, I.; Tsuji, M.; Carry, E.; Brathwaite, J.; Sims, S.; Frolinger, T.; Westfall, S.; Mazzola, P.; Simon, J.E.; Wu, Q.L.; Faith, J. & Pasinetti, G.M. (2019). Heterogeneity in gut microbiota drive polyphenol metabolism that influences α-synuclein misfolding and toxicity. The Journal of Nutritional Biochemistry, 64, 170-181.\nZhao, D.; J.; Simon, J.E. & Wu, Q.L. (2019). A Critical Review on Grape Polyphenols for Neuroprotection: Strategies to Enhance Bioefficacy. Critical Reviews in Food Science and Nutrition, 4, 597-625.\nCarry, E.(#1); Zhao, D.(#1); Faith, J.; Ho, L.; Villani, T.; Patel, H.; Pasinetti, G.M.; Simon, J.E. & Wu, Q.L. (2018). Development and validation of a gas chromatography-triple quadruple mass spectrometry method for quantification of microbial phenolic acid metabolites derived from grape flavanols. Journal of Pharmaceutical and Biomedical Analysis, 159, 374-383.\nZhao, D.; Yuan, B.; Carry, E.; Pasinetti, G.M.; Ho, L.; Faith, J.; Mogno, I.; Simon, J.E. & Wu, Q.L. (2018). Development and validation of an ultra-high performance liquid chromatography/triple quadrupole mass spectrometry method for analyzing microbial-derived grape polyphenol metabolites. Journal of Chromatography B, 1099, 34-45.\nOu, J.; Huang, J.; Zhao, D.; Du, B.; Wang, M. (2018). Protective effect of rosmarinic acid and carnosic acid against streptozotocin-induced oxidation, glycation, inflammation and microbiota imbalance in diabetic rats. Food & Function, 9, 851-860.\nZhao, D. & Shah, N.P. (2016). Synergistic administration of lactic acid bacteria and black tea enhances polyphenols bioavailability and relieves D-galactose induced oxidative stress in mice via modulating glutathione-related enzymes. The Journal of Nutritional Biochemistry, 38, 116 – 124.\nZhao, D. & Shah, N.P. (2016). Synergistic application of black tea extracts and lactic acid bacteria in protecting human colonocytes against oxidative damage. Journal of Agricultural and Food Chemistry,64, 2238–2246.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-zhao-danyue-daisy"
 },
 {
  "text": "Dr Chang Jinhui, Gail \nSmart food technology, functional food product development and mushroom living material; Genomics and transcriptomics of mushroom development. \nDoctor of Philosophy, The Chinese University of Hong Kong\nmicrobiology \nmushroom \nfood technology \nfunctional food \nChang J, Kwan HS, Wong MC, Chan PL, Xie Y, Ho WCB. Regulation of fungal fruiting body development. PCT Application no. PCT/CN2018/115410, Nov , 2018.\nChang J, Kwan HS, Wong MC, Chan PL, Xie Y, Ho WCB. Regulation of fungal fruiting body development. U.S. Non-Provisional Patent Application No. 16/137,134, Sept, 2018.\n常金辉，谢逸纯。专利申请号：202010645431.9，一种筛选真阳性不出菇的食用菌变异菌株的方法，中国，发明专利\n吴文捷，常金辉。专利申请号：202110432095.4，一种基于介电电泳的芽孢萌发机理研究装置的使用方法及制造方法，中国，发明专利\n吴文捷，常金辉, 金涌。专利号：ZL202120824249.X，一种基于介电电泳的芽孢萌发机理研究装置，中国，实用新型专利\nXie Y, Chang J, Kwan HS. Carbon metabolism and transcriptome in developmental paths differentiation of a homokaryotic Coprinopsis cinerea strain. Fungal Genetics and Biology. 2020, 143:103432.\nXie Y, Zhong Y, Chang J, Kwan HS. Chromosome-level de novo assembly of Coprinopsis cinerea A43mut B43mut pab1-1# 326 and genetic variant identification of mutants using Nanopore MinION sequencing. Fungal Genetics and Biology, 2020, 146:103485.\nChang J, Chan PL, Cheung MK, Ma KL, Kwan HS. Modified recipe to inhibit GSK-3 for the living fungal biomaterial manufacture. Plos One. 2019, 14(5): e0209812.\nHuang Q, Chang J, Cheung MK, Nong W, Li L, Lee MT, Kwan HS. Human proteins with target sites of multiple post-translational modification types are more prone to be involved in disease. Journal of proteome research. 2014, 13(6):2735-48.\nChang J, Wu WJ. Effect of Deuterium Oxide on Bacillus atrophaeus Spore Germination. Progress in Biochemistry and Biophysics, 2021, 48(10):1196-1203.\nWu WJ,Chang J. Effect of oxygen on the germination and culturability of Bacillus atrophaeus spores. International Microbiology, 2022: 1-11.\nWJ, Chang, J. Inactivation of vegetative cells, germinated spores, and dormant spores of Bacillus atrophaeus by pulsed electric field with fixed energy input. Journal of Food Process Engineering, 2022: e13959.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-chang-jinhui-gail"
 },
 {
  "text": "Dr Chen Sibao \nOur group is interested in drug discovery and development of functional food & dietary supplements from natural resources and Traditional Chinese Medicine. \nDoctor of Philosophy, Peking Union Medical College & Chinese Academy of Medical Science\nDrug Discovery \nFunctional Food \nNatural Products and Traditional Chinese Medicine \nQuality Control of Traditional Chinese Medicine ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-chen-sibao"
 },
 {
  "text": "Dr Zhu Yuyan \nWe are studying the role of functional food components/nutrients in ameliorating lipid metabolism disorders, such as obesity and its associated metabolic syndromes, with the focus on adipose tissue. \nBachelor of Agriculture, Zhejiang University\nDoctor of Philosophy, Purdue University\nEditorial Board Member, Journal of Future Foods.\nReview Editor on the Editorial Board of RNA (specialty section of Frontiers in Genetics and Frontiers in Molecular Biosciences) \nMember of Biophysical Society of China \nScientific consultant, EFIL Bioscience Incorporation (USA)\nFunctional Food \nNutrition \nMetabolic Disorders \nRegulation of Adipose Tissue Expansion and Function \nCholesterol Metabolism \nAdipocyte Development \nYoung Investigator Award (1st place in poster Presentation), 20th diabetes and cardiovascular risk factors - East Meets West Symposium (2018)\nThe Bilsland Dissertation Fellowship, Purdue University, USA (2015-2016)\nPurdue Research Foundation Graduate Fellowship, Purdue University, USA (2014)\nNational Scholarship, Minister of Education, China (2007)\nKee-Hong Kim, Yuyan Zhu. \"Compositions and methods for regulating body weight and metabolic syndromes\" (filled on 2017), Pub. No. WO2018093966, United States Patent & Trademark Office.\nHo Ting Shiu*, Xiaohan Pan*, Qing Liu, KeKao Long, Kenneth King Yip Cheng, Ben Chi-Bun Ko, James Kar-Hei Fang, Yuyan Zhu# (2022) “Dietary exposure to polystyrene nanoplastics impairs fasting-induced lipolysis in adipose tissue from high-fat diet fed mice“. Journal of Hazardous Materials, Volume 440, 15 October 2022, 129698.\nY. Zhu#, Sora Q. Kim, Yuan Zhang, Qing Liu, Kee-Hong Kim# (2021) “Pharmacological inhibition of acyl-coenzyme A: cholesterol acyltransferase alleviates obesity and insulin resistance in diet-induced obese mice by regulating food intake”. Metabolism-Clinical and Experimental, online ahead of print. (DOI: 10.1016/j.metabol.2021.154861) (# corresponding author) \nX Xia, Q Liu, Y. Zhu#, Y Zi# (2020) \"Recent Advances of Triboelectric Nanogenerator Based Applications in Biomedical Systems\". EcoMat, DOI: 10.1002/eom2.12049 (# corresponding author) \nZhu, Y., Chen, C.Y., Li, J., Chen, J.-X., Jang, M., Kim, K.-H. (2018) \"In vitro exploration of ACAT contributions to lipid droplet formation during adipogenesis\". Journal of Lipid Research 59(5):820-829.\nKim, C.Y.*, Zhu, Y.*, Buhman, K.K., Kim, K.-H. (2015) \"Dietary selenate attenuates adiposity and improves insulin sensitivity in high-fat diet-induced obese mice\". Journal of Functional Foods 17:33-42. (* co-first author) ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-zhu-yuyan"
 },
 {
  "text": "Dr Dong Xiaoli \nMy research interests include Pathogenic mechanism studies of age-related diseases including Parkinson's disease and osteoporosis, Novel therapy (Food-based therapies) development for treatment of neurodegenerative disease and bone disease and Functional food development for mental and bone health \nBachelor of Medicine, Jining Medical College\nMaster of Medicine, Qingdao University Medical College\nDoctor of Philosophy, The Hong Kong Polytechnic University\nParkinson’s disease \nOsteoporosis \nFood-based therapies \nFunctional foods \n黄家兴，董晓莉，陆家谦，张兆滔。一种纳米硒水溶胶及其制备方法与应用。专利申请号：201911215358.5\n黄文秀，董晓莉，曹思思，王奕。齐敦果酸和熊果酸在制备调节维生素D3代谢酶活性的药物中的应用。中国专利，已授权 专利号：ZL 2017 1 1061004.0\n黄文秀，姚新生，邱佐成，董晓莉，戴毅。异戊烯基二氢黄酮类化合物在防治骨疾病领域的应用 中国专利，已授权 专利号：ZL 2016 1 0102211.5\n李小花，董晓莉，赵清，张焕。三萜类化合物在制备治疗帕金森药物中的应用。中国专利，已授权 专利号：ZL 2015 1 0673284.5\nLiu X, Du ZR, Wang X, Luk KH, Chan CH, Cao X, Zhao Q, Zhao F, Wong WT, Wong KH*, Dong XL*. Colonic dopaminergic neurons changed reversely with those in the midbrain via gut microbiota-mediated autophagy in a chronic Parkinson's disease mice model. Frontiers in Aging Neuroscience, 2021, 13: 649627\nDong XL, Wang X, Liu F, Liu X, Du ZR, Li RW, Hu XC, Wong KH, Wong WT, Zhao Q, Tang QJ*. Polymannuronic acid prevents dopaminergic neuronal loss via brain-gut-microbiota axis in Parkinson's disease model. International Journal of Biological Macromolecules, 2020, 164: 994-1005\nDong XL, Yu WX, Li CM, He S, Zhou LP, Poon CW, Wong MS*. Danshen (Salvia miltiorrhiza) protects ovariectomized rats fed with high-saturated fat-sucrose diet from bone loss. Osteoporosis International, 2018, 29(1):223-235\nCao S, Dong XL, Ho MX, Yu WX, Wong KC, Yao XS, Wong MS*. Oleanolic acid exerts osteoprotective effects and modulates vitamin D metabolism. Nutrients, 2018, 10 (2): 247\nDong XL, Zhang JX, Zhou ZL, Ye ZN, Chen JH, Yuan JF, Cao FJ, Wang XB, Liu WC, Yu WX, Li XH*. Maslinic acid promotes autophagy by disrupting the interaction between Bcl2 and Beclin1 in rat phenochromocytoma PC12 cells. Oncotarget, 2017, 8(43):74527-74538\nYu WX, Lin CQ, Zhao Q, Lin XJ*, Dong XL*. Neuroprotection against hydrogen peroxide-induced toxicity by Dictyophora echinovolvata polysaccharide via inhibiting the mitochondria-dependent apoptotic pathway. Biomedicine & Pharmacotherapy, 2017, 88, 569-573\nZhao Q, Ye JL, Wei N, Fong CC, Dong XL*. Protection against MPP+-induced neurotoxicity in SH-SY5Y cells by tormentic acid via the activation of PI3-K/Akt/GSK3β pathway. Neurochemistry International, 2016, 97: 117-123\nDong XL, Li CM, Cao SS, Zhou LP, Wong MS*. A high saturated fat, high sucrose diet aggravates bone loss in ovariectomized female rats. Journal of Nutrition, 2016, 146(6): 1172-1179\nQiu ZC, Dong XL, Dai Y, Xiao GK, Wang XL, Wong KC, Wong MS*, Yao XS*. Discovery of a new class of cathepsin K inhibitors in Rhizoma Drynariae as potential candidates for the treatment of osteoporosis. International Journal of Molecular Sciences, 2016, 17, 2116\nDong XL, Zhang Y, Wong MS*. Estrogen deficiency-induced Ca balance impairment is associated with decrease in expression of epithelial Ca transport proteins in aged female rats. Life Sciences, 2014, 96(1-2): 26-32",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-dong-xiaoli"
 },
 {
  "text": "Dr Cheng Wai-yin, Nano \nDr Cheng’s research interests are in the areas of chrononutrition, immunology and neuroscience. She focuses on developing novel dietary strategies for treating neuroinflammation, chronodisruption (e.g. shift-work/ jet lag) and its related diseases; as well as studying the underlying mechanisms involved. \nBachelor of Science in Food Safety and Technology, The Hong Kong Polytechnic University\nMaster of Philosophy, The Chinese University of Hong Kong\nPostdoctoral researcher, KU Leuven\nReviewer for different SCI journals, including International Journal of Biological Macromolecules and The Journal of Nutritional Biochemistry\nMember, Society for Neuroscience\nMember, Alzheimer's Association International Society to Advance Alzheimer's Research and Treatment\nRegistered European Commission Expert\nYoung GI Associate, United European Gastroenterology\nOrganizing Committee, Yen Kwo Yung Lecture in Life Sciences (2019)\nAcademic exchange, University of Cambridge (2016)\nCircadian clocks \nSystemic inflammation \nNeuroinflammation \nFunctional foods \nPrebiotics \nBeta-glucan \nGut microbiota \nPostdoctoral Fellowship (2022-2023), KU Leuven\nHui Pun Hing Memorial Postgraduate Fellowship, University Postgraduate Fellowship (2019-2022), The University of Hong Kong\nUniversity Postgraduate Scholarship (2019-2022)\nResearch Postgraduate Student Grants for Overseas Academic Activities, The Chinese University of Hong Kong (2018)\nHKSAR Government Scholarship (2016-2017)\nReaching Out Award, HKSAR Government Scholarship Fund (2014)\nDr. Ng Tat-lun Memorial Scholarship (2016-2017)\nLi Po Chun Charitable Trust Fund Scholarship (2015-2016)\nDean’s Honours List (2014-2017), The Hong Kong Polytechnic University\nLee Kam Kee Food Innovation Competition Merit award (2015)\nSubject Prize for Outstanding Performance in Analytical Chemistry (2014-2015), The Hong Kong Polytechnic University\nCheng, W. Y., Ho, Y. S., & Chang, R. C. C. The role of PKR as a potential pharmaceutical target for treating neuroinflammation, tau phosphorylation and cognitive dysfunctions in a peripheral inflammation model. (Unpublished manuscript)\nCheng, W. Y., Ho, Y. S., & Chang, R. C. C. (2022). Linking circadian rhythms to microbiome-gut-brain axis in aging-associated neurodegenerative diseases. Ageing Research Reviews, 78, 101620. (Impact factor: 11.788, Q1) \nWong, W. K., Lai, C. H. N., Cheng, W. Y., Tung, L. H., Chang, R. C. C., & Leung, F. K. C. (2022). Polymer–Metal Composite Healthcare Materials: From Nano to Device Scale. Journal of Composites Science, 6(8), 218. (Impact score: 3.486, Q2) \nCheng, W. Y., Lam, K. L., Li, X., Kong, A. P. S., & Cheung, P. C. K. (2021). Circadian disruption-induced metabolic syndrome in mice is ameliorated by oat β-glucan mediated by gut microbiota. Carbohydrate Polymers, 267, 118216. (Impact factor: 10.723, Q1) \nCheng, W. Y., Lam, K. L., Kong, A. P. S., & Cheung, P. C. K. (2020). Prebiotic supplementation (beta-glucan and inulin) attenuates circadian misalignment induced by shifted light-dark cycle in mice by modulating circadian gene expression. Food Research International, 137, 109437. (Impact factor: 7.425, Q1) \nLam, K. L., Cheng, W. Y., Su, Y., Li, X., Wu, X., Wong, K. H., ... & Cheung, P. C. K. (2020). Use of random forest analysis to quantify the importance of the structural characteristics of beta-glucans for prebiotic development. Food Hydrocolloids, 108, 106001. (Impact factor: 11.504, Q1) \nLam, K. L., Cheng, W. Y., Yang, F., Lin, S., You, L., Chiou, J., ... & Cheung, P. C. K. (2020). Framework as a Service, FaaS: Personalized Prebiotic Development for Infants with the Elements of Time and Parametric Modelling of In Vitro Fermentation. Microorganisms, 8(5), 623. (Impact factor: 4.926, Q2) \nLam, K. L., Ko, K. C., Li, X., Ke, X., Cheng, W. Y., Chen, T., ... & Cheung, P. C. K. (2019). In Vitro Infant Faecal Fermentation of Low Viscosity Barley β-Glucan and Its Acid Hydrolyzed Derivatives: Evaluation of Their Potential as Novel Prebiotics. Molecules, 24(5), 828. (Impact factor: 4.927, Q2) \nCheng, W. Y., Wei, X. Q., Siu, K. C., Song, A. X., & Wu, J. Y. (2018). Cosmetic and Skincare Benefits of Cultivated Mycelia from the Chinese Caterpillar Mushroom, Ophiocordyceps sinensis (Ascomycetes). International journal of medicinal mushrooms, 20(7), 623-636. (Research article based on final year project; Impact factor: 1.921, Q3)\nLi, X., Zhou, J., Dong, X., Cheng, W. Y., Duan, H., & Cheung, P. C. K. (2018). In Vitro and In Vivo Photothermal Cancer Therapeutic Effects of Gold Nanorods Modified with Mushroom β-Glucan. Journal of agricultural and food chemistry, 66(16), 4091-4098. (Impact factor: 5.895, Q1) ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-cheng-wai-yin-nano"
 },
 {
  "text": "Dr Dong Nai-ping \nMaster of Science, Central South University\nDoctor of Science, Central South University",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-dong-naiping"
 },
 {
  "text": "Dr Kong Hang-kin \nMy research focuses on multi-omics approach to study food related research: (1) Biological mechanism of production of edible bird's nest in swiftlets and the efficacies of edible bird's nest; (2) Biological mechanism of production of paralytic shellfish toxins in harmful algae; (3) Toxicity of chronic exposure to methylmercury \nBachelor of Science in Applied Biology with Biotechnology, The Hong Kong Polytechnic University\nDoctor of Philosophy, The Hong Kong Polytechnic University\nMulti-omics \nBioinformatics \nFood Science \nHarmful Algae \nToxicology \nSirius Pui-Kam Tse, Fred Wang-Fat Lee, Daniel Yun-Lam Mak, Hang-Kin Kong, Kenrick Kai-Yuen Chan, Pak-Yeung Lo, Samuel Chun-Lap Lo, Production of Paralytic Shellfish Toxins (PSTs) in Toxic Alexandrium catenella is Intertwined with Photosynthesis and Energy Production, Toxins (Basel). 2020 Jul 27;12(8):477\nHang-Kin Kong, Chun-Fang Gan, Min Xiong, Kevin Wing-Hin Kwok, Gilbert Chiu-Sing Lui, Ping Li, Hing Man Chan, Samuel Chun-Lap Lo, Chronic Methylmercury Exposure Induces Production of Prostaglandins: Evidence From A Population Study and A Rat Dosing Experiment, Environ Sci Technol. 2019 Jul 2;53(13):7782-7791\nIvan Fan Xia, Jacky St Cheung, Manhui Wu, Kwong-Sen Wong, Hang-Kin Kong, Xiao-Ting Zheng, Ka-Hing Wong, Kevin Wh Kwok, Dietary chitosan-selenium nanoparticle (CTS-SeNP) enhance immunity and disease resistance in zebrafish, Fish Shellfish Immunol. 2019 Apr;87:449-459.\nHang-kin Kong, Ka-hing Wong, Samuel Chun-lap Lo, Identification of peptides released from hot water insoluble fraction of edible bird's nest under simulated gastro-intestinal conditions, Food Research International. 2016 July; 85: 19 – 25\nKong HK, Wong MH, Chan HM and Lo SC, Chronic exposure of adult rats to low doses of methylmercury induced a state of metabolic deficit in the somatosensory cortex. Journal of Proteome Research. 2013 Nov (1); 12(11): 5233 – 45\nHang-Kin Kong and Samuel CL Lo, Proteomic investigation on the mechanism of neurotoxicity in low-dose chronic methylmercury intake. Progress in Nutrition. Vol 13, No 3 (2011), 214 - 216.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-kong-hangkin"
 },
 {
  "text": "Dr Tsoi Bun \nY824-04 \n+852 3400 8714 \nbun.tsoi@polyu.edu.hk \nMy research is mainly related to the pharmacological study of herbal medicine and its active compounds in various neurological diseases, such as stroke and depression, using animal and cellular model. \nMaster of Science, Jinan University\nDoctor of Medicine, Jinan University\nMember of World Federation of Chinese Medicine Societies\nNeuroscience and Neuropharmacology \nPost-stroke therapy \nDepression \nActive compound screening \ntraditional Chinese medicine \nShen J., Chen H., Tsoi B., Wu W., & Li X. Kit combating ischemic stroke and use thereof. WO2019127672A1, CN109954112A\nFirst authorship\nTsoi, B., Chen, X., Gao, C., Wang, S., Yuen, S. C., Yang, D., & Shen, J. “Neuroprotective Effects and Hepatorenal Toxicity of Angong Niuhuang Wan Against Ischemia–Reperfusion Brain Injury in Rats.” Frontiers in pharmacology 10 (2019): 593.\nTsoi, B., Wang, S., Gao, C., Luo, Y., Li, W., Yang, D., Yang, D. & Shen, J. “Realgar and cinnabar are essential components contributing to neuroprotection of Angong Niuhuang Wan with no hepatorenal toxicity in transient ischemic brain injury.” Toxicology and Applied Pharmacology, 337, (2019): 114613.\nTsoi, B., Yi, R. N., Cao, L. F., Li, S. B., Tan, R. R., Chen, M., Li, X. X., Wang, C., Li, Y. F., Kurihara, H. & He, R. R. “Comparing antioxidant capacity of purine alkaloids: A new, efficient trio for screening and discovering potential antioxidants in vitro and in vivo.” Food Chemistry, 176, (2015): 411-419.\nTsoi, B., He, R. R., Yang, D. H., Li, Y. F., Li, X. D., Li, W. X., Abe, K. & Kurihara, H. “Carnosine ameliorates stress-induced glucose metabolism disorder in restrained mice.” Journal of Pharmacological Sciences, 117, (2011): 223-229.\nHe, R. R., Tsoi, B., Lan, F., Yao, N., Yao, X. S., & Kurihara, H. “Antioxidant properties of lutein contribute to the protection against lipopolysaccharide-induced uveitis in mice.” Chinese Medicine 6 (2011): 38. (Co-first author)\nCo-authorship\nDu, Q., Deng, R., Li, W., Zhang, D., Tsoi, B., & Shen, J. “Baoyuan Capsule promotes neurogenesis and neurological functional recovery through improving mitochondrial function and modulating PI3K/Akt signaling pathway.” Phytomedicine, 93, (2021): 153795.\nHe, Y., Chen, S., Tsoi, B., Qi, S., Gu, B., Wang, Z., Peng, C., & Shen, J. “Alpinia oxyphylla Miq. and Its Active Compound P-Coumaric Acid Promote Brain-Derived Neurotrophic Factor Signaling for Inducing Hippocampal Neurogenesis and Improving Post-cerebral Ischemic Spatial Cognitive Functions.” Frontiers in cell and developmental biology 8 (2021): 577790.\nLi, W., Feng, J., Gao, C., Wu, M., Du, Q., Tsoi, B., Wang, Q., Yang, D., & Shen, J. “Nitration of Drp1 provokes mitophagy activation mediating neuronal injury in experimental autoimmune encephalomyelitis.” Free Radical Biology and Medicine 143 (2019): 70-83.\nTan, R. R., Li, Y. F., Zhang, S. J., Huang, W. S., Tsoi, B., Hu, D., Wan. X., Yang, X. Wang, Q., Kurihara, H., & He, R. R. “Abnormal O-GlcNAcylation of Pax3 Occurring from Hyperglycemia-Induced Neural Tube Defects Is Ameliorated by Carnosine But Not Folic Acid in Chicken Embryos.” Molecular Neurobiology 54 (2017): 281-294.\nDuan, W. J., Li, Y. F., Liu, F. L., Deng, J., Wu, Y. P., Yuan, W. L., Tsoi, B., Chen, J. L., Wang, Q., Cai, S. H., Kurihara, H. & He, R. R.\"A SIRT3/AMPK/autophagy network orchestrates the protective effects of trans-resveratrol in stressed peritoneal macrophages and RAW 264.7 macrophages.\" Free Radical Biology and Medicine 95 (2016): 230- 242. IF 7.376",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-tsoi-bun"
 },
 {
  "text": "Dr Wong Wing-yan \nY824-02 \n+852 3400 8884 \nwyan.wong@polyu.edu.hk \nFunctional role of gut microbiota in gastrointestinal cancers and inflammatory bowel disease. Mechanistic study of exosome in gastrointestinal cancers and inflammatory bowel disease. \nDoctor of Philosophy, Hong Kong Baptist University\nReview Editor (Frontiers in Pharmacology)\nThe Chinese Medicine Council of Hong Kong, Department of Health\nGut Microbiota \nCancer \nInflammatory Bowel Diseases \nHerbal Formula \nCompounds, compositions and methods for the preparation of peptide/protein conjugates. Li, X., Tung, C. L., Wong, C. T. T. US9752137B2, CN104877982B\nChu, J. C. H., Chin, M. L., Wong, C. T. T.*, Hui, M.*, Lo, P. C.*, Ng, D. K. P.* One-Pot Synthesis of a Cyclic Antimicrobial Peptide-Conjugated Phthalocyanine for Synergistic Chemo-Photodynamic Killing of Multidrug-Resistant Bacteria. Adv. Therap. 2020, 2000204.\nChu, J. C. H., Yang, C., Fong, W. P., Wong, C. T. T.*, Ng, D. K. P.* Facile One-Pot Synthesis of Cyclic Peptide-Conjugated Photosensitiser For Targeted Photodynamic Therapy. Chem. Commun. 2020, 55, 11941.\nWong, C. T. T.*, Chu J. C. H., Ha, S. Y. Y., Wong, R. C. H., Dai, G., Kwong, T. T., Wong, C. H., Ng, D. K. P.* Phthalaldehyde-Amine Capture Reaction For Bioconjugation and Immobilization of Phthalocyanines. Org. Lett. 2020, 22, 7098.\nZhang, Y., Zhang, Q., Wong, C. T. T., Li, X. Chemoselective Peptide Cyclization and Biocyclization Directly on Unprotected Peptides. J. Am. Chem. Soc. 2019, 141.12274.\nLee, C. L., Liu, H. Wong, C. T. T., Chow, H. Y. and Li, X. Enabling N-to-C Ser/Thr Ligation for Convergent Protein Synthesis via Combining Chemical Ligation Approaches. J. Am. Chem. Soc. 2016, 138, 10477-10484.\nTung, C. L., Wong, C. T. T., Fung, E. Y. M. and Li, X. Traceless and Chemoselective Amine Bioconjugation via Phthalimidine Formation in Native Protein Modification. Org. Lett. 2016, 18, 2600-2603.\nWong, C. T. T., Lam, H. Y., Song, T., Chen, G. and Li, X. Synthesis of Constrained Head-to- Tail Cyclic Tetrapeptides by Imine-Induced Ring-Closing/Contraction Strategy. Angew. Chem. Int. Ed. 2013, 52, 10212-10215.\nLam, H. Y., Zhang, Y., Liu, H., Xu, J., Wong, C. T. T., Xu, C. and Li, X. Total Synthesis of Daptomycin by Cyclization via a Chemoselective Serine Ligation. J. Am. Chem. Soc. 2013, 135, 6272-6279.\nWong. C. T. T., Rowlands, D. K., Wong, C. H., Lo, T. W. C., Nguyen, G. K. T., Li, H, Y., Tam, J. P. Orally Active Peptidic Bradykinin B1 Receptor Antagonists Engineered from a Cyclotide Scaffold for Inflammatory Pain Treatment. Angew. Chem. Int. Ed. 2012, 51, 5620",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-wong-wingyan"
 },
 {
  "text": "Dr Zhang Huan \n(1) Drug R&D from TCM for Treating Neurodegenerative Diseases and Nonalcoholic Fatty Liver\n(2) Molecular/cellular Mechanisms of Neurodegenerative Diseases and Nonalcoholic Fatty Liver \nBachelor of Science in Clinical Traditional Chinese Medicine, Henan University of Traditional Chinese Medicine\nMaster of Science in Chinese Medicinal Sciences, University of Macau\nMaster of Medicine, Guangzhou University of Traditional Chinese Medicine\nDoctor of Philosophy, The Hong Kong Polytechnic University, Hong Kong\nRegistered Chinese Medicine Practitioner in Hong Kong \nTraditional Chinese Medicine \nNonalcoholic Fatty Liver \nNeurodegenerative Diseases \nParkinson’s disease \nChan, S. W.; Lam, K.H; Zhang H; Ng, Y. F. Quinoline dimer as well as preparation method and application thereof. Shen Zhen Research Institute, The Hong Kong Polytechnic University. CN 109535075B. Granted Date: 08/07/2020 \n2Li X.H.; Dong X. H.; Zhao Q.; Zhang H. Application of triterpene compound and Parkinson's disease treatment medicine. Shen Zhen Research Institute, The Hong Kong Polytechnic University. CN106581006, Granted Date:29/11/2019 \nXu S*. Zhang, H.*, Cheng S.H., Chen., X.P. (2021). Cannabidiol promotes fin regeneration and reduces apoptosis in zebrafish embryos. Journal of functional foods. (Under revision). * The authors contributed equally to this work. \nXu S. Zhang, H., Pao P. C. , Lee Audrey., Wang, J., Chan Yu Suen., Chan, S.W., Cheng S.H., Chen., X.P. (2020) Exposure to phthalates impaired neurodevelopment through estrogenic effects and induced DNA damage in neurons. Aquatic Toxicology 222 (2020) 105469 \nZhang, H., Zhou, X., Wong, M. H. Y., Man, K. Y., Pin, W. K., Yeung, J. H. K., Kwan,Y. W., Leung, G. P. H., Ho, P. M., Lee, S. M. Y., Chan, C. O., Mok, D. K. W., Yu, P. H. F., and Chan, S. W. (2017) Sichuan pepper attenuates H2O2-induced apoptosis via antioxidant activity and up-regulating heme oxygenase-1 gene expression in primary rat hepatocytes. Journal of Food Biochemistry e12403, 1-10 \nZhang, H., Wu, M. Y., Guo, D. J., Wan, C. W., and Chan, S. W. (2017) Gui‐ling‐gao inhibits Concanavalin A‐induced inflammation by suppressing the expressions of iNOS and proinflammatory cytokines in mice isolated splenocytes. Journal of Food Biochemistry, 1-7 \nSham, T. T., Li, M. H., Chan, C. O., Zhang, H., Chan, S. W., and Mok, D. K. W. (2017) Cholesterol-lowering effects of piceatannol, a stilbene from wine, using untargeted metabolomics. Journal of Functional Foods 28, 127-137 \nLi, J. J., Zhou, S. Y., Zhang, H., Lam, K. H., Lee, S. M. Y., Yu, P. H. F., and Chan, S. W. (2015) Cortex Fraxini (Qingpi) protects rat pheochromocytoma cells against 6-hydroxydopamine-induced apoptosis. Parkinson’s Disease 2015, 1-10 \nZhang, H., Li, C., Kwok, S. T., Zhang, Q. W., and Chan, S. W. (2013) A review of the pharmacological effects of the dried root of Polygonum cuspidatum (Hu Zhang) and its constituents. Evidence-based complementary and alternative medicine 2013, 208349 \nZhang, H., Wu, M. Y., Guo, D. J., Wan, C. W., Lau, C. C., Chan, C. O., Mok, D. K. W., and Chan, S. W. (2013) Gui-ling-gao (turtle jelly), a traditional Chinese functional food, exerts anti-inflammatory effects by inhibiting iNOS and pro-inflammatory cytokine expressions in splenocytes isolated from BALB/c mice. Journal of Functional Foods 5, 625-632 \nZhang H, Qing-Wen Zhang , Lei Wang, Xiao-Qi Zhang, Wen-Cai Yecd and Yi-Tao Wang. (2012) Two new anthraquinone malonylglucosides from Polygonum cuspidatum. Natural Product Research.26(14):1323-7 \nZhang H, Mak SH, Cui W, Li WM, Han RW, Hu SQ, Ye MZ, Pi RB, Han YF. (2011) Tacrine(2)-ferulic acid, a novel multifunctional dimer, attenuates 6-hydroxyldopamine-induced apoptosis in PC12 cells by activating Akt pathway. Neurochemistry International. 59(7):981-8. ",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-zhang-huan"
 },
 {
  "text": "Dr Poon Chui-wa, Christina \nThe focus of my research area is to study the use and underlying mechanisms of Chinese herbal medicine and the active ingredients for improving musculoskeletal health and the management of aging-related diseases. \nBachelor of Science, The University of Leeds\nMaster of Philosophy, The Chinese University of Hong Kong\nChinese herbal medicine \nOsteoporosis \nSarcopenia \nBone and mineral metabolism \nAging-related diseases \nLi WX, Qin XH,Poon CCW, Wong MS, Feng R, Wang J, Lin FH, Sun YL, Liu SF, Wang YJ and Zhang Y(2021). Vitamin D/Vitamin D Receptor Signaling Attenuates Skeletal Muscle Atrophy by Suppressing Renin-Angiotensin System. Journal of Bone and Mineral Research. doi: 10.1002/jbmr.4441.\nZhou L, Poon CCW*, Wong KY, Cao S, Dong X, Zhang Y and Wong MS (2021). Icariin ameliorates estrogen-deficiency induced bone loss by enhancing IGF-I signaling via its crosstalk with non-genomic ERα signaling. Phytomedicine. 82:153413.doi: 10.1016/j.phymed.2020.153413.\nZhou L, Poon CCW*, Wong KY, Cao S, Yu W, Dong X, Lee WY, Zhang Y and Wong MS (2019). Prenylflavonoid Icariin Induces Estrogen Response Element-Independent Estrogenic Responses in a Tissue-Selective Manner. Journal of the Endocrine Society. 4(2):bvz025. doi: 10.1210/jendso/bvz025.\nWong MS, Poon CCW, Zhou LP and Xiao HH (2019). Natural Products as Potential Bone Therapies. Handbook of experimental pharmacology. doi: 10.1007/164_2019_322.\nHo MX, Poon CCW*, Wong KC, Qiu ZC and Wong MS (2018). Icariin, but Not Genistein, Exerts Osteogenic and Anti-apoptotic Effects in Osteoblastic Cells by Selective Activation of Non-genomic ERα Signaling. Frontiers in Pharmacology. 9:474. doi: 10.3389/fphar.2018.00474.\nPoon CCW, Li RWS, Seto SW, Kong SK, Ho HP, Hoi MP, Lee SMY, Ngai SM,Chan SW, Leung GPH and Kwan YW (2015). In vitro vitamin K2 and 1α,25-dihydroxyvitamin D3 combination enhances osteoblasts anabolism of diabetic mice. European Journal of Pharmacology. 2015; 767: 30-40. doi: 10.1016/j.ejphar.2015.09.048.\nPoon CCW, Seto SW, Au ALS, Zhang Q, Li RWS, Lee WYW, Leung GPH, Kong SK, Yeung JHK, Ngai SM, Ho HP, Lee SMY, Chan SW and Kwan YW (2010). Mitochondrial monoamine oxidase A-mediated hydrogen peroxide generation enhances 5-hydroxytryptamine-induced contraction of rat basilar artery. British Journal of Pharmacology. 161:1086-1098. doi: 10.1111/j.1476-5381.2010.00941.x.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-poon-chuiwa-christina"
 },
 {
  "text": "Dr Woh Pei-yee, Peggy \nMy research focuses on the food microbiology to study the role of microorganisms in foods, through characterization of bacterial phenotypes and genotypes such as antibiotic resistance for the control of food quality and safety to safeguard human health. \nFood microbiology \nFood safety \nAntibiotic resistance \nFood microbiome \nEurasia-Pacific Uninet Ernst Mach Grant, Austria (2022)\nOne Health Fellowship Award, 6th World One Health Congress, Scotland (2020)\nReaching Out Award, HKSAR Government Scholarship Fund (2020)\nGlobal Scholarship for Research Excellence, CUHK-UC Berkeley (2020)\n10th University Scholar Leadership Symposium, Kuala Lumpur, Malaysia (2019)\n9th University Scholar Leadership Symposium, Bangkok, Thailand (2018)\nPostgraduate Fellowship Scheme, University of Malaya (2014)\nPostgraduate Research Fund, University of Malaya (2014)\nWoh PY, Yeung MPS, Goggins WB III, Lo N, Wong KT, Chow V, Chau KY, Fung K, Chen Z, Ip M. (2021). Genomic epidemiology of multidrug-resistant nontyphoidal Salmonella in young children hospitalized for gastroenteritis. Microbiology Spectrum. doi: 10.1128/Spectrum.00248-21. PMID: 34346743.\nWoh PY, Yeung MPS, Nelson EAS, Goggins WB. (2021) Risk factors of non-typhoidal Salmonella gastroenteritis in hospitalised young children: a case-control study. BMJ Paediatrics Open.5:e000898.\nWoh PY, Thong KL, Behnke JM, Lewis WL and Mohd Zain SN. (2017). Characterization of nontyphoidal Salmonella isolates from asymptomatic migrant food handlers in Peninsular Malaysia. Journal of Food Protection. 80(8), 1378-1383.\nWoh PY, Thong KL, Lim YAL, Behnke JM. Lewis WL and Mohd Zain SN. (2017). Microorganisms as an indicator of hygiene status among migrant food handlers in Peninsular Malaysia. Asia Pacific Journal of Public Health. 29(7), 599-607.\nWoh PY, Thong KL, Benhke JM, Lewis JW and Mohd Zain SN. (2016). Evaluation of basic knowledge on food safety and food handling practice amongst migrant food handlers in Peninsular Malaysia. Food Control,70,64-73.\nMohd Zain SN, Farah Haziqah MT, Woh PY, Fazly Ann Z, Vickneshwaran M, Mohd Khalid MKN, Arutchelvan R and Suresh K. (2017). Morphology and molecular detection of Blastocystis in wildlife from Tioman island, Malaysia. Tropical Biomedicine, 34(1), 249-255.\nSahimin N, Alias SN, Woh PY, Edah MA and Mohd Zain SN. (2014). Comparison between uantitative Buffy Coat (QBC) and Giemsa-stained Thin Film (GTF) technique for blood protozoa infections in wild rats. Tropical Biomedicine, 31(3), 422-431.\nBenacer D, Woh PY, Mohd Zain SN, Amran F and Thong KL. (2013). Pathogenic and saprophytic Leptospira species in water and soils from selected urban sites in Peninsular Malaysia. Journal of Microbes and Environments, 28(1), 135-140.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-woh-pei-yee-peggy"
 },
 {
  "text": "Introduction\nFAQs\nA1: Yes, preferred subjects will be given the highest weighting, while other subjects will be given appropriate weightings depending on their relevance to the scheme.\nPreferred subjects included:\nEnglish Language\nMathematics\nBiology\nChemistry\nCombined Science: Biology + Chemistry \nCombined Science: Biology + Physics\nCombined Science: Physics + Chemistry\nA2: There is no compulsory subject requirement for our scheme, and no penalty will be imposed for amittees who have not studied the science subjects. However, they may need to take additional relevant underpinning subjects after admission so as to get the necessary foundation knowledge. \nA3: The best 5 HKDSE subjects (after subject weightings have been applied) will be taken into account and converted to admission score point.\nA4: Applicants may be invited to attend an admission interview when necessary. You will be notified of the interview arrangements by email once shortlisted. \nA5: Students will be asked to rank their major choices after the second semester, and are expected to have chosen a specific major programme by the end of the third semester. \nA6: Interviews may be arranged when necessary. The decision to admit a student to a major will be made by the department based on the student’s choice, overall GPA of year one study, and/or interview result.\nA7: Students may apply to their programme leader for change of programme, such applications will be considered on individual merits and case-by-case basis. \nA8: We offer over 50 exchange and overseas/ local summer internship opportunities at renowned institutions, government bureaus and relevant industries each year. The Department will call for applications annually and any full-time undergraduate students fulfilling the minimum requirements on CGPA and English language may apply. ",
  "url": "https://www.polyu.edu.hk/fsn/study/undergraduate-programmes/bachelor-of-science-honours-scheme-in-biotechnology-food-safety--and-chemical-technology/faqs"
 },
 {
  "text": "Dr Lai Wing-fu \nFood materials science is a field of study related to the development, characterization, processing and engineering of materials for food applications. Dr. Lai’s research lies in this field, and focuses on the design and engineering of functional polymeric materials for bioactive agent encapsulation, food packaging, and food product development. \nMaterials engineering \nfood packaging \nfood microencapsulation \nfood product development \nbioactive agent delivery \nsustained release \nLai, W. F., & Wong, W. T. (2022). Edible clusteroluminogenic films obtained from starch of different botanical origins for both food packaging and real-time quality management of packaged frozen foods. Membranes, 12(4), 437.\nLai, W. F., & Wong, W. T. (2021). Property-tuneable gelatine-based microgels fabricated by using flow-focusing microfluidic geometry for bioactive agent delivery. Pharmaceutics, 13(6), 787.\nLai, W. F., Wong, E., & Wong, W. T. (2020). Multilayered composite-coated ionically crosslinked food-grade hydrogel beads generated from algal alginate for controlled and sustained release of bioactive compounds. RSC Advances, 10, 44522 - 44532. \nHu, C. S., Wong, W. T., Wu, R. Y., Lai, W. F. (2020). Biochemistry and use of soybean isoflavones in functional food development. Critical Reviews in Food Science and Nutrition, 60(12), 2098-2112.\nLai, W. F., Hu, C. S., Deng, G. X., Lui, K. H., Wang, X., Tsoi, T. H., Wang, S. X., Wong, W. T. (2019). A biocompatible and easy-to-make polyelectrolyte dressing with tunable drug delivery properties for wound care. International Journal of Pharmaceutics, 566, 101-110.",
  "url": "https://www.polyu.edu.hk/fsn/people/academic-staff/dr-lai-wingfu"
 },
 {
  "text": "Over the past decades, Dept. ABCT has established a Bachelor programme on food safety and technology, which is the only programme related to Food Safety in Hong Kong. It has produced graduates of bright scholars and outstanding community leaders and members. To celebrate its 10th anniversary, Dept. ABCT would like to invite all FST alumni, current and former faculty members and industrial partners to attend the Homecoming Dinner on 19 Oct 2018 at Hotel ICON. We hope that this homecoming dinner could establish close ties within graduates and build up a long-term relationship among alumni and the University. \nDate: 19 Oct 2018 (Friday)\nTime: 8pm – 11:30pm (7:30pm registration)\nVenue: Silverbox Ballroom, Hotel ICON, 17 Science Museum Road, Tsim Sha Tsui East, Kowloon\n(Western Buffet, free flow beverages, spirits and wine will be served)\nRemarks: Babies that are less than 2 years old are free. Otherwise, full fare should be applied .\nFull House! Thank you very much for your support! For any inquiries, please contact our organizing committee via fst10th@polyu.edu.hk\nRegistration Fee\nAccompany persons Early Bird Registration Period\n(Now to 15 July 2018) 15 July to 30 Sept 2018 \nFST Alumni\tOne FST alumni + maximum one friend / relative\tHK$349\n\tHK$449\nIf you are ABCT alumnus, please sign up to be ABCTAA members! $100 for live-long membership!\t\nABCT Alumni Association members \tOne FST alumni + maximum one friend / relative\tHK$349\tHK$349\nPlease fill in the online form below. After verification, we will soon send you the payment link.\nEarly-bird Group Purchase (5 persons or above) \tThree FST alumni + maximum two friend / relative (if there are more than six people, at least half of the group are FST alumni)\t$299\nPlease fill in the online form below. After verification, we will soon send you the payment link.\tN.A.\t\nBuffet Menu",
  "url": "https://www.polyu.edu.hk/fsn/experience-and-opportunities/alumni/activities/fst-10th-anniversary-homecoming-dinner"
 },
 {
  "text": "Six Key Research Areas\nFSTRC actively promotes the research and development of food safety and technology in six key areas, namely 1) testing and certification, 2) risk analysis and toxicology, 3) functional food development, 4) innovative technology development, 5) nutrition and public health and 6) education and professional development. Combining the findings and solid scientific research experience of its team, FSTRC has developed various innovative food technologies to address the issue. It also aims to raise public awareness of food safety through education programs, information sharing and related risk analytical research.\nProjects\nFood Hygiene Standard Certification System (FHSCS) for local catering industry\nDr. Kahing Wong / Dr. Ka-sing Leung\nDevelopment of rapid detection tools, bionsensors and chemosensors for the application on environmental surveillance, biomedical diagnosis and food testing\nA highly selective FRET-based fluorescent probe for rapid detection of food contaminants (Dr. Mankin Wong) \nFRET-based rapid detection technique for formaldehyde\nHigh specificity and stability; not affected by food color; Relatively low cost\nFunded by 2011年對外科技合作專項-廣州市科技和資訊化局\nSuitable for on-site food safety testing and front line quality control\nCollaborated with GDCIQ\nChinese patent file no.: 201410409453.X\nRisk-benefit Analysis of Fish Commonly Consumed in Southern Part of China (Prof. Samuel Chun-lap Lo / Dr. Ka-sing Leung / Dr. Kevin Kwok)\nPart of an national project, and in collaboration with GDCDC & China National Center for Food Safety Risk Assessment\nTo construct a national database on methyl-mercury & polyunsaturated fatty acids of fish commonly consumed in China\nPolyU-UMD Joint Food Safety Training Programme (JIFSAN)\nEstablishment of A Mass Spectral Database for Rapid Authentication of Edible Oils Using MALDI-MS (Dr. Zhongping Yao)\nEstablish a MALDI-MS spectral database of edible oils\nDetermine the authenticity of an edible oil sample within 5 min based on a unique MALDI-MS spectral pattern\nFunded by ITF-ITSP (Tier 3); Innovation & Technology Commission\nCollaborated with Nestlé R&D (China) Ltd.\nCFS funded consultancy project: Developing guidelines on good practice of using frying oil in Hong Kong\nImproving Meat Quality of Cultured Giant Grouper (Dr. Kevin Kwok)\nInvestigate the effects of algae supplement (fish feed) on meat quality (hardness & gumminess, DHA, collagen) in cultured giant grouper\nFunded by ITF-ITSP (Tier 2); Innovation and Technology Commission\nCollaborated with Aquaculture Technologies Asia (R&D) Ltd.\nSuga Research Laboratory for Sustainable Urban Green Agriculture (Dr. Kahing Wong)\nDevelop the next generation Urban Agriculture model (e.g. precision hydroponics)\nInvestigate the relationship between major environmental factors (e.g. temperature) and hydroponic vegetables (e.g. growth rate)\nSystematically determine and compare the food safety risk in vegetables originated from hydroponics and traditional farming in terms of harmful chemicals (e.g. heavy metals) and foodborne pathogens (e.g. E. coli)\nDevelop high-efficient, eco-friendly and standardized recycling/upcycling technologies for by-products generated in hydroponics\nIndustrial donation: Suga International Holdings Ltd.\nStudy in Early Nutrition (Prof. Man-sau Wong)\n1. Establish the first nutrient database on breast milk from local lactating women\nSupported by local breastfeeding associations\nTo characterize the eating patterns of local mothers\nTo investigate the nutritional composition, including trace elements & fatty acid profile\nTo examine the impact of local dietary characteristics on nutritional composition of human milk\n2. Effectiveness of a community based early nutrition program on promoting breastfeeding and optimizing infant growth and diet quality (NCT03493594)\nTo evaluate the effects of postpartum nutrition program on\nSuccess of breastfeeding by comparing the average duration of breastfeeding between intervention group and control group (primary outcome)\nDiet quality of the infants and mothers (secondary outcome)\nStudy on Gut Microbiota in Hong Kong Populations (Prof. Man-Sau Wong / Dr. Amber Chiou)\nEstablish the first nutrient database on breast milk from local lactating women\nTo establish the first gut microbiota database from both breastmilk-fed & infant formula-fed infants in Hong Kong\nTo set up a research platform for determining gut microbiota in Hong Kong infants (breast-milk Vs infant formula)\nTo study if early establishment of the gut microbiome is influenced by breastfeeding and/or traditional infant formula fed in vaginal-delivered infants\nFunded by HMRF\nOrganize short courses and workshops for general citizens\n5-day HACCP workshop (upon request)\nRegular seminars and symposia\nInternational Food Safety Symposia",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre/research"
 },
 {
  "text": "Research \nResearch Centres \nFood Safety and Technology Research Centre \nChemical Imaging and Rapid Toxins Detection \nDr Ka-hing Wong \nExecutive Director\nAssociate Professor of Department of Food Science and Nutrition\nFood Authentication and Funtional Food Development \nInternal Advisory Board\nDr Ka-sing Leung \nInternal Advisory Board\nVisiting Associate Professor of Department of Applied Biology & Chemical Technology\nFood Policy and Regulations; Risk Assessment and Food Toxicology \nProf. Man-sau Wong \nInternal Advisory Board\nAssociate Dean of Faculty of Applied Science and Textiles\nFunctional Food Development; Nutrition and Public Health \nProf. Man-kin Wong \nInternal Advisory Board\nAssoc. Dean(FS), Interim Head(FSN) & Professor(FSN)\nMethod Development for Rapid Detection of Food Hazards \nProf. Laurie Hing-man Chan\nVisiting Chair Professor of Department of Applied Biology & Chemical Technology\nToxicology, Environmental health and Nutrition \nAssociate Directors\nFood Authentication; Risk Assessment and Food Toxicology \nProbiotics; Functional Food Development \nCore Members\nRisk Assessment and Food Toxicology \nFood Authentication \nMass Spectrometry \nMarine biology; Environmental Toxicology \nProf. Jian-yong Wu \nCore Member\nResearch Professor of Department of Food Science and Nutrition\nProf. Mo Yang \nCore Member\nAssociate Head (Research) and Professor of Department of Biomedical Engineering\n2D nanomaterials based nanoprobe for multi-modality imaging; Nanoprobes for theranostics; Nanbiosensor \nVirology; Vaccine Development \nDr Chunyi Wen \nCore Member\nAssistant Professor of Department of Biomedical Engineering\nCellular Senescence and Skeletal Aging; Precision Medicine for Skeletal Ageing; Data-driven Community-based Bone & Joint… \nProf. Zijian Zheng \nCore Member\nProfessor of Department of Applied Biology & Chemical Technology\nPolymer Science; Nanoscience and Nanotechnology; Surface Chemistry; Organic Electronics; Materials Science and… \nDr Joanne Yip \nAssociate Dean (Industrial Partnership) of School of Fashion and Textiles\nNew materials (spacer fabric, EAP, IPMC) and technology (Liquefaction, Electrospinning); Surface treatments on textiles (plasma and… \nProf. Terence Lok-ting Lau\nMicrobiology \nInternational Advisory Board\nProf. John D. FLOROS\nInternational Advisory Board\nPresident, New Mexico State University\nProf. John W. ERDMAN\nInternational Advisory Board\nProfessor Emeritus, Food Science and Human Nutrition, University of Illinois\nProf. Lucy SUN HWANG\nInternational Advisory Board\nProfessor Emeritus, Graduate Institute of Food Science and Technology, National Taiwan University\nMr. Sheng-li LIU\nFormer Director, Shenzhen Entry–exit Inspection and Quarantine (CIQ)\nProf. Yong-ning WU\nChief Scientist, China International Center for Food Safety Risk Assessment\nProf. Eric JOHNSON\nProfessor, Department of Bacteriology and Food Research Institute, University of Wisconsin-Madison\nAdministrative Staff",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre/people"
 },
 {
  "text": "Research \nResearch Centres \nFood Safety and Technology Research Centre \nResearch Platforms \nSuga Research Laboratory for Sustainable Urban Green Agriculture 信佳城市綠色耕種研究實驗室 (SUGA Lab)\nSUGA lab is Hong Kong's first research platform on urban agriculture. With the use of innovative technologies, the laboratory aims to develop the next generation of urban agriculture model in cultivating high quality and safe fruits and vegetables in a small indoor space. Research will be conducted to explore the optimal correlation between environmental factors and the growth of hydroponics vegetables, as well as the systematical assessment and comparison of food safety risk of harmful chemicals and food-borne bacteria found in vegetables grown from hydroponics and traditional farming.\nResearch Laboratory on Microbiome\nOur microbiome laboratory introduces Hong Kong's first Simulator of Human Intestinal Microbial Ecosystem (SHIME). No similar instruments available in Hong Kong, SHIME is fully automated and controlled by computer. It allows direct comparison of different treatments (microbiota, placebo vs treatment, etc.) and could be designed specifically depending on the type of person (such as baby, adult or elderly). It is an ideal system to test harmful and infectious agents.\nSHIME has its broad applications such as short-term screening for drugs, microbiome analyses, absorption and bioavailability, host response, strain characterization and pathogen-host interaction.\nSensory Evaluation Laboratory 感官評定實驗室\nFirst and sole University-owned Sensory Evaluation Laboratory in Hong Kong, it provides sensory analysis both qualitatively and quantitatively. The lab features individual tasting booths and controlled white/red lighting to cater different scientific and industry standard methods. The lab serves closely with industry and academia partners to design studies, collect data and produce statistical analysis to support R&D, Sales, Marketing and Manufacturing.\nLaboratory for Infant & Child Nutrition 嬰幼兒營養實驗室\nLocated in the Hong Kong Science and Technology Park (HKSTP), the 3,000 sq. ft. laboratory for infant and child nutrition was established in 2013. The lab features GC-FID, GC-MS, HPLC-DAD and ICP-MS systems and allows researchers to examine nutrients, trace metal or heavy metal profile in food and human specimens such as blood and milk. Our research team is studying the nutrition profile of breast milk and the impact of mother's dietary pattern on the nutrition profile for local mothers. Data collected is used for future promotion of breastfeeding.\nFor more details on how your company / organizations can benefit from working with our Centre, please contact:",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre/research-platforms"
 },
 {
  "text": "Avoid food hazards, win the trusts from the consumers \n建立消費者的信心，避免食品危害\nPresence of food safety hazards in food, namely chemical, biological and physical hazards, poses health risks to the consumers. Amongst them, microbiological food safety hazard is the most common culprit for food poisoning cases in catering establishments. Adequate environmental, personal and food process hygiene practices throughout the processes are essential for ensuring food hygiene and safety, from purchasing and receiving of food raw materials and ingredients to serving the food products to the consumer.\n食品安全危害 (大致上分為化學性、生物性及物理性危害) 對健康造成風險，當中微生物食品安全危害所導致的食物中毒最為常見。充足的環境、個人及食品工序等的衛生操作規範，能確保由食材採購及驗收，至把食品端至顧客面前整個流程的食品衛生及安全。\nFollow HACCP principles, with minimal regulations \n用最低資源，同時可跟循危害分析與關鍵控制點 (HACCP) 的原則\nHACCP principles provide a product-based and process-based approach to control food-borne hazards in food production. However, direct application of HACCP principles to a catering establishment is considered not readily practicable due to the large variety of food products. Identification of critical control points of the process of a food product category and establishment of appropriate control measures are then achieved by applying the HACCP principles.\n危害分析與關鍵控制點 (HACCP) 原則提供一個以及生產過程作基礎的操作模式，去控制在食品製作過程中的食源性危害。可是，由於一般餐飲場所需要處理大量不同種類的食材及產品，直接套用HACCP 原則於餐飲場所的管理未必切實可行。因此，此標準應用了HACCP的原則，在某食品類別的工序選定關鍵控制點，並建立合適的控制措施，以達至保障食品衛生目的。\nDemonstrating your responsibility on food safety management in food premises \n展現食品安全管理的責任\nThe future of the catering industry is very important – to environment, to your business and to all of us. \n餐飲業的未來對環境、您的生意以至我們每一位都非常重要。",
  "url": "https://www.polyu.edu.hk/fsn/research/research-centres/food-safety-and-technology-research-centre/fhscs"
 },
 {
  "text": "The 10th International Symposium on Nutritional Aspects of Osteoporosis, which lasted four days, drew to a close on 1st December 2017 at Kerry Hotel, with the participation of over 100 health professionals, researchers from all over the world. \nThe symposium provides a platform for scientists who work in the field of osteoporosis to gather together every three years to discuss their latest research. There were 22 speakers who took part in the 10th symposium. They gave plenary lectures and shared with us their latest findings across many disciplines, including topics about exercise and sedentary behavior, vitamin D, micronutrients: calcium, sodium and potassium, prebiotics, diet patterns and macronutrients and bioactive and functional foods. \nIn addition, the poster section showcased 22 posters on osteoporosis. Dr. Zhou Liping (graduated from Prof. Wong Man Sau's group) and Miss Wong Ka Ying (M.Phil student of Prof. Wong Man Sau) of ABCT Department won the Bess Daeson-Hughes Poster Award with their poster titled \"Icariin, the most abundant flavonoid in Herba Epimedii, exerted osteoprotective effect without uterotrophic activity\". \nLet us take this opportunity to congratulate Dr. Zhou Liping and Miss Wong Ka Ying on receiving the honour. \nLast but not least, we would like to thank Prof. Connie M. Weaver, Prof. Robin M. Daly, Prof. Heike A. Bischoff-Ferrari, Prof. Wong Man Sau, Mr. Gordon Cheung and the Federation of Medical Societies of Hong Kong for organizing this inspiring conference.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/bess-daeson-hughes-poster-award"
 },
 {
  "text": "PolyU has received a generous donation of HK$2 million from Hong Kong Yakult Co. Ltd. (Yakult) to establish the “PolyU-Yakult Joint Research Laboratory for Probiotics and Prebiotics in Human Health”. It promotes interdisciplinary research in the fields of food science and human health, and focus on the cutting-edge research of probiotics and prebiotics for the prevention and treatment of intestinal, brain diseases, eczema and women’s health.\nProbiotics and prebiotics are hot topics in nutrition and their positive effects on human health are being widely discussed these days. Dr William Tai Chi-shing, Executive Director of the Joint Lab, and his team study the therapeutic potential of different probiotics and prebiotics in inflammatory bowel disease with mouse models. Preliminary results show that probiotic therapy can significantly modulate inflammatory responses and help restore impaired intestinal structure. Dr Tai believes that evidence-based research will form a basis to increase awareness and understanding of probiotics and prebiotics amongst the public and contribute to the entire world.\nThe Joint Research Lab is under the newly established PolyU Research Institute for Future Food (RiFood). Dr Wong Ka Hing, Director of RiFood, introduced the Human Intestine Extracorporeal Simulation System (SHIME), an in vitro simulator of the human digestion system which helps to obtain detailed data for developing new approaches in the prevention or treatment of diseases with probiotics.",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/polyu-and-yakult"
 },
 {
  "text": "Mr. Kar-him LUK, PhD student of Dr. Ka-hing WONG, received the Young Investigator Award in the International Conference on Food Factors 2015 (ICoFF2015) held in the Seoul, South Korea, from 22 to 25 November 2015. \nMr. Luk has gained recognitions from the judges with his interactive sharing and outstanding oral presentation entitled \"Enhanced Bone Formation in MC3T3-E1 Preosteoblast Cell Induced by Selenium Nanoparticles Encapsulated by Mushroom Polysaccharide Protein Complex via upregulating BMP-2 expression\", which studies how selenium nanoparticles (SeNPs) can be successfully stabilized with the aid of mushroom polysaccharide-protein complex extracted from Lignosus rhinocerus sclerotia. Mr. Luk said, \"The findings of this study could provide significant insights for the further development of PTR-SeNPs into the functional food on bone health\". \nICoFF started in 1995 and has been held every four years. The conference represents a gathering of world experts in food factors which reduce the risk of lifestyle related diseases. The main theme of ICoFF 2015 is 'Bioconvergence for Food Function', which includes food factors for health promotion and disease prevention, sources of food factors and processing aspects of food factors. \nLet us congratulate Mr. Luk on receiving the award!",
  "url": "https://www.polyu.edu.hk/fsn/news-and-events/news-and-awards/2022/young-investigator-award-in-the-international-conference-on-food-factors-2015"
 }
]