[
 {
  "text": "MM organized Hong Kong Quant Marketing End-of-Spring-Semester Symposium on 17 May 2023 in Y306, PolyU.\nThe event attracted around 70 researchers and students from different universities. We invited Dr Xinyu CAO, Visiting Scholar, The Chinese University of Hong Kong & Assistant Professor, New York University, Dr Qiyuan WANG, Assistant Professor, PolyU and Prof. Lan LUO, Professor, University of Southern California, to be our keynote speakers. \nMORE DETAILS",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/hong-kong-quant-marketing-endofspringsemester-symposium"
 },
 {
  "text": "Overview\nProgramme Structure\nAdmission\nEnquiries\nPublications\nEntrance Year Sept 2023 \nProgramme Code 23090 \nStream Code \nMKF (Full-time)\nMKP (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time)\n2.5 years (Part-time)\nCredits Required for Graduation 31 \nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nProgramme Leaders Programme Director\nDr Zhang Xubing\nBEng, MEng, PhD \nRemarks\nPlease complete all relevant fields and enclose necessary documents.\nIncomplete applications cannot be processed promptly. \nAims and Characteristics\nProgramme Aims\nThis programme enables non-marketing graduates to connect theory with practice in the field of marketing. It covers a range of specialist marketing issues in such areas as online consumer market analysis, managerial issues in marketing, analytical methods for market research and global marketing strategy.\nCharacteristics\nEquips students with sound knowledge and skills in marketing and related areas\nOffers a comprehensive range of marketing electives\nCovers applied marketing and leading-edge marketing practices and issues\nFocuses on finding marketing opportunities and solving marketing problems in Hong Kong and mainland China\nEmpowers students to achieve career potential via professional coaching and career services\nFee (For 2023/24 Intake)\nHK$272,800 per programme (HK$8,800 per credit) for local students\nHK$291,400 per programme (HK$9,400 per credit) for non-local students\nMessages from Alumni \nAs a marketing practitioner, studying the Msc in Marketing Management programme at PolyU was truly an inspiring and thought-provoking journey that contributed a lot in my current job and sharpen my skills in preparing for future challenges in this dynamic market environment. The curriculum is well-structured which covers the essential marketing knowledge from the core subjects with the diversified elective subjects to keep me abreast with the fast changing marketing landscape under the new digital era. The theories that I’ve learned had not only supported me in my day-to-day decision-making and planning, the up-to-date case studies shared by professors had also broadened my horizons and allowed me to put theories into practice through application in my individual assignments, class discussions, and group projects. Collaborating with my fellow students from diverse trade backgrounds for group projects was also valuable as it expanded my personal and trade network. \nHUI Yan Ki, Shannon\n(2021/2022 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/mm"
 },
 {
  "text": "2+3 Integrated Programme 3-Year & 4-Year PhD Programme Programme Structure Research Areas \nProgramme Title \t\n2+3 Integrated Programme Overview (2-year MPhil + 3-year PhD)\t\nProgramme Code\t\n23601- FTM + 23601- FD\t\nMode of Attendance\t\nFull-time\t\nDuration\t\nNormal 2 years and Maximum 3 years for MPhil study\nNormal 3 years and Maximum 5 years for PhD study\n\t\nCredit Requirements for Graduation\t\nStarting from the 2022/23 intake cohort, all research students are required to complete the e-Learning module on “Understanding China and the Hong Kong Special Administrative Region, P.R.C.” in English before thesis submission as a graduation requirement.\nStudents are allowed to take additional subjects in the MPhil study; and they are allowed to apply for transfer of credits which have not been used to contribute to the MPhil degree.\n*3-yr PhD students are allowed to transfer one credit from their previous studies in the ethics subject (HTI6081) and one credit from their previous attendance at seminars.\n#Students who fail the Examination will not be allowed to transit to the PhD study.\n\t\nProgramme Management\t\t\t\nManagement\tProf. Wu LIU \twu.liu@polyu.edu.hk \t\nMarketing\tDr Fang Flora GU\nProf. Yuwei JIANG\tflora.gu@polyu.edu.hk\nyuwei.jiang@polyu.edu.hk\t\nManagement Information Systems \tProf. W.T. Eric NGAI \teric.ngai@polyu.edu.hk\t\n\nProgramme Title \t\nDoctoral of Philosophy in Management/ Doctoral of Philosophy in Marketing/ Doctoral of Philosophy in Management Information Systems\t\nProgramme Code\t\n23601 - FD / 23061 - FTD\t\nMode of Attendance\t\nFull-time\t\nDuration\t\nNormal 4 years / 3 years (for students with Master degree with research components)\nMaximum 6 years / 5 years (for students with Master degree with research components)\n\t\nCredit Requirements for Graduation\t\nA minimum of 18 academic credits, plus 6 - 11 training credits.\nStarting from the 2022/23 intake cohort, all research students are required to complete the e-Learning module on “Understanding China and the Hong Kong Special Administrative Region, P.R.C.” in English before thesis submission as a graduation requirement.\n*3-yr PhD students are allowed to apply to transfer one credit from their previous studies in the ethics subject (HTI6081) and one credit from their previous attendance at seminars.\n#i. Departments can integrate the two elements as long as the Confirmation of Registration is successfully carried out by the end of the first five semesters/terms as required by the University.\n#ii. Students who fail the compulsory PhD Qualification Exam will be required to exit with the MPhil degree (subject to meeting all the relevant MPhil requirements).\nA minimum of 18 academic credits, plus 7 - 12 training credits.\nStarting from the 2022/23 intake cohort, all research students are required to complete the e-Learning module on “Understanding China and the Hong Kong Special Administrative Region, P.R.C.” in English before thesis submission as a graduation requirement.\n#i. Departments can integrate the two elements as long as the Confirmation of Registration is successfully carried out within the first half of the normal study period as required by the University.\nii. Students who fail the compulsory PhD Qualification Exam will be required to exit with the MPhil degree (subject to meeting all the relevant MPhil requirements).\n\t\n\nGeneral University Requirements\nCompulsory Core Subjects\n[6 - 15 Credits]\nSpecialized Subjects\n[3 - 12 Credits]\nResearch Seminar Subjects\n[2/ 3/ 4 Credits]\nEthics Subject\n[1 Credit]\nPracticum Subject\n[2 Credits]\nEnglish Enhancement Subjects\n\t[0 - 5 Credit(s)] \t\nI.\nCompulsory Core Subjects\nMM6001 Research Methodology\nMM6004 Research Methods for Behavioural Research\nAF6003 Econometric Methods\nAF6005 Microeconomic Foundations of Financial Economics\nLGT6006 Statistics and Game Theoretic Methods for Business Analysis and Decisions\nLGT6204 Inventory and Supply Chain Management\nII.\nSpecialized Subjects\nMM613 Research in Organisational Behaviour\nMM633 Research in Strategic Management\nMM674 Research Seminar in Marketing\nMM6121 Meso Organizational Behaviour\nMM6441 Advanced Topics in Information Systems Research\nMM6741 Advanced Topics in Consumer Behavior\nMM6891 Guided Study in Management and Marketing I\nMM6892 Guided Study in Management and Marketing II\nMM6893 Guided Study in Management and Marketing III\nIII.\nResearch Seminar Subjects\nMM6201 Research Seminars I\nMM6202 Research Seminars II\nMM6203 Research Seminars III\nMM6204 Research Seminars IV\nIV.\nEthics Subject\nHTI6081 Ethics: Research, Professional and Personal Perspectives\nV.\nPracticum Subject\nMM6200 University Teaching/ Research Practicum\nVI.\nEnglish Enhancement Subjects\n* You may have more information on this page.\nManagement\nBusiness Ethics\nCorporate Governance and Family Business\nCorporate Social Responsibility\nCross-Cultural Management\nCulture\nDiversity and Inclusion\nDiversity and Inequality\nEmerging Market Strategies\nEmployee Attitudes and Behaviors\nInnovation Management\nJudgment and Decision Making\nLeadership\nOrganisational Justice\nPhilanthropy\nProactive Behaviours\nPublic Sector Management\nSocial Enterprise and Entrepreneurship\nSocial Networks\nStrategic HRM\nStress and Health\nVoice and Citizenship Behaviours\nWork Teams\nWork-Family Conflict\nMarketing\nConsumer Information Processing\nConsumer Judgment and Decision Making\nConsumer Psychology\nDigital Marketing\nInternational Marketing\nMarketing Strategy\nOmni-Channel Management\nPricing and Competitive Strategies\nPro-Social Consumer Behaviour\nQuantitative Marketing Modelling\nRelationship Marketing\nSensory Marketing\nSocial Influence on Consumer Behaviour\nTheoretical Marketing Modelling\nVisual Marketing\nManagement Information Systems\nBlockChain Applications and Digital Assets\nDigital Transformation\nDisinformation and Promotional Information on the Internet\nE-Commerce\nE-Health\nHuman-AI Interaction\nInternet of Things & Smart Service\nIoT and AI Methods and Applications\nIT Governance\nKnowledge Management & Innovation\nLogistics and Supply Chain Management\nM-Commerce\nPlatformization\nSocial Commerce\nSocial Media Analytics & Social Media Marketing",
  "url": "https://www.polyu.edu.hk/mm/study/research-postgraduate-programme"
 },
 {
  "text": "Overview\nProgramme Structure\nAdmission\nEnquiries\nEntrance Year Sept 2023 \nProgramme Code 23090 \nStream Code \nMHF (Full-time)\nMHP (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time)\n2.5 years (Part-time)\nCredits Required for Graduation 31 \nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nProgramme Leaders Programme Director\nDr Annie KO, PhD \nRemarks\nPlease complete all relevant fields and enclose necessary documents.\nIncomplete applications cannot be processed promptly. \nAims and Characteristics\nProgramme Aims\nThis programme combines theoretical knowledge with application of theories to understand and solve organizational issues. It helps students to manage effectively. \nCharacteristics\nA conversion programme for general and HR professionals and managers\nA wide range of people management courses \nEmphasis on both theory and practice\nLocal and global perspectives in private and public sectors\nEmpowers students to achieve career potential via professional coaching and career services\nFee (For 2023/24 Intake)\nHK$272,800 per programme (HK$8,800 per credit) for local students\nHK$291,400 per programme (HK$9,400 per credit) for non-local students\nMessages from Alumni \nThis programme was an excellent opportunity for me to develop specific skills and knowledge to excel as a HR professional. The course contents in this programme equipped me in understanding HR theories, business strategies, practical skills and strategic analysis and also, could help in strengthening my critical thinking skills. Professional educators shared their insights and experiences broadened my horizons and enabled me to manage practical issues at workplace professionally. This well-designed programme led me to have in-depth HR knowledge as the coursework emphasized on practical information and techniques, and the professors gave advisable feedback that enabled me to think deeply and hence, to improve. Fellow students with diverse background shared their workplace involvements through group discussion allowed me to know more approaches in dealing with HR related matters. Overall, it was a fascinating journey that equipped me to lead the strategic deployment of human capital for all sorts of organizations.\nKWONG Hoi Ying, Athena\n(2020/2021 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/hrm"
 },
 {
  "text": "Student Exchange Programme supports the all-round development of students, particularly with greater exposure to different cultures. It offer the good aboard opportunity to develop students’ pioneering visions, become more independent and flexible, make friends with people from different cultures, and improve their language and communication skills by living in a foreign language environment. Exchange students also gain greater first-hand exposure to different education systems and learning environments, and broaden their social networks.\nOutbound exchange places at Institutional level are open for application from full-time PolyU undergraduates. Places at Faculty level are open for application from Faculty students only. \nFor more details of the Faculty Exchange Programme, please visit FB Website.",
  "url": "https://www.polyu.edu.hk/mm/experience/exchange-programme"
 },
 {
  "text": "Student Name Graduation Year Current Placement Thesis Title Dr Jiexian Chloe HUANG 2022 Lecturer, Newcastle University, United Kingdom No Time to Enjoy The Extra! Aging and Consumer Reaction to Volume-based Sales Promotion Dr Fenghao Andrew WANG 2022 Lecturer, Deakin University, Australia The (Dys-)functionality of Within-Team Social Hierarchy: The Role of Power and Status as Hierarchical Bases Dr Meng WANG 2022 Assistant Professor, Shenzhen University, China Three Studies on Interfirm Relationships Under Supplier Encroachment and Online Channel Proliferation Dr Peng LUO 2021 Associate Professor, Sichuan University, China Two Studies on User’s Choice Behavior on Online Platforms Dr Qian WANG 2021 Assistant Professor, University of Macau, Macau, China Three Essays on Organizational Determinants of Data Breach Risk Dr Yijie WANG 2021 Research Assistant Professor, The Hong Kong Polytechnic University, Hong Kong, China How Consumers Make Unilateral decisions in Joint Consumption Dr Yukuan XU 2021 Post Doctoral Fellow, The Hong Kong Polytechnic University, Hong Kong, China Two Studies on Individuals’ Perception on Online Disinformation Dr Yuenlam BAVIK 2020 Senior Lecturer, Deakin University, Australia A Social Projection Perspective to Psychological Contract Overfulfillment and Employee Gratitude Dr Linying Sophie FAN 2019 Assistant Professor, The Hong Kong University of Science and Technology, Hong Kong, China Effects of Resource Scarcity in Consumer Behavior Dr Dongjin Helen HE 2019 Assistant Professor, Lingnan University, Hong Kong, China Effects of Secrecy in Consumer Behavior Dr Marloes HEIJINK 2019 Research Consultant, IG&H Consulting BV, Netherlands Guilt Trips: How Nudity in Advertising Enhances Pro-Social Behaviour Dr Siyu LI 2019 Lecturer, Xi'an Jiaotong University, China Three Studies on Supply Chain Information Sharing and Coordination Dr Zheng LI 2019 Director of Clinical Medicine Division, CN-Healthcare.com, China Doctors in the People’s Republic of China: A Research of Profession and Professionalization Dr Chuding LING 2019 Assistant Professor, Renmin University of China, China An Investigation of the Antecedents and Consequences of Team Members' External Learning: A Bottom-Up Model Dr Fei LIU 2019 Associate Professor, Harbin Engineering University, China Three Studies on Exploring Mobile Health Services in China Dr Xue Rose PANG 2019 Post Doctoral Fellow, The Chinese University of Hong Kong, Hong Kong, China Corporate Social Responsibility Engagement and Disclosure Behaviors in China: A Stakeholder Perspective Dr Jiaqi SONG 2019 Lecturer, University of Liverpool, United Kingdom Is All That Glitters Gold? The Effect of Product Glossiness on Consumer Judgments Dr Tak Way David WONG 2019 Research Assistant Professor, The Hong Kong Polytechnic University, Hong Kong, China The Effects of Supply Chain Innovation, Dynamic Capabilities on Supply Chain Performance in Fashion Industry Dr Pengkun WU 2019 Post Doctoral Fellow, The Hong Kong Polytechnic University, Hong Kong, China Two Essays on Reduction of Fake Reviews Dr Ying Emma XIA 2019 Assistant Researcher, Nanjing University, China Is Paternalistic Leadership Challenge or Hindrance? Congruence Effect and Incongruence Effect of Authoritarianism and Benevolence on Employee Outcomes Dr Shuisheng SHI 2018 Assistant Professor, Hunan University, China The Cross-cultural Generalizability of Paradoxical Leader Behavior Theory Dr Wei SI 2018 Assistant Professor, Tongji University, China Coworker Justice and Its Interaction Effects with Supervisor Justice Dr Jialing Juley XIAO 2018 Teaching Fellow, The Hong Kong Polytechnic University, Hong Kong, China Organizational Cynicism: A Social Information Processing Perspective Dr Yanyan FAN 2017 Research Associate, The Chinese University of Hong Kong, Hong Kong, China Antecedents and Outcomes of CSR Strategies - Three Empirical Studies in China Dr Dalu FANG 2017 Assistant Professor, University of International Business and Economics, China Two Analytical Essays in Distribution Channels Dr Rongwen Tina JIA 2017 Associate Professor, University of International Business and Economics, China Could You Transfer My Voice To The Leader? Antecedents and Consequences of Transit Voice Dr Chun Fong LEI 2017 Research Assistant Professor, The Hong Kong Polytechnic University, Hong Kong, China The Double-Edged Nature of Technostress on Work Performance: A Theoretical Model and Empirical Analysis Dr Xueni Shirley LI 2017 Assistant Professor, Hong Kong Baptist University, Hong Kong, China Service with Emoticons: How Customers Interpret Service Employees’ Use of Emoticons in Online Service Encounters Dr Jing Aaron LI 2017 Assistant Professor, Nanjing University, China Three Studies on Exploring the Effectiveness of e-WOM on Customer Evaluation and Behavior Dr Kan OUYANG 2016 Associate Professor, Shanghai University of Finance and Economics, China Taking Charge as a Double-Edged Sword: Understanding Its Benefits and Costs from a Resource Perspective Dr Yipeng TANG 2016 Associate Professor, Zhongnan University of Economics and Law, China Remove the Mask: A Relational Perspective on the Effects of Authenticity on Work-related Interpersonal Outcomes Dr Ning Nicole LIU 2014 Assistant Professor, City University of Hong Kong, Hong Kong, China Corporate Compliance with Environmental Regulation in China: Style, Commitment, and Proactive Management Dr Chung Kei Dorothy CHAU 2012 APAC Data Protection Officer and Head of Security Assurance, Crypto.com, Singapore IT Governance and Agility: Organizational Information Processing Perspective Dr Hao Kaylee KONG 2012 Assistant Professor, The Hang Seng University of Hong Kong, Hong Kong, China Innovation-oriented Leadership, Contingencies and Outcomes in the Multiple Stages of Innovation Process Dr Ka Fung Catherine LAM 2012 Associate Professor, Wilfrid Laurier University, Canada Interpersonal Relationships, Emotions, and Harming: the Role of Cooperative Goals Dr Hanhua Erica XU 2012 Associate Professor, The Hong Kong Baptist University, Hong Kong, China How Am I Supposed to Live without You: An Investigation of Antecedents and Consequences of Workplace Ostracism Dr Haobin Ben YE 2012 Associate Professor, South China Normal University, China An Integrative Framework of Customers' Perceived Discrimination and Its Impact: An Empirical Study of Tourists in Hong Kong Dr Hui Vivienne ZHANG 2012 Associate Professor, Sun Yat-sen University, China Medical Savings Account Balance and Outpatient Utilization: A Multivariate Analysis on the Impact of the Medical Savings",
  "url": "https://www.polyu.edu.hk/mm/experience/phd-graduates-placement"
 },
 {
  "text": "Skip to main content\nStart main content\nAcademic Advising\nThe Academic Advising System at PolyU “aims to help students make informed and intelligent academic decisions / choices about their study at PolyU that suit their intellectual, professional and personal goals. It is instrumental to promoting student success, and plays a vital role in enhancing students’ overall learning experience at PolyU” (Learning and Teaching Committee Paper LTC/42/A4).\nTo empower students to fulfil the General University Requirements (GUR) and the Discipline Specific Requirements (DSR), PolyU adopts the 2-tier academic advising system: (1) Department-based Academic Advising; and (2) Academic Advising at the institutional level operated by Student Affairs Office (SAO). \n\nStudents on BBA (Hons) in Management and BBA (Hons) in Marketing programmes will be assigned to an Academic Advisor in MM. The primary role of Academic Advisor is to advise students on their Major study and Minor/free elective choices. \nIt is expected that:\nAcademic advisors keep in contact with their student advisees regularly (e.g. via emails or other means), and need to have at least one face-to-face meeting with them, either individually or in small groups, once in each academic year. Additional meetings might be arranged if deemed appropriate. \nAcademic advisors are expected (1) to advise students on their study plans; (2) to review students’ progress in study for early identification of those with special learning needs; (3) to grasp students’ views on learning/teaching issues; and (4) to review students’ overall academic performance and provide counselling to students who have been put on academic probation and/or attempted dishonesties (e.g. cheating in examination, plagiarism, disciplinary issues, etc.).\nEffective academic advising requires an active participation of student advisees in the processes. To enable you to maximize your gain from academic advising, please note your responsibilities in academic advising as follows:\nClarify personal abilities, interests, and goals for academics and life.\nContact and schedule regular appointments with your Departmental Academic Advisor each year as required or when in need of assistance.\nPrepare for advising sessions. Understand and review their academic progress before meeting their Academic Advisor. Study the Programme Requirement Document (PRD).\nBecome knowledgeable and adhere to institutional policies, procedures, and requirements.\nHave an open mind and be ready to consider advice given by teachers, Academic Advisors/ Counsellors and other staff.\nRead your PolyU e-mails and other important communications from the University and your Academic Advisor.\nAccess and use eStudent for academic updates, information updating, registration, and other purposes.\nAccept final responsibility for all decisions made and your graduation requirements.\nAcademic Advisors are expected to:\nHave a clear understanding of:\nstudy pathways;\ndiscipline-specific requirements;\nUniversity policies on undergraduate studies; and\nopportunities and resources within the University.\nCommunicate effectively, listen to the students and respect their views and choices.\nUphold the core values of Academic Advising (e.g. respect, empathy) within PolyU.\nAssist students to identify their academic, career, and personal goals and help them develop plans to achieve these goals.\nAssist students to understand their academic performance and areas of strengths.\nAssist students to understand the graduation requirements and auditing process.\nKeep accurate record about sessions of Academic Advising.\nBe available to answer the questions of students through different means.\nMake appropriate referrals when necessary.\nStrive for excellence in Academic Advising.\n",
  "url": "https://www.polyu.edu.hk/mm/experience/academic-advising"
 },
 {
  "text": "Professional Mentorship Programme \nOverview Be our Mentor Be our Mentee Photo Gallery Enquiry \nWhat are the objectives of Professional Mentorship Programme\nProfessional Mentorship Programme (PMP) aims at offering opportunities for students to grow and build self-esteem through a positive and supportive professional relationship. Students benefit from the PMP where senior executives offer advice and guidance on professional development and career planning. Through the PMP, students are able to: \nacquire social and interpersonal skills\ndevelop their potential, values and aspirations\npursue a professional career\nlive up the employers’ expectations\nrespond constructively to real world challenges\nWhat are the roles of Mentors?\nMentors will serve as advisor, coaches and counsellors by sharing experience with mentees on social and communication techniques, leadership and management skills and advising mentees on issues related to their academic and personal growth and development.\nWho can be mentors?\nAll PolyU alumni and friends, professionals, potential employers of our students and social dignitaries are invited to participate.\nA mentor is suggested to take on average 2 mentees at second or third year bachelor level.\n\nHow can one be a mentor?\nThe Departmental Mentorship Liaison Officer will invite alumni or industrial practitioners to become mentors before commencement of each academic year. Individual mentor will not choose their particular mentees but can indicate preference, if any. The Departmental Mentorship Liaison Officer will be responsible for the mentor-mentee matching. Mentor-mentee re-matching is available on a case-by-case basis.\nIf you wish to serve as a mentor, you are most welcome to contact the following academic colleague in the Department to understand more about the Professional Mentorship Programme:\nDr Annie Ko\nTel: 3400 2124\nEmail: a.an.ko@polyu.edu.hk\nWho can be mentees?\nAll Senior Year 1, Year 2, 3 and Final Year students of the BBA (Hons) in Management and BBA (Hons) in Marketing programme are eligible to join the PMP. \nMentees do not choose their mentor, but they can indicate areas of preference, if any. The Departmental Mentorship Liaison Officer will be responsible for the mentor-mentee matching. Mentor-mentee re-matching is available on a case-by-case basis. The department reserves the right to take a mentee off the program (temporarily or permanently) should undesirable behavior be reported and confirmed, e.g. repeated ignoring the mentor without proper notice/reason.\nIf you have any enquiry regarding the Professional Mentorship Programme, you are welcome to contact us as follows:\nMM Professional Mentorship Coordinator \nDr.Annie KO\nTel:3400 2124\nEmail: a.an.ko@polyu.edu.hk\nEmail: mm.dept@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/mm/experience/professional-mentorship-programme"
 },
 {
  "text": "About Us Activities Roles and Responsibilities of MM Academy Members Enquiry \nThe MM Academy is a programme that professionally develops students of the Department of Management and Marketing at the Hong Kong Polytechnic University as our future leaders.\nThrough a series of targeted workshops conducted by professional trainers, industry guests and academic coaches, the MM Academy programme is designed to enhance students’ all-round competitiveness, academic performance, employability and market value.\nThe MM Academy’s goal is to provide MM students with the essential skills for the academic and business world, pushing individual students’ potential in embarking on their future career.\nActivities and events may include the followings, subject to availability of guests and coaches:\nBusiness Case Competitions\nProfessional Programmes \nMC Training Sessions\nBusiness Etiquette\nMM-tailored CV Workshop\nInterview Skills (Preparation and Presentation)\nPublic Speaking \nDebating\nGuests for Industry Sharing and Other Sharing Sessions\nAs MM members, you are required to provide MM with a self-designed social media post (created with photos and written content) twice within the academic year of membership.\nJoin all workshops and events hosted/co-hosted by the MM Academy.\nExpected to be active MM Student Ambassadors or assistants in sharing sessions and promotional events.",
  "url": "https://www.polyu.edu.hk/mm/experience/mm-academy"
 },
 {
  "text": "Workplace supervisors play a pivotal role in mentoring, training and development our students. Supervisors are encouraged to:\nMonitor student progress and give constructive feedback to students to help them learn\nKeep the Faculty be updated on the student’s progress\nComplete and return a performance evaluation (Employer Evaluation Form) for each student intern. This employer feedback will form part of the basis for the WIE assessment for the student\nProvide a reference letter/ certificate for students who demonstrate good performance\nTypes of Internship\nWIE placement can occur locally in Hong Kong, in Mainland China or internationally.\nLocal Internship\nFull-Time – Summer Term (late May through late August)\nPart-Time – Anytime throughout the year from September to August except students’ examination periods in December and May; approximately 1-2 full days per week\nInternational Internship\nFull-Time – Summer Term (late May through late August)\nCompensation / MPF / Insurance\nCompensation and Minimum Wage Ordinance\nCompensation and/or benefits are granted solely at the discretion of employers. Please note that Statutory Minimum Wage (SMW) does not apply to student interns as well as work experience students during a period of exempt student employment. Also, SMW does not apply to interns/students with no employment relationship with the host organization or company.\nFor more details, please refer to the website of Labour Department.\nMandatory Provident Fund (MPF)\nIf there is an employment relationship between the student and the offering organization for a continuous period of not less than 60 days, the offering organization is required to enrol the student into an MPF scheme.\nFor more details, please refer to the website of Mandatory Provident Fund Scheme Authority.\nInsurance\nThe University has in place a Group Personal Accident Insurance Scheme to cover students taking on placements locally or offshore. For offshore internships, students are encouraged to arrange additional travel insurance and medical protection. \nPRC students who reside and work in Mainland China are NOT covered within the territory of China\nNomination and Selection of Student Interns\nOrganizations complete the FB WIE Partner Organization Registration Form.\nSend the form together with a copy of the Business Registration to wie.job@polyu.edu.hk.\nThe Department will disseminate the job post to the students via email to collect their CVs.\nAfter the application deadline, organizations may invite the potential candidates for an interview upon receipt of the CVs.",
  "url": "https://www.polyu.edu.hk/mm/experience/work-integrated-education"
 },
 {
  "text": "forthcoming Impact of praise cashback strategy: Implications for consumers and e-businesses. Production and Operations Management Society. Wu, P. K., Ngai, Eric W. T., & Wu, Y. Y. forthcoming Augmenting fake content detection in online platforms: A domain adaptive transfer learning via adversarial training approach. Operations Management. Ng, K. C., Ke, P. F., So, M. K. P., & Tam, K. Y. forthcoming Do employees' views matter in corporate governance? The relationship between employee approval and CEO dismissal. Strategic Management Journal. Wang, D., Zhu, Q., Avolio, B. J., Shen, W. & Waldman, D. forthcoming Why and when does CFO ranking in top management team informal hierarchy affect entrepreneurial firm initial public offering fraud? Journal of Management Studies. Zhang, Z., Gong, M., Jia, M., & Zhu, Q. forthcoming When Products Come Alive: Interpersonal Communication Norms Induce Positive Word-of-Mouth for Anthropomorphized Products. Journal of Consumer Research. Chen, F., Sengupta, J., & Zheng, F. forthcoming Hierarchical Team Structures Limit Joint Gain in Interteam Negotiations: The Role of Information Elaboration and Value Claiming Behavior. Academy of Management Journal. Doyle, S. P., Chung, S., Lount, R. B., Jr., Swaab, R. I., & Rathjens, J. 2023 Does Job Satisfaction Rise and Fall with the Economy? Cross-Sectional, Longitudinal, and Experimental Evidence That Job Satisfaction Increases during Recessions. Academy of Management Journal, 66(2), 688-709. Bianchi, E. C., Martin, C. C., & Li, R. 2023 A Dynamic Model of Owner Acceptance in Peer-to-Peer Sharing Markets. Marketing Science, 42(1), 166-188. Yao, D., Tang, C., & Chu, J. 2023 Biting the Hand That Feeds: A Status-Based Model of When and Why Receiving Help Motivates Social Undermining. Journal of Applied Psychology, 108(1), 27-52. Tai, K., Lin, K. J., Lam, C., & Liu, W. 2023 Valuing Spanners: Why Category Nesting and Expertise Matter. Academy of Management Journal, 66(1), 335-365. Cudennec, A., & Durand, R.",
  "url": "https://www.polyu.edu.hk/mm/research/selected-a-papers"
 },
 {
  "text": "Principal Investigator Project Title Area \nDr Feifei HUANG\tA New Way to Tackle Loneliness: Used Products Consumption\tMarketing\t\nDr Xueyong ZHAN\tA Pilot Study on the Processes and Effects of Environmental Impact Assessment\tManagement\t\nDr Fine Fanni Leung\tAntecedents and Consequences of Service Employee Dehumanization\tMarketing\t\nProf. Wai Ting Eric NGAI\tArtificial Intelligent Platform for Sales and Customer Support in the New Era - Apparel Retail Applications\tManagement Information Systems\t\nDr Yi Amy OU\tCEO Humility and Corporate Social Irresponsibility\tManagement\t\nDr Fang Flora GU\tConnecting to Your Partner's Partners? By Passing Strategy in Inhibiting Partner Opportunism\tMarketing\t\nProf. Yuwei JIANG\tConsumer Color Preference under Time Scarcity\tMarketing\t\nProf. Wu LIU\tDigital Transformation of Hong Kong Enterprises in the Greater Bay Area\tManagement\t\nDr Fang Flora GU\tDoes CEO Overconfidence Matter? Effects on Firms' Customer Acquisition and Retention Strategies\tMarketing\t\nDr Yi Amy OU\tDoes Top Managers' Regulatory Focus Affect Corporate Environmental Responsibility Disclosure? Evidence from China\tManagement\t",
  "url": "https://www.polyu.edu.hk/mm/research/on-going-research-projects"
 },
 {
  "text": "Project Start Date Project Manager Project Title Customer Name \n10 Jan, 2022\tProf. Wai Ting Eric NGAI\tVideo Analytics Tool: Preliminary Analysis of Footages\tInnocorn Technology Limited\t\n20 Aug, 2021\tProf. Wai Ting Eric NGAI\tText and Image Analytics Engine for Pet Care\tAI Pet Care Ltd.\t\n1 Aug, 2020\tProf. Wu LIU\tUse of brand licensing strategy to grow business\tAsia Licensing Association Co. Ltd.\t\n17 Jul, 2020\tProf. Wai Ting Eric NGAI\tSocial Media Monitoring and Management System\tK11 Concepts Limited\t\n16 Jan, 2020\tProf. Wai Ting Eric NGAI\tDevelopment of a System and Algorithms of Combining Biometric Identification with AI for Safe Deposit Box Management\tPingan Industrial Co. Limited\t\n30 Jul, 2019\tDr Wing Sing Vincent CHO\tWorkshop on Quantitative Research Methods in Shanghai\tSHERRIFF & ASSOCIATES CO.LTD\t\n12 Jul, 2019\tDr Yuen Wai Ken WONG\tWorkshop on Service Innovations and Sustainable Growth of Beauty Service Firms\tEntrepreneurial Leadership Institute (Shanghai) Consulting Co.Ltd\t\n2 Jul, 2019\tProf. Wai Ting Eric NGAI\tSocial Media Monitoring and Management (SMMM) System (II)\tNew World Development Company Limited\t\n22 May, 2019\tDr Wong Yuen Wai\tUser Experience and Perceptions of Wi-Fi.HK: Brand Health Audit -2019\tBravo Marketing Consultancy Ltd\t\n11 Mar, 2019\tProf. Wai Ting Eric NGAI\tDevelopment of AI-based Auto Safe Deposit Box (AI-ASDB) System\tPingan Industrial Co. Limited\t",
  "url": "https://www.polyu.edu.hk/mm/research/consultancy-projects"
 },
 {
  "text": "Research Centres\nAsian Centre for Branding & Marketing (ACBM), Department of Management and Marketing\nACBM aims to promote professionalism and excellence in the areas such as consumer behavior, digital marketing, social media communication, and B2B marketing. We advocate an integrated approach to the advancement of research, executive training and management consulting. ACBM serves as a knowledge sharing platform which facilitates the exchange of innovative ideas and best practices among marketing professionals, business communities, and academia. With the vision to nurture, inspire and empower ethical leaders, we are committed to developing collaborative networks and making a positive impact in the wider society.\n\t\t\nCentre for Leadership & Innovation (CLI), Department of Management and Marketing\nThe CLI draws on the diverse expertise of the Faculty and the knowledge and experience of the local and international academic and business communities. It adopts an integrated approach to the advancement of research, teaching and consultancy in the areas of entrepreneurship, leadership and strategic management. The centre organizes research activities and provides service to industry. Such activities include seminars, workshops and collaborative projects within and outside the university. Its services include consultancy, management training and executive coaching.\nBehavioural Research Lab, Department of Management and Marketing\nThe Behavioural Research Lab (BRL) is managed by the Department of Management and Marketing and is available for all faculty members, PhD students and research personnel from across the university to conduct leading-edge business related research.\nThe BRL is dedicated to the understanding of human behaviour in markets and organizations. Research conducted in this lab explores some of the most fascinating and complex questions regarding how people understand the world, interact and make decisions.\nThe BRL offers world-class software (Qualtrics, eye tracking software, face reading software, etc.) and a range of services, and includes 20 cubicles, 2 general research rooms, a computer lab, a sound-isolated PC Cube and a meeting room. The space can be adjusted to meet the needs of studies conducted in a controlled environment. Researchers are able to conduct a variety of studies using a broad range of research methods, including computer-based surveys, tasks or games and discussion-based experiments and focus groups in this lab. Participants learn about important social scientific questions and techniques while being compensated for their time.",
  "url": "https://www.polyu.edu.hk/mm/research/research-centres"
 },
 {
  "text": "Head's Message\nWe are living in an exciting era prolific with creative management tools, innovative marketing initiatives, and revolutionary information technologies. Such an era calls for new talents equipped with updated intelligence in these areas. \nThe Department of Management and Marketing at PolyU is dedicated to provide the cutting-edge knowledge and practical skills for our students in three key areas of business – Management, Marketing, and Management Information Systems. We bring together around 50 academic and professional experts from across the globe to providing high-quality education. They possess a comprehensive portfolio of expertise in the main fields of business –organizational behavior, human resource management, consumer behavior, quantitative marketing, strategic management, and international business – and specialized areas such as public-sector management and business analytics. In particular, our management subjects have been ranked Top 5 in the world by Shanghai Ranking’s Global Ranking of Academic Subjects in 2021, and in the Business and Management Studies area we are ranked 52nd by the QS Global Ranking in 2021. Through rigorous teaching and active engagement with the business community, we focus on developing students’ leadership and marketing skills, analytical techniques, team spirit and social responsibility in this new era.\nWe have carefully designed our programmes at both the undergraduate and the graduate levels to create an engaging learning environment. We also have two well-established centers –Center for Leadership & Innovation (CLI) and Asian Center for Branding & Marketing (ACBM) –that produce leading research outputs. We have also built close connections with the local and regional business communities. Students will benefit from these diverse resources and develop their pioneering visions and entrepreneurial thinking. Following our Faculty of Business motto of IDEAS – Innovation-Driven Education and Scholarship, we aim to be a leading think tank and educator in the areas of management and marketing in Asia.\nPlease explore our website for more information about study, research, people, and latest developments at our department.\nProf Wu LIU\nProfessor and Head\nDepartment of Management and Marketing\n\t\t",
  "url": "https://www.polyu.edu.hk/mm/about-mm/heads-message"
 },
 {
  "text": "Vision & Mission\nOur mission is to provide undergraduate and postgraduate business education, and to undertake scholarly work to advance knowledge and improve practice in Management and Marketing. \nWe will strive to: \n• Create highly effective managers and leaders who have the knowledge, skills, and global perspective necessary to work with others to solve problems in an interdependent, culturally diverse, and technologically advanced world. \n• Discover and disseminate new ways of managing and of creating effective managers through research and the development of innovative teaching methods.\n• Engage in partnerships to more directly resolve relevant managerial problems, including consultation and participation in professional and public bodies.\nWe believe that learning and teaching are our core activities, and we are committed to supporting our students in the development of professional competence and in their all-round development. We work closely with the professional community in management and marketing, and aim to meet their need for newly-qualified entrants, continuing professional development, research and consultancy, and service.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/vision-and-mission"
 },
 {
  "text": "Recent Achievements\nStaff Members Honoured with Awards and Fellowships\nAcademic Year 2021/2022\nStaff\tAward/Fellowship Details\t\nProfessor Michael Harris BOND\t\nNumber 1 Psychology Scientists in China, Research.com\nProfessor Yuwei JIANG\t\nTop 50 Most Productive Marketing Scholars in the World, American Marketing Association \nDr Fang Flora GU\t\n2022 Outstanding Reviewer Award, Journal of Marketing\nAcademic Year 2020/2021\nStaff\tAward/Fellowship Details\t\nProfessor Yuwei JIANG\t\n2020 MSI Scholar, Marketing Science Institute\nAcademic Year 2019/2020\nStaff\tAward/Fellowship Details\t\nProfessor Yuwei JIANG\t\nJCR Outstanding Reviewer Award ofJournal of Consumer Research\nAssociate Editor,Journal of Consumer Psychology\nProfessor Wu LIU\t\nAssociate Editor,Management and Organization Review\nProfessor Wai Ting Eric NGAI\t\nAssociate Editor,Information & Management\nAssociate Editor,International Journal of Enterprise Information Systems (IJEIS)\nAssociate Editor,Communications of the Association for Information Systems\nDr Wing Sing Vincent CHO\t\nWRFASE Excellent Paper Award of Institute of Research and Journals (IRAJ)\nAssociate Editor,Information Technology & People\nAssociate Editor,Enterprise Information Systems\nAssociate Editor,International Journal of Engineering Business Management\nDr Robert WRIGHT\t\nAssociate Editor,Journal of Management Education\nAcademic Year 2018/2019\nStaff\tAward/Fellowship Details\t\nProf. Michael Harris BOND\t\nLifetime Achievement Award in the International Network of Personal Meaning 2018\nProfessor Wai Ting Eric NGAI\t\nAssociate Editor,Information & Management\nProfessor Yuwei JIANG\t\nAssociate Editor,Journal of Consumer Psychology\nProfessor Wu LIU\t\nAssociate Editor,Management and Organization Review\nDr Wing Sing Vincent CHO\t\nAssociate Editor,Information Technology & People\nAssociate Editor,Enterprise Information Systems\nAssociate Editor,International Journal of Engineering Business Management\nDr Jia Katrina LIN\t\nBest Reviewer and the OB Track Best Paper in 11th Asia Academy of Management Conference 2019\nHonorable Mention for the 2019 Award for Outstanding Published Article in Positive Organizational Scholarship (POS)\nDr Feng BAI\t\nStudent Publication Prize in The Society of Personality and Social Psychology 2018\nDr Robert WRIGHT\t\nAssociate Editor,Journal of Management Education\nDr Xin XU\t\nAssociate Editor,MIS Quarterly\nAcademic Year 2017/2018\nStaff\nAward/Fellowship Details\nProfessor Wai Ting Eric NGAI\nAppointed Honorary Professor for Lee Shau Kee School of Business and Administration, The Open University of Hong Kong\nAssociate Editor,Information & Management\nAssociate Editor, International Journal of Enterprise Information System\nProfessor Yuwei JIANG\nBest Paper Award, 2017 La Londe International Research Conference in Marketing\nDr Wing Sing Vincent CHO\nAssociate Editor,Information Technology & People\nAssociate Editor,Enterprise Information Systems\nAssociate Editor,International Journal of Engineering Business Management\nDr Fang Flora GU\nEditorial Review Board:Journal of Marketing” and“Editorial Review Board:Journal of the Academy of Marketing Science\nJAMS best reviewers for 2018, Journal of the Academy of Marketing Science (JAMS)\nResearch Associate, China Management Centre, University of Hong Kong\nDr Robert Phillip WRIGHT\nLeads a project entitled “Transforming Internship for Transformative Learning and Reciprocal Knowledge Transfer between University and Workplace”. The project has been selected by the University Grants Committee (UGC) of Hong Kong for 2016-2019 Triennium support under the Funding Scheme for Teaching and Learning Related Proposals.\nDr Xubing ZHANG\nEditorial Review Board,Journal of the Academy of Marketing Science\nDr Bonnie Hayden CHENG\nCentre for Leadership & Innovation (CLI) Research Fellow Award\nTop Paper Award, Academy of Management\nDr Kwok Yee Wing LAM\nTop Paper Award, Academy of Management\nBest Paper Award for International Conference on Economics, Management, and Social Study, Krakόw, Poland, ISERD−International Conference on Economics, Management, and Social Study (ICEMSS)\nAssociate Editor,Journal of Business Research\nDr Jia Katrina LIN\nOutstanding Reviewer Award,Journal of Managerial Psychology\nDr Xin XU\nAssociate Editor,MIS Quarterly\nDr Siok Ngoh Ivy CHEN\nPolyU Distinguished Knowledge Transfer Awards 2017 – Business Excellence Merit Award - Brand management, equity, loyalty and assessment for Chow Tai Fook Jewellery Co. Ltd.\nDr Sung Yan Hazel LEE\nBest Full Paper Award at the British Academy of Management Conference\nDr Yuen Wai Ken WONG\nPolyU Distinguished Knowledge Transfer Awards 2017 – Business Excellence Merit Award - Brand management, equity, loyalty and assessment for Chow Tai Fook Jewellery Co. Ltd.\nAcademic Year 2016/2017\nStaff\nAward/Fellowship Details\nProfessor Gerald GORN\nOutstanding Reviewer Award, The Journal of Consumer Research, 2016/2017\nProfessor Namwoon KIM\nJournal of Business-to-Business Marketing Best Article Award,Journal of Business-to-Business Marketing\nProfessor Wai Ting Eric NGAI\nAppointed Honorary Professor for Lee Shau Kee School of Business and Administration, The Open University of Hong Kong\nHighly Commended Paper Award, Industrial Management & Data Systems for the article entitled “Social media models, technologies and applications: an academic review and case study” (Ngai, Moon, Lam, Chin, Tao, 115(5), 2015)\nDr Fang Flora GU\nBest Paper Award, 15thWorld Business Research Conference\nEditorial Review Board:Journal of Marketing” and“Editorial Review Board:Journal of the Academy of Marketing Science\nResearch Associate, China Management Centre, University of Hong Kong\nDr Kwok Yee Wing LAM\nBest Stream Paper Award at the Australian & New Zealand Academy of Management (ANZAM) Conference 2016\nDr Robert Phillip WRIGHT\nInternational Research High Impact Award and his paper “How Useful Are the Strategic Tools We Teach in Business Schools?” published in the Journal of Management Studies, was selected as a winning paper in the prestigious Emerald Citations of Excellence for 2016\nDr Xubing ZHANG\nEditorial Review Board,Journal of the Academy of Marketing Science\nDr Bonnie Hayden CHENG\nBest Paper Award in OB Division, Australia/New Zealand Academy of Management\nDr Wei Vivian GUO\nFaculty Prize Award for Outstanding Performance/Achievement (Teaching), Faculty of Business, The Hong Kong Polytechnic University\nAcademic Year 2015/2016 \nStaff\nAward/Fellowship Details\nProfessor Wai Ting Eric NGAI\nSilver Medal Award for the Project entitled “An Intelligent Condition-based Key Machinery Assets Maintenance Management Platform for the Textile Industry, at the 43rdInternational Exhibition of Inventions of Geneva\nAppointed Honorary Professor for Lee Shau Kee School of Business and Administration, The Open University of Hong Kong\nProfessor Yuwei JIANG\nMSI Young Scholar, Marketing Science Institute\nFaculty Award for Outstanding Performance/ Achievement on Research and Scholarly Activities, Faculty of Business, The Hong Kong Polytechnic University\nFB Fellow, Faculty of Business, The Hong Kong Polytechnic University\nDr Fang Flora GU\nResearch Associate, China Management Centre, University of Hong Kong\nDr Kwok Yee Wing LAM\nBest Paper Award at the Human Capital International Conference, Chongqing, China\nDr Wu LIU\nEmerald Citation of Excellence Winner in 2015\nDr Robert Phillip WRIGHT\nOutstanding Reviewer Award for the Strategizing Activities and Practices Interest Group of the BPS Division of the American Academy of Management, Vancouver, Canada\nDr Feng BAI\nPositive Organizational Scholarship Research Conference Travel Award\nDr Bonnie Hayden CHENG\nOutstanding Reviewer Award from OB Division, Academy of Management\nDr Ting Yan Winslet CHAN\nAcademic Advisor Award, Joint University Outstanding Marketing Award Competition 2015/16",
  "url": "https://www.polyu.edu.hk/mm/about-mm/recent-achivements"
 },
 {
  "text": "Contact Us\nGeneral Enquiries\nPhone : (852) 2766 7374 / 2766 7114 / 2766 7381\nFax : (852) 2765 0611\nEmail: mm.dept@polyu.edu.hk\nWebsite: mm.polyu.edu.hk\nOpening hours\nMondays to Fridays\n9:00am - 1:00pm\n2:00pm - 5:45pm\nSaturdays, Sundays and Public Holidays\nClosed\nAddress\nM801, Li Ka Shing Tower,\nThe Hong Kong Polytechnic University,\nHung Hom, Kowloon, Hong Kong",
  "url": "https://www.polyu.edu.hk/mm/about-mm/contact-us"
 },
 {
  "text": "Home \nAbout MM \nNews and Events \nNews \n1 / 3\nA delegation from Xian Jiantong University visited MM on 20 June 2023.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/a-delegation-from-xian-jiantong-university-visited-mm"
 },
 {
  "text": "Home \nAbout MM \nNews and Events \nNews \n1 / 2\nMM organized a Research Postgraduate Alumni Networking Dinner on 15 June 2023.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/research-postgraduate-alumni-networking-dinner"
 },
 {
  "text": "Departmental Academic Advisor\nProf. Raymond A. FRIEDMAN\t\nBrownlee O. Currey Professor of Management &\nProfessor of Asian Studies\nOwen Graduate School of Management\nVanderbilt University, U.S.A.\nResearch Interests: Negotiation, Conflict Management, Emotions, Chinese Management, and Diversity\t\nProfessors of Practice\nIr Prof. Man Chung Daniel CHENG,BBS, MH,JP\t\nManaging Director\nDunwell Enviro-Tech (Holdings) Ltd.\t\nAreas of Expertise: Green Sustainability and Management\t\nProf. Yat Chiu Buston CHU\t\nExecutive Director\nService Cybernetics Consulting Ltd.\t\nArea of Expertise: Marketiing\t\nProf. Ming Wai Celine HO\t\nHonorary Advisor\nHong Kong Advertisers Association\nArea of Expertise: Marketing\t\nProf. Ki Wai Lianne LAM\t\nCEO and Founder\nHong Kong Sustainable Society\t\nArea of Expertise: Sustainable Development and Human Resource Management\t\nProf. Wai Yuan Leon LAM\t\nSenior Vice President of Asia and Vice President of Strategy for Asia Pacific\nMerit Asia Medical Ltd.\t\nAreas of Expertise: Organizational Behaviour \t\nProf. Terrance Kwok Yin LEUNG\t\nExecutive & Team Coach\nINRI Executive Coaching\t\nArea of Expertise: Coaching and Leadership Culture Development\t\nProf. Joohong Robert PARK\t\nManaging Director\nState Street Bank & Trust, Hong Kong\t\nArea of Expertise: Strategic Management & Behavioral Aspects of Financial Institutions\t\nProf. Yi-keung Dicky SHEK\t\nVice President\nGBA Business School\t\nArea of Expertise: Data Science and Digital Transformation\t\nProf. Chiu Shun Charleston SIN\t\nExecutive Director\nMIT HK Innovation Node\t\nArea of Expertise: Technology Management\t\nProf. Hak Kun Sunny WONG\t\nDirector\nRise Counselling Service Ltd.\nAreas of Expertise: Strategic Marketing \t\nProf. Xianjin Sean XU\t\nAssistant Director\nMainland Development Office, PolyU\nAreas of Expertise: Marketing\t\nProf. Man Chun Royce YUEN,JP\t\nCEO\nMaLogic\nAreas of Expertise: Marketing\t\nAdjunct Professor\nProf. Alex Siu Wah WONG\t\nChairman & Chief Executive Officer\nKing’s Flair International (Holdings) Ltd.\t\nAreas of Expertise: Management Innovation\t",
  "url": "https://www.polyu.edu.hk/mm/people/external-advisors-adjunct-professors"
 },
 {
  "text": "Post Doctoral Fellow\nName / Rank\nPhone\nRoom\nE-mail\nArea\nXiaode JI (Dr)\t\n2766 7117\n\tM1009\txiaode.ji \tManagement \t\nDonglian MA (Dr)\n\t2766 7347\tM1019 \tdonglian.ma \tManagement Information Systems\nLu MENG (Dr)\t3400 3875 \tM910 \tmonroe.meng\tMarketing\t\nWU Banggang (Dr)\t2766 7344\tM910\tbanggang.wu\tMarketing \t\nYuanyuan WU (Dr) \t3400 2120\tM1009\tyuan-yuan-an.wu \tManagement Information Systems \t\nResearch Associate\t\nName / Rank\nPhone\nRoom\nE-mail\nArea\nYat-fan Paul CHAI\t3400 3951\tM505a\tpaul.chai\tManagement Information Systems\t\nSiu-lap Patrick CHAN\n2766 7360\nM504\npatrick.csl\nManagement Information Systems\nAnming Amy LI\n2766 7360\nM504\nam.li\nManagement Information Systems\nAbhishek SHEETAL\t2766 7363\tM1009a\tabhishek.sheetal\tManagement\t\nLi Esther, YAO\t3400 3949 \tM507H \testher.yao \tManagement\t\nResearch Assistant\t\nName / Rank\nPhone\nRoom\nE-mail\nArea\nYat-sing CHOI\t2766 7360\tM504\tstar.choi\tManagement Information Systems\t\nJian DONG \t2766 7347 \tM1019\tian677.dong\tManagement Information Systems \t\nWai Wai Gary HO\t27667160\tM504\twai.wai.ho\tManagement Information Systems\t\nYifan HUANG\t3400 2117 \tGH120A \tyifan.huang \tMarketing \t\nMingyang LIU\t--\tM501G\tming-yang.liu \tMarketing \t\nShun-kwong TSE Samuel\t3400 3951\tM505A\tsk-samuel.tse\tManagement Information Systems \t\nLiangyu WEI \t--\tM501G\tvalerie-liangyu.wei\tManagement \t\nYucheng XIE\t--\tM501G\tohhhh.xie\tMarketing\t\nLianyong XU\t3400 3949\tM507H\tlianyong.xu\tManagement Information Systems\t\nWang Leung Danny YU\t2766 7360\tM504\tdanny.wl.yu\tManagement Information Systems\t\nJesssica ZHANG \t2766 4013\tM507I\tjessica-v.zhang\tManagement\nTongming ZHANG\t2766 4013\tGH120A\ttongming.zhang\tMarketing \t\nYan ZHANG \t3400 3949\tM507H\tyan1994.zhang \tManagement Information Systems \t\nYiyun ZHANG\t2766 4013\tM507I\tyi-yun.zhang\tManagement \t",
  "url": "https://www.polyu.edu.hk/mm/people/research-staff"
 },
 {
  "text": "Programme Overview ",
  "url": "https://www.polyu.edu.hk/mm/study"
 },
 {
  "text": "M829a, M936 \n+852 3400 3954 \nwu.liu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Employee Voice Behavior, Top Management Teams, Leadership, Negotiation, Cross-cultural Management, Conflict Management \nCurriculum Vitae \nM1034 \n+852 3400 3646 \nchinien.chung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Organization Theory, Economic Sociology, Business Groups, Family Firms \nCurriculum Vitae \nM1027 \n+852 2766 7383 \nkai.lim@polyu.edu.hk \nConsulting, Research and Teaching Interests: e-Health, cross-cultural issues related to information systems management, IT-enable innovation, digital transformation, e-commerce, social media, mobile commerce, and human-computer interactions \nCurriculum Vitae \nM931 \n+852 2766 7296 \neric.ngai@polyu.edu.hk \nConsulting, Research and Teaching Interests: E-Commerce, Decision Support Systems, Social Computing, Logistics and Supply Chain Management, Knowledge Management & Innovation, IT Governance, IoT and AI Methods and Applications \nCurriculum Vitae \nM902 \n+852 2766 7342 \nmichael.bond@polyu.edu.hk \nConsulting, Research and Teaching Interests: Personality and Interpersonal Processes in Organizational Life, Organizational Culture, Cross-cultural Management \nM914 \n+852 3400 3948 \nyuwei.jiang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Social Influence on Consumer Behavior, Visual Marketing, Consumption and the Self \nM857 \n+852 2766 7129 \nkrishna.savani@polyu.edu.hk \nConsulting, Research and Teaching Interests: Diversity, inequality, decision making, culture, machine learning \nHHB1702a \n+852 3746 0001 \npeter.yuen@polyu.edu.hk \nConsulting, Research and Teaching Interests: Public Policy Analysis, Health Services Management \nM826 \n+852 2766 4017 \nflora.gu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Marketing Strategy, Interorganizational Relationships, Distribution Channels, Cross-cultural Marketing, Digital Marketing \nM915 \n+852 2766 7135 \nshu-ping.li@polyu.edu.hk \nConsulting, Research and Teaching Interests: Leadership,Corporate Governance,Institutions and Corporate Social Responsibility \nM939 \n+852 2766 4057 \namy-yi.ou@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic leadership, Leader humility, Organizational culture, Women career management \nM906 \n+852 2766 7378 \nrobert.wright@polyu.edu.hk \nConsulting, Research and Teaching Interests: Paradoxical Thinking, Reflective Practice, Boards of Directors, Managerial Cognitions, Strategy-as-Practice, Strategy-as-Paradox, Executive Educatoin \nM921e, M824 \n+852 2766 7065 \nxin.xu@polyu.edu.hk \nConsulting, Research and Teaching Interests: IT Service Management, IT Innovation and Consumers, Human Computer Interaction, Mobile Computing, Social Media and Business Analytics \nM827 \n+852 2766 7143 \ndai-yoda.yao@polyu.edu.hk \nConsulting, Research and Teaching Interests: Development, Application, and Incubation of Statistics, Artificial Intelligence, Neuroscience, and Economics Based Solutions for Business Problems. \nM821 \n+852 3400 3648 \nxueyong.zhan@polyu.edu.hk \nConsulting, Research and Teaching Interests: Public and Nonprofit Management, Public Policy Processes, Environmental Governance, Government and Business, Public Sector Financial Management \nM904 \n+852 2766 4060 \nzhang.xubing@polyu.edu.hk \nConsulting, Research and Teaching Interests: Analytical and Empirical Research in Retailing Practices, Distribution Channels, Internet Marketing, Advertising, Pricing and Competitive Strategies. \nM1021 \n+852 3400 3924 \nfeng.bai@polyu.edu.hk \nConsulting, Research and Teaching Interests: Morality, Virtue, Social Inequality \nM509 \n+852 3400 3613 \ngrace.chae@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behavior, Consumer Socialization and Motivation, Sensory Marketing \nM927 \n+852 3400 3645 \nseunghoo.chung@polyu.edu.hk \nConsulting: Group/Team Composition to Performance Team Negotiations Inter-group Collaboration/Cooperation Meta-Analysis \nM1028 \n+852 2766 7340 \narnaud.cudennec@polyu.edu.hk \nConsulting, Research and Teaching Interests: Organization Theory, Economic Sociology, Social Categories, Expertise, Institutions \nM1011 \n+852 2766 7127 \nkatherine.feng@polyu.edu.hk \nConsulting, Research and Teaching Interests: Social Media & User-Generated Content, Digital Marketing, Business Analytics, IT Innovation and Implementation \nM1020 \n+852 3400 3642 \nfeifei.huang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behavior, Sustainability, Marketing Communications, Emotions and Feelings \nM928 \n+852 2766 7106 \nnicole.kim@polyu.edu.hk \nConsulting, Research and Teaching Interests: Signaling, Consumer Lay Belief, Self-Other Perceptions , Joint Consumption & Social Media \nM1029 \n+852 2766 7110 \njuyoung.lee@polyu.edu.hk \nConsulting, Research and Teaching Interests: Corporate Environmental Practice and Performance, Corporate Social Responsibility, Non-Market Strategies \nM1010 \n+852 3400 3952 \nfine.leung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Marketing Strategy, Customer Relationships, Influencer Marketing, Services Marketing \nM1015 \n+852 2766 7380 \nren-rl.li@polyu.edu.hk \nConsulting, Research and Teaching Interests: Social norms in Organizations, Gender Norms, Conflict, Conflict Management, Cross-cultural Management \nM505D \n+852 3400 3119 \nyijing1.li@polyu.edu.hk \nConsulting, Research and Teaching Interests: Deep Learning and Business Analytics, Social Media Mining, Visual Analytics, Content Marketing, Mechanism Design in Crowd Platforms \nM908 \n+852 2766 7359 \njaegoo.lim@polyu.edu.hk \nConsulting, Research and Teaching Interests: Influence of Institutional Environment, Corporate Political Activity, Corporate Social Responsibility, Firm Reputation, Top Executives \nM930 \n+852 3400 3923 \nkatrina.lin@polyu.edu.hk \nConsulting, Research and Teaching Interests: Helping Behaviours, Social Support, Interpersonal Relationships, Emotions, Work-family Issues \nM841 \n+852 2766 4541 \nfei-albert.liu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Behavioral Analytics, Service Platformization, Crowdfunding, Social Media, Creator Economy \nM842 \n+852 2766 7133 \nmichael.mei@polyu.edu.hk \nConsulting, Research and Teaching Interests: Big Data and Business Analytics, Data Mining, Social Network Analysis, Economics of Information Systems, Mechanism Design in Information Systems \nM840 \n+852 2766 4021 \nkc-boris.ng@polyu.edu.hk \nConsulting, Research and Teaching Interests: Augmented AI, Business Analytics, Fake News, FinTech, Social Media \nPersonal Website \nM935 \n+852 2766 7357 \nqin-yu.wang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Innovation, Entrepreneurship, Knowledge Management, Intellectual Property Management \nM1012 \n+852 2766 7382 \nqiyuan.wang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Online Platforms, Sharing Economy, Online Healthcare \nM1022 \n+852 3400 3925 \nmannok.wong@polyu.edu.hk \nConsulting, Research and Teaching Interests: Pay Communication, Leadership, Interpersonal Processes, Research Methods \nM1013 \n+852 3400 2120 \nbicheng.yang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Incentives, Salesforce Management, Advertising, Pricing \nM1014 \n+852 3400 3921 \nmelody-jun.zhang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Leadership, Employee Proactive Behavior, Group/Team Dynamics, Outputs, Overqualification and HRM-related Issues \nM905 \n+852 2766 7376 \nqi-thomas.zhu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Corporate governance, Strategic leadership, M&A, Innovation \nM1018 \n+852 2766 7366 \nrujiao-helene.cao@polyu.edu.hk \nConsulting, Research and Teaching Interests: Prosocial and Proactive Behavior, Boundary Management, Emotion, Humor \nM934 \n+852 2766 4059 \nchun-fong.lei@polyu.edu.hk \nConsulting: Technostress, Green IT/IS, Blockchain, Shared Economy, IS User Behavior; IoT and AI Methods and Applications \nM501F \n+852 2766 7390 \nyijie-jessie.wang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behaviour and Social Influence \nM1025 \n+852 2766 7339 \ntw-david.wong@polyu.edu.hk \nConsulting, Research and Teaching Interests: Management Information Systems, Supply Chain Innovation \nM508 \n+852 2766 4087 \nConsulting, Research and Teaching Interests: Platform Economy, FinTech, Corporate Social Responsibility, Economics of IT \nM501E \n+852 3400 3949 \njianhua.yu@polyu.edu.hk \nConsulting, Research and Teaching Interests: E-Health, Mobile Technology Design and Usage, AI Application and Management, Digital Commerce \nM938 \n+852 3400 3644 \ndave.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Business Strategies, Chinese Family Business, Online WOM Advertising, Consultancy on Outdoor Advertising, Quality Assurance, Factory Audit,Sales Training on B to B Marketing, Fast Food and Supermarket Management, Product Inspection and Certification via ISO 9000, ISO 14000, SA 8000, TQM, Product Review – Safety and Reliability, Import and Export \nM851 \n+852 2766 7341 \nvincent-kk.leung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Teaching Pedagogy, Strategy, Sports \nM940 \n+852 2766 7394 \npamsy.hui@polyu.edu.hk \nConsulting, Research and Teaching Interests: Responsible Management Education, International Management, Inter-Organizational Relationships \nM933 \n+852 2766 6339 \nvincent.cho@polyu.edu.hk \nConsulting, Research and Teaching Interests: Textual Mining, Technology Adoption, Information Systems Management \nM856 \n+852 2766 7951 \njackie.tam@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behaviour, Service Quality, Research Methods \nM1031 \n+852 3400 3643 \nsimon.ch.chan@polyu.edu.hk \nConsulting, Research and Teaching Interests: Leadership, Organizational Behavior, Human Resource Management \nM1030 \n+852 3400 2122 \nwinslet.ty.chan@polyu.edu.hk \nConsulting, Research and Teaching Interests: Retail Management, Marketing Management, Consumer Behavior, Corporate Social Responsibility Management, Green Service Management \nM1033 \n+852 3400 2124 \na.an.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Corporate Social Responsibility, Business Ethics, Human Resource Management, Experiential Learning \nM1026 \n+852 2766 4061 \nstephen.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic Management, Entrepreneurship \nM1032 \n+852 2766 4058 \nhazelsy.lee@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic Management, Innovation, Social Innovation, Social Enterprises, Social Entrepreneurship \nM912 \n+852 3400 3650 \nchi-hong.leung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Natural Language Processing, IT in Education, E-commerce, Consumer Attitudes \nM1024 \n+852 3400 3950 \npansyhy.li@polyu.edu.hk \nConsulting, Research and Teaching Interests: Entrepreneurship, Business Sustainability, Social Networks, Corporate Social Responsibility and Longitudinal Methodology \nM916 \n+852 2766 7356 \nelvy.pang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Group Effectiveness and Creative Thinking \nM1023 \n+852 2766 7375 \ncong.qi@polyu.edu.hk \nConsulting, Research and Teaching Interests: IT Outsourcing, Social Media, Knowledge Management, Mobile Computing, New Technology adoption, and IS Pedagogy Research \nM913 \n2766 7385 \njuley-j.xiao@polyu.edu.hk \nConsulting, Research and Teaching Interests: Well-being, Justice, Cynicism, Leadership, Pay \nM1017 \n+852 2766 7395 \nw-k-edmond.yeung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Personal and Leadership Development, Active Learning, Blended Learning, Experiential Learning ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff"
 },
 {
  "text": "Departmental Advisory Committee\nAdvisory Committee on Management & Marketing\nThe Departmental Advisory Committee plays an important role as an interface between the Department and industry, commerce, education, Government, the professions, and the community generally. We look to the Advisory Committee to give advice on the scope and nature of our academic programmes, research and other scholarly activities in order to relate these to the needs of Hong Kong. The Advisory Committee also facilitates our collaboration with industry, commerce, the service sectors and the community.\nMembership of the Advisory Committee on Management and Marketing is as follows:",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee"
 },
 {
  "text": "Programme Structure\nTotal Credit Requirements\t120\t\nDiscipline-specific Requirements (DSR)\t90\t\nBBA core subjects (^9 credits: double fulfillment)\n\t57^\t\nSpecialist subjects\n\t33\t\nFree Elective\t9\t\nGeneral University Requirements (GUR)\t30\t\nLanguage and Communication Requirements (LCR)\n(English: 6 credits + Chinese: 3 credits)\n\t9\t\nCluster-Area Requirements (CAR)\n\t12\t\nLeadership and Intra-personal Development (LIPD)\nMM1051 Tango! Managing Self & Leading Others\n\t3\t\nService-Learning (SL)\n\t3\t\nFreshman Seminar\nFB1003, 1- Semester\n\t3\t\nHealthy Lifestyle (non-credit bearing)\n\t0\t\nTraining credits (WIE)\t3\t\nCompulsory Core Subjects for all BBA Awards (19 subjects – 57 credits) \nAF1605\nIntroduction to Economics*\nAF2108\nFinancial Accounting \nAF2110\nManagement Accounting 1\nAF3313\nBusiness Finance\nAF3513\nBusiness Law (for 2021/2022 intake cohort onwards)\nAF3627\nGlobal Economic Environment (for 2021/2022 intake cohort onwards)\nAMA1501\nIntroduction to Statistics for Business \nAPSS111\nIntroduction to Psychology*\nCLC3221P\nChinese Language Communication for Business\nELC3221 \nWorkplace English for Business Students I\nELC3222\nWorkplace English for Business Students II\nLGT2106\nPrinciples of Operations Management*\nMM1051\nTango! Managing Self & Leading Others*\nMM2021\nManagement & Organisation\nMM2711\nIntroduction to Marketing*\nMM3422\nBusiness Information Systems (for 2021/2022 intake cohort onwards)\nMM3425\nBusiness Analytics (for 2021/2022 intake cohort onwards)\nMM4311\nStrategic Management\nMM4513\nCorporate Social Responsibility\n\t\t\n*These subjects can satisfy both DSR and GUR\nBBA (Hons) in Management\nDiscipline-Specialist Compulsory Subjects (7 subjects – 24 credits) \nMM3011\nResearch Methods for Management\nMM3111\nHuman Resource Management\nMM3141\nOrganisational Behaviour\nMM3151\nManagerial Leadership\nMM4342\nGlobal Business Management\nMM4351\nEntrepreneurship\nMM4922 \nManagement Capstone Project (6 credits)\nDiscipline-Specialist Elective Subjects (any 3 subjects – 9 credits) \nAF3508\nEmployment Law\nMM3131\nTraining and Development\nMM3451\nKnowledge Management\nMM4111\nEmployee Relations\nMM4132\nReward & Performance Management\nMM4141\nManaging Diversity in Organisations\nMM4151\nGender and Organisations\nMM4161\nStaffing and Selection\nMM4181\nInternational Human Resource Management\nMM4191 \nBusiness Negotiation\nMM4361\nSocial Innovation: Achieving Sustainable Development Goals through Business\nMM4411\nE-Commerce for Management\nMM4451\nContemporary Issues in Management Information Systems (for 2021/2022 intake cohort onwards)\nMM4501\nEnvironmental Management for Business\nMM4522\nChina Business Management\nBBA (Hons) in Marketing\nDiscipline-Specialist Compulsory Subjects (8 subjects – 27 credits) \nMM3711\nIntegrated Marketing Communications\nMM3721 \nConsumer Behaviour\nMM3761\nMarketing Research\nMM4711\nBusiness to Business Marketing\nMM4732\nGlobal Marketing\nMM4751\nMarketing Strategy\nMM4772\nProduct Management\nMM4942\nMarketing Capstone Project (6 credits)\nDiscipline-Specialist Elective Subjects (any 2 subjects – 6 credits) \nMM3791\nRetailing and Merchandising\nMM3842\nDigital Marketing\nMM3851\nSocial Media Marketing\nMM4721\nMarketing Management in China\nMM4741\nMarket Decision Analysis\nMM4782\nSales and Distribution Management\nMM4791\nServices Marketing\nMM4831\nStrategic Brand Management\nWork-Integrated Education (3 training credits for all BBA awards) \nMM3001\nWork-Integrated Education \nWork-Integrated Education (WIE)\nTo graduate, every BBA student must complete 100 hours (3 training credits) of WIE. The Department offers opportunities for students to work in firms either during the summer vacation or alongside their studies. Summer placements may be available in Hong Kong, in mainland China or overseas. These and other forms of work experience count towards the WIE requirement.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management-and-marketing/programme-structure"
 },
 {
  "text": "Entrance Year September 2023 \nProgramme Code 23492 (JUPAS Code: JS3080) \nMode of Study Full-time \nNormal Duration 4 years \nProgramme Intake 88 \nFund Type Government-Funded \nCredits Required for Graduation 120 (plus 3 training credits) \nProgramme Leaders \nBBA (Hons) in Management Programme Leader\nDr Chan Chi-hong Simon\nBA, MPhil, PhD\nDeputy Programme Leader\nDr Ko Chi-chung, Stephen\nBSocSc(Hons), LLM, MBA, PhD\nBBA (Hons) in Marketing Programme Leader\nDr TAM Lai-ming Jackie\nBSc, MSc, PhD\nDeputy Programme Leader\nDr CHAN Ting Yan Winslet\nBA, PhD\nRemarks\nThe credit requirements of this scheme are indicative only. They are subject to review.\nAll students must complete a short work placement during their studies, either in summer or during the semester. The Department provides assistance in finding suitable placements.\nStudents will be awarded one of the following titles upon successful completion of the graduation requirements of the programme concerned: \nBBA (Hons) in Management\nBBA (Hons) in Marketing\nStudents are subject to further assessment criteria i.e., students’ own choice, GPA and individual subject results at the end of their Year One study.\nThe option of Secondary Major in Artificial Intelligence and Data Analytics is available to the students of BBA (Hons) in Management, and BBA (Hons) in Marketing. Admission to the Secondary Major is on competitive basis and subject to a different credit requirement for graduation.\nAdditional Information:\nFB Outstanding HKDSE Students Entry Scholarship\nAims and Characteristics\nProgramme Aims\nLearning and teaching are our core activities. We are committed to nurturing our students’ professional competence and supporting their all-round development. \nStudents complete some General University Requirements core and fundamental business subjects at an early stage. They then choose one of the following awards as their specialism for graduation. \nCharacteristics of Scheme-based Admission\nStudents first follow a common curriculum under the Scheme.\nIt offers students approximately one year to identify their area(s) of interest and career aspirations, which facilitates their Major programme selection.\nThe decision to admit a student to a Major programme will be made by the Department based on the student’s choice, overall GPA of Year One study, and individual subject results (i.e., MM2021 Management and Organisation and MM2711 Introduction to Marketing). Students will be asked to indicate their choices of Major programme during Semester 2 of their Year One study for the Department’s consideration and approval.\nIn the event of oversubscription for any of the programmes, the number of students admitted to that programme will be capped at 60% of the number of students in the respective years.\nProgramme Flyer for 2023/24 cohort",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management-and-marketing"
 },
 {
  "text": "Introduction\nProgramme Structure\nAdmissions\nProgramme Guide\nEnquiries",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management-and-marketing/admissions"
 },
 {
  "text": "Introduction\nAdmissions\nProgramme Guide\nEnquiries\nProgramme Guide \nProgramme Requirement Document 2022/2023\t\t",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management-and-marketing/programme-guide"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code 02402-MGT/SYM \nMode of Study Full-time \nNormal Duration \n4 years\nFor students admitted to Senior Year Places\n2 years\nProgramme Intake \n13 Senior Year places\nFor students admitted to Senior Year Places\n60-75 (plus 3 training credits)\nThe exact credits required for each AD/HD holder will depend on the approved credits of transfer.\nFund Type Government-Funded \nCredits Required for Graduation 120 (plus 3 training credits) \nProgramme Leaders \nProgramme Leader\nDr Chan Chi-hong Simon\nBA, MPhil, PhD\nDeputy Programme Leader\nDr Ko Chi-chung, Stephen\nBSocSc(Hons), LLM, MBA, PhD\nAims and Characteristics\nManagement is a lively and interesting subject to study. Our programme emphasises developing both academic and professional knowledge and practical skills in general management and human resource management, including communication and presentation, leadership and teamwork, problem solving and the effective use of information technology.\nThe programme offers a wide range of subject choices in the fields of general, strategy and human resource management, such as Business Negotiation, Environmental Management for Business, Gender & Organisations, Management Practice Through Real World Projects, Managing Diversity in Organisations, China Business Management, Employee Relations, Employment Law, HRM in China, International HRM, Reward & Performance Management, Staffing & Selection and Training & Development. Students can choose subjects within the HRM concentration to obtain recognition by professional bodies. \nThere is a strong emphasis on interactive and student-centred learning methods, including case studies, role playing and simulation exercises. Visits to companies and other organisations are arranged, and practitioners are invited as guest speakers to share their practical experience with students.\nAll students within the Faculty of Business are encouraged to participate in the Whole Person Development Programme (WPDP), which includes a range of extracurricular activities, such as leadership training camps, peer tutoring, mentorship and overseas and the Chinese mainland exchanges. Each student is assigned a professional mentor who is an experienced executive or manager in the business world and who provides advice and support and helps students to plan their careers and prepare for their first jobs after graduation.\nSubject to availability, BBA students can spend a semester studying at another university overseas or in the Chinese mainland and have the credits counted towards their PolyU degree.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management"
 },
 {
  "text": "Students in the following undergraduate programmes shall have an opportunity to pursue a Secondary Major in Innovation and Entrepreneurship (IE): \nDepartment\nBlock X programme\nABCT\nBSc(Hons) in Applied Biology with Biotechnology\nAMA\nBSc(Hons) in Data Science and Analytics\nAP\nBSc(Hons) in Physics\nAPSS\nBA(Hons) in Social Policy and Social Entrepreneurship\nBRE\nBSc(Hons) in Property Management\nBEEE\nBEng(Hons) in Building Sciences and Engineering\nBME\nBSc(Hons) in Biomedical Engineering\nISE\nBEng(Hons) in Product Engineering\n(Existing programme title: BEng(Hons) in Product Engineering and Management)\nSD\nBA(Hons) in Design (Advertising Design)\nBA(Hons) in Design (Information Design)\nBA(Hons) in Design (Media Design)\nBA(Hons) in Design (Environmental Design)\nBA(Hons) in Design (Interior Design)\nBA(Hons) in Design (Service Design)\nBA(Hons) in Design (Social Design)\nBA(Hons) in Design (Product Design)\nBA(Hons) in Design (Interaction Design)\nSFT\nBA(Hons) in Fashion and Textiles\nSHTM\nBSc(Hons) in Hotel and Tourism Management\nSO\nBSc(Hons) in Vision Science\n(Existing programme title: BSc(Hons) in Optometry)\nThis Secondary Major curriculum takes a cross-disciplinary approach that aims to instil in students from different disciplines the spirit and mindset of innovation and entrepreneurship, whether it is applied to the commercialisation of technologies specifically or to problem solving in general. Through the cross-disciplinary design, students are equipped with knowledge and techniques critical to the analysing, planning, and implementing of financially-viable and technically-feasible innovation and ventures. Students are provided with hands-on experience in innovative and entrepreneurial activities.\nUpon completion of this Secondary Major, students are expected to be able to:\na) Develop an innovative and entrepreneurial mindset in exploring a business solution\nb) Critically assess business environments, as well as identify opportunities and innovative ideas with the support of professional-specific skills and knowledge\nc) Demonstrate an understanding on the applications and implications of the latest technologies to inform or support entrepreneurship and innovation\nd) Align the resources and interests of different stakeholders in the knowledge transfer process through effective communication\ne) Identify and respond appropriately to ethical issues as they arise in different business settings.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/secondary-major-in-innovation-and-entrepreneurship"
 },
 {
  "text": "Department Department of Management and Marketing \nEntrance Year Sept 2022 \nProgramme Code 23491-YIE \nProgramme Intake 40 (for cohort of students admitted in 2021/22 promoted to Year 2 in 2022/23 academic year)\nCredits Required for Graduation 18 credits (at least 9 credits must be at level 3 or above)\nProgramme Leaders Minor Programme Coordinator\nDr Vincent LEUNG\nDBA, MBA, BBA; Design Thinking Facilitator, MIHRM, MCIM, MIoD, PMgr \nThe Minor programme in Innovation and Entrepreneurship aims at developing students an entrepreneurial mindset, and to equip them with knowledge and skills crucial to the innovation and entrepreneurship process, as well as to effective problem-solving. The Learning Outcomes of this programme are driven directly by the mission of the University and the Faculty of Business and represent a balance between the continuing need for “practicality” in programmes and the pressing need for “whole person development” of students.\nUpon completion of this Minor programme, students are expected to be able to:\nCritically assess business environments, and to provide innovative and effective solutions to capture the opportunities that arise;\nAlign the resources and interests of different stakeholders in the knowledge transfer process through effective communication.\nEntrance Requirements\nAll students admitted to the UGC-funded full time 4-year curriculum undergraduate programmes from 2021/22 with a GPA of 2.5 or above.\nStudents will be invited to opt for the Major/Minor study path normally in mid-October during Semester 1 of their second year of study. Approved students can register their Minor subjects for the following Semester 2 during the subject registration period after release of class timetable normally in December/January. No late application will be considered.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-innovation-and-entrepreneurship"
 },
 {
  "text": "Entrance Year Sept 2021 \nProgramme Code 02402-MKT/SYK \nMode of Study Full-time \nNormal Duration \n4 years\nFor students admitted to Senior Year Places\n2 years\nProgramme Intake 23 Senior Year places \nFund Type Government-Funded \nCredits Required for Graduation \n120 (plus 3 training credits)\nFor students admitted to Senior Year Places\n60-75 (plus 3 training credits)\nThe exact credits required for each AD/HD holder will depend on the approved credits of transfer.\nProgramme Leaders Programme Leader\nDr TAM Lai-ming Jackie\nBSc, MSc, PhD\nDeputy Programme Leader\nDr CHAN Ting Yan Winslet\nBA, PhD\nRemarks\nThis programme is offered within the BBA(Hons) Scheme.\nThe credit requirements of this programme are indicative only. They are subject to review.\nAll BBA(Hons) students must complete a short work placement during their studies, either in summer or during the semester. The Department provides assistance in finding suitable placements.\nProgramme Aims & Learning Outcomes\nThis programme provides students with: \nA well-rounded business education;\nCompetence in the analysis, planning, implementation and control of marketing decisions;\nAnalytical ability and research competence;\nThe ability to communicate, interact and intervene in the integrative role that is ascribed to marketing;\nAppreciation of the responsibilities of marketing professionals within broader environmental and international contexts; and\nLiteracy in the use of information systems and technology relevant to marketing.\nProgramme Characteristics\nThe programme focuses on the development of practical skills and academic and professional knowledge. It places a strong emphasis on interactive and student-centred learning methods, including case studies, role playing and simulation exercises. It offers a wide range of subject choices, including Consumer Behaviour, Integrated Marketing Communications, Social Media Marketing, Marketing Research, Services Marketing, Digital Marketing and Marketing Management in China.\nAll students within the Faculty of Business are encouraged to participate in the Whole Person Development Programme (WPDP), which includes a wide range of extracurricular activities such as leadership training camps, peer tutoring mentorship, and overseas and Chinese mainland exchanges.\nStudents can be assigned mentors, experienced executives or managers in the business world who provide advice and support and help students to plan their careers and prepare for their first jobs after graduation.\nSubject to availability, BBA students can spend a semester studying at another university overseas or in the Chinese mainland and have the credits counted towards their PolyU degree.\nMarketing students are well equipped with both theoretical and practical experience upon graduation. Our students and graduates have a remarkable track record of obtaining awards from open competitions.\nThe Department has also developed opportunities for students to work in firms either during the summer vacation or as part-timers to fulfil 100 hours (3 training credits) of Work-Integrated Education (WIE) requirement. Summer replacements may be found in Hong Kong or the Chinese mainland or overseas. These, and other forms of work experience, can count towards the WIE requirement.\nWork-Integrated Education (WIE) \nTo graduate, every student must complete 100 hours (3 training credits) of WIE. The Department has developed opportunities for students to work in firms either during the summer vacation or as part-timers. Summer placements can be found in Hong Kong, the Chinese mainland or overseas. These and other forms of work experience count towards the WIE requirement.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-marketing"
 },
 {
  "text": "Introduction\nDepartment Department of Management and Marketing \nEntrance Year Sept 2021 \nProgramme Code 02402-YMK \nCredits Required for Graduation 18 credits (at least 9 credits must be at level 3 or above) \nTo equip the students with marketing knowledge and business skills to enable them to solve real-life business problems.\nOn successfully completion of the minor programme, the students will be able to: \nAnalyze business situations/problems and identify/evaluate marketing opportunities as they arise;\nPropose ways for organizations to create value in goods and services and\nFormulate appropriate marketing strategies in local/global markets.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-marketing"
 },
 {
  "text": "Overview\nAdmission\nEntrance Year Sept 2023 \nProgramme Code 23090 \nStream Code \nMAF (Full-time)\nMAP (Part-time)\nMode of Study Mixed Mode \n1.5 years (Full-time)\n2.5 years (Part-time)\nCredits Required for Graduation 31 \nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nProgramme Leaders Programme Director\nDr Xin Xu\nBEcon, MPhil, PhD\nDeputy Programme Director\nDr Vincent Cho \nBSc, MEngSc, PhD\nPlease complete all relevant fields and enclose necessary documents.\nIncomplete applications cannot be processed promptly. \nProgramme Aims\nThis programme starts with the fundamentals of applying analytical techniques on big data for decision supports of an organisation, and progresses to in-depth studies of various application domains.\nCharacteristics\nEmphasises essential skills and knowledge of business analytics\nApplies domains of business analytics\nCovers theoretical knowledge and research findings of decision making using big data\nOffers opportunities to apply theories to investigating and solving business problems\nFocuses on the systematic training and development of skills and competence in business analytics\nEnhances the ability to solve big data problems\nEmpowers students to achieve career potential via professional coaching and career services\nFee (For 2023/24 Intake)\nHK$292,330 per programme (HK$9,430 per credit) for local students\nHK$316,200 per programme (HK$10,200 per credit) for non-local students\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 12 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the fellowship at any time. In case of any dispute/disagreement, PolyU’s decision is final.\nMessages from Alumni \nIn today's business environment, big data and analytics are becoming increasingly important for enterprises of all kinds, marketing is no longer just an art of intuition and inspiration. In addition to storytelling, it is important to use a statistically proven process to find the target audience. The learning journey of the MSc BA demonstrated the power of business analytics methods such as customer profile clustering, Apriori algorithm, behavioural prediction modelling, and more. It expanded my perspective with statistical analysis techniques and provided the specialist skills I need for my career as a business analyst. \nCurrently, I work for an industry-leading company, responsible for developing new models to support business decision-making on initiatives and strategies. I play a key role in improving business efficiency and adding value through data analytics to identify needs and provide data-driven recommendations. I am pleased to be able to contribute valuable insights to my work that leverage the knowledge and skills learned from this programme.\nMOK Wan Yee, Winny\n(2020/21 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/ba"
 },
 {
  "text": "Introduction\nDepartment Department of Management and Marketing \nEntrance Year Sept 2021 \nProgramme Code 02402-YMG \nCredits Required for Graduation 18 credits (at least 9 credits must be at level 3 or above) \nOrganization and management literacy is of increasing importance and relevance. This minor aims to provide non-management majors with the opportunity to equip themselves with basin managerial knowledge and skills.\nOn successfully completion of the minor programme, the students will be able to:\nUnderstand managerial roles and functions, and apply theories to solving organizational problems.\nAnalyze organizational situations, and explain the causes and effects of different scenarios.\nOffer intellectual arguments for discussing contemporary organization and management issues.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-management"
 },
 {
  "text": "The offering of subjects is subject to class quota availability. Students may also choose from a list of \"Common Pool Electives\", subject to the prescriptions of programme curriculum.\nProgramme structure, course names and content are subject to continuous review and change. \n\t* These subjects have been included in the list of reimbursable courses under the Continuing Education Fund with effect from 4 May 2020. The programme (MSc in Business Analytics) is recognised under the Qualifications Framework (QF Level 6).\t\nMode of Study and Duration\nMode of study: Mixed-mode\nStudents can pursue their studies with either a full-time study load (9 credits or more in a semester) or a part-time study load (less than 9 credits in a semester).\nStudents normally complete the programme full-time in 1.5 years or part-time in 2.5 years. Students who wish to extend their studies beyond normal duration can submit such request to the Department of Management and Marketing for consideration, as appropriate.\nThe programme offers a structured progression pattern. Classes are normally scheduled on weekday evenings. Each subject requires 39 contact hours over a teaching semester, with one 3-hour class per week.\nCurrent students can refer to the Programme Requirement Document for more details about the programme.\nProgramme Requirement Document",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/ba/programme"
 },
 {
  "text": "Overview\nAdmission\nEntrance Requirements\nApplicants should have a Bachelor's degree or equivalent academic / professional qualifications, preferably with at least one year of relevant work experience.\nApplicants, normally aged 27 or above, with other post-secondary qualifications and at least 6 years of work experience in industry, commerce or public administration, including 3 years in a managerial capacity, will also be considered.\nIf you are not a native speaker of English, and your Bachelor’s degree or equivalent qualification is awarded by institutions where the medium of instruction is not English, you are expected to fulfil the University’s minimum English language requirement for admission purpose. Please refer to the \"Admissions Requirements\" section for Taught Postgraduate Programmes at Study@PolyU for details.\nShortlisted candidates may be invited to attend admission interviews.\nAdmissions Procedures and Fee\nPlease refer to Study@PolyU website (www.polyu.edu.hk/study) for the application details of individual programmes.\nMessages from Alumni \nIn today's business environment, big data and analytics are becoming increasingly important for enterprises of all kinds, marketing is no longer just an art of intuition and inspiration. In addition to storytelling, it is important to use a statistically proven process to find the target audience. The learning journey of the MSc BA demonstrated the power of business analytics methods such as customer profile clustering, Apriori algorithm, behavioural prediction modelling, and more. It expanded my perspective with statistical analysis techniques and provided the specialist skills I need for my career as a business analyst. \nCurrently, I work for an industry-leading company, responsible for developing new models to support business decision-making on initiatives and strategies. I play a key role in improving business efficiency and adding value through data analytics to identify needs and provide data-driven recommendations. I am pleased to be able to contribute valuable insights to my work that leverage the knowledge and skills learned from this programme.\nMOK Wan Yee, Winny\n(2020/21 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/ba/admissions"
 },
 {
  "text": "Please put at least one valid content allocate to this component.\nEntrance Requirements\nApplicants should have a Bachelor’s degree or equivalent academic / professional qualifications. There is no restriction on their background -- business, engineering, social sciences, natural sciences, humanities, law and others are all acceptable.\nPriority will be given to applicants with relevant work experience.\nIf you are not a native speaker of English, and your Bachelor’s degree or equivalent qualification is awarded by institutions where the medium of instruction is not English, you are expected to fulfil the University’s minimum English language requirement for admission purpose. Please refer to the \"Admissions Requirements\" section for Taught Postgraduate Programmes at Study@PolyU for details.\nShortlisted candidates may be invited to attend admission interviews.\nAdmissions Procedures and Fee\nPlease refer to Study@PolyU website (www.polyu.edu.hk/study) for the application details of individual programmes.",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/mm/admissions"
 },
 {
  "text": "With the knowledge and experience of our academic staff in marketing, Asian Centre for Branding and Marketing (ACBM) aims to promote professionalism and excellence in areas such as consumer behavior, digital marketing, social media communication and B2B marketing. It advocates an integrated approach to the advancement of research, executive training and management consulting. ACBM serves as a knowledge sharing platform which facilitates the exchange of innovative ideas and best practices among marketing professionals, business communities, and academia. \nACBM’s mission is to establish a leading branding and marketing research center in Hong Kong, the Greater Bay Area and the Asia Pacific region and to promote best-in-class practices in the related research disciplines. With the vision to nurture, inspire and empower ethical leaders, it is committed to developing collaborative networks and making a positive impact in the wider society. \nProfessor Wu Liu, Head and Professor, Department of Management and Marketing; Dr Flora Gu, Centre Director and Associate Head of Department and Dr Celine Ho, Centre Assistant Director welcomed six Honorary Advisors to the Advisory Board in the April meeting. The six advisors include Mr Kevin Huang, COO of The South China Morning Post; Mr Terry Iu, Head of Industries Greater China Region of Meta; Ms Dionne Kung, Deputy CEO of Greater Bay Area Homeland Youth Community Foundation; Mr Gabriel Lee, Executive Director & Group General Manager of Hong Kong Ferry (Holdings) Limited; Mr James Tong, Director Public Affairs, John Swire & Sons (HK) Limited; Ms Olivia Wong, General Manager Environmental & Social Responsibility of MTR Corporation Limited.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/asian-centre-for-branding-and-marketing-acbm-welcomes-new-honorary-advisors-to-the-advisory-board"
 },
 {
  "text": "Publications\nProgramme Structure (From 2019/20 Cohort onwards)\nTo qualify for the MSc degree, students must obtain 31 credits as follows:\n4 Compulsory Subjects (3 credits each) \n1 Ethics Subject (1 credit)\n6 Elective Subjects (3 credits each)\nOR\n4 Compulsory Subjects (3 credits each) \n1 Ethics Subject (1 credit) \n2 Elective Subjects (3 credits each) \nthe subject Research Methods (3 credits) and a Dissertation (9 credits)\nStudent may, on completion of 4 Compulsory Subjects and 3 Elective Subjects (21 credits), opt for the Postgraduate Diploma.\nThe Compulsory Subjects comprise strategic and functional marketing modules and are designed to provide students with conceptual and analytical foundations in marketing. The Elective Subjects provide the opportunity for students to learn about applied marketing topics and explore leading-edge marketing practices and issues.\nMM5112 Organization and Management\nMM576 Marketing Management * \nMM5803 Introduction to Customer Value *\nMM587 Consumer Behaviour *\nMM5021 Business Ethics\nNon-Dissertation Option\nMM501 Research Methods \nMM539 International Management \nMM544 E-Commerce \nMM5712 Marketing Management in China\nMM573 Marketing Strategy \nMM578 Services Marketing \nMM582 Business to Business Marketing \nMM584 Sales Management \nMM588 Brand Management \nMM589 Promotion and Advertising \nMM5425 Business Analytics\nMM5451 Technology Innovation and Management\nMM5831 Social Media Marketing\nDissertation Option\nMM501 Research Methods (3 credits) \nMM597 Marketing Management Dissertation (9 credits) \nMM539 International Management\nMM544 E-Commerce \nMM5712 Marketing Management in China\nMM573 Marketing Strategy \nMM578 Services Marketing \nMM582 Business to Business Marketing \nMM584 Sales Management \nMM588 Brand Management \nMM589 Promotion and Advertising \nMM5425 Business Analytics\nMM5451 Technology Innovation and Management\nMM5831 Social Media Marketing\nThe offering of subjects is subject to class quota availability. Students may also choose from a list of \"Common Pool Electives\", subject to the prescriptions of programme curriculum.\nProgramme structure, course names and content are subject to continuous review and change.\n\t* These subjects have been included in the list of reimbursable courses under the Continuing Education Fund. The programme (MSc in Marketing Management) is recognised under the Qualifications Framework (QF Level 6).\t\nMode of Study and Duration\nMode of study: Mixed-mode\nStudents can pursue their studies with either a full-time study load (9 credits or more in a semester) or a part-time study load (less than 9 credits in a semester).\nStudents normally complete the programme full-time in 1.5 years or part-time in 2.5 years. Students who wish to extend their studies beyond normal duration can submit such request to the Department of Management and Marketing for consideration, as appropriate.\nThe programme offers a structured progression pattern. Classes are normally scheduled on weekday evenings in two semesters within an academic year. Each subject requires 39 contact hours over a teaching semester, with one 3-hour class per week.\nCurrent students can refer to the Programme Requirement Document for more details about the programme.\nProgramme Requirement Document\nAs a marketing practitioner, studying the Msc in Marketing Management programme at PolyU was truly an inspiring and thought-provoking journey that contributed a lot in my current job and sharpen my skills in preparing for future challenges in this dynamic market environment. The curriculum is well-structured which covers the essential marketing knowledge from the core subjects with the diversified elective subjects to keep me abreast with the fast changing marketing landscape under the new digital era. The theories that I’ve learned had not only supported me in my day-to-day decision-making and planning, the up-to-date case studies shared by professors had also broadened my horizons and allowed me to put theories into practice through application in my individual assignments, class discussions, and group projects. Collaborating with my fellow students from diverse trade backgrounds for group projects was also valuable as it expanded my personal and trade network. \nHUI Yan Ki, Shannon\n(2021/2022 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/mm/programme"
 },
 {
  "text": "Dr Vincent Cho\nTel: (852) 2766 6339\nE-mail: vincent.cho@polyu.edu.hk \nTel: (852) 2766 7381 / (852) 2766 7952\nE-mail: mm.msc@polyu.edu.hk \nDepartment of Management and Marketing\nM801, Li Ka Shing Tower\nThe Hong Kong Polytechnic University\nHung Hom, Kowloon, Hong Kong\nIn today's business environment, big data and analytics are becoming increasingly important for enterprises of all kinds, marketing is no longer just an art of intuition and inspiration. In addition to storytelling, it is important to use a statistically proven process to find the target audience. The learning journey of the MSc BA demonstrated the power of business analytics methods such as customer profile clustering, Apriori algorithm, behavioural prediction modelling, and more. It expanded my perspective with statistical analysis techniques and provided the specialist skills I need for my career as a business analyst. \nCurrently, I work for an industry-leading company, responsible for developing new models to support business decision-making on initiatives and strategies. I play a key role in improving business efficiency and adding value through data analytics to identify needs and provide data-driven recommendations. I am pleased to be able to contribute valuable insights to my work that leverage the knowledge and skills learned from this programme.\nMOK Wan Yee, Winny\n(2020/21 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/ba/enquiries"
 },
 {
  "text": "Publications\nDr Zhang Xubing\nProgramme Director\nTel: (852) 2766 4060\nE-mail: zhang.xubing@polyu.edu.hk\nTel: (852) 2766 7381 / (852) 2766 7952\nE-mail: mm.msc@polyu.edu.hk \nDepartment of Management and Marketing\nM801, Li Ka Shing Tower\nThe Hong Kong Polytechnic University\nHung Hom, Kowloon, Hong Kong\nAs a marketing practitioner, studying the Msc in Marketing Management programme at PolyU was truly an inspiring and thought-provoking journey that contributed a lot in my current job and sharpen my skills in preparing for future challenges in this dynamic market environment. The curriculum is well-structured which covers the essential marketing knowledge from the core subjects with the diversified elective subjects to keep me abreast with the fast changing marketing landscape under the new digital era. The theories that I’ve learned had not only supported me in my day-to-day decision-making and planning, the up-to-date case studies shared by professors had also broadened my horizons and allowed me to put theories into practice through application in my individual assignments, class discussions, and group projects. Collaborating with my fellow students from diverse trade backgrounds for group projects was also valuable as it expanded my personal and trade network. \nHUI Yan Ki, Shannon\n(2021/2022 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/mm/enquiries"
 },
 {
  "text": "Publications\nDate\tContent\tAuthor\t\n2020\tTo survive or to thrive? China’s luxury hotel restaurants entering O2O food delivery platforms amid the COVID-19 crisis, International Journal of Hospitality Management\tFiona X.Yang, XiangpingLi, Virginia Meng-Chan Lau, Victor Z.Zhu\t\nAs a marketing practitioner, studying the Msc in Marketing Management programme at PolyU was truly an inspiring and thought-provoking journey that contributed a lot in my current job and sharpen my skills in preparing for future challenges in this dynamic market environment. The curriculum is well-structured which covers the essential marketing knowledge from the core subjects with the diversified elective subjects to keep me abreast with the fast changing marketing landscape under the new digital era. The theories that I’ve learned had not only supported me in my day-to-day decision-making and planning, the up-to-date case studies shared by professors had also broadened my horizons and allowed me to put theories into practice through application in my individual assignments, class discussions, and group projects. Collaborating with my fellow students from diverse trade backgrounds for group projects was also valuable as it expanded my personal and trade network. \nHUI Yan Ki, Shannon\n(2021/2022 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/mm/publications"
 },
 {
  "text": "Please put at least one valid content allocate to this component.\nEntrance Requirements\nA Bachelor's degree or equivalent professional qualifications, preferably with at least one year of relevant work experience. \nApplicants, normally aged 27 or above, with other post-secondary qualifications and at least 6 years of work experience in industry, commerce or public administration, including 3 years in a managerial capacity, will also be considered.\nIf you are not a native speaker of English, and your Bachelor's degree or equivalent qualification is awarded by an institution where the medium of instruction is not English, you are expected to fulfil the University's minimum English language requirement for admission purpose. Please refer to the \"Admission Requirements\" section at Study@PolyU for details. \nSuitable candidates may be invited to attend admission interviews.\nAdmissions Procedures and Fee\nPlease refer to Study@PolyU website (www.polyu.edu.hk/study) for the application details of individual programmes.\nThis programme was an excellent opportunity for me to develop specific skills and knowledge to excel as a HR professional. The course contents in this programme equipped me in understanding HR theories, business strategies, practical skills and strategic analysis and also, could help in strengthening my critical thinking skills. Professional educators shared their insights and experiences broadened my horizons and enabled me to manage practical issues at workplace professionally. This well-designed programme led me to have in-depth HR knowledge as the coursework emphasized on practical information and techniques, and the professors gave advisable feedback that enabled me to think deeply and hence, to improve. Fellow students with diverse background shared their workplace involvements through group discussion allowed me to know more approaches in dealing with HR related matters. Overall, it was a fascinating journey that equipped me to lead the strategic deployment of human capital for all sorts of organizations.\nKWONG Hoi Ying, Athena\n(2020/2021 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/hrm/admissions"
 },
 {
  "text": "Dr Annie Ko\nProgramme Director\nTel: (852) 3400 2124\nE-mail: aanko@polyu.edu.hk\nFor admission inquiries, please contact:\nTel: (852) 2766 7381 / (852) 2766 7952\nE-mail: mm.msc@polyu.edu.hk \nM801, Li Ka Shing Tower\nThe Hong Kong Polytechnic University\nHung Hom, Kowloon, Hong Kong\nThis programme was an excellent opportunity for me to develop specific skills and knowledge to excel as a HR professional. The course contents in this programme equipped me in understanding HR theories, business strategies, practical skills and strategic analysis and also, could help in strengthening my critical thinking skills. Professional educators shared their insights and experiences broadened my horizons and enabled me to manage practical issues at workplace professionally. This well-designed programme led me to have in-depth HR knowledge as the coursework emphasized on practical information and techniques, and the professors gave advisable feedback that enabled me to think deeply and hence, to improve. Fellow students with diverse background shared their workplace involvements through group discussion allowed me to know more approaches in dealing with HR related matters. Overall, it was a fascinating journey that equipped me to lead the strategic deployment of human capital for all sorts of organizations.\nKWONG Hoi Ying, Athena\n(2020/2021 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/hrm/enquiries"
 },
 {
  "text": "Programme Details\nTo graduate, students need to complete 31 credits. There are two routes for attaining these 31 credits:\n10 three-credit subjects (4 Compulsory and 6 Elective), plus one-credit Business Ethics;\nOR\n4 Compulsory Subjects and 2 Elective Subjects, plus one-credit Business Ethics, three-credit Research Methods, and nine-credit Dissertation\nStudents may graduate with a Postgraduate Diploma upon completing 4 Compulsory Subjects and 3 Elective Subjects (21 credits), or with a Postgraduate Certificate upon completing Compulsory Subjects (12 credits).\nFrom 2022/23 Cohort onwards \nMM514 Human Resource Management *\nMM515 Organizational Behaviour *\nMM517 Human Resource Development\nMM5112 Organization and Management *\nMM5021 Business Ethics\nNon-Dissertation Option\nMM501 Research Methods \nMM516 Management of Pay and Benefits \nMM518 Employee Relations \nMM5191 Negotiation and Conflict Management \nMM5201 Global Leadership in the Asian Context \nMM5221 Human Resource Management in China \nMM5222 HRM Seminars\nMM5231 Strategic Human Resource Management\nMM5281 Mediation at Workplace\nMM5271 Wellbeing at Work\nMM531 Strategic Management*\nMM534 Entrepreneurship \nMM539 International Management\nMM5424 Management Information Systems\nMM554 Political and Economic Environment for Management\nMM576 Marketing Management\nMM5921 Practice of Human Resource Management\nDissertation Option\nMM501 Research Methods (3 credits)\nMM592 HRM Dissertation (9 credits)\nMM516 Management of Pay and Benefits \nMM518 Employee Relations \nMM5191 Negotiation and Conflict Management \nMM5201 Global Leadership in the Asian Context \nMM5221 Human Resource Management in China \nMM5222 HRM Seminars \nMM5231 Strategic Human Resource Management\nMM5271 Wellbeing at Work\nMM5281 Mediation at Workplace\nMM531 Strategic Management *\nMM534 Entrepreneurship \nMM539 International Management\nMM5424 Management Information Systems\nMM554 Political and Economic Environment for Management\nMM576 Marketing Management\nFrom 2019/20 Cohort onwards \nMM514 Human Resource Management *\nMM515 Organizational Behaviour *\nMM5112 Organization and Management *\nMM576 Marketing Management\nMM5021 Business Ethics\nNon-Dissertation Option\nMM501 Research Methods \nMM516 Management of Pay and Benefits \nMM517 Human Resource Development \nMM518 Employee Relations \nMM5191 Negotiation and Conflict Management \nMM5201 Global Leadership in the Asian Context \nMM5221 Human Resource Management in China\nMM5222 HRM Seminars \nMM5231 Strategic Human Resource Management\nMM5271 Wellbeing at Work\nMM5281 Mediation at Workplace\nMM531 Strategic Management*\nMM534 Entrepreneurship \nMM539 International Management\nMM544 E-Commerce\nMM5424 Management Information Systems\nMM554 Political and Economic Environment for Management\nMM5921 Practice of Human Resource Management\nDissertation Option\nMM501 Research Methods (3 credits)\nMM592 HRM Dissertation (9 credits)\nMM516 Management of Pay and Benefits \nMM517 Human Resource Development \nMM518 Employee Relations \nMM5191 Negotiation and Conflict Management \nMM5201 Global Leadership in the Asian Context \nMM5221 Human Resource Management in China \nMM5222 HRM Seminars\nMM5231 Strategic Human Resource Management\nMM5271 Wellbeing at Work\nMM5281 Mediation at Workplace\nMM531 Strategic Management *\nMM534 Entrepreneurship \nMM544 E-Commerce \nMM5424 Management Information Systems\nMM554 Political and Economic Environment for Management\nThe offering of subjects is subject to class quota availability. Students may also choose from a list of \"Common Pool Electives\", subject to the prescriptions of programme curriculum.\nProgramme structure, course names and content are subject to continuous review and change.\n\t* These subjects have been included in the list of reimbursable courses under the Continuing Education Fund. The programme (MSc in Human Resource Management) is recognised under the Qualifications Framework (QF Level 6).\t\nMode of Study and Duration\nMode of study: Mixed-mode\nStudents can pursue their studies with either a full-time study load (9 credits or more in a semester) or a part-time study load (less than 9 credits in a semester).\nStudents normally complete the programme full-time in 1.5 years or part-time in 2.5 years. Classes are normally scheduled on weekday evenings. Students who wish to extend their studies beyond normal duration can submit such request to the Department of Management and Marketing for consideration, as appropriate.\nThe programme offers a structured progression pattern. Students are encouraged to follow the pattern to benefit from a cohort-based structure.\nCurrent students can refer to the Programme Requirement Document for more details about the programme.\nProgramme Requirement Document\nThis programme was an excellent opportunity for me to develop specific skills and knowledge to excel as a HR professional. The course contents in this programme equipped me in understanding HR theories, business strategies, practical skills and strategic analysis and also, could help in strengthening my critical thinking skills. Professional educators shared their insights and experiences broadened my horizons and enabled me to manage practical issues at workplace professionally. This well-designed programme led me to have in-depth HR knowledge as the coursework emphasized on practical information and techniques, and the professors gave advisable feedback that enabled me to think deeply and hence, to improve. Fellow students with diverse background shared their workplace involvements through group discussion allowed me to know more approaches in dealing with HR related matters. Overall, it was a fascinating journey that equipped me to lead the strategic deployment of human capital for all sorts of organizations.\nKWONG Hoi Ying, Athena\n(2020/2021 Graduate)",
  "url": "https://www.polyu.edu.hk/mm/study/tpg/hrm/programme"
 },
 {
  "text": "Hong Kong Quant Marketing End-of-Spring-Semester Symposium\nYou are invited to attend the Hong Kong Quant Marketing End-of-Spring-Semester Symposium on 17 May 2023.\nDate* : 17 May 2023 (Wednesday)\nTime* : 12:00 – 17:10\n*Hong Kong Time\nVenue : Y306, PolyU Campus\nLanguage: English\nTentative schedule of the event:\n12:00 – 13:20: Welcome lunch in the Market, Hotel Icon \n13:30 – 13:40: Opening Speech by Prof. Wu LIU (Professor & Head of Department of Management and Marketing) \n13:40 – 14:40: Keynote Speaker - Dr Xinyu CAO (Visiting Scholar, The Chinese University of Hong Kong & Assistant Professor, New York University) \n14:40 – 15:40: Keynote Speaker - Dr Qiyuan WANG (Assistant Professor, The Hong Kong Polytechnic University)\n15:40 – 16:00: Coffee break\n16:00 – 17:00: Keynote Speaker - Prof. Lan LUO (Professor, University of Southern California)\n17:00 – 17:10: Closing Speech - Prof. Junhong CHU (Professor, The University of Hong Kong)\nThe event is open to registrants only. Please contact Dr Dai YAO at daiyao@polyu.edu.hk if you are interested.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/hong-kong-quant-marketing-end-of-spring-semester-symposium"
 },
 {
  "text": "Alumni Networking Happy Hour\n1 / 5\nMM organized a Alumni Networking Happy Hour in FINDS on 28 April 2023.\nWe are happy to welcome back our alumni.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/alumni-networking-happy-hour"
 },
 {
  "text": "PolyU Joint University Summer Workshop on Information Systems 2023\nJUSWIS 2023\nDepartment of Management & Marketing\nPolyU Business School\n6-8 July 2023\nAbout the Workshop:\nJUSWIS is an annual summer workshop initiated by the Management Information Systems (MIS) group in the Department of Management & Marketing at Hong Kong Polytechnic University (PolyU) Business School in collaboration with IS groups in both the Chinese University of Hong Kong (CUHK) and the Hong Kong University (HKU). All participating universities will take turns hosting the event on an annual basis from this year forward.\nAll guests invited to participate in the workshop are either current Editor-in-Chief or Senior Editors of the top two journals in the IS discipline. The workshop serves as a platform for authors in all participating universities who aspired to submit their scholarly work to premium journals in the IS discipline to solicit constructive feedback directly from the editors.\nCall for Papers:\nWe invite submissions across two general themes: Behavioral Information Systems and Economics in Information Systems.\nThe authors should format their manuscripts based on the formatting guidelines at MIS Quarterly (https://misq.umn.edu/formatting-your-manuscript). For initial submissions, authors name(s) must not appear in the body of the paper (including the abstract). The language of the workshop, and of all paper submissions, is English.\nFor authors at PolyU\nAll papers must be submitted as PDF files through the EasyChair submission system.\nSubmission link: https://easychair.org/conferences/?conf=juswis2023\nSubmission deadline: 7 June 2023\nFor authors at CUHK and HKU\nAll submissions will be handled by local coordinators. Please follow your local submission guideline and deadline.\nConfirmation emails will be sent out to attendees on a first-come, first-served basis, based on their registration time due to the limited capacity of the event venues.\nImportant Dates:\nSubmission Open: 30 April 2023\nSubmission Deadline: 7 June 2023\nFinal Program Announcement: 15 June 2023\nWorkshop: 6-8 July 2023\nPlease register here.\nWorkshop Activities and Attendance Policy\nPlenary Sessions:\nTwo one-hour plenary sessions featuring esteemed keynote speakers, Prof. Andrew Burton-Jones and Prof. Sarker Suprateek will take place on July 6th at 9:30 and July 7th at 8:45, respectively. During these sessions, the speakers will impart valuable ideas and strategies to all participants attending the workshop. It's important to note that both plenary sessions are open to all registered attendees. To ensure inclusivity, parallel online Zoom sessions will be organized, allowing unregistered participants to remotely join the plenary sessions.\nPaper Development Sessions:\nParallel paper development sessions will be organized for attending authors of accepted papers to present their research work to guest advisors and receive valuable feedback. To create a supportive and secure environment for authors presenting their work-in-progress, these paper development sessions are exclusively open to invited guests, registered authors of accepted papers, and registered participants affiliated with the participating universities: CUHK, HKU, and PolyU. We prioritize controlling access to the paper development sessions to ensure that attending authors feel confident that their intellectual properties are respected and safeguarded throughout the process. We aim to foster a conducive environment for fruitful discussions and constructive feedback.\nSpeedy Mentoring Sessions:\nA mentoring session will be organized exclusively to junior faculty members and senior doctoral students affiliated with all participating universities: CUHK, HKU, and PolyU. Guest advisors will be seated across three tables whereas junior faculty members and senior doctoral students will be split into three groups and rotate from table to table with a 20-minute interval. We recommend each participating faculty member and doctoral student to prepare at least one question in advance.\nInvited Guests:\nAndrew Burton-Jones: Editor-in-Chief, MIS Quarterly\nAndrew graduated from UQ's Commerce program in 1998 and worked for several years in IT risk management for one of the Big-4 accounting/consulting firms. He then moved to Georgia State University in Atlanta, USA, to complete his Ph.D., followed by seven years at the University of British Columbia in Vancouver, Canada, where he became a tenured Associate Professor. He returned to UQ in May 2012.\nAndrew has taught information systems in undergraduate, graduate, and executive programs, in several counties. He has a particular interest in IT governance and control, IT development, and IT strategy. He undertakes research in three areas. His first area focuses on how effectively organisations use IT. For example, he has been studying the effective use of electronic health records in health authorities. His second research area focused on improving methods to analyse and design IT systems. For example, he has examined ways to improve the specification of user requirements. His third research stream focuses on improving theories and methods used by researchers in the Information Systems discipline.\nHe has published in and served on the editorial boards of the Journal of the Association for Information Systems, Information Systems Research, MIS Quarterly, and other outlets. He recently completed a term as Representative for the Americas for the Association of Information Systems and commenced a term as International Representative for the Academy of Management (OCIS Division). He is a Fellow of the Association for Information Systems, Fellow of the Academy of Social Sciences of Australia, and Editor-in-Chief of MIS Quarterly (2021-2023).\nSarker Suprateek: Editor-in-Chief, Information Systems Research\nSuprateek Sarker (“Supra”) is Rolls-Royce Commonwealth Commerce Professor (Information Technology) at the McIntire School of Commerce, University of Virginia. Prof. Sarker holds an Honorary Professorship of Business Information Systems at the University of Sydney Business School, Sydney, Australia. He was formerly the Philip Kays Distinguished Professor of Information Systems at Washington State University and the Microsoft Chair of Information Systems at the Copenhagen Business School. \nProf. Sarker's research, which is largely qualitative or mixed-methods in nature, has been published in many journals, including MIS Quarterly; Information Systems Research; Journal of Management Information Systems; Journal of the Association of Information Systems; IEEE Transactions on Engineering Management and other outlets.\nHe serves on the editorial boards of a number of leading academic journals, including Information Systems Research (as senior editor), Journal of MIS Quarterly (as a member of the board of editors), and IEEE Transactions on Engineering Management (as an editorial board member). In addition, he serves as an Editorial Advisory Board member of journals such as Information & Organization; Information Technology & People; Decision Support Systems; AIS Transactions on HCI; Pacific Asia Journal of the Association for Information Systems; and International Journal of Information Management. He is also a past editor-in-chief of Journal of the AIS and Journal of Information Technology Case and Application Research, and a past senior editor of MIS Quarterly and Decision Sciences Journal.\nPei-yu (Sharon) Chen: Senior Editor, Information Systems Research\nDr Pei-yu Sharon Chen is the Earl and Gladys Davis Distinguished Professor and Department Chair of Information Systems. She is also the co-Director of the Actionable Analytics Lab at the W. P. Carey School of Business, Arizona State University. Prior to joining ASU, she served on the faculty at Tepper School of Business, Carnegie Mellon University and Fox School of Business, Temple University. She received her PhD from Wharton School of Business at the University of Pennsylvania.\nDr Chen’s research are interdisciplinary, spanning across Information Systems, Economics, Management and Strategy, Marketing, and Operations. Her recent research focuses on data analytics, IT-enabled strategies, crowdsourcing, open innovation and AI applications and impacts. Dr Chen’s work has been published in leading business journals such as Management Science, Information Systems Research, MIS Quarterly, Operations Research, and Production and Operations Management. Dr Chen was awarded the Dean’s Distinguished Research Career Award at the W. P. Carey School of Business. Many of Dr Chen’s research has triggered industry interests and been implemented in practice. Dr Chen has also worked with many corporate partners in research, in industries such as E-commerce, Education, Financial Services, Information Technology, Health Care, Manufacturing and Retailing. Professionally, Dr Chen has served on the editorial boards of Management Science and Information Systems Research. She has also served as co-chair for several premier conferences/workshops and has been frequently invited as a speaker or panelist in top tier conferences/workshops and at other leading research universities.\nBin Gu: Department Chair, Senior Editor, Information Systems Research \nBin Gu is a distinguished professor at Boston University, where he holds the title of Everett W. Lord Distinguished Faculty Scholar and serves as the Chair of the Department of Information Systems. Prof. Gu's achievements have been recognized by the INFORMS Information Systems Society, which named him a Distinguished Fellow. \nProf. Gu’s research focuses on the areas of data analytics, online platforms, online social media and social network, mobile commerce and IT-enabled business models. His work has been widely published in leading academic journals, including MIS Quarterly, Information Systems Research, Journal of Management Information Systems, Production and Operations Management, Journal of Retailing, Management Science, and Decision Support Systems and others.\nHe currently serves as a Senior Editor at Information Systems Research, and has previously served in the same capacity at MIS Quarterly. He has also guest edited a special issue of MIS Quarterly on \"Managing AI\" and associate edited special issues of Information Systems Research on \"Social Media and Business Transformation\" and \"Fintech - Innovating the Financial Industry.\"\nElena Karahanna: Advisory Senior Editor, Information Systems Research\nElena Karahanna is a University of Georgia Distinguished Research Professor and the C. Herman and Mary Virginia Terry Distinguished Chair in Business Administration in the MIS Department, Terry College of Business, at the University of Georgia. She was named a Fellow of the Association for Information Systems. And she has also held visiting appointments in Hong Kong, Australia, Singapore, and Italy and was on the faculty at the University of Cyprus and at Florida State University.\nElena’s expertise are in the implementation and use of information systems, health IT, IS leadership especially at the CIO level, social media, and cross-cultural issues. Her research has been published in leading scholarly journals in Information Systems (e.g., Management Science, MIS Quarterly, Information Systems Research, Journal of Management Information Systems, Journal of the Association for Information Systems) and other disciplines (e.g., Academy of Management Review, Organization Science, Academy of Management Discoveries, Journal of the Academy of Marketing Science) as well as in practitioner journals (e.g., MIS Quarterly Executive, Cutter Benchmark Review, Business Horizons). \nElena has served as Advisory Senior Editor at the MIS Quarterly, Information Systems Research, and the Journal of the Association for Information Systems, and serves or has served as Associate Editor at Management Science, Information Systems Research, MIS Quarterly, Journal of the Association for Information Systems, IEEE Transactions on Engineering Management, and the European Journal of Information Systems. She has also guest co-edited a special issue of the MIS Quarterly on “The Role of Information Systems and Analytics and Chronic Disease Prevention and Management,” a special issue of IEEE Transactions on Engineering Management on “IS Leadership,” a Special Issue of MIS Quarterly Executive on “New IS Leadership Roles in a Digital World,” and a Special Issue of the Journal of the Academy of Marketing Science on “The Future of Technology and Marketing.”\nArun Rai: Former Editor-in-Chief, MIS Quarterly (2016-2020)\nArun Rai is Regents’ Professor of the University System of Georgia, holds the Howard S. Starks Distinguished Chair, and is Director of the Center for Digital Innovation at the Robinson College of Business (RCB) at Georgia State University. He has held visiting appointments at universities in Australia, France, Germany, Hong Kong, and Slovenia. He was named a Fellow of the Association for Information Systems and a Distinguished Fellow of the INFORMS Information Systems Society and the Association for Information Systems LEO Award for Lifetime Exceptional Achievement in the Information Systems discipline.\nFor over 30 years, Arun’s research has focused on the development and deployment of information systems to drive innovation and create value. His research has contributed to understanding the digital transformation of organizations and supply chains; governance of IT investments and platform ecosystems; and deployment of digital innovations at scale to empower individuals and address thorny societal problems including poverty, health disparities, infant mortality, and digital inequality.\nArun’s work has been published extensively in premier journals in IS and other disciplines, with 250 peer-reviewed articles that include 120 refereed journal articles in journals such as MIS Quarterly, Information Systems Research, Management Science, Production and Operations Management, Journal of Operations Management, and Journal of the American Medical Informatics Association. He is ranked among the top 5 scholars for publications over the last 20 years in the IS field’s top-2 journals (MISQ and ISR). His work has received several best paper awards and has been widely cited both in leading journals in the IS discipline and in leading journals in other disciplines (e.g., Accounting, Marketing, Operations Management, Strategic Management, Computer Science, Education, Healthcare, and Psychology).\nHe served a 5-year term (2016-2020) as Editor-in-Chief of MIS Quarterly (MISQ), widely regarded as the premier IS journal. He has also served as Senior Editor for MISQ, ISR, and Journal of Strategic Information Systems and Associate Editor for several leading journals (e.g., ISR, MISQ, Management Science, JMIS); Panelist for the National Science Foundation; Track Co-Chair for major conferences; chair, mentor and keynote speaker for doctoral/junior faculty/mid-career faculty consortia; and President of the Special Interest Group on the Adoption and Diffusion of Information Technology.\nJason Bennett Thatcher: Senior Editor, Information Systems Research\nDr Thatcher holds the Milton F. Stauffer Professorship in the Department of Management Information Systems at the Fox School of Business of Temple University. He also holds faculty appointments at the Technical University of Munich, the Information Technology University-Copenhagen, and Hong Kong Polytechnic University.\nJason studies individual decision-making, strategic alignment, and workforce issues related to the effective and secure application of information technologies in organizations. His more recent projects direct attention to cybersecurity and social media. Jason’s work appears in MIS Quarterly, Information Systems Research, Journal of Applied Psychology, and other outlets. Jason has published (or forthcoming) papers in Financial Times 50 listed journals about once a year since earning his Ph.D. He appears on the MIS Quarterly’s most prolific authors list, placing him in the top 35 or so active researchers in the Information Systems discipline.\nJason serves as Senior Editor at Information Systems Research as well as Journal of the Association for Information Systems and has served as Senior Editor at MIS Quarterly. He served on the editorial boards of the European Journal of Information Systems, Decision Sciences, and IEEE Transactions on Engineering Management. He was recognized as a top Associate Editor by Information Systems Research.\nHan Zhang: Senior Editor, MIS Quarterly\nDr Han Zhang is a Professor in Information Technology Management (ITM) and Steven A. Denning Professor of Technology & Management. He received his Ph.D. in Information Systems from the University of Texas at Austin. He currently serves as the Faculty Director of the Steven A. Denning Technology & Management (T&M) Program. He was the ITM Area Coordinator from 2007 to 2012 and he served as the Faculty Director of the Executive MBA Program from 2013 to 2016. Dr Zhang held the Helen and John Taylor Rhett, Jr. Term Professorship from 2008 to 2012. He is also an affiliate research faculty member of the Center for Research in Electronic Commerce at the University of Texas at Austin.\nDr Zhang's research focuses on the economics of information technology, online trust and reputation, online word-of-mouth, and the evolution of electronic markets. His research work on the institutional setup to help small businesses grow in the digital economy has been used as the basis for testimony before the Congressional House Committee on Small Business. His research has appeared in several premier journals such as Information Systems Research, MIS Quarterly, Journal of Marketing Research, Journal of Management Information Systems, and Decision Support Systems among others. Dr Zhang currently serves as a senior editor for MIS Quarterly. He is also a senior editor for Information & Management and Journal of Information Systems and E-Business Management.\nWorkshop Committee\nWorkshop Chair\nProf. Kai LIM, Department of Management and Marketing, PolyU Business School\nProgram Co-Chairs\nDr. Yue (Katherine) FENG, Department of Management and Marketing, PolyU Business School\nDr. Fei (Albert) LIU, Department of Management and Marketing, PolyU Business School\nIf you have any question, please feel free to contact Dr Albert LIU at fei-albert.liu@polyu.edu.hk.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/polyu-joint-university-summer-workshop-on-information-systems-2023--juswis-2023"
 },
 {
  "text": "We are pleased to announce the following awardees of the Outstanding Alumni Award of PolyU Department of Management & Marketing 2023 for their remarkable achievements.\nProf. Wing LAM\nOutstanding Alumni Award in Scholarly Achievement of PolyU Department of Management and Marketing\nProf. Wing Lam is currently Professor of Organisational Psychology at the University of Manchester. She received her Ph.D. from the Hong Kong Polytechnic University. Prof. Lam’s research focuses on employee proactivity, leadership, and emotional labor. Her standing and impact are demonstrated by the quality of published outputs (54% of articles in ABS journal list 4*), its volume (26 journal articles, 3 book chapters), and citation levels (nearly 3,000 citations). Her publications have appeared in top-tier journals, such as Academy of Management Journal, Journal of Applied Psychology, Journal of the Academy of Marketing Science, Personnel Psychology, and Journal of Organizational Behavior. Currently, she is serving as an Associate Editor for Journal of Occupational and Organizational Psychology (ABS 4) and Journal of Business Research (ABS 3). \nMr Kino LAW\nOutstanding Young Alumni Award in Entrepreneurial Achievement of PolyU Department of Management and Marketing\nMr Kino Law is the Chief Executive Officer and Chairman of K&K Property Holdings Limited. He co-founded the K&K Property Group with his father, Mr Raymond Law in 2012. He is also the chairman of K&K Charity, which focuses on empowering underprivileged teenagers through sports education.\nBefore founding the K&K Property Group, he worked in investment bank and Park Hotel Group. He was involved in a range of major property transactions within the family business. For example, he participated in the disposal of the a shopping mall in Hong Kong for HK$1.9 billion in year 2012 and the sales of two hotels in Singapore for HK$8.8 billion in year 2013. Through the K&K Property Group, he has participated in land acquisitions, product design and development, sales and marketing of at least 18 projects in Hong Kong and London.\nThrough K&K Charity, Mr Law sponsored a competition for Faculty of Business and Faculty of Construction and Environment students on sustainable housing (Smart-e Competition). The winning team was sponsored to participate in an international conference to share their ideas. The competition generated publicity for PolyU on sustainable building in 2017.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/outstanding-alumni-award-of-polyu-department-of-management-and-marketing-2023"
 },
 {
  "text": "PolyU Scholars Hub \nProf. Wu LIU\nProfessor and Head of Department \nResearch Area: Management\nM829a, M936 \n+852 3400 3954 \nwu.liu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Employee Voice Behavior, Top Management Teams, Leadership, Negotiation, Cross-cultural Management, Conflict Management \nEducation and Academic Qualifications\nBachelor of Economics, Fudan University\nMaster of Economics, Fudan University\nDoctor of Philosophy, Vanderbilt University\nProf. Liu Wu joined the Department of Management and Marketing in 2008 after he obtained his Ph.D. at Vanderbilt University, U.S.A. His current passion of research centers on (1) leader-member and team dynamics on voice behavior, and (2) under which social conditions that cross-cultural differences in conflict resolutions may appear or disappear.",
  "url": "https://www.polyu.edu.hk/mm/people/department-and-programme-leadership/prof-liu-wu"
 },
 {
  "text": "PolyU Scholars Hub \nDr Fang Flora GU\nAssociate Professor and Associate Head of Department \nResearch Area: Marketing\nM826 \n+852 2766 4017 \nflora.gu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Marketing Strategy, Interorganizational Relationships, Distribution Channels, Cross-cultural Marketing, Digital Marketing \nEducation and Academic Qualifications\nBachelor of Economics, Fudan University\nDoctor of Philosophy, The University of Hong Kong\nFlora F. Gu is Associate Professor of Marketing and Associate Head in the Department of Management and Marketing, Hong Kong Polytechnic University. Her research focuses on marketing strategy, inter-organizational relationships, cross-cultural marketing, and online influencer marketing. She has published inJournal of Marketing, Journal of Marketing Research, Journal of International Business Studies, Journal of International Marketing, Industrial Marketing Management, International Business Review, among others. She serves on Editorial Review Board forJournal of MarketingandJournal of the Academy of Marketing Science. ",
  "url": "https://www.polyu.edu.hk/mm/people/department-and-programme-leadership/dr-flora-gu"
 },
 {
  "text": "Dr Pun Zee Pamsy HUI\nSenior Teaching Fellow and Associate Head of Department \nResearch Area: Management\nM940 \n+852 2766 7394 \npamsy.hui@polyu.edu.hk \nConsulting, Research and Teaching Interests: Responsible Management Education, International Management, Inter-Organizational Relationships \nEducation and Academic Qualifications\nBachelor of Arts, University of California\nDoctor of Philosophy, The University of Texas at Austin",
  "url": "https://www.polyu.edu.hk/mm/people/department-and-programme-leadership/dr-pamsy-hui"
 },
 {
  "text": "Prof. Jiang’s research interests are in the area of consumer psychology. Most of his research involves how consumers' judgments and decisions are shaped by social influence, self concepts, and visual marketing information. Prof. Jiang is one of the top 50 most productive marketing scholars in the world (based on the number of publications on premier marketing journals in 2012-2021). His research has appeared frequently in top-tier academic journals, such as the Journal of Personality and Social Psychology, Journal of Consumer Research, Journal of Marketing Research, Journal of Marketing, Journal of Consumer Psychology, Strategic Management Journal, Organizational Behavior and Human Decision Processes, and Consumer Psychology Review. Prof. Jiang serves as an associate editor for the Journal of Consumer Psychology, a guest associate editor and editorial board member for the Journal of Consumer Research, and a co-editor for the Journal of the Association for Consumer Research special issue on pandemic-transformed economy. He was awarded the Marketing Science Institute (MSI) Scholar in 2020, the outstanding reviewer award for the Journal of Consumer Research in 2019; the MSI Young Scholar in 2015, and the AMA-Sheth Doctoral Consortium Fellow in 2008.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof-yuwei-jiang"
 },
 {
  "text": "Dr Chi Hong Simon CHAN\nTeaching Fellow \nResearch Area: Management\nM1031 \n+852 3400 3643 \nsimon.ch.chan@polyu.edu.hk \nConsulting, Research and Teaching Interests: Leadership, Organizational Behavior, Human Resource Management \nEducation and Academic Qualifications\nBachelor of Arts in Management, The Hong Kong Polytechnic University\nMaster of Philosophy, The Hong Kong Polytechnic University\nDoctor of Philosophy, The Hong Kong Polytechnic University\nSimon Chan received his Ph.D., M.Phil., and BA (Hons) with first class honors (Organizational Behavior/ Human Resources Management) from The Hong Kong Polytechnic University. Before he joined the university, he has taught undergraduate subjects in general management and human resources management. He has published research papers in International Journal of Human Resources Management, Information System Journal, Personnel Review, International Journal of Innovation and Learning. His main research interests focus mainly on organizational behavior, and in particular Chinese leadership. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-simon-ch-chan"
 },
 {
  "text": "Dr Chi Chung Stephen KO\nTeaching Fellow \nResearch Area: Management\nM1026 \n+852 2766 4061 \nstephen.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic Management, Entrepreneurship \nBachelor of Social Sciences in China Studies (Sociology), Hong Kong Baptist University\nMaster of Laws, University of London\nMaster of Business Administration, The Chinese University of Hong Kong\nDoctor of Philosophy, The Hong Kong Polytechnic University\nDr. Ko teaches Entrepreneurship and Research Methods at the undergraduate and postgraduate levels. His research interests include innovation, entrepreneurship, and business education. He is the author of dozens of business cases and other scholarly articles. Currently, he is an Associate Editor of the Journal of Education for Business and serves on the editorial review boards of SAGE Business Cases and Emerging Markets Case Studies. To contribute to the advancement of knowledge in global business and technology management, he serves as an Asia Editor for the Journal of Global Business and Technology.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-stephen-ko-chi-chung"
 },
 {
  "text": "Dr Lai Ming Jackie TAM\nSenior Teaching Fellow \nResearch Area: Marketing\nM856 \n+852 2766 7951 \njackie.tam@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behaviour, Service Quality, Research Methods \nBachelor of Science, University of London\nMaster of Science in Management Science and Operational Research, The University of Warwick\nDoctor of Philosophy, Aston University\nDr Tam teaches Marketing Management and Services Marketing. Her research interests include services marketing and consumer behavior across cultures. She has published in referred journals and conference proceedings. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-jackie-tam"
 },
 {
  "text": "PolyU Scholars Hub \nDr Xin XU\nAssociate Professor Associate Dean (External Relations and Development) \nResearch Area: Management Information Systems\nM921e, M824 \n+852 2766 7065 \nxin.xu@polyu.edu.hk \nConsulting, Research and Teaching Interests: IT Service Management, IT Innovation and Consumers, Human Computer Interaction, Mobile Computing, Social Media and Business Analytics \nXU Xin received his bachelor and master degrees in Economics. His doctoral study was focused on the strategic impacts of IT innovation on consumers. His current research interests are in the fields of management of IT service, organizational implementation of IT, HCI for E-commerce, Mobile Computing, and Social Media and Business Analytics.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-xu-xin"
 },
 {
  "text": "Dr Annie KO\nTeaching Fellow \nM1033 \n+852 3400 2124 \na.an.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Corporate Social Responsibility, Business Ethics, Human Resource Management, Experiential Learning \nAnnie received her MSc degree and PhD in Hotel and Tourism Management at the Hong Kong Polytechnic University. Her teaching and research interests focus on perceived corporate social responsibility, human resource development and organisational behaviour. She has published papers in the International Journal of Hospitality Management and International Journal of Contemporary Hospitality Management. Prior to her post-graduate studies, Annie was responsible for the development and execution of regeneration strategies for an urban tourism precinct.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-annie-ko"
 },
 {
  "text": "Dr Cho currently researches on \"m-commerce technology adoption\" and \"health care information system adoption\". He is also specialised on data mining, stock index forecasting, database marketing, yield management and e-commerce infrastructure and strategy. His research papers are published on various international journals including Information & Management, Journal of Computer information Systems, Expert Systems, Knowledge and Information Systems, Journal of Computational Intelligence in Finance, Journal of Hospitality and Tourism Research, International Journal of Hospitality Management, International Journal of Tourism Research, Annals of Tourism Research. Before joining the university, he had several years of experience in systems development in some prestige international consulting firms. He is also interested in consultancy works.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-cho-wing-sing-vincent"
 },
 {
  "text": "M904 \n+852 2766 4060 \nzhang.xubing@polyu.edu.hk \nConsulting, Research and Teaching Interests: Analytical and Empirical Research in Retailing Practices, Distribution Channels, Internet Marketing, Advertising, Pricing and Competitive Strategies. \nBachelor of Engineering, University of Science and Technology Beijing\nMaster of Engineering, Beijing Polytechnic University\nDoctor of Philosophy, University of Toronto\nMainly using quantitative approach (mathmatical modeling, game theory, econometric methods), my research exmines issues of waranties, multichannel retailing, co-branding, and consumers' search behavior online. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-xubin-zhang"
 },
 {
  "text": "Laurel Qi received her PhD degree in Management Information Systems at the School of Business, the University of Hong Kong in 2008. Her research areas cover IT outsourcing, social media, knowledge management, mobile computing, new technology adoption, AI, Blockchain, E-Commerce, and IS pedagogical research, etc. She specializes in conducting quantitative and qualitative behavioral research. Before joining PolyU, she has been working in academia and business sectors (China and Hong Kong) for three years. She is now actively participating in journal and conference paper generations. Her research papers were published in the journals of Decision Support Systems (2013), Information Technology and People (2013 & 2015), Journal of Organizational Computing and Electronic Commerce (2017), Behaviour & Information technology (2019), Journal of Educational Computing Research (2019), and Asian Pacific Journal of Information Systems (2023). Her works were also presented at the following important international conferences: AMCIS (2014), CSCL (2015), PACIS (2016, 2017, 2019, & 2023), ALT (2017), ICCE (2017), CSIM (2018), ACIS (2019 & 2021) and more.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-laurel-qi"
 },
 {
  "text": "Dr Chun Fan Elvy PANG LEUNG\nTeaching Fellow \nM916 \n+852 2766 7356 \nelvy.pang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Group Effectiveness and Creative Thinking \nBachelor of Arts in Business Studies, Hong Kong Polytechnic\nMaster of Science in Management, The Hong Kong Polytechnic University\nDoctor of Business Administration, University of South Australia\nElvy obtained a doctorate in business administration and a masters degree in human resource management. Prior to joining our academic team, she was a business practitioner in a diverse range of areas in Hong Kong and the Mainland including HR development, executive training and consultancy, and personnel management. Elvy has qualifications for the Big-Five, FIRO-B, MBTI, DISC and NLP. Her recent research interest is on the effect of student teaming. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-elvy-pang"
 },
 {
  "text": "Dr Juley Jialing XIAO received her Ph.D. in organizational behavior from the Hong Kong Polytechnic University (HKPU), MBA from HKBU, and BBA from HKPU. Her consulting, research and teaching interests include well-being, justice, leadership, and Pay. She has many years of experience performing surveys across industries. Partnered with various industrial and academic institutions, she has conducted the Pay and Benefits Survey for several years and established the annual pay index in the Greater Bay Area. She has contributed to the university in various aspects, including teaching, concentration and course development, and the associate directorship for an applied research Centre in the Faculty of Business.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-juley-xiao"
 },
 {
  "text": "PolyU Scholars Hub \nProf. Wu LIU\nProfessor and Head of Department \nM829a, M936 \n+852 3400 3954 \nwu.liu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Employee Voice Behavior, Top Management Teams, Leadership, Negotiation, Cross-cultural Management, Conflict Management \nBachelor of Economics, Fudan University\nMaster of Economics, Fudan University\nDoctor of Philosophy, Vanderbilt University\nProf. Liu Wu joined the Department of Management and Marketing in 2008 after he obtained his Ph.D. at Vanderbilt University, U.S.A. His current passion of research centers on (1) leader-member and team dynamics on voice behavior, and (2) under which social conditions that cross-cultural differences in conflict resolutions may appear or disappear.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof-liu-wu"
 },
 {
  "text": "Prof. Chung obtained his Doctor of Philosophy degree in Sociology from Stanford University in 2000. He joined the National University of Singapore Business School since then. He was Professor and Head of the Department of Strategy and Policy before joining PolyU. \nProf. Chung specialized in areas of economic sociology and organization theory. He endeavors to explore and understand the social foundation such as social networks and status hierarchy that underpins business organizations and economic activities. His research contexts have been focusing on business groups in emerging economies, family firm governance and succession, and political connections and firm strategies. Prof. Chung’s works have appeared in Administrative Science Quarterly, American Journal of Sociology, Organizartion Science, Strategic Management Journal, and other referred journals. He is serving or has served as an editorial board member for several renowned journals in management disciplines, including Academy of Management Journal, Corporate Governance: An International Review, Journal of Management Studies, Management and Organization Review, and Strategic Management Journal. He is also the guest editor of Special Issue on Family Firms for Corporate Governance: An International Review.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof-chi-nien-chung"
 },
 {
  "text": "Kai H. Lim is Chair Professor of Information Technology Innovation and Management at Management and Marketing Department, The Hong Kong Polytechnic University. He served as a Senior Editor of the top journal of the Information Systems field, MIS Quarterly (2011-2016; two terms) and was on the editorial boards of ISR, MISQ, and JAIS. His research has widely appeared in top journals such as MIS Quarterly, ISR, JMIS, and JAIS. Prior to joining CityU, he was on the faculty of CityU of Hong Kong Case Western Reserve University and the University of Hawaii. He has won numerous teaching and research awards, including the 2002/03 University-Wide Teaching Excellence Award and 2020/21 University-Wide Outstanding Research Award. Kai is also an Honorary Professor of Fudan University, China and a Fellow of the Association for Information Systems (AIS Fellow).",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof--kai-h-lim"
 },
 {
  "text": "Prof. Eric W. T. Ngai is a Distinguished Research Professor in the Department of Management & Marketing at The Hong Kong Polytechnic University. His current research interests are in the areas of E-commerce, Decision Support Systems, Logistics and Supply Chain Management, Knowledge Management & Innovation, IoT and AI Methods and Applications. He has published papers in a number of international journals including MIS Quarterly, Journal of Operations Management, INFORMS Journal of Computing, Decision Support Systems, Information & Management, Production & Operations Management, and others. He is an Associate Editor of Information & Management, Decision Support Systems, and Communications of AIS",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof-eric-ngai-wt"
 },
 {
  "text": "Prof. Krishna Savani is a Professor of Management at the Hong Kong Polytechnic University. He has previously worked at Columbia University, National University of Singapore, and Nanyang Technological University. He has three inter-related programs of research. One program uses cross-cultural research to uncover basic psychological constructs (e.g., the choice mindset, the universal mindset) and examines the implications of these constructs for individuals, organizations, and society. His second program uses knowledge of people’s decision-making biases to counteract discrimination in employees’ hiring, evaluation, and promotion. His final program uses machine learning methods to generate novel hypotheses, which are subsequently tested with experiments. \nProf. Savani’s research has received numerous awards, including the 2021 Responsible Research in Management award by the Academy of Management Fellows, and the 2016 Rising Star award from the Association of Psychological Science. He was featured among the 2018 “Top 40 Business Professors Under 40” by Poets and Quants. He is a fellow of the Society for Personality and Social Psychology, the Association for Psychological Science, and the Society for Experimental Social Psychology. He is currently an Associate Editor at the Journal of Personality and Social Psychology.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/prof-krishna-savani"
 },
 {
  "text": "Prof. Michael Harris BOND\nVisiting Chair Professor of Management \nM902 \n+852 2766 7342 \nmichael.bond@polyu.edu.hk \nConsulting, Research and Teaching Interests: Personality and Interpersonal Processes in Organizational Life, Organizational Culture, Cross-cultural Management \nProf. Bond is a cross-cultural social psychologist whose career has been focused on locating Chinese interpersonal processes in a multi-cultural space. This goal has most recently been realized in his co-authorship of Understanding social psychology across cultures (Sage, 2013). He taught for 35 years at the Chinese University of Hong Kong contributing to and integrating the literature on Chinese psychology, editing The Oxford handbook of Chinese psychology (2010). Believing that all social psychology should be applied, he is eager to involve himself in the research agenda of the Department of Management and Marketing, and has informed himself about the current development of organizational psychology by co-editing The handbook of Chinese organizational behaviour (Elgar, 2012) with Prof. Xu Huang. Eager to help promote the research agenda at Department of Management & Marketing, he is ready to chat and collaborate! ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/michael-harris-bond"
 },
 {
  "text": "Associate Professor and Associate Head of Department \nResearch Area: Marketing\nM826 \n+852 2766 4017 \nflora.gu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Marketing Strategy, Interorganizational Relationships, Distribution Channels, Cross-cultural Marketing, Digital Marketing \nBachelor of Economics, Fudan University\nDoctor of Philosophy, The University of Hong Kong\nFlora F. Gu is Associate Professor of Marketing and Associate Head in the Department of Management and Marketing, Hong Kong Polytechnic University. Her research focuses on marketing strategy, inter-organizational relationships, cross-cultural marketing, and online influencer marketing. She has published inJournal of Marketing, Journal of Marketing Research, Journal of International Business Studies, Journal of International Marketing, Industrial Marketing Management, International Business Review, among others. She serves on Editorial Review Board forJournal of MarketingandJournal of the Academy of Marketing Science. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-flora-gu"
 },
 {
  "text": "Dr Shuping Li uses a behavioral lens to understand leadership processes and their consequences. Most notably, she examines how leaders behave and make decisions by exploring the macro-level institutional influences (e.g., formal regulations), the firm-level corporate governance antecedents (e.g., ownership structure), and the individual-level microfoundations (e.g., leaders’ dispositional features). A notable convergence of the streams concerns looking for multi-level factors that interact to shape leaders’ employment risk and their subsequent decisions on firm competitiveness (e.g., corporate social responsibility and innovation). Focusing on worldwide firms, she has several papers published at Academy of Management Journal, Strategic Management Journal, and Journal of Applied Psychology.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-shuping-li"
 },
 {
  "text": "M906 \n+852 2766 7378 \nrobert.wright@polyu.edu.hk \nConsulting, Research and Teaching Interests: Paradoxical Thinking, Reflective Practice, Boards of Directors, Managerial Cognitions, Strategy-as-Practice, Strategy-as-Paradox, Executive Educatoin \nBachelor of Business, Western Australian College of Advanced Education\nMaster of Industrial Relations, The University of Western Australia\nDoctor of Philosophy, The University of Hong Kong\nProfessional Qualifications\nFellow of the Hong Kong Institute of Human Resource Management\nFellow of the Hong Kong Institute of Directors\nFellow of the Australian Institute of Management\nDr Wright is an internationally recognized multi-award winning educator and scholar with over 30+ years experience in tertiary education. He is a four time nominee for the University’s President’s Award for Excellence Performance and recipient of the President’s Award for Teaching Excellence and Finalist for the University Grants Committee Teaching Award, in addition to his other awards in reseach and service. Dr Wright recently successfully completed a $HK9.7M 3-year Teaching & Learning Development Grant awarded by the Hong Kong Government to scale up his strategic thinking “F.O.C.U.S.E.D.” framework across the UGC tertiary education sector. In 2020, he received the Faculty Prize for Outstanding Service. In 2021 he completed a 6-months sabbatical leave attached to the Yong Loo Lin School of Medicine at the National University of Singapore. Dr Wright is the past Chairperson for the Teaching Community and past Chairperson of the Strategy Practice Research track of the American Strategic Management Society (SMS). His research on “How useful are the strategic tools we teach in business schools?” won Best Paper of the Year from the prestigious Journal of Management Studies. He is recognized by Emerald Citations of Excellence Award for high impact research. He is Associate Editor of the Journal of Management Education (JME) and sits on the Editorial Review Boards of the Academy of Management Learning & Education (AMLE), Organizational Research Methods (ORM), and previously served on the boards of the Academy of Management Review (AMR) and Journal of Organizational Behavior (JOB). Outside academia he is a Life Fellow of the Australian Institute of Management, Fellow of the Hong Kong Institute of Directors, and served on the Board of Directors for 14 years (as an Executive Council member) of the Hong Kong Institute of Human Resource Management. Dr Wright is a graduate of executive development programs in IMD in Switzerland and the Harvard Business School.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-robert-p-wright"
 },
 {
  "text": "M939 \n+852 2766 4057 \namy-yi.ou@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic leadership, Leader humility, Organizational culture, Women career management \nBachelor of Economics, Peking University\nMaster of Management, Peking University\nDoctor of Philosophy Business Administration, Arizona State University\nDr Amy Ou received PhD degree in management from W.P.Carey School of Business, Arizona State University. Her research is dedicated to helping organizations and employees better adapt to a VUCA (volatile, uncertain, complex and ambiguous) world. She studies whether and how CEO attributes such as humility affect top management team dynamics, organizational culture, strategic decision making, employee behaviours, and organizational performance. Her papers have been published in top-tier management journals such as Administrative Science Quarterly, Academy of Management Journal, Journal of Applied Psychology, Journal of Management, and the Leadership Quarterly. Her research won the 2008 Academy of Management Best Paper Award, the 2012 Journal of Management Best Paper Award, the 2013 Alvah H. Chapman Jr. Outstanding Dissertation Award, and 2016 Australia and New Zealand Academy of Management Best Paper Award. Her research on CEO humility has been featured in Forbes China, USA Today, and The Business Times. Before joining academia, she worked in management consulting and property management positions.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-amy-y-ou"
 },
 {
  "text": "Dr Seunghoo CHUNG\nAssistant Professor \nM927 \n+852 3400 3645 \nseunghoo.chung@polyu.edu.hk \nConsulting: Group/Team Composition to Performance Team Negotiations Inter-group Collaboration/Cooperation Meta-Analysis \nSeunghoo Chung is an assistant professor of the Department of Management and Marketing at The Hong Kong Polytechnic University. He earned his bachelor’s degree in Business Administration from Korea University, and master’s degree in Human Resource Management and Ph.D. in Business Administration from the Fisher College of Business at The Ohio State University. His research examines how to best structure group and team settings to facilitate successful outcomes, with a primary interest in the factors that promote collaboration. His work has been published in Academy of Management Journal, Journal of Applied Psychology, Organizational Behavior and Human Decision Processes, and Personality and Social Psychology Bulletin and featured in outlets such as BBC News, Harvard Business Review, and The New York Times.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-seunghoo-chung"
 },
 {
  "text": "Dr Grace Chae received her MSc. and BBA degree in Business Administration at Seoul National University, South Korea. She also studied at Trinity College, University of Dublin, Ireland and ESSEC, France as an ASEM Duo exchange student during her programs at Seoul National University. She completed her PhD degree in Marketing at the University of British Columbia, Canada.\nDr Chae’s research foci have been sensory marketing, consumer socialization and motivation. She published articles at leading marketing journals such asJournal of Consumer Researchand theJournal of Consumer Psychology. Her article also appeared on the Harvard Business Review as a review article.\nDr Chae taught Behavioral Research Seminar for doctoral students and Marketing Research and Consumer Behavior for undergraduate students. She is teaching Integrated Marketing Communications in Spring.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-boyoun-grace-chae"
 },
 {
  "text": "Personal Link: http:/www.yaod.ai\nDr Dai Yao’s research focuses on understanding consumer and firm behaviors in various business contexts enabled by high and new technologies, such as social media and network-mediated environments, live streaming, sharing economy, car rental and taxi ride, mobile games, online labour markets, crowdsourcing, etc. He has published papers in top marketing and management journals such as Marketing Science, Management Science, Journal of Marketing Research, and Journal of the Academy of Marketing Science. Before his academic career, he had extensive working experience in high-tech research institutes and companies in China and India, such as Microsoft Research Asia, Netease, Infosys, IDC, and Sohu, and had worked on his own startup.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-dai-yao"
 },
 {
  "text": "Dr Arnaud CUDENNEC\nAssistant Professor \nM1028 \n+852 2766 7340 \narnaud.cudennec@polyu.edu.hk \nConsulting, Research and Teaching Interests: Organization Theory, Economic Sociology, Social Categories, Expertise, Institutions \nAs a social scientist, Dr. Arnaud Cudennec studies the sociological determinants of organizations' and individuals' behaviors in markets. His research examines topics related to categorization processes, expertise, and social institutions using experimental and large-scale quantitative data. He has a particular interest in entrepreneurship (venture capital) and cultural industries. His research has been published in the Academy of Management Journal and Research in the Sociology of Organizations. A graduate in philosophy, sociology, and business administration, he obtained a Ph.D. in management sciences from HEC Paris (France) where he was affiliated with the Society & Organizations Institute. During his Ph.D. studies, he visited the Kellogg School of Management at Northwestern University (Illinois, USA).",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-arnaud-cudennec"
 },
 {
  "text": "M1021 \n+852 3400 3924 \nfeng.bai@polyu.edu.hk \nConsulting, Research and Teaching Interests: Morality, Virtue, Social Inequality \nBachelor of Management, Nanjing University\nMaster of Philosophy, City University of Hong Kong\nFeng received his MPhil degree in Management Sciences and his PhD degree in Organizational Behaviour and Human Resources. His research focuses on understanding the role of morality, particularly moral virtue, in shaping social inequalities. He has published sole-authored or first-authored articles in Journal of Personality and Social Psychology, Personality and Social Psychology Review, Organizational Behavior and Human Decision Processes, Journal of Experimental Social Psychology, and Academy of Management Best Paper Proceedings. Feng teaches Organizational Behaviour and Experimental Design.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-feng-bai"
 },
 {
  "text": "Xueyong obtained his PhD in public administration and an MPA from the Price School of Public Policy, University of Southern California. He also received an M.Sc. in management science from the Chinese Academy of Sciences and his B.S. in engineering from Tsinghua University in Beijing. His current research focuses on environmental governance, public and nonprofit management. His recent research articles have been published or forthcoming in the Journal of Public Administration Research and Theory, Public Administration Review, Journal of Policy Analysis and Management, Public Administration, Policy Studies Journal, and the Journal of Development Studies. Before joining the PolyU, Dr Zhan was an Assistant Professor of Public Administration at the School of Public Economics and Administration, Shanghai University of Finance and Economics.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-xueyong-zhan"
 },
 {
  "text": "Dr Yue Katherine FENG\nAssistant Professor, Assistant Dean (External Relations) \nResearch Area: Management Information Systems\nM1011 \n+852 2766 7127 \nkatherine.feng@polyu.edu.hk \nConsulting, Research and Teaching Interests: Social Media & User-Generated Content, Digital Marketing, Business Analytics, IT Innovation and Implementation \nBachelor of Science in Statistics, Fudan University\nDoctor of Philosophy in Information Systems, Hong Kong University of Science and Technology\nKatherine received her PhD in Information Systems from the Hong Kong University of Science and Technology. Her research aims to understand individual activities on social media, online marketing, and IT innovation and implementation in different contexts, using a variety of research methods such as econometrics, machine learning, and field experiment. Her work has been published in leading journals such as Information Systems Research and Journal of the Association for Information Systems. Prior to joining PolyU, Katherine worked in Fintech industry as a big data analyst.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-y-katherine-feng"
 },
 {
  "text": "M1020 \n+852 3400 3642 \nfeifei.huang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Consumer Behavior, Sustainability, Marketing Communications, Emotions and Feelings \nDr. Feifei Huang received her PhD in Marketing from the Chinese University of Hong Kong. Her research interests are in the area of consumer behavior. Her recent work focuses on when and how consumers behave in a sustainable way, how consumers react to various marketing communication tactics, and the influence of emotions and feelings on consumption. Her research has been published in the Journal of Consumer Research, Journal of Marketing Research, and Journal of Consumer Psychology.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-feifei-huang"
 },
 {
  "text": "M1010 \n+852 3400 3952 \nfine.leung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Marketing Strategy, Customer Relationships, Influencer Marketing, Services Marketing \nBachelor of Commerce, University of British Columbia\nMaster of Business Administration, Harvard University\nDoctor of Philosophy, The University of Hong Kong\nDr. Fine F. Leung received her PhD degree in Marketing from the University of Hong Kong. Prior to her doctorate studies, she obtained a MBA degree from Harvard Business School as well as a Bachelor of Commerce degree from University of British Columbia. Her core research interest is in marketing strategy, with a focus on research topics relating to customer relationship management, influencer mark ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-fine-leung"
 },
 {
  "text": "Ren Li holds a PhD in Social, Decision Making, and Organizational Science at the University of Maryland, College Park, and an MA in clinical psychology from Columbia University. Her research spans two areas: 1) conflict management in teams; 2) understanding social and gender norms in organizations. The key goals of her research are to broaden theory on these topics as well as offer organizational applications for managing conflict, addressing gender inequality, motivating employees’ desirable behaviors, and bridging cross-cultural differences. She has published in top academic outlets, including Psychological Science, Journal of Experimental Social Psychology, and Journal of Consumer Psychology.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-ren-li"
 },
 {
  "text": "Dr Yijing Li received her PhD in Information Systems from the University of New South Wales (UNSW). Her research focuses on business analytics, computer vision, social media, and crowd platforms. Her current work aims to understand the diffusion mechanisms, business value and social impact of digital content. Particularly, she is interested in discovering how content consumers respond to visual stimuli using various research methodologies such as experiments, deep learning, computer vision, network analysis, and econometrics.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-yijing-li"
 },
 {
  "text": "M930 \n+852 3400 3923 \nkatrina.lin@polyu.edu.hk \nConsulting, Research and Teaching Interests: Helping Behaviours, Social Support, Interpersonal Relationships, Emotions, Work-family Issues \nDoctor of Philosophy, National University of Singapore\nKatrina received her MSc degree in Work and Organizational Psychology, and her PhD degree in Organizational Behavior. Her research focuses on how co-worker social interaction, especially helping interaction, influences employees’ performance and psychological well-being. Her work on co-worker helping interaction has been published in outlets including the Academy of Management Journal, Journal of Applied Psychology, and Organizational Behavior and Human Decision Processes. She is currently serving on the editorial review boards of the Journal of Managerial Psychology and Management and Organization Review. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-katrina-lin"
 },
 {
  "text": "Dr. Boris Ng is an Assistant Professor - Presidential Young Scholar in the Department of Management and Marketing, Faculty of Business, Hong Kong Polytechnic University. He received his Ph.D. in Information Systems from the Hong Kong University of Science and Technology.\nHis works bridge multidisciplinary research areas and advanced machine learning methods to resolve significant societal issues and generate valuable business insights. His research contributes to the sustainable development of AI in business and FinTech. Specifically, his studies on strategic manipulation in machine learning, computerized textual analysis of fake news, and behavioral aspects of cybersecurity offer theoretical and practical implications to academia, institutions, and policymakers that are pivotal to promoting the social and corporate governance aspects of ESG. His research has appeared in leading business journals, such as Production and Operations Management and Journal of Management Information Systems, and top conferences on Information Systems.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-boris--ng"
 },
 {
  "text": "M935 \n+852 2766 7357 \nqin-yu.wang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Innovation, Entrepreneurship, Knowledge Management, Intellectual Property Management \nDr Qinyu (Ryan) Wang obtained his PhD in strategic management from the University of Hong Kong (HKU). He also received MEcon and BBA from HKU. His research interests include open innovation, technology, and entrepreneurship. Dr Wang’s current line of research focuses on how institutions such as IPRs shape innovation landscapes. His work has been published in Strategic Management Journal. Before his doctoral studies, Ryan has been a teaching assistant for two entrepreneurship courses in HKU for two years.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-qinyu-ryan-wang"
 },
 {
  "text": "Dr Bicheng YANG\nAssistant Professor; Presidential Young Scholar \nResearch Area: Marketing\nM1013 \n+852 3400 2120 \nbicheng.yang@polyu.edu.hk \nConsulting, Research and Teaching Interests: Incentives, Salesforce Management, Advertising, Pricing \nI am an Assistant Professor of Marketing at the Hong Kong Polytechnic University. I obtained my PhD in Marketing from the Olin Business School, Washington University in St. Louis in 2017. \nMy research focuses on the incentives of employees and consumers, and the design of incentive mechanism to improve firm performance and social welfare.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-bicheng-yang"
 },
 {
  "text": "PhD in Organizational Behavior/Human Resource Management, University of Maryland; M.B.A./M.S. in Business Administation, Renmin University of China; B.S. in Tourism Management, Sun Yat-sen University.\nRujiao Helene Cao received her PhD degree in Organizational Behavior /Human Resource Management at University of Maryland, College Park. Her research is centered around the question of what promotes (or inhibits) employee prosocial and proactive behavior. There are two core streams in her research that shed light on the antecedents and psychological processes of prosocial and proactive behavior. The first stream of her research examines the role of boundaries in the workplace (i.e., physical and social) in influencing prosocial and proactive behavior. Her second stream of research emphasizes the emotional processes underlying prosocial and proactive behavior.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-rujiao-cao"
 },
 {
  "text": "M905 \n+852 2766 7376 \nqi-thomas.zhu@polyu.edu.hk \nConsulting, Research and Teaching Interests: Corporate governance, Strategic leadership, M&A, Innovation \nBachelor of Engineering, Tongji University\nMaster of Science, Fudan University\nDoctor of Philosophy, Arizona State University\nQi received his PhD degree in strategic management from Arizona State University. He is examining how executives affect strategies, such as M&A, strategic change, and the creation of impactful patents. He is also exploring how directors effectively monitor executives and how investors with enhanced power over organizations play their roles in strategic leadership and corporate governance. His articles are published at Strategic Management Journal and Asia Pacific Journal of Management.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-zhu-qi"
 },
 {
  "text": "M1022 \n+852 3400 3925 \nmannok.wong@polyu.edu.hk \nConsulting, Research and Teaching Interests: Pay Communication, Leadership, Interpersonal Processes, Research Methods \nBiography\nMan-Nok Wong is an Assistant Professor in the Department of Management and Marketing, Faculty of Business, Hong Kong Polytechnic University. He received his Ph.D. in Management from the Hong Kong Baptist University. He studies teams and organizations with a focus on pay communication, leadership, and interpersonal processes. His research has been published in the Academy of Management Journal, Journal of Applied Psychology and Organizational Research Methods, and has been featured in Harvard Business Review, The New York Times, Daily Mail (UK) and Business Insider. He is also an author of the web-based shiny app SRM_R for social relations analyses. He provides training and consulting services to various organizations ranging from startups to Fortune 500.\nBachelor of Science in Computing, The Hong Kong Polytechnic University\nBachelor of Business Administration in Management, The Hong Kong Polytechnic University\nDoctor of Philosophy, Hong Kong Baptist University\nTeaching Area\nResearch Interests\npay communication, leadership, interpersonal processes, research methods \nMan-Nok Wong is an Assistant Professor in the Department of Management and Marketing at the Hong Kong Polytechnic University (PolyU). Before joining PolyU, he worked as an Assistant Professor in the School of Business at the Sun Yat-sen University. He received his Ph.D. in Management from the Hong Kong Baptist University. He studies teams and organizations with a focus on pay communication, leadership, and interpersonal processes. His research has been published in the Academy of Management Journal, Journal of Applied Psychology and Organizational Research Methods, and has been featured in Harvard Business Review, The New York Times, Daily Mail (UK) and Business Insider. He is also an author of the web-based shiny app SRM_R for social relations analyses. He provides training and consulting services to various organizations ranging from startups to Fortune 500.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-man-nok-wong"
 },
 {
  "text": "Dr Chun Fong LEI\nResearch Assistant Professor \nM934 \n+852 2766 4059 \nchun-fong.lei@polyu.edu.hk \nConsulting: Technostress, Green IT/IS, Blockchain, Shared Economy, IS User Behavior; IoT and AI Methods and Applications \nDr Chun Fong LEI is a research assistant professor in the Department of Management & Marketing, PolyU. His research interests are in the areas of Technostress, Green IT/IS, Blockchain, Shared Economy, IS User Behavior; IoT and AI Methods and Applications. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-chun-fong-lei"
 },
 {
  "text": "Biography\nMPhil (University of California, Santa Barbara); PhD (HK PolyU) \nDr Yijie Wang received her Master degree in Economics at University of California, Santa Barbara and BBA degree in Accounting and Finance at University of Iowa. She completed her PhD degree in Marketing at the Hong Kong Polytechnic University in 2021.\nDr Wang’s main research interest is to understand the role of social influence in consumption. In particular, her research aims to understand consumers’ decision-making process in joint consumption. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-jessie-wang"
 },
 {
  "text": "Dr Tak-way David WONG\nResearch Assistant Professor \nResearch Area: Management Information Systems\nM1025 \n+852 2766 7339 \ntw-david.wong@polyu.edu.hk \nConsulting, Research and Teaching Interests: Management Information Systems, Supply Chain Innovation \nBiography\nPhD (PolyU), MBA Distinction (PolyU), BSc (PolyU)\nDr David T.W. Wong is a Research Assistant Professor (MIS) at the Department of Management and Marketing. He received his Bachelor degree, an MBA (Distinction), and PhD. from Hong Kong Polytechnic University. Prior to joining the Hong Kong Polytechnic University, Dr Wong has substantial teaching experience in other tertiary institution in Hong Kong and over 16 years of marketing experience in various international sourcing companies in Hong Kong.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-tak-way-david-wong"
 },
 {
  "text": "Dr Hao YING\nResearch Assistant Professor \nResearch Area: Management Information Systems\nM508 \n+852 2766 4087 \nConsulting, Research and Teaching Interests: Platform Economy, FinTech, Corporate Social Responsibility, Economics of IT \nHao Ying recieved his PhD in Decision Sciences and Managerial Economics from the Chinese University of Hong Kong. His research mainly focuses on Platform Economy, FinTech, and Corporate Social Responsibility. Hao's research has been published in Journal of the Association for Information Systems and Decision Support Systems.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-hao-ying"
 },
 {
  "text": "Dr Jianhua Jordan YU\nResearch Assistant Professor \nM501E \n+852 3400 3949 \njianhua.yu@polyu.edu.hk \nConsulting, Research and Teaching Interests: E-Health, Mobile Technology Design and Usage, AI Application and Management, Digital Commerce \nDr Jianhua (Jordan) Yu received his PhD in Information Systems from City University of Hong Kong. His research interests lie in e-health, applications of blockchain and artificial intelligence (AI), and mobile technology design and usage in diverse areas such as digital commerce and virtual teams.",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-jordan-yu"
 },
 {
  "text": "Dr Pun Zee Pamsy HUI\nSenior Teaching Fellow and Associate Head of Department \nM940 \n+852 2766 7394 \npamsy.hui@polyu.edu.hk \nConsulting, Research and Teaching Interests: Responsible Management Education, International Management, Inter-Organizational Relationships \nBachelor of Arts, University of California\nDoctor of Philosophy, The University of Texas at Austin",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-pamsy-hui"
 },
 {
  "text": "Dr Sung Yan Hazel LEE\nTeaching Fellow; Assistant Dean (Student Development) \nM1032 \n+852 2766 4058 \nhazelsy.lee@polyu.edu.hk \nConsulting, Research and Teaching Interests: Strategic Management, Innovation, Social Innovation, Social Enterprises, Social Entrepreneurship \nDiploma, The Associated Board of the Royal Schools of Music\nBachelor of Music, University of Wales\nMaster of Science, University of the West of England\nDoctor of Philosophy, University of the West of England\nHazel has published in the Journal of Business Ethics and also in the Group & Organization Management journal as a principle author. She received her PhD in Strategy and Innovation as a scholarship holder and also achieved her MSc in International Management at the Bristol Business School, University of the West of England. Hazel has worked with the Royal Bank of Scotland on the Social Enterprise SE100 Index as part of her doctoral thesis The Role of Relationships in Creating Dynamic Capabilities for Social Innovation: The Case of Social Enterprises. Her research foci has since been social innovation, strategic management and social enterprises, primarily in the UK and EU.Her teaching interests lie in strategic management, innovation and social innovation, social enterprises, and research philosophy and methodology. Prior to achieving her post-graduate studies, Hazel graduated as a scholarship holder with a First Class Final Recital from the Royal Welsh College of Music and Drama (UK) as a professionally trained pianist. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-hazel-lee"
 },
 {
  "text": "Dr Chi Hong LEUNG\nM912 \n+852 3400 3650 \nchi-hong.leung@polyu.edu.hk \nConsulting, Research and Teaching Interests: Natural Language Processing, IT in Education, E-commerce, Consumer Attitudes \nBachelor of Science, The Chinese University of Hong Kong\nMaster of Educational Studies, The University of Western Australia\nMaster of Business Administration, University of Leicester\nMaster of Philosophy, The Chinese University of Hong Kong\nDoctor of Business Administration, The University of Newcastle\nDoctor of Philosophy, The Chinese University of Hong Kong\nLeung Chi-hong graduated from the Department of Biology at the Chinese University of Hong Kong. Then he studied in the Department of Computer Science and Engineering at the same university and was awarded an MPhil degree and a PhD degree respectively. He also obtained his MBA from the University of Leicester, MEdSt from the University of Western Australia, and DBA from the University of Newcastle. Consistent with the academic background, his working experience covers several disciplines. He was responsible for a research project in the Faculty of Engineering at Hong Kong University (1996 – 1999). Then, he taught in the Faculty of Education at the Chinese University of Hong Kong (1999 – 2003) and worked as a project fellow in the Faculty of Business at Hong Kong Polytechnic University (2003 – 2004). In recent years, before joining the Department, he worked in the Education Bureau to monitor the progress of Government-funded projects in Hong Kong primary and secondary schools. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-leung-chi-hong"
 },
 {
  "text": "Dr Hon Ying Pansy LI\nM1024 \n+852 3400 3950 \npansyhy.li@polyu.edu.hk \nConsulting, Research and Teaching Interests: Entrepreneurship, Business Sustainability, Social Networks, Corporate Social Responsibility and Longitudinal Methodology \nBachelor of Arts, The Chinese University of Hong Kong\nMaster of Science in International Management, University of Exeter\nMaster of Philosophy, The Chinese University of Hong Kong\nDoctor of Philosophy, The Hong Kong Polytechnic University\nPansy has worked in the field of higher education since 2004, serving as Programme Manager, Instructor, Project Manager and Post-doctoral Fellow in various institutions. Her research focuses are on entrepreneurship, social networks, business sustainability and corporate social responsibility. She is now working on a research handbook on business sustainability and longitudinal research projects on entrepreneurs’ social networks and corporate environmental management. She is a co-investigator of the GRF’s project “Assessing Ecological Modernization in China: A Longitudinal and Comparative Study of Stakeholder Demands and Corporate Environmental Management Practices” (2012/13). \nPansy teaches subjects on Corporate Social Responsibility, Environmental Management for Business and China Business Management in 2012/13. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-pansy-hon-ying-li"
 },
 {
  "text": "Prof. Lap Kwong David KO\nProfessor of Practice (Marketing) \nM938 \n+852 3400 3644 \ndave.ko@polyu.edu.hk \nConsulting, Research and Teaching Interests: Business Strategies, Chinese Family Business, Online WOM Advertising, Consultancy on Outdoor Advertising, Quality Assurance, Factory Audit,Sales Training on B to B Marketing, Fast Food and Supermarket Management, Product Inspection and Certification via ISO 9000, ISO 14000, SA 8000, TQM, Product Review – Safety and Reliability, Import and Export \nDoctor of Business Administration, The Hong Kong Polytechnic University\nProfessional Qualifications\nFellow of the Institute of Quality Assurance\nMembers from The Hong Kong Institute of Marketing 2020-2021\nmemebers from The Chartered Institute of Marketing (CIM-UK) 2019-2020\nDavid received his DBA from The Hong Kong Polytechnic University. He has a M.Sc. degree in International Business, a BBA degree from the Chinese University of Hong Kong, and has a MBA degree from The Hong Kong Baptist University. His research foci have been business strategies, technology strategies in Chinese Family Business, Online word of mouth advertising and Density Forecasting in Tourism Industry. He has published in the Asia Pacific Journal of Management, International Journal of advertising and Annals of Tourism Research. Apart from academic research, he has served as a consultant to various companies, such as Oriental Trading Company (USA) and Intertek Testing Companies (UK). David teaches subjects on Global Marketing, Product Management, B to B Marketing, Sales Management, Marketing Communication, Introduction to Marketing. Prior to his post-graduate studies, David worked in the testing industry as quality and marketing director. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-dave-ko"
 },
 {
  "text": "Dr Cheuk-hung Kenneth WONG (黃卓雄 博士)\nGeneral Manager, MICE & Cruise, Hong Kong Tourism Board (香港旅遊發展局 會議展覽及郵輪業務 總經理) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-cheuk-hung-kenneth-wong"
 },
 {
  "text": "Ir Prof. T.C. Edwin CHENG (鄭大昭 教授)\nFung Yiu King – Wing Hang Bank Professor in Business Administration, Chair Professor of Management and Dean, Faculty of Business (PolyU) (香港理工大學 工商管理學院院長, 馮堯敬–永亨銀行工商管理教授 及 管理學講座教授) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/ir-prof-tc-edwin-cheng"
 },
 {
  "text": "Mr Ben WONG (黄介中 先生)\nChief Marketing Officer Google Greater China (Google 大中華區 首席市場官) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/mr-ben-wong"
 },
 {
  "text": "Dr Angela NG (吳惠容 博士)\nFounder Chung Tai Printing (China) Company Limited (中大印刷（中國）有限公司 創辦人) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-angela-ng"
 },
 {
  "text": "Dr Tina AU-YEUNG 歐陽美歡 博士\nGroup Chief Human Resources Officer, Emperor Group (英皇集團 集團首席人力資源總監) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-tina-au-yeung"
 },
 {
  "text": "Dr John H.C. YEUNG, SBS, OBE, JP (楊顯中 博士, 太平紳士)\nManaging Director The Cross-Harbour (Holdings) Limited (港通控股有限公司 董事總經理) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-john-hc-yeung-sbs-obe-jp"
 },
 {
  "text": "Prof. Wu LIU (劉武 教授)\nProfessor and Head, Department Department of Management & Marketing (PolyU) (香港理工大學 管理及市場學系 系主任) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/prof-wu-liu"
 },
 {
  "text": "Mr Raymond CHEUNG 張立民 先生\nManaging Director, Credit Suisse AG Hong Kong Branch (瑞士信貸銀行股份有限公司香港分行 董事總經理) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/mr-raymond-cheung"
 },
 {
  "text": "Dr Fang Flora GU (顧芳 博士)\nAssociate Professor and Associate Head, Department of Management & Marketing (PolyU) (香港理工大學 管理及市場學系 副教授 及 副系主任) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-fang-flora-gu"
 },
 {
  "text": "Dr Pun Zee Pamsy HUI (許品斯 博士)\nSenior Teaching Fellow and Associate Head, Department of Management & Marketing (PolyU) (香港理工大學 管理及市場學系 高級專任導師 及 副系主任) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-pun-zee-pamsy-hui"
 },
 {
  "text": "Biography\nProf. Katherine White is currently Professor of Marketing and Behavioural Science at the Sauder School of Business, University of British Columbia, Canada. She is the Academic Director of the Peter P. Dhillon Centre for Business Ethics and she holds a professorship in Consumer Insights, Prosocial Consumption, and Sustainability. She teaches courses in consumer behaviour, consumer insights, social influence, marketing strategy, and sustainability/ social marketing at the undergraduate, graduate, and executive levels.\nProf. White was identified as an up-and-coming Young Scholar by the Marketing Science Institute and in 2015 she was honored as one of the top 5 Marketing Researchers in the world by the American Marketing Association. She is co-author of the leading Consumer Behaviour Textbook in Canada (Consumer Behaviour: Buying, Having, Being). She currently serves as Associate Editor for the Journal of Marketing Research and is on the editorial review boards of the Journal of Consumer Research and the Journal of Consumer Psychology. She is Editor of an upcoming special issue of the Journal of Association for Consumer Research called “The Prosocial Consumer.”\nProf. White has been the lead on various large-scale consumer behaviour-change projects with clients such as The City of Calgary, Lululemon, Health Canada, My Sustainable Canada, DDB Canada, BC Hydro, Big Rock Brewery, The United Way, and the SPCA, Celgene Health Care, and the Share, Repair, Reuse Initiative. She’s industry collaborations focus on shifting people towards various types of positive, sustainable behaviour change.",
  "url": "https://www.polyu.edu.hk/mm/people/visiting-professors/prof-katherine-white"
 },
 {
  "text": "Ms Yue CAO\nPhD Student \nConsulting, Research and Teaching Interests: Marketing \nBBA in Management Science, Nanjing Normal University\nMSc in Management, The University of Manchester\nYue CAO obtained her BBA in management science from Nanjing Normal University, and MSc in management from the University of Manchester. Under the supervision of Dr Fang Flora GU and Prof. Guoxin LI, she is pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Harbin Institute of Technology. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yue-cao"
 },
 {
  "text": "Dr Xin XU (徐鑫 博士)\nAssociate Professor, Department of Management & Marketing and Associate Dean (External Relations & Development), Faculty of Business (PolyU) (香港理工大學 管理及市場學系 副教授 及 工商管理學院 副院長 (外務及發展事務)) ",
  "url": "https://www.polyu.edu.hk/mm/people/departmental-advisory-committee/departmental-advisory-committee/dr-xin-xu"
 },
 {
  "text": "Mr Wuyang CHEN\nPhD Student \nConsulting, Research and Teaching Interests: Organizational Behavior \nBachelor, Applied Psychology, Guangzhou University\nMaster, Applied Psychology, Jinan University\nWuyang is currently pursuing his Doctor of Philosophy degree under the supervision of Dr Amy Y. OU and Prof. Wu LIU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-wuyang-chen"
 },
 {
  "text": "Ms Menglu DONG\nPhD Student \nConsulting, Research and Teaching Interests: Marketing \nBachelor, Management Sciences in Human Resource Management, Zhejiang University\nEcho has obtained her Bachelor degree from Zhejiang University. Under the supervision of Prof. Yuwei JIANG and Prof. Lili WANG, she is currently pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Zhejiang University. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-menglu-dong"
 },
 {
  "text": "M908 \n+852 2766 7359 \njaegoo.lim@polyu.edu.hk \nConsulting, Research and Teaching Interests: Influence of Institutional Environment, Corporate Political Activity, Corporate Social Responsibility, Firm Reputation, Top Executives \nBachelor of Business Administration, Seoul National University\nMaster of Science in Business Administration, Seoul National University\nDoctor of Philosophy in Business Administration, University of Illinois at Urbana-Champaign\nJaegoo received his MS degree in business administration and his PhD degree in organizational theory. His research focuses on the interaction between the institutional environment and corporate nonmarket activity and the formation of social evaluations of corporations such as firm reputation and social responsibility. His research on CEOs impact of corporate reputation is forthcoming in Academy of Management Journal. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-jaegoo-lim"
 },
 {
  "text": "Ms Zihan Alexis CHEN\nPhD Student \nConsulting, Research and Teaching Interests: Social Interaction \nBachelor degree in Economics, Beijing Institute of Technology\nAlexis has graduated from Beijing Institute of Technology in Economics and is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Yue Katherine FENG and Prof. Wai Ting Eric NGAI. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-zihan-alexis-chen"
 },
 {
  "text": "Ms Di FU\nConsulting, Research and Teaching Interests: Quantitative Marketing \nBachelor of Engineering, Xiamen University\nMaster of Economics, Shanghai University of Finance and Economics\nShe is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Xubing ZHANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-di-fu"
 },
 {
  "text": "Ms Chang GAO\nConsulting, Research and Teaching Interests: Management Information Systems \nBachelor, International Hospitality Management, Ecole Hoteliere de Lausanne\nMSc, Applied Data Analytics, Boston University\nChang obtained her bachelor’s degree at Ecole Hoteliere de Lausanne in Switzerland and her master’s degree at the Boston University in the United States. She is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Xin XU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-chang-gao"
 },
 {
  "text": "Ms Yi Angela GAO\nConsulting, Research and Teaching Interests: Influencer Marketing, Live Streaming \nBBA in Management, Dongbei University of Finance and Economics\nMaster of Economics, The University of Hong Kong\nAngela obtained her BBA in management from Dongbei University of Finance and Economics, MSc in economics from the University of Hong Kong, and MPhil degree in Marketing from the Hong Kong Polytechnic University. She is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Fang Flora GU and Dr Fine LEUNG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yi-angela-gao"
 },
 {
  "text": "Ms Xiaofei HU\nConsulting, Research and Teaching Interests: Organizational Behaviour \nBachelor in Management, Zhongnan University of Economics and Law\nBachelor in Economics, Zhongnan University of Economics and Law\nMaster in Management, Zhongnan University of Economics and Law\nXiaofei obtained her Bachelor of Management, Bachelor of Economics and Master of Management at Zhongnan University of Economics and Law. She is currently pursuing her Master of Philosophy degree under the supervision of Prof. Wu LIU, Dr Jia Katrina LIN. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-xiaofei-hu"
 },
 {
  "text": "Ms Jiahui HE\nConsulting, Research and Teaching Interests: Organizational Behavior \nBA, Human Resource Management, Zhejiang University\nJiahui obtained her bachelor’s degree in School of Management, Zhejiang University, majoring in human resource management. Under the supervision of Prof. Wu LIU and Prof. Xiao-Yun XIE, she is currently pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Zhejiang University. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-jiahui-he"
 },
 {
  "text": "Mr Yong HUANG\nConsulting, Research and Teaching Interests: Game Theory, Optimization, esp in Industrial Organization \nBachelor, Peking University\nDritise HUANG obtained his bachelor degree from Peking University. He is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Xin XU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-yong-huang"
 },
 {
  "text": "Mr Pengju HUO\nConsulting, Research and Teaching Interests: Public Administration \nBachelor, Grassland Science & Human Resources Management, Northeast Agricultural University\nMaster, Animal Production, Northeast Agricultural University\nUnder the supervision of Dr Xueyong Zhan and Prof. Jianing Mi, he is currently pursuing his PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Harbin Institute of Technology. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-pengju-huo"
 },
 {
  "text": "Ms Yehui LIU\nConsulting, Research and Teaching Interests: Consumer behaviour \nBachelor, German, International Economy and Trade, Nankai University\nMaster, Management of International Business, Renmin University of China\nKathy graduated from Nankai University with one Bachelor degree in literature and another Bachelor degree in Economics. She obtained her Master degree in Management from Renmin University of China. She is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Yuwei JIANG and Dr Shaobo LI. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yehui-liu"
 },
 {
  "text": "Ms Yuting PANG\nConsulting, Research and Teaching Interests: Marketing \nBBA in Marketing, Zhejiang University\nUnder the supervision of Dr Fangyuan Chen and Prof. Lili Wang, Rainie is currently pursuing her Doctor of Philosophy degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Zhejiang University. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yuting-pang"
 },
 {
  "text": "Mr Ce LIANG\nConsulting, Research and Teaching Interests: Consumer Behaviour \nBMgt, Nanjing University\nMSc, National University of Singapore\nCe holds a Bachelor of Management degree in Marketing from Nanjing University and a Master of Science degree in Management from National University of Singapore. He joined PolyU’s Marketing PhD program in 2020 with a focus on consumer behaviour under the supervision of Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-ce-liang"
 },
 {
  "text": "Ms Muxuan LYU\nConsulting, Research and Teaching Interests: Consumer behaviour \nBS in Psychology, University of Illinois Urbana-Champaign\nMA in Social Sciences, University of Chicago\nMuxuan obtained her Bachelor degree in Psychology from University of Illinois Urbana-Champaign and her Master degree in Social Sciences from the University of Chicago. She is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-muxuan-lyu"
 },
 {
  "text": "Ms Qianqian LIU\nConsulting, Research and Teaching Interests: Consumer Behavior \nBBA in Marketing, Shanghai University of Finance and Economics\nEsther has graduated from the Shanghai University of Finance and Economics in China and is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Yuwei JIANG and Dr Feifei HUANG. Her research topic is Consumer Behavior. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-qianqian-liu"
 },
 {
  "text": "Ms Diwan LI\nConsulting, Research and Teaching Interests: Organizational Behavior \nBachelor, Management in Administrative Management, Southwest University\nMSc, HRM, Wuhan University\nDiwan has obtained her Bachelor of Management degree in administrative management from Southwest University and Master of Management degree in HRM from Wuhan University. She is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Wu LIU and Dr Feng BAI. Her research topics include leadership and emotion. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-diwan-li"
 },
 {
  "text": "Ms Yinghao LIU\nConsulting, Research and Teaching Interests: Big Data Analytics, e-Healthcare \nBachelor, Information & Electronic Engineering, Zhejiang University\nMSc, Business Information Systems, City University of Hong Kong\nYinghao obtained her Bachelor Degree of Information & Electronic Engineering from Zhejiang University and Master Degree of Business Information Systems from City University of Hong Kong. She is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Xin XU and Dr Xiaowei MEI. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yinghao-liu"
 },
 {
  "text": "Mr Zhe Joe JING\nConsulting, Research and Teaching Interests: Management Information Systems \nBachelor in Engineering Management, Hohai University\nUnder the supervision of Dr Xin XU and Dr Yue GUO, he is currently pursuing her PhD degree in the Collaborative PhD Programme provided by the PolyU and SUSTech. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-zhe-joe-jing"
 },
 {
  "text": "Mr Pengyao SUN\nConsulting, Research and Teaching Interests: Marketing \nBA in Math, University of Wisconsin-Madison\nPengyao has graduated from University of Wisconsin-Madison and is currently pursuing his Doctor of Philosophy degree under the supervision of Dr Yue Katherine FENG and Dr Dai YAO. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-pengyao-sun"
 },
 {
  "text": "Ms Yutong SUN\nConsulting, Research and Teaching Interests: Organizational Behavior \nBachelor, Business Administration, Beijing Normal University\nMaster, Industrial Relations and Human Resources, University of Toronto\nYutong obtained her Bachelor of Management at Beijing Normal University, and Master of Industrial Relations and Human Resources at University of Toronto. She is currently pursuing her Doctor of Philosophy degree under the supervision of Dr. Melody ZHANG and Prof. Wu LIU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yutong-sun"
 },
 {
  "text": "Mr Aureliu SINDILA\nBusiness resilience, Strategic decision-making, Entrepreneurial judgment, Managerial cognition \nMaster of Development Policy, KDI School of Public Policy and Management\nAureliu has graduated from the Academy of Economic Studies, and from KDI School of Public Policy and Management in South Korea with master's degrees in International Business and Development Policy. He is currently pursuing his Doctor of Philosophy degree in Management under the supervision of Dr Xueyong ZHAN. His research area is centred on social enterprises and family firms in vulnerable regions. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-aureliu-sindila"
 },
 {
  "text": "Ms Jie Jane WANG\nConsulting, Research and Teaching Interests: Consumer Behaviour \nBachelor, Accounting, China University of Mining and Technology\nMaster, Marketing, Jiangnan University\nMPhil, Marketing, The Hong Kong Polytechnic University\nJane obtained her bachelor’s degree from China University of Mining and Technology and master’s degree from Jiangnan University. She is currently pursuing her Ph.D. degree under the supervision of Dr. Boyoun Grace CHAE and Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-jie-jane-wang"
 },
 {
  "text": "Ms Ziyi WANG\nConsulting, Research and Teaching Interests: Management Information Systems \nBachelor, Economics, The Chinese University of Hong Kong\nMaster, Economics, The Chinese University of Hong Kong\nWANG obtained her bachelor’s and master’s degree of economics both at the Chinese University of Hong Kong. She is now pursuing her Doctor of Philosophy degree under the supervision of Dr Xin XU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-ziyi-wang"
 },
 {
  "text": "Ms Wei WU\nBachelor, Medicine and Psychology, Peking University\nMaster, Applied Psychology, Peking University\nWei obtained her Bachelor of Medicine, Bachelor of Science in Psychology and Master of Applied Psychology at Peking University. She is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Wu LIU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-wei-wu"
 },
 {
  "text": "Ms Yuanyuan WU\nConsulting, Research and Teaching Interests: Management information systems, E-commerce, Fake news \nBA in Accounting, Nanchang University\nMA in Accounting, Nanchang University\nYuanyuan has obtained her bachelor degree and master degree from Nanchang University. Under the supervision of Prof. Wai Ting Eric NGAI and Prof. Chong WU, she is currently pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Harbin Institute of Technology. Her research interests include management information systems and e-commerce, and fake news on the Internet. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-yuanyuan-wu"
 },
 {
  "text": "Mr Yikai YANG\nConsulting, Research and Teaching Interests: Management Information Systems \nBachelor of Medicine in Public Health, Sichuan University\nYikai obtained his Bachelor Degree of Medicine in Public Health from Sichuan University. Under the supervision of Prof. Wai Ting Eric NGAI and Prof. Lei WANG, he is currently pursuing his PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Zhejiang University. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-yikai-yang"
 },
 {
  "text": "Ms Danyang ZHAO\nConsulting, Research and Teaching Interests: Interorganizational relationship, Strategic alliance, Social network embeddedness \nBA in School of Foreign Studies, Xi’an Jiaotong University\nDanyang ZHAO obtained her BA in School of Foreign Studies, Xi’an Jiaotong University. Under the supervision of Dr Fang Flora GU, Prof. Guijun ZHUANG and Dr Longwei WANG, she is pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Xi’an Jiaotong University. Her research interests include interorganizational relationship, strategic alliance and social network embeddedness. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-danyang-zhao"
 },
 {
  "text": "Ms Suyue Suki WANG\nMPhil Student \nResearch Area: Management Information System\nConsulting, Research and Teaching Interests: Management Information System \nBachelor, Public Finance, Zhongnan University of Economics and Law\nSuki obtained her Bachelor degree in Public Finance from Zhongnan University of Economics and Law. She is currently pursuing her Master of Philosophy degree under the supervision of Dr Xin XU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-suyue-suki-wang"
 },
 {
  "text": "Ms Xin LIU\nMPhil Student \nBSc in Management Science, Sun Yat-sen University\nMSc in Management, The University of Warwick\nXin obtained her Bachelor degree in Management Science from Sun Yat-sen University and her Master degree in Management from the University of Warwick. Xin is currently pursuing her Master of Philosophy degree under the supervision of Dr Boyoun Grace CHAE and Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-xin-liu"
 },
 {
  "text": "Ms Wen XIE\nConsulting, Research and Teaching Interests: Big Data, Digital Platform \nBachelor, Management, Beijing Technology and Business University\nMaster, Science, The Hong Kong Baptist University\nWen obtained her bachelor degree from Beijing Technology and Business University and master degree from Hong Kong Baptist University. She is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Xin XU and Prof. Wai Ting Eric NGAI. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-wen-xie"
 },
 {
  "text": "Ms Tianze ZHANG\nBachelor of Communication Studies, Northeastern University\nMaster of Marketing, The University of Hong Kong\nShe is currently pursuing her Doctor of Philosophy degree in consumer behaviour under the supervision of Dr Feifei Huang and Prof. Yuwei Jiang. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-tianze-zhang"
 },
 {
  "text": "Ms Manlin XIAO\nConsulting, Research and Teaching Interests: Public and Nonprofit Management \nBachelor, Cultural Industry Management, South China Normal University\nMA, Public Policy and Management, City University of Hong Kong\nManlin obtained her Bachelor of Cultural Industry Management degree from South China Normal University and Master of Public Policy and Management degree from City University of Hong Kong. She is currently pursuing her Doctor of Philosophy degree under the supervision of Dr Xueyong ZHAN. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-manlin-xiao"
 },
 {
  "text": "Mr Canquan LI\nMPhil Student \nConsulting, Research and Teaching Interests: Strategic Management, Corporate Governance \nBachelor, Economics, Sun Yat-sen University\nCanquan has graduated from Sun Yat-sen University in Economics and is currently pursuing his Master of Philosophy degree under the supervision of Dr Shuping LI and Dr Xueyong ZHAN. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-canquan-li"
 },
 {
  "text": "Ms Chengchen Sheryl LIU\nMPhil Student \nBachelor, Philosophy, Huazhong University of Science and Technology\nMaster, Management, Huazhong University of Science and Technology\nSheryl obtained her bachelor and master degrees from Huazhong University of Science and Technology. She is currently pursuing her Master of Philosophy degree in PolyU under the supervision of Dr Fangyuan CHEN and Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-chengchen-sheryl-liu"
 },
 {
  "text": "Ms Fei Katie XU\nConsulting, Research and Teaching Interests: Consumer Behaviour \nBA, French, Wuhan University\nBSc, International Business, NEOMA Business School\nMA, Management, EDHEC Business School\nMSc, Marketing Management, EDHEC Business School\nMPhil, Marketing, The Hong Kong Polytechnic University\nKatie obtained her BA in French from Wuhan University and BSc in International Business from NEOMA Business School, France. She also obtained two master’s degrees from EDHEC Business School, France. After obtaining a MPhil degree in PolyU, she is currently pursuing her PhD degree under the supervision of Prof. Yuwei JIANG. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-fei-katie-xu"
 },
 {
  "text": "Ms Xueying ZHAO\nConsulting, Research and Teaching Interests: Consumer Behaviour \nBachelor degree, Marketing, Shaanxi Normal University\nNancy has obtained her Bachelor degree from Shaanxi Normal University. Under the supervision of Prof. Yuwei JIANG and Prof. Xienyue ZHOU, she is currently pursuing her PhD degree in the Joint Program Leading to Dual Awards provided by the Hong Kong Polytechnic University and Zhejiang University. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-xueying-zhao"
 },
 {
  "text": "Mr Luman YU\nConsulting, Research and Teaching Interests: Strategic Management \nBEng, Vehicle Engineering, Tongji University\nMSc, Finance, University of Macau\nLuman obtained his Bachelor degree in Vehicle Engineering from Tongji University and his Master degree in Finance from the University of Macau. He is currently pursuing his Master of Philosophy degree under the supervision of Dr Shuping Li. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-luman-yu"
 },
 {
  "text": "Mr Xinhao YU\nConsulting, Research and Teaching Interests: Management \nBachelor of Business Administration, Accounting, Hong Kong Baptist University\nMaster in Applied Accounting & Finance, Hong Kong Baptist University\nXinhao has graduated from Hong Kong Baptist University with a bachelor degree in accounting and a master’s degree in Applied Accounting & Finance. He is currently pursing his Master of Philosophy degree in the Management area under the supervision of Dr Amy Yi, Ou. His research interests cover strategic HRM, entrepreneurship, strategic leadership and machine learning. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/mr-xinhao-yu"
 },
 {
  "text": "Ms Zhiqian ZHANG\nBechelor, Management, Sun Yat-sen University\nMaster, International Business, Southeast University\nMaster, International Business, Monash University\nShe is currently pursuing her Doctor of Philosophy degree under the supervision of Prof. Yuwei JIANG & Dr Shaobo LI. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-zhiqian-zhang"
 },
 {
  "text": "Ms Shimin Jessamine ZHANG\nBachelor, Human Resources Management, Zhejiang University\nMaster, Management, University College London\nJessamine has obtained her Bachelor degree from Zhejiang University and MSc degree from University College London. She is currently pursuing her Master of Philosophy degree under the supervision of Prof. Wu LIU. ",
  "url": "https://www.polyu.edu.hk/mm/people/research-students/ms-shimin-jessamine-zhang"
 },
 {
  "text": "Programme Application\nProgramme Guide",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management/admissions"
 },
 {
  "text": "Programme Application\nProgramme Guide\nNormal Year students\nFor student admitted in Senior Year place\n(^ for 2022/23 intake)\nTotal Credit Requirements\n120\n66*\nDiscipline-specific Requirements (DSR)\n90\n57\nBBA core subjects (^9 credits: double fulfillment)\n57^\n24\nSpecialist subjects\n33\n33\nFree Elective\n9\n0\nGeneral University Requirements (GUR)\n30\n9\nLanguage and Communication Requirements (LCR)\n(English: 6 credits + Chinese: 3 credits)\n9\nNot required if students have met the equivalent standard\nCluster-Area Requirements (CAR)\n12\n6\nLeadership and Intra-personal Development (LIPD)\nMM1051 Tango! Managing Self & Leading Others\n3\nNot required\nService-Learning (SL)\n3\n3\nFreshman Seminar\nFB1003, 1- Semester\n3\nNot required\nHealthy Lifestyle (non-credit bearing)\n0\nNot required\nSubject containing components on National Education, OTAI, AIDA and IE\nN/A\nNon-credit bearing subject^\nTraining credits (WIE)\n*Depending on an individual’s academic merits, the credits requirement for graduation is between 60 and 75.\nFor details of Programme Curriculum and Progression Pattern, please refer to the Programme Requirement Document.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management/programme-structure"
 },
 {
  "text": "Programme Application",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-management/student-resources"
 },
 {
  "text": "Credit Requirements\nCompulsory subjects:\ni) 5 core subjects\n15 credits\nii) Discipline-specific Company Attachment\nStudents to take the ‘Company Attachment’ subject offered by their Host Department\n6 credits\nSub-total\n21 credits\nElective subjects:\niii) IE electives\n6 credits in any areas of:\nAccounting and Finance\nInnovation and Technology Management\nManagement\nMarketing\n6 credits\niv) Discipline-specific electives\nStudents to take the Discipline-specific electives as prescribed by respective Block X offering Department\n6 credits\nv) General electives\n3 credits from ‘General electives’ or ‘IE electives’ or ‘Discipline-specific electives’\n3 credits\nSub-total\n15 credits\nTotal Credits Required\n36 credits\nStudents may count up to 12 credits of their Major/GUR subjects towards the Secondary Major. Nevertheless, students must take at least 12 credits from Secondary Major in IE in order to satisfy the residential requirement of the Secondary Major in IE. Students who have completed more than 12 credits of subjects that are eligible for double counting will need to apply for graduation and indicate the subjects intended for double counting. Notwithstanding the above, students must meet the minimum credit requirements of the “X + Secondary Major” concerned, i.e., 132 credits.\nSubject List\nSubject Code\nSubject Title\nOffering Dept\nCredits\nPre-requisite\nExclusion\nBlock-X \nOffering Dept\nCore (Compulsory subjects)\nMM2021\nManagement and Organisation\nMM\n\t\t\t\t\nLGT3161/\nMM3161\nCreativity, Innovation and Entrepreneurship\nLMS/ MM\n\t\t\nLGT3161 & MM3161 are mutually exclusive\nMM2901 or\nGBA Immersion\nMM\nMM2902\nMM2902\nField Study for Innovation Ecosystems\nMM\nMM2901\nMM3162\nInnovation and Entrepreneurship Colloquium\nMM\n\t\t\t\t\nMM4393\nBusiness Innovation Project\n\t\t\t\t\nCompulsory (Discipline-specific Company Attachment)\nStudents shall take the subject offered by their Host Dept \nABCT4118\nCompany Attachment\nABCT\n6\nLGT/MM3161\nABCT\nAMA4941\nCompany Attachment\nAMA\n6\nLGT/MM3161\nAMA\nAP40022\nCompany Attachment\nAP\n6\nLGT/MM3161\nAP\nAPSS3783\nCompany Attachment\nAPSS\nLGT/MM3161\nAPSS\nBME44262\nBME\nBME\nBRE4999\nBRE\nBRE\nBSE484\nBEEE\nBEEE\nHTM4366\nSHTM\nSHTM\nISE4018\nISE\nISE\nSFT4217G\nSFT\nSFT\nSD4003\nSD\nSD\nSO4050\nSO\nSO\nIE Electives (6 credits from any areas below)\nArea: Accounting and Finance\nAF3319\nEntrepreneurial Finance\nAF\n\t\t\t\t\nArea: Innovation and Technology Management\nBME34143\nMedTech Innovation and Entrepreneurship\nBME\nCOMP3531\nIT Entrepreneurship\nCOMP\nLGT4312\nManaging Innovation and Technology\nLMS\nMM3422\nBusiness Information Systems\nMM2422\nMM3451\nKnowledge Management\nMM4411\nE-Commerce for Management\nMM2421/\nMM3422\n\t\t\t\nArea: Management\nMM4191\nBusiness Negotiation\nMM2021\n\t\t\t\nMM4342\nGlobal Business Management\nMM2021\n\t\t\t\nMM4351\nEntrepreneurship\n\t\t\t\nMM4361\nSocial Innovation: Achieving Sustainable Development Goals through Business\nMM4392\nInnovation and Entrepreneurship Project\nMM4522\nChina Business Management\nMM4521\nArea: Marketing\nMM2711\nIntroduction to Marketing\nMM2BN05\nMM3842\nDigital Marketing\nMM2711/\nMM2BN05\nMM3841\nMM3851\nSocial Media Marketing\nMM2711/\nMM2BN05\nMM4772\nProduct Management\nMM2711/\nMM2BN05\nMM4771 & MM484\nMM4831\nStrategic Brand Management\nMM2711/\nDiscipline-specific electives (6 credits from the list below)\nStudents should take the Discipline-specific electives as prescribed by the Block X offering Department;\nStudents will normally take Company Attachment in the Summer Term, however, they may be allowed to take this subject in Semester One/Two if approval is obtained from the Block X offering Department. \nABCT3104\nCommercialization of Biotechnology Products\nABCT\nABCT4104\nRecent Developments in Medical Biotechnology\nABCT2103\nAMA3654\nSurvey Sampling\nAMA\nAMA2601\n/AMA2634 /AMA2634A/ AMA2691\nAMA264\nAPSS3234\nFinancial Planning and Management in Organizations\nAPSS\nAPSS331\nAPSS328\nProgramme Planning and Evaluation\nAPSS331\nAPSS331\nManagement in Human Services\nAPSS4511\nSocial Entrepreneurship and Enterprises\nAPSS4535\nSocial Innovation for Grand Challenges\nAPSS454\nLegal Aspects of Human Services\nAPSS/SO\nBME31147\nBiomedical Engineering Innovation for the Community\nBME21151\nBME34143\nMedTech Innovation and Entrepreneurship\nAP/BME\nBRE4291\nReal Estate Marketing\nBRE\nBRE465\nAsset Management\nBSE3515\nConstruction Management for Building Sciences and Engineering\nBEEE\nBSE4317\nFire Engineering Safety Management\nBSE3322\n(from 2022/23 cohort)\nBSE4417\nEnergy Efficient Buildings and Assessment\nBSE4419\nRenewable Energy and Smart Grid\nBSE5549\nBSE4512\nBuilding Aquaponics\nBSE3313 or equivalent\nBSE4513\nUrban Environments for Older Citizens\nBSE2215 & BSE2217\nBSE457\nFacility Management and the Workplace\nBSE3515 \n(from 2022/23 cohort)\nBSE458\nBuilding Performance Diagnosis and Management\nBSE3515\n(from 2022/23 cohort)\nCOMP3531\nIT Entrepreneurship\nCOMP\nENG4001\nProject Management\nISE\nAP/ISE\nHTM3227\nAttractions Management\nSHTM\nHTM4352\nIntegrated Resort and Gaming Management\nISE376\nEntrepreneurship and Innovation\nISE/SO\nISE430\nNew Product Planning and Development\nSFT328FB\nFashion Retail Buying\nSFT\nSFT329FB\nFashion Visual Merchandising\nSFT321FS\nEnvironment, Social, and Governance in Fashion Business\nSFT340E\nLuxury Fashion Marketing and Management\nSFT418E\nFashion Entrepreneurship Management\nSFT339E\nOmni-channel Marketing and Retailing\nMM4711\nBusiness to Business Marketing\nSD3272\nUser Studies Seminar\nSD\nSD3266\nSD4306\nDesign for Social and Culture Business\nSD4772\nInteractive Media and Marketing\nSO4044\nPractice Management\nSO\nGeneral Electives (3 credits from the list below)\nIncluding all IE electives\nIncluding all Discipline-specific electives\nABCT4107\nCase Study in Biotechnology Companies\nABCT2102\nABCT4708\nPrinciples of Quality Assurance\nABCT3113/\nABCT3747\nBSE449\nEnvironmental Economics and Policy\nBSE4511\nPrinciples of Ecological Design\nENGL3011\nContent Design for Social Media\nENGL\nENGL3029\nThe Language of Advertising\nENGL\nENGL3009\nENGL3031\nLanguage and Intercultural Communication for the Professions\nENGL\nENGL4004\nEffective Communication for Public Relations\nENGL\nHTM4352\nIntegrated Resort and Gaming Management\nHTM4354\nWine Studies\nHTM1C07\nHTM4356 &\nHTM4357\nInnovation and Entrepreneurship in Hospitality, Tourism and Events I & II\nHTM4356 before taking HTM4357\nHTM4360\nExperience Mapping in Hospitality, Tourism and Events\nHTM4361\nLuxury Management\nIt should be noticed that the offering of elective subjects is subject to staffing resources and student enrolment and not all elective subjects will be offered every single year.\nIndicative Progression Pattern\nSuggested Semester\nCode\nSubject\nCredit\nCompulsory(C)/\nElective(E)\nYear 2\n1 or 2\nManagement & Organization\nC\n1 or 2\nLGT3161/MM3161\nCreativity, Innovation & Entrepreneurship\nC\n2\nElective 1\nE\n2 or 3\n(This subject can be taken in Year 2 to 4, or as prescribed by the Block X Dept)\nC\n(Optional Summer Term)\nMM2901\nOr\nMM2902\nGBA Immersion\nOr\nField Study for Innovation Ecosystem\n(MM2901 and MM2902 are exclusions; this subject can be taken in Year 2 or 3)\nC\n9 to 18\nYear 3\n1\nMM3162\nInnovation and Entrepreneurship Colloquium\n1\nElective 2\nE\n1 or 2\nMM4393\nBusiness Innovation Project\n1 or 2 or 3\n(This subject can be taken in Year 2 to 4, or as prescribed by the Block X Dept)\n2 or 3\nMM2901\nGBA Immersion\n(This subject can be taken in Year 2 or 3)\n(Optional Summer Term)\nMM2902\nField Study for Innovation Ecosystem\n(MM2901 and MM2902 are exclusions; this subject can be taken in Year 2 or 3)\n9 to 18\nYear 4\n1\nElective 3\nE\n1\nElective 4\nE\n1 or 2\n(This subject can be taken in Year 2 to 4, or as prescribed by the Block X Dept)\n2\nElective 5\n9 to 15\nYear 2 to 4\nTotal\n36\nCompulsory subjects: 21 credits\nElective subjects: 15 credits\nRequirement on Elective subjects:\nIE Electives – any 6 credits from 18 designated IE-related subjects\nDiscipline-specific Electives – any 6 credits from electives prescribed by the respective Block X offering Department\nGeneral Electives – any 3 credits from IE Electives or Discipline-specific Electives or General Electives",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/secondary-major-in-innovation-and-entrepreneurship/programme-structure"
 },
 {
  "text": "Studying a Secondary Major is a free choice by students and not mandatory. Students must apply to and obtain approval from their Major programme offering Department (i.e., Block X), no later than the commencement of the second year of study, to be admitted to the Secondary Major. \nOnly students with a Cumulative GPA of 2.70 or above, and fufil other criteria (if any) required by Block X Department, may be considered for Secondary Major enrolment. Students must apply to and obtain approval from the programme offering Department, no later than the commencement of the second year of study, to be admitted to the Secondary Major.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/secondary-major-in-innovation-and-entrepreneurship/admissions"
 },
 {
  "text": "Programme Application",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-marketing/admissions"
 },
 {
  "text": "Normal Year students\nFor student admitted in Senior Year place\n(^ for 2022/23 intake)\nTotal Credit Requirements\n120\n66*\nDiscipline-specific Requirements (DSR)\n90\n57\nBBA core subjects (^9 credits: double fulfillment)\n57^\n24\nSpecialist subjects\n33\n33\nFree Elective\n9\n0\nGeneral University Requirements (GUR)\n30\nLanguage and Communication Requirements (LCR)\n(English: 6 credits + Chinese: 3 credits)\nNot required if students have met the equivalent standard\nCluster-Area Requirements (CAR)\n12\nLeadership and Intra-personal Development (LIPD)\nMM1051 Tango! Managing Self & Leading Others\nNot required\nService-Learning (SL)\nFreshman Seminar\nFB1003, 1- Semester\nHealthy Lifestyle (non-credit bearing)\n0\nSubject containing components on National Education, OTAI, AIDA and IE\nN/A\nNon-credit bearing subject^\nTraining credits (WIE)\n*Depending on an individual’s academic merits, the credits requirement for graduation is between 60 and 75.\nFor details of Programme Curriculum and Progression Pattern, please refer to the Programme Requirement Document.",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/bba-marketing/programme-structure"
 },
 {
  "text": "Please click here for more information. ",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-innovation-and-entrepreneurship/programme-structure"
 },
 {
  "text": "Please click here for more information. ",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-marketing/programme-structure"
 },
 {
  "text": "Please click here for more information. ",
  "url": "https://www.polyu.edu.hk/mm/study/undergraduate-programmes/minor-in-management/programme-structure"
 },
 {
  "text": "1 / 4\nCentre for Leadership & Innovation organized a Rhodes Scholar Presentation on “Toward knowledge obsolescence amongst scaffold ‘master’ craftsmen: the challenge of standardisation and occupational legitimacy” presented by Prof. Ken Kamoche, Professor of Human Resource Management and Organization Studies, University of Nottingham on 18 Apr 2023.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/polyucli-a-rhodes-scholar-presentation-by-prof-ken-kamoche"
 },
 {
  "text": "M908 \n+852 2766 7359 \njaegoo.lim@polyu.edu.hk \nConsulting, Research and Teaching Interests: Influence of Institutional Environment, Corporate Political Activity, Corporate Social Responsibility, Firm Reputation, Top Executives \nBachelor of Business Administration, Seoul National University\nMaster of Science in Business Administration, Seoul National University\nDoctor of Philosophy in Business Administration, University of Illinois at Urbana-Champaign\nJaegoo received his MS degree in business administration and his PhD degree in organizational theory. His research focuses on the interaction between the institutional environment and corporate nonmarket activity and the formation of social evaluations of corporations such as firm reputation and social responsibility. His research on CEOs impact of corporate reputation is forthcoming in Academy of Management Journal. ",
  "url": "https://www.polyu.edu.hk/mm/people/academic-staff/dr-jaegoo-lim"
 },
 {
  "text": "PolyU Taster Programme 2023\n1 / 3\nMM organized Taster Program 2023 on 15 April 2023.\nProf. Kin-keung Vincent LEUNG shared how to achieve human-centric improvement through empathy, and how empathy is key to Management and Marketing with a group of secondary school students.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/mm-polyu-taster-programme-2023"
 },
 {
  "text": "1 / 5\nMM organized an exclusive tour to Kadoorie Farm & Botanic Garden (KFBG) on 31 March 2023.\nWe are honoured to have Ms Josephine Wu, Head of Holistic Education of KBFG to give us a special introduction of KFBG from the sustainability perspective. KFBG raises awareness of ecological and environmental issues, undertake species conservation and ecosystem restoration in Hong Kong, mainland China, Cambodia and Laos, reconnect people with nature and promote sustainable lifestyles.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/tour-to-kadoorie-farm-botanic-garden"
 },
 {
  "text": "1 / 1\nOur MSc Program in Human Resource Management aims to develop ethical and competent people managers. We balance academic rigor and practicality in designing courses to sharpen students' managerial competencies, strategic decision-making and leadership skills. Outside of the classrooms, we provide students with career development and professional networking opportunities.\nFurther information about the program can be found here.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/msc-in-human-resource-management-admission-2023-24"
 },
 {
  "text": "Prof. Yuwei JIANG has been recognised for the second time as one of the Top 50 Most Productive Marketing Scholars in the World. According to the American Marketing Association DocSIG Research Productivity Report, Prof. Jiang now ranks 22nd, a significant increase from his previous position of 42nd last year. He now holds the top spot in Asia.\nProf. Jiang’s achievement is based on the number of times his research has been published in the premier marketing journals: Journal of Consumer Research, Journal of Marketing Research, Journal of Marketing, and Marketing Science, in the ten-year period from 2013 to 2022, as calculated by the American Marketing Association. This recognition is widely regarded as the most prestigious acknowledgement of research productivity that a marketing scholar can receive.\nReference:\nhttps://www.ama.org/research-productivity-report/?msclkid=07e17ab8b97f11ec9acb4324d23aeed8",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/top-50-most-productive-marketing-scholars"
 },
 {
  "text": "1 / 1\nWe will host the new Secondary Major in Innovation and Entrepreneurship (IE).\nThis Secondary Major curriculum takes a cross-disciplinary approach that aims to instil in students from different disciplines the spirit and mindset of innovation and entrepreneurship, whether it is applied to the commercialisation of technologies specifically or to problem solving in general. Through the cross-disciplinary design, students are equipped with knowledge and techniques critical to the analysing, planning, and implementing of financially-viable and technically-feasible innovation and ventures. Students are provided with hands-on experience in innovative and entrepreneurial activities.\nMore information about the program can be found here.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/new-secondary-major-in-innovation-and-entrepreneurship"
 },
 {
  "text": "According to Research.com, PolyU is ranked 4th among the world’s best universities for Business and Management and 1st in the university rankings for China, with a total D-index score of 864, a mean h-index score of 61.71, 14 scholars in the area of Business and Management, and 4,023 publications.\nThe top scientists in the Business and Management rankings include Professor Eric Wai-ting Ngai (World: 99; China: 7). The Psychology rankings include Professor Michael Bond (World: 414; China: 1).\nThe rankings are based on a detailed examination of 166,880 researcher profiles from a consolidated set of bibliometric data sources including OpenAlex and Crossref on 21 December, 2022. The position in the rankings is based on the sum of the D-index (Discipline H-index) scores of all leading scholars affiliated with that university for an examined discipline. For the Business and Management discipline, over 7,819 profiles and scientists from more than 554 institutions and affiliations were analysed.\nPlease follow the link for details of the rankings: https://research.com/university/business-and-management/the-hong-kong-polytechnic-university.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/4th-in-the-best-business-and-management-university-rankings"
 },
 {
  "text": "The enhanced three-level Outstanding PolyU Alumni Award (OPAA) introduced last year has achieved a great success. The Department of Management and Marketing (MM) is pleased to announce that the new round of departmental OPAA 2023 is now calling for nominations until 31 March 2023 (Friday).\nThe departmental OPAA aims to publicly recognise outstanding graduates of MM for their professional achievements and significant contributions to the community and their alma mater. The departmental awardees will be nominated for the Faculty Awards or above.\nEligibility\nThe nominated candidate must be a bona fide graduate who has successfully completed the full-time or part-time programme offered by PolyU (or its forerunners: Hong Kong Government Trade School, Hong Kong Technical College, Hong Kong Polytechnic; and its constituent units: School of Professional Education & Executive Development and Hong Kong Community College) which led to academic award accredited by the respective Institution.\nThe proposer can be a PolyU graduate, Honorary Graduate, University Fellow, PolyU staff, current PolyU Council and Court member and current Advisory Committee member. There is no limit to the number of nominations to be submitted by each proposer. However, the proposer cannot be the candidate himself/ herself or a direct relative of the candidate.\nAward Categories and Selection Criteria\nIn addition to honouring distinguished graduates for their distinction in their chosen fields, the Award recognises the alumni’s active support to their alma mater. Support and Contribution to PolyU is one of the key selection criteria at all levels.\nFour specific areas of achievement would be given recognition, they include Professional Achievement, Entrepreneurial Achievement, Scholarly Achievement and Community Service Achievement.\nOutstanding Young Alumni Award is introduced for alumni at/under the age of 40.\nAward Category Description \nProfessional Achievement\tThis category recognises alumni who have attained distinguished achievements, demonstrated exemplary leadership, and made a strong impact on their profession/ industry/ society.\t\nEntrepreneurial Achievement\tThis category recognises alumni who have demonstrated outstanding innovation and entrepreneurship, as well as founded or advanced business or technology ventures with impact.\t\nScholarly Achievement\tThis category recognises alumni scholars who have made notable scholarly or research contributions in their disciplines, with proven track record and excellent reputation in the field.\t\nCommunity Service Achievement\tThis category recognises alumni who have made impactful contributions to the communities, or demonstrated an extraordinary level of commitment, volunteerism and/or philanthropy for promoting the wellbeing of the communities.\t\nNotes: The bestowal of the award shall subject to individual merits of the candidates. No award shall be given out in a certain category if no suitable candidate is identified.\nNomination and Selection Schedule\nThe nomination form could be downloaded here. Please return the completed form to mm.notice@polyu.edu.hk with all required supplementary documents (such as a current curriculum vitae of the nominee and two written references) on or before 31 March 2023.\nSelection Committee and Result Announcement\nSelection Committee will examine the nominations and assess candidates’ qualifications and performance for the awards. The result will be announced in early May.\nConfidentiality\nAll information submitted on this nomination form will be kept strictly confidential and will only be used by the Selection Committee for the purpose of the selection process. The candidate will not be contacted by the OPAA Secretariat until he/she is selected as the awardee of the Outstanding PolyU Alumni Award.\nThe Hong Kong Polytechnic University\nEmail: mm.notice@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/call-for-nominations-outstanding-alumni-award-2023"
 },
 {
  "text": "Professional Networking Reception\n1 / 5\nMM organized a Professional Networking Reception in Hotel ICON on 3 March 2023 .\nThis is a special occasion for MSc students to network with industry professionals from different sectors to help them jumpstart their career development. ",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/professional-networking-reception"
 },
 {
  "text": "PolyU-CLI: A Rhodes Scholar Presentation by Prof. Ken Kamoche\nYou are invited to attend the PolyU-CLI: A Rhodes Scholar Presentation on “Toward knowledge obsolescence amongst scaffold ‘master’ craftsmen: the challenge of standardisation and occupational legitimacy” presented by Prof. Ken Kamoche, Professor of Human Resource Management and Organization Studies, University of Nottingham on 18 Apr 2023.\nDate* : 18 Apr 2023 (Tuesday)\nTime* : 2:30 – 4:30 pm\n*Hong Kong Time\nVenue : Senate Room (M1603), PolyU Campus\nLanguage: English\nPlease refer to the flyer for details.\nTo register, please click the registration link and input your information on and before 13 Apr 2023 (Thu).\nYou are welcome to disseminate the information to colleagues and friends who might be interested.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/polyu-cli-a-rhodes-scholar-presentation-by-prof-ken-kamoche"
 },
 {
  "text": "PolyU Taster Programme 2023\n1 / 1\nMM will hold a PolyU Taster Programme 2023 on 15 April 2023.\nDate*: 15 Apr 2023 (Saturday)\nTime*: 2 to 5 pm (Registration at 1:45 pm*)\n*Hong Kong Time\nVenue: PolyU Campus\nNumber of places: 100\nProgramme fee: HKD50 (Refundable deposit)\nMedium of Instruction: Cantonese\nTarget participants: Secondary 4 and 5 students who are interested in business disciplines\nFor enrollment, please click here and input your information on and before 12 Mar 2023.\nFurther information can be found here.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/polyu-taster-programme-2023"
 },
 {
  "text": "1 / 4\nMM organized a Networking and Dining Etiquette Workshop for MSc students at Bistro 1979 in Hotel ICON on 25 February 2023.\nNetworking etiquette and table manner are important to students' professional image and career positioning. Proper etiquette plays an essential part in making a favourable impression.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/networking-and-dining-etiquette-workshop"
 },
 {
  "text": "Student-Alumni Networking Dinner\n1 / 5\nMM organized a Student-Alumni Networking Dinner in Hotel ICON on 24 February 2023.\nStudents learned about how to plan their career and build up their professional network. We are happy to welcome back a group of accomplished young alumni of MM to share their experiences. ",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/student-alumni-networking-dinner"
 },
 {
  "text": "1 / 2\nMM organized an exclusive tour to Hong Kong Palace Museum (HKPM) on 23 February 2023.\nWe are honoured to have Mr. Brian Yuen, Deputy Director (Museum Operations) of HKPM to give our MSc students a special introduction of HKPM from business perspective. ",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2023/tour-to-hong-kong-palace-museum"
 },
 {
  "text": "To celebrate the 85th Anniversary of The Hong Kong Polytechnic University, our department has organized the Conference - \"Managing Innovation in the Digital Era\" successfully on 4 Nov 2022 (Fri).\nThis conference has brought cutting-edge knowledge from both academia and business world to generate new ideas and best practices on innovation, leadership, and digital marketing. Speakers from Cathay Pacific Airways, Google, Carousell, Cloudbreakr, Wedo Global and PolyU MM delivered keynote speeches on innovation & branding in the morning session, and innovation & business opportunities in the afternoon session. Panel discussions were followed to facilitate exchanges of viewpoints among speakers and participants.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2022/polyu-85th-anniversary-conference"
 },
 {
  "text": "PolyU-ACBM International Management Seminar by Mr Maxime Engels-Deutsch\nYou are invited to attend the PolyU-ACBM International Management Seminar on “Automotive Marketing Today - Discussing business implications of a changing industry” presented by Mr Maxime Engels-Deutsch on 7 Nov 2022.\nDate* : 7 Nov 2022 (Monday)\nTime* : 6:30 pm\n*Hong Kong Time\nVenue : Hybrid – QR504, PolyU & Online via Zoom\nLanguage: English\nPlease refer to the flyer for details.\nTo register, please click the registration link and input your information.\nYou are welcome to disseminate the information to colleagues and friends who might be interested.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2022/polyu-acbm-international-management-seminar-by-mr-maxime-engels-deutsch"
 },
 {
  "text": "Prof. Michael Harris BOND, Prof. Wai Ting Eric NGAI and Dr Wing Sing Vincent CHO rank among the world’s top 2% of scientists in their main disciplines for career-long citation impact (Ioannidis, 2022). Tracking millions of scientists worldwide, the study has identified about 195,600 top 2% of scientists, among whom 201 are PolyU academics. The database contains the career-long data updated to end of citation year 2021. The latest dataset is based on the 1 September 2022 snapshot from Scopus.\nRank in PolyU \tName \tScience-metrix Category\tTotal Citations (Career-Long) \t\n9\tProf. Michael Harris BOND\tSocial Psychology\t15,442\t\n12\tProf. Wai Ting Eric NGAI\tArtificial Intelligence &\nImage Processing\t13,940\t\n100 \tDr Wing Sing Vincent CHO\tEducation \t1,598\t\nIoannidis, J.P.A. (2022) September 2022 data-update for “Updated science-wide author databases of standardized citation indicators”. Mendeley Data, V4. Available at: https://doi.org/10.17632/btchxktzyw.4.",
  "url": "https://www.polyu.edu.hk/mm/about-mm/news-and-events/news/2022/worlds-top-2-scientists-by-citation-2021"
 }
]