[
 {
  "text": "Skip to main content\nStart main content\nHome \nAlumni \nAlumni Sharing \nCecilia CHEUK\nMSc in Clinical Embryology, University of Oxford, 2014\nBSc (Hons) in Medical Laboratory Science, 2013\nBSc (Hons) in Medical Laboratory Science is a course that designed to equip students with scientific, professional skills and a sense of responsibility and belonging to my desire profession. With the work integrated education - the clinical attachment in four major medical laboratory science disciplines provided and supported by the university, I am looking forward to apply knowledge from lectures and put them into practice for developing generic skills that will be useful in my future employment and professional life.\nMedical laboratory technologist is a very meaningful job for me and for the whole health care system. The profession aims at giving good health care services to patients and helping the whole community in the prevention of diseases.\nRosalind LIE\nBSc (Hons) in Medical Laboratory Science, 2010\nAssociate Medical Technologist in Hospital Authority\nApart from excellent lectures given by renowned scientists and practical sessions in a well-equipped laboratory, clinical attachment in both local and mainland China’s hospitals also allowed me to have a better understanding regarding the role and responsibility that a medical technologist should posses. Furthermore, exchange experience in Northern Ireland has broadened my horizons and this is not only useful in my career but also lifelong benefits.\nThanks to my university education, I am able to adapt quickly in work and develop my career. Therefore, studying Medical Laboratory Science is certainly the milestone for you to launch a professional and noble career.\nOscar CHEUNG\nBSc (Hons) in Radiography (Medical Imaging), 2015\nBeing a health care professional had long been my dream and Radiography was a wonderful option for me. The course of BSc (Hons) in Radiography is both very academic and skill-based. It encompasses a wide range of subjects that allowed me to explore scientific knowledge in physics, human biology, statistics, information technology and research skills. Knowledge is usually more theoretical but what made it concrete were the substantial clinical attachments. Not only did they allow me to acquire clinical knowledge from real cases and scenarios, but they also enabled me to gain early exposure to my future working environment. It should also be highlighted that through the attachments in various public hospitals, they enabled me to learn from their different practices and cultures. And, having understood the differences, I could make a wise decision upon my graduation in choosing a hospital as my desirable workplace. Consequently, I was able to adapt very quickly to the Radiology Department at the very beginning of my career. Most importantly, it was also clinical attachments that allowed me to be instantly granted a professional recognition upon graduation.\n",
  "url": "https://www.polyu.edu.hk/hti/alumni/alumni-sharing"
 },
 {
  "text": "The Outstanding Alumni Award of PolyU Department of Health Technology and Informatics aims to give public recognition to the outstanding graduates for their professional achievements and significant contributions to the community and their alma mater. There are four award categories, namely “Professional Achievement”, “Entrepreneurial Achievement”, “Scholarly Achievement” and “Community Service Achievement”. Selection criteria for each category are listed below.\nAward Category\n\tDescription\t\nProfessional Achievement\n專業成就\n\tThis category recognises alumni who have attained distinguished achievements, demonstrated exemplary leadership and made a strong impact on their profession/ industry/ society.\t\nEntrepreneurial Achievement\n創業/ 工商業成就\n\tThis category recognises alumni who have demonstrated outstanding innovation and entrepreneurship, as well as founded or founded advanced business or technology ventures with social impact.\t\nScholarly Achievement\n學術成就\n\tThis category recognises alumni scholars who have made notable scholarly or research contributions in their disciplines, with proven track record and excellent reputation in the field.\t\nCommunity Service Achievement\n社會服務成就\n\tThis category recognises alumni who have made impactful contributions to the communities, or demonstrated an extraordinary level of commitment, volunteerism and/or philanthropy for promoting the wellbeing of the communities.\t\nSelection is based on the nominee’s accomplishments in his/her personal achievements in the field, contributions to the community, and support and contributions to the Department of Health Technology and Informatics and PolyU.\n(I) Eligibility\nThe nominee must be a bona fide graduate who has successfully completed full-time or part-time programme offered by the Department of Health Technology and Informatics, PolyU (or its forerunner: Hong Kong Polytechnic), which led to an academic award.\nThe nomination can be made by:\nGraduates, Honorary Graduates of Department of Health Technology and Informatics\nUniversity Fellows and PolyU Staffs of Department of Health Technology and Informatics\nCurrent PolyU Council, Court members and current Advisory Committee members of Department of Health Technology and Informatics\nProposers should have obtained nominees’ consent before submitting the nominations. There is no limit to the number of nominations to be submitted by each proposer. However, the proposer cannot be the candidate himself/herself or a direct relative of the candidate.\nThe proposer can submit his/her nomination(s) to the Department of Health Technology and Informatics via email at kayley.fung@polyu.edu.hk with his/her written recommendations and the curriculum vitae of the nominee by 15 Mar 2023.\nDownload Nomination Form HERE .\n(II) Selection Criteria\nOutstanding alumni aged under 40 by the end of the award year can be honoured with the Outstanding Young Alumni Award in the respective category.\nIn addition to the above criteria for the respective award categories which will account for 75% of the scores, a common criterion, “Support and Contribution to PolyU”, will account for 25% of the scores. Regarding “Support and Contribution to PolyU”, it can be in the form of advisory roles in the University/Faculty/Department, support rendered to PolyU’s initiatives including financial/in-kind donation and sponsorship, or leadership and contribution to alumni events and activities.\nOne senior awardee (aged 40 or above by the end of the award year) and one young awardee (aged under 40 by the end of the award year) should normally be identified each year. However, the bestowal of the award shall subject to individual merits of the candidates. No award shall be given in a certain category if no suitable candidate is identified.\n(III) Award Title\nThe awardees will be honoured with:\nAward Title\n\tAwardees \t\nOutstanding Alumni Award in Professional Achievement/ Entrepreneurial Achievement/Scholarly Achievement/ Community Service Achievement of PolyU Department of Health Technology and Informatics\n理大醫療科技及資訊學系傑出校友專業成就/創業成就/學術成就/ 社會服務成就獎\tFor awardees aged 40 or above by the end of the award year. \t\nOutstanding Young Alumni Award in Professional Achievement/ Entrepreneurial Achievement/Scholarly Achievement/ Community Service Achievement of PolyU Department of Health Technology and Informatics\n理大醫療科技及資訊學系青年傑出校友專業成就/創業成就/學術成就/社會服務成就獎\tFor awardees aged under 40 by the end of the award year. \t\n(IV) Schedule\nActivity\n\tConcerned Party \tSchedule \t\nCall for nominations\tDepartment of Health Technology and Informatics, The Hong Kong Polytechnic University \tMid-Feb to Mar 2023\t\nSubmission of nominations(s)\tProposer\tBy 15 Mar 2023\t\nSelection of awardees\tPanel of Judges, Department of Health Technology and Informatics, The Hong Kong Polytechnic University \tApr 2023\t\nResult announcement\tDepartment of Health Technology and Informatics, The Hong Kong Polytechnic University \tBy end of Apr 2023\t\n(V) Enquiry\nFor enquiries, please contact the Department of Health Technology and Informatics of The Hong Kong Polytechnic University at kayley.fung@polyu.edu.hk.",
  "url": "https://www.polyu.edu.hk/hti/alumni/outstanding-alumni-award-of-hti"
 },
 {
  "text": "HTI is the youngest Department in the Faculty of Health and Social Sciences at PolyU. However, it hosts Medical Laboratory Science and Radiography–two well-established healthcare disciplines whose tertiary education has a long history of over 35 years in Hong Kong and was first started by the predecessor of PolyU in 1978. The unique combination of these two healthcare disciplines in one department enables us to share expertise, complement each other and excel in both academic programmes and research.\nWe offers both BSc(Hons) and MSc programmes in these two healthcare disciplines. Working with both our local and overseas collaborating institutes, we are dedicated to inspiring and nurturing our students to achieve academic excellence, and equipping them with professional competence and global perspective. We aspire to produce the best graduates in these two disciplines in Asia and globally.\nResearch underpins teaching and learning. We strive to excel in research in biomedical science, radiation science and medical imaging. We conduct both basic and translational research under five thematic research areas. Our research laboratories are equipped with advanced instruments for high-impact research work. In addition to working with researchers within the University, we also collaborate with top-notch scholars around\nthe globe. We supervise research students by drawing expertise from within and outside the Department as appropriate.\nYou are most welcome to visit our departmental webpages for information related to our academic programmes,\nthematic research areas and the research interests of our academic colleagues.\n\nProfessor YIP, Shea Ping\n\nHead of Department",
  "url": "https://www.polyu.edu.hk/hti/about-hti/message-from-the-head"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \nAlumni \nAlumni Associations \nAlumni Association of Biomedical Science \nNews and Events Join Us Job Hunting Matrix Facebook \nCurrent AABMS Committee:\n18th AABMS Executive Committee (2021/23)\nChairperson:\tLAM Hoi Ching\tZeta \t\nVice-chairperson:\tCHEUNG Lok Yin\tDick\t\nHonorary Treasurer:\tFOK Wan Man\tTeresa\t\nCommittee Members:\tChan Chun Yin \tEric\t\n\tChan Ming Tak \tNooch\t\n\tChan Wing Fai \tWilson\t\n\tLau Chun Yu \tRonald\t\n\tLi Wui Man \tAlvin\t\n\tTsui Fong Wai \tAdam\t\n\tWong Yi Huen \tHelen\t\n\tChan Tin Cheuk \tNono\t\n\nPosting Date\tJob Title\t\nCompany (English)\n\tEmployment Term \tSalary Range \tDetail \t\n09 Dec 2020\tMedical Technologist \tChina Dragon Inspection & Certification (HK) Ltd\tFull-Time\tSalary negotiable\t\t\n09 Dec 2020\tAssociate Medical Technologist (MLT Part I & II)\n\tChina Dragon Inspection & Certification (HK) Ltd\tFull-Time\tSalary negotiable\t\n\t\n\t\t\t\t\t\t\nTel: (852) 2766 5123 Fax: (852) 2764 0326 Email: aabms@polyu.edu.hk\nAddress: M1506a, 15/F, Li Ka Shing Tower, The Hong Kong Polytechnic University, Hung Hom, Kowloon, Hong Kong\nCopyright © 2021 Alumni Association of Biomedical Science of the Hong Kong Polytechnic University. All Rights Reserved\n",
  "url": "https://www.polyu.edu.hk/hti/alumni/alumni-associations/alumni-association-of-biomedical-science"
 },
 {
  "text": "Skip to main content\nStart main content\nHome \nAlumni \nGiving \nGiving\nOur Department would appreciate very much your giving to support the research and development of us and the scholarship for students.\nWays for making donation:\nDownload Donation Forms\nOnline Donation\nTo support our Department by online donation, you may follow the procedures as below:\nSelect your type of donation;\nSelect your donation amount;\nAt purpose of donation, check “Academic Department” and select “Department of Health Technology and Informatics”;\nClick “Next”, and follow next steps.\nShould you have any enquiries regarding donation, please contact Alumni Affair and Development Office.\n",
  "url": "https://www.polyu.edu.hk/hti/alumni/giving"
 },
 {
  "text": "HTI is the youngest Department in the Faculty of Health and Social Science at PolyU. However, it hosts Medical Laboratory Science and Radiography–two well-established healthcare disciplines whose tertiary education has a long history of over 35 years in Hong Kong and was first started by the predecessor of PolyU in 1978. The unique combination of these two healthcare disciplines in one department enables us to share expertise, complement each other and excel in both academic programmes and research.\nWe offers both BSc(Hons) and MSc programmes in these two healthcare disciplines. Working with both our local and overseas collaborating institutes, we are dedicated to inspiring and nurturing our students to achieve academic excellence, and equipping them with professional competence and global perspective. We aspire to produce the best graduates in these two disciplines in Asia and globally. Research underpins teaching and learning. We strive to excel in research in biomedical science, radiation science and medical imaging. We conduct both basic and translational research under five thematic research areas. Our research laboratories are equipped with advanced instruments for high-impact research work. In addition to working with researchers within the University, we also collaborate with top-notch scholars around the globe. We supervise research students by drawing expertise from within and outside the Department as appropriate. You are most welcome to visit our departmental webpages for information related to our academic programmes, thematic research areas and the research interests of our academic colleagues.",
  "url": "https://www.polyu.edu.hk/hti/about-hti/history-of-hti"
 },
 {
  "text": "Home \nAbout HTI \nVision and Missions \nTo compare our present state against our highest aspirations, to look ahead five to 15 years and seek to identify areas—existing and new—where HTI has the opportunity both to improve itself and to lead in teaching and research. \nFor HTI, we are committed \nTo building distinguishing characteristics of our Faculty:\nExceptional faculty; Highly sought-after graduates; Innovative & sophisticated curriculum; Vital community partnership, both locally & globally\nTo addressing the challenges in today's health care and promote excellence in teaching, research and service. More specifically, our missions will be: \nAdvance and preserve knowledge on human health.\nEducate the next generation of allied health professionals—including practicing clinical staff, advance practice staff, faculty and researchers—and the general public.\nProvide service that promotes the health and well-being of diverse individuals, families, communities, populations and systems.\nTo improving the general health and well-being of the public. In pursuit of its goals, the department will be committed to excellence in education of various healthcare disciplines and research. The department is also dedicated to ethical conduct in all its activities. We hold ourselves to the highest standards of ethics, as a beacon for our community and the world. Our department will be home to many of the unique life and health sciences research and teaching programs at PolyU. We will step-up and build into a productive and highly collaborative research community with excellent scientific resources and facilities. \nTo obtaining research achievements that will have tremendous impact on the daily lives of HK and Mainland China citizens, through discoveries and innovations that help patients, and new knowledge that advances our understanding of health sciences at its highest levels.\nValues\nIntegrity ; Diversity ; Excellence ; Collaboration ; Innovation ; Respect\nWe teach and we care. Our vision and strategic priorities will reflect the core values and culture that make us great and unique.",
  "url": "https://www.polyu.edu.hk/hti/about-hti/vision-and-missions"
 },
 {
  "text": "Event Name: ISRRT World Congress 2024\nDate: 6-9 June 2024\nWe are delighted to announce that Dr Vincent Leung has been appointed as the Organising Committee Chairman for the 2024 World Congress of the International Society of Radiographers and Radiological Technologists (ISRRT). Dr Leung, being the chairman of the Hong Kong Association of Radiation Therapists and the Vice-chairman of the Hong Kong Radiographers’ Association, is a distinguished radiation therapist who is widely recognized and has established brilliant industry connections, which are essential for our Radiography degree programme.\nThe ISRRT World Congress is a highly anticipated event in the radiography community, and is a unique opportunity for radiographers and radiation therapists from around the world to share knowledge, exchange ideas, and learn about the latest advances in the field. This prestigious event is expected to draw around 800-1000 radiographers and radiation therapists from all over the world. Dr Leung's appointment is a testament to his exceptional leadership skills and his ability to bring together diverse stakeholders. His vast experience and deep knowledge of the field make him an ideal choice to lead the organising committee for this prestigious event.\nDr Leung will work closely with Dr Helen Law, the Scientific Chair, and Mr Edward Wong, the Organising Committee Co-chair, to ensure that the congress is a resounding success. We are confident that Dr Leung's leadership and industry connections will ensure that the congress is a resounding success. This will enhance the reputation of our Radiography degree programme, and our students will have the opportunity to learn from world leading experts in the field.\n› Details",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2024/6/6-jun-2024"
 },
 {
  "text": "News and Events \nEvents \nVenue\nMichelle, 2/F, Eaton Hong Kong \nSummary\nEvent name: Hong Kong Association of Radiation Therapists Annual Scientific Meeting 2023\nDate: 17 June 2023\nTime: 13:00-19:15\nVenue: Michelle, 2/F, Eaton Hong Kong \nFormat: Hybrid Onsite/ Online format \n› Details",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/6/17-jun-2023"
 },
 {
  "text": "News and Events \nEvents \nVenue\nRoom FJ302, The Hong Kong Polytechnic University \nSummary\nEvent Name: School of Optometry 45th Anniversary Joint Seminar - Primary Care Directory, e-Health and Healthcare Subsidy - 3 Tools to Sculpt Primary Healthcare for Hong Kong\nDate: 13 June 2023 (Tuesday)\nTime: 7:00pm – 8:00pm \nMode: Room FJ302, The Hong Kong Polytechnic University \nRegistration: https://bit.ly/3OoRMkN \n› Poster",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/6/13-jun-2023"
 },
 {
  "text": "News and Events \nEvents \nOrganiser\nDepartment of Health Technology and Informatics\nSummary\nEvent Name: BSc MLS Graduation Ceremony 2022-2023\nDate and time: 2 June 2023 (Fri) 17:30-19:00\nVenue: V322 \nFormat: Face-to-face \nSpeaker: 5:30 pm – 6:00 pm (Reception & Poster exhibition at Block V, 3/F foyer) \n6:00 pm - 7:00 pm (award presentation ceremony at V322)” \n› Details",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/6/02-jun-2023"
 },
 {
  "text": "News and Events \nEvents \nHTI Departmental Retreat\nSymposium \nOrganiser\nDepartment of Health Technology and Informatics\nSummary\nEvent Name: HTI Departmental Retreat\nDate and time: 31 May 2023 (Wednesday) 9:00-17:30",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/5/31-may-2023"
 },
 {
  "text": "Taking Students Under Our Wing \n~ Academic Advising at HTI ~\nAcademic advising is a process through which students will be guided, supported, encouraged and empowered to make informed decisions in accordance to their academic goals and career aspirations. We aim at providing students with a supportive framework to enhance their learning experience and development during their years of studies at HTI.\nSince 2012/13 academic year, HTI has adopted a policy of allocating each new undergraduate student into a group of six or seven students within their classes to facilitate academic advising. Each group will have an academic advisor (at Instructor level or above) from within the core discipline academic staff body (i.e. from the MLS or RAD team).\nBrief Description of Academic Advising at HTI :\nClick to Download\nList of Affiliated Groups and Advisors :",
  "url": "https://www.polyu.edu.hk/hti/study/teaching-and-learning/undergraduate-studies/academic-advising"
 },
 {
  "text": "PhD programme - 2023/24\nThe Hong Kong Polytechnic University\nDepartment of Health Technology and Informatics\nPhD Opportunities - Applications for PhD studentship start September 1st, 2022\nThe Department of Health Technology and Informatics welcomes applications from high potential candidates with academic excellence, research ability and potential, and good communication, interpersonal and leadership abilities for full-time PhD study in Hong Kong through the Hong Kong PhD Fellowship Scheme (HKPFS) 2023/24.\nThe Hong Kong Polytechnic University\nThe Hong Kong Polytechnic University is a government-funded university in the Hong Kong Special Administrative Region of the People's Republic of China which has a long and proud history of providing internationally competitive professionally oriented education. The University has a strong team of academic staff with solid experience in supervising research postgraduate students, many of whom are internationally leading experts in their research areas.\nDepartment of Health Technology and Informatics\nThe Department of Health Technology and Informatics is comprised of Medical Laboratory Science and Radiography – two well-established healthcare disciplines whose tertiary education has a long history of over 40 years in Hong Kong. The unique combination of these two healthcare disciplines in one department enables us to share expertise, complement each other and excel in both academic programmes and research.\nWe strive to excel in research in biomedical science, radiation science and medical imaging. We conduct both basic and translational research under five thematic areas:\nCancer\nHaemodynamic and Vascular Disorders\nImmunity and Infection\nMetabolic and Ocular Disorders\nNeuroimaging and Neuropathology\nOur research laboratories are equipped with advanced instruments for high-impact research work. In addition to working with researchers within the University, we also collaborate with top-notch scholars around the globe. We supervise research students by drawing expertise from within and outside the Department as appropriate.\nOur PhD programme aims to provide rigorous training to students who aspire to become researchers or scholars capable of conducting independent and original research, and producing research findings that are relevant and significant to their chosen field of specialisation. The graduates will be equipped with the knowledge, skills and abilities necessary to perform investigative work of substance with rigour and wit.\nApplication Method\nApplicants seeking admission to the PhD programme should identify and make contact with their intended PhD supervisors in the Department before submission of their applications via the HKPFS 2023/24. Information on the academic staff and research areas of the Department can be accessed via www.polyu.edu.hk/hti/en/staff/academic-staff and www.polyu.edu.hk/hti/en/research/research-areas respectively.\nPlease make an initial application online through the HKPFS Electronic System at www.rgc.edu.hk/hkphd to obtain an HKPFS Reference prior to submitting a full application directly to the University’s electronic system at https://www38.polyu.edu.hk/eAdmission/index.do. The application deadline will be announced in due course.\nPlease note that applicants applying for admission to the University through HKPFS will be considered concurrently for the Postgraduate Studentship awarded by the Department.\nFurther Information\nDepartment Website: www.polyu.edu.hk/hti\nUniversity Website: www.polyu.edu.hk\neProspectus: www51.polyu.edu.hk/eprospectus/rpg\neAdmission: www38.polyu.edu.hk/eAdmission/index.do\nEnquiries: hti.rpgs@polyu.edu.hk",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/research-postgraduate-studies/research-postgraduate-programme"
 },
 {
  "text": "Organiser\nEvent Name: Seminar - “From Small Molecules to Gene Therapy - the Growing Arsenal to Tackle the Unmet\nMedical Needs of Patients with Rare Genetic Diseases” by Prof. Kent Lai\nDate and time: 25 May 2023 (Thursday) 14:00-15:00\nVenue: Y908 \nFormat: Hybrid ",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/5/25-may-2023-2"
 },
 {
  "text": "Title \tAuthors\t\nIdentification of the WNT7B gene provides insights into the mechanism underlying myopia development. Nat Commun 2015; 6: 6689.\nREAD MORE...\n\t\nMiyake M, Yamashiro K, Tabara Y, Suda K, Morooka S, Nakanishi H, Khor CC, Chen P, Qiao F, Nakata I, Akagi-Kurashige Y, Gotoh N, Tsujikawa A, the Nagahama Study Group, Meguro A, Kusuhara S, Polasek O, Hayward C, Wright AF, Campbell H, Richardson AJ, Schache M, Takeuchi M, Mackey DA, Hewitt AW, Cuellar G, Shi Y, Huang L, Yang Z, Leung KH, Kao PY, Yap MK, Yip SP, Moriyama M, Ohno-Matsui K, Mizuki N, MacGregor S, Vitart V, Saw SM, Tai ES, Wong TY, Cheng CY, Baird PN, Yamada R, Matsuda F, Yoshimura N\n\t\nGenetic susceptibility to refractive error: association of vasoactive intestinal peptide receptor 2 (VIPR2) with high myopia in Chinese. PLoS One 2013; 8: e61805\nREAD MORE...\n\t\nYiu WC, Fung WY, Ng PW, Yap MK, Yip SP\nUnacylated ghrelin restores insulin and autophagic signaling in skeletal muscle of diabetic mice. Pflugers Arch 2015; 467: 2555-69.\nREAD MORE...\nTam BT, Pei XM, Yung BY, Yip SP, Lawrence WC Chan, Wong CS, Siu PM\nAutophagic adaptation is associated with exercise-induced fibre-type shifting in skeletal muscle. Acta Physiol 2015; 214: 221-36.\nREAD MORE...\nTam BT, Pei XM, Yu AP, Sin TK, Leung KK, Au KK, Chong JT, Yung BY, Yip SP, Lawrence WC Chan, Wong CS, Siu PM\nGenetic algorithm supported by graphical processing unit improves the exploration of effective connectivity in functional brain imaging. Front Comput Neurosci 2015; 9: 50.\nLawrence WC Chan, Pang B, Shyu CR, Chan T, Khong PL\nPubMed-supported clinical term weighting approach for improving inter-patient similarity measure in diagnosis prediction. BMC Med Inform Decis Mak 2015; 15: 43.\nLawrence WC Chan, Liu Y, Chan T, Law HKW, Wong SC, Yeung AP, Lo KF, Yeung SW, Kwok KY, Chan WY, Lau TY, Shyu CR.\nThe cytoprotective role of autophagy in puromycin aminonucleoside treated human podocytes. Biochem Biophys Res Commun 2014; 443: 628–34.\nKang YL, Saleem MA, Chan KW, Yung BY, LAW HKW\nA novel selectable ISL-1 positive progenitor cell reprogrammed to expandable and functional smooth muscle cells. Stem Cells 2016; 34: 1354-68.\nTurner EC, Huang CL (co-first author), Sawhney N, Govindarajan K, Clover AJ, Martin K, Browne TC, Whelan D, Kumar AH, Mackrill JJ, Wang S, Schmeckpeper J, Stocca A, Pierce WG, Leblond AL, Cai L, O'Sullivan DM, Buneker CK, Choi J, MacSharry J, Ikeda Y, Russell SJ, Caplice NM.\nDisabled-2 is required for efficient haemostasis and platelet activation by thrombin in mouse. Arterioscler Thromb Vasc Biol 2014; 34: 2404-12.\nTsai HJ, Huang CL (co-first author), Huang DY, Lin CC, Cooper JA, Cheng JC, and Tseng C-P\nDetection of methicillin-resistant Staphylococcus aureus using a gold nanoparticle-based colourimetric polymerase chain reaction assay. Biosens Bioelectron 2014, 53: 105-11.\nChan WS1, Tang BS, Boost MV, Chow C, Leung PH\nUltrasensitive detection of E. coli O157:H7 with biofunctional magnetic bead concentration via nanoporous membrane based electrochemical immunosensor. Biosens Bioelectron 2013, 41: 532-7\nChan KY, Ye WW, Zhang Y, Xiao LD, Leung PH, Li Y, Yang M\nBacterial internalization, localization and effectors shape the epithelial immune response during Shigella infection. Infect Immun 2015; 83: 3624-37.\nLippmann J, Gwinner F, Rey C, Tamir U, Law HKW, Schwikowski B, Enninga J\nAn upstream truncation of furA-katG operon confer high-level isoniazid resistance in a Mycobacterium tuberculosis clinical isolate with no known resistance associated mutations. Antimicrob Agents Chemother 2014; 58: 6093-100.\nSiu GK, Yam WC, Zhang Y, Kao RY.\nPerformance Evaluation of the Verigene Gram-Positive and Gram-Negative Blood Culture Test for Direct Identification of Bacteria and Their Resistance Determinants from Positive Blood Cultures in Hong Kong. PLoS One 2015; 10: e0139728.\nSiu GK, Chen JH, Ng TK, Lee RA, Fung KS, To SW, Wong KC, Cheung S, Wong IW, Tam MM, Lee SS, Yam WC.",
  "url": "https://www.polyu.edu.hk/hti/research/research-publications"
 },
 {
  "text": "Research \nResearch Seminars \nResearch Seminars\nTo encourage the exchange of ideas between research postgraduate students and researchers, we hold a series of research seminars. ",
  "url": "https://www.polyu.edu.hk/hti/research/research-seminars"
 },
 {
  "text": "Facilities \nTeaching Laboratory \nClinical Radiography Laboratory \nClinical Radiography Laboratory, formerly known as Radiography Clinic, was established in September 1999. It is now a satellite radiography laboratory to support teaching and research in Medical Imaging. It simulates a real clinical environment for learning and is equipped with the latest imaging modalities and equipment; such as state-of-the-art digital radiography system, a computed radiography system, a portable radiography unit, a spot digital mammography unit, special equipment for radiodosimetry and facilities for digital image appreciation. All these imaging modalities are integrated with the Radiological Information System and the Picture Archiving Communication System (PACS).\nClinical Radiography Lab ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/clinical-radiography-laboratory"
 },
 {
  "text": "Facilities \nTeaching Laboratory \nClinical Skills Laboratory \nClinical Skills Laboratory was designed to facilitate clinical and patient care skills under the 4-year professional programme in Radiography (Medical Imaging & Radiation Therapy). The room is equipped with 2 high-fidelity medical simulators (Advanced life support simulators) and numerous manikins to help students to practice their resuscitation and emergency care skills from basic to advanced level. All the simulators and equipment are easily movable thus allowing the room to function individually as a seminar room.\nLearning Aids & Equipment:\n2x Advanced Life Support Simulator\n1x Airway Management Trainer\n1x Resusci Anne (CPR Training with immediate feedback device)\n2x Multi-venous IV Training Arms2x Vital signs monitor\n2x Blood pressure monitor (Manual & Automatic)\n1x Crash Cart (Manual defibrillator and associated adjuncts)\nClinical Skills Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/clinical-skills-laboratory"
 },
 {
  "text": "Facilities \nTeaching Laboratory \nDigital Imaging Laboratory \nThe digital imaging laboratories are well equipped with computer facilities including hardware and software for the teaching of imaging informatics and other imaging-related subjects.\nDigital Imaging Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/digital-imaging-laboratory"
 },
 {
  "text": "Facilities \nTeaching Laboratory \nComputed Radiography Laboratory \nThis laboratory is equipped with the computed radiography machine which provides image manipulation facilities and develops hardcopy of radiographic images.\nComputed Radiography Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/computed-radiography-laboratory"
 },
 {
  "text": "Ultrasound Laboratory \nThis laboratory houses a number of modern ultrasound imaging units for teaching and research.\nUltrasound Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/ultrasound-laboratory"
 },
 {
  "text": "Medical Laboratory Science Teaching Laboratory \nThree teaching laboratories each can accommodate up to 40 students at the same time. One is for the disciplines of Cellular Pathology, and Clinical Chemistry. The other is for the disciplines of Haematology, and Medical Microbiology.\nApart from the instruments in the research laboratory which are also used for teaching, there are other instruments mainly used for teaching in the teaching laboratories e.g. \nTeaching microscope with multiple displays\nStudent microscopes\nTissue processor (Research Laboratory)\nTissue embedder\nCryostat (Research Laboratory)\nMicrotomes\nHaematology analyzers and Haemoglobin analyzer\nBiological safety cabinets\nFume hoods\nCO2 incubators\nO2 incubators\nPlate pouring system\nAutoclaves\nBlood gas analyser\nOsmometer\nElectrolyte Analyzer",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/medical-laboratory-science-teaching-laboratory"
 },
 {
  "text": "Radiodosimetry Laboratory \nThis laboratory is equipped with a modern automatic TLD system for measurement of radiation dose. This equipment is important for teaching, research and personal radiation monitoring services for our students. The laboratory also houses a wide variety of radiation detection instruments, such as GM counters, ionization chamber radiation detectors, gamma and alpha spectrometers which are used for radiation detection and dosimetry experiments.\nRadiodosimetry Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/radiodosimetry-laboratory"
 },
 {
  "text": "Radiotherapy Planning and Treatment Simulation Laboratory \nThe first Virtual Environment in Radiotherapy Training (VERT) in Hong Kong is installed in this laboratory, which provide training of radiotherapy treatment setup and quality assurance. In addition, this lab is equipped with the state-of-the-art radiation therapy treatment planning systems, which has been an essential and important component of teaching and research on radiotherapy planning and dosimetry.",
  "url": "https://www.polyu.edu.hk/hti/facilities/teaching-laboratory/radiotherapy-planning-and-treatment-simulation-laboratory"
 },
 {
  "text": "Research Laboratory \nAdvanced Microscopy Laboratory \nOur Advanced Microscopy Laboratory provides various types of sophisticated microscopic system, fulfilling the demands on difference research activities including fluorescent in-situ hybridization, epitope tagging, fluorescent proteins detection, microscopic manipulation on large specimens and micro-dissecting procedures. Our facility also supports digital slides image capturing which enhances the efficiency on pathological research and teaching workflow.\nMajor Instruments:\nNikon SMZ18 Fluorescent Stereo Microscope\nNikon Eclipse Ni-U Fluorescent Microscope\nNikon Eclipse C1 Confocal Microscope\nLeica LMD7000 Laser Microdissection System\nLeica Aperio CS2/FL Slide Scanner\nAdvanced Microscopy Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/advanced-microscopy-laboratory"
 },
 {
  "text": "Cell and tissue culture are the essential techniques involved in biomedical research activities, which facilitate a variety of studies ranging from drug efficacy test, interaction between pathogen and host, genetic modification analysis, cancer research, cell growth and differentiation, immunology, stem cell biology, neurobiology, and so on. Our facility supports the maintenance and propagation of eukaryotic cells and the real-time fluorescent microscope on cell proliferation imaging is also available.\nMajor Instruments :\nNuaire Class IIA2 Biosafety Cabinet\nSanyo/ ThermoFisher Scientific Water-Jacketed CO2 Incubator\nThermoFisher Scientific Cryo Vessel Locator\nNikon Ts2-FL Fluorescent Phase Contrast Inverted Microscope\nLife Technologies Countess II FL Automated Cell Counter\nLeica DMI 6000/DM IRB/DM IRE2 Cell Culture and Microscopy System\nFluxion BioFlux 1000Z System\nThermoFisher Scientific CryoStar NX70 Cryostat",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/cell-and-tissue-culture-laboratory"
 },
 {
  "text": "Research Laboratory \nBiochemical Analysis Laboratory \nBiochemical analyses play an important role in medical laboratory science. Biomarkers identification provides insight into health status and risk of disease. The department equipped with a wide range of sophisticated instruments encompassing spectrophotometric, electrochemical and chromatographic techniques for the studies on biomarkers in biological specimens including blood plasma, urine and also components in herbal extracts, foods and drugs.\nMajor instruments:\nWaters Millennium HPLC (High Performance Liquid Chromatography) systems with Photodiode array, Fluorescence and Electrochemical Detectors\nBeckman Access II Immunoassay System\nRoche Integra 400 Biochemistry analyzer\nMDS SCIEX 3200 Q TRAP Mass Spectrometer (MS/MS) System\nAgilent 1200 Liquid Chromatography (LC) System\nAgilent 7900 Inductively Coupled Plasma Mass Spectrometer (ICP-MS)\nBruker Daltonics MALDI Biotyper (RUO) MALDI-TOF Mass Spectrometery-Based Microorganism Identification System\nBiochemical Analysis Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/biochemical-analysis-laboratory"
 },
 {
  "text": "Research Laboratory \nGenome Research Laboratory \nGenome research provides insights into genome biology of all organisms including advances in genomic medicine. The scope of studies includes genome structure and function, comparative genomics, molecular evolution, population genetics, epigenomics and systems biology. Our department possesses different cutting-edge next-generation systems to facilitate the high-throughput genomic data demands.\nMajor Instruments :\nIllumina MiSeq System\nOxford Nanopore MinION System\nGenome Research Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/genome-research-laboratory"
 },
 {
  "text": "Flow cytometry is not only applied routinely in the diagnosis of health complications, particularly on hematological disorders, but the technology is also important on basic research for studying extra- and intracellular biomarkers, immunophenotyping, cell cycle, cell viability, apoptosis, autophagy, necroptosis, oncosis, necrosis, etc. An IVD-certified cell analyzer and a research use cell sorter are equipped in the department to facilitate both academic and research activities.\nMajor Instruments :\nBeckman Coulter FC500 Flow Cytometer\nBD FASCAriaIII Flow Cytometer",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/flow-cytometry-laboratory"
 },
 {
  "text": "Research Laboratory \nRadiography Research Laboratory \nTranslational Imaging Laboratory\nThe laboratory is designed to perform radiography research to develop novel translational imaging techniques using in vivo small animal imaging instruments. The laboratory is equipped with various state-of-the-art in vivo imaging systems including intravital microscope, optoacoustic imaging system, x-ray irradiator, and optical/CT imaging system.\nMajor Instruments:\niThera Medical MSOT inVision 128 Vivo Imaging System\nFaxitron Bioptics MultiRad 225 Compact Cabinet X-ray System, Complete with Accessories\nPerkinElmer IVIS Spectrum CT In Vivo Imaging System\nTranslational Imaging Laboratory \nIn Vivo Imaging Laboratory\nIn Vivo Imaging Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/radiography-research-laboratory"
 },
 {
  "text": "Molecular Biology Laboratory \nMolecular technique is one of the most commonly adopted approaches in biomedical research. Studies on the molecular basis of biological activities among bio-molecules in the organisms, organs, tissues, or even in a single cell are facilitated with various techniques: molecular cloning, polymerase chain reaction, electrophoresis, macromolecule blotting and probing, quantitative molecule analysis. Our laboratories are fully furnished with up-to-date equipment specific for the manipulation of nucleic acid and protein molecules.\nMajor Instruments :\nRoche LightCyclers LC480/LC480II/LC96\nApplied Biosystems 7500/ViiA7 Real-time PCR System\nQIAGEN Rotor-Gene Q Real-time PCR System\nBio-Rad QX200 Digital Droplet PCR (ddPCR) System\nApplied Biosystems 3130 Genetic Analyzer\nQIAGEN PyroMark Q24 Integrated Nucleic Acid Processing and DNA Sequencing System\nAgilent 2100 Bioanalyzer\nInvitrogen Qubit2 Fluorometer\nPerkin Elmer Victor3V Multilabel Plate Counter\nThermoFisher Scientific Nanodrop ND1000/ND2000 Spectrophotometer\nBeckman Coulter DU730 Life Science UV/Vis Spectrophotometer\nBio-Rad GelDoc XR+ System\nBio-Rad ChemiDoc MP Integrated Imaging System\nMolecular Biology Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/molecular-biology-laboratory"
 },
 {
  "text": "Translational Research Laboratory \nZebrafish is one of the most important and widely used vertebrate model organisms in biomedical research. With its relatively short generation time, zebrafish is used on the T1 stage of translational studies including disease progression, therapeutic efficiency and other medical treatments. Our department is furnished with a zebrafish housing system, providing a complete experimental environment on zebrafish studies.\nTecniplast ZebTEC Active Blue Stand-Alone Adult Zebrafish System\nSutter Instrument Microinjection System for Zebrafish Studies\nTranslational Research Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/translational-research-laboratory"
 },
 {
  "text": "Ultrasound Laboratory \nThis laboratory houses a number of modern ultrasound imaging units for teaching and research.\nUltrasound Laboratory ",
  "url": "https://www.polyu.edu.hk/hti/facilities/research-laboratory/ultrasound-laboratory"
 },
 {
  "text": "Upcoming Events\n\t\t\nToday\nSeminar\nSymposium\nUniversity Event\nWorkshop\nNo results have been found.",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event"
 },
 {
  "text": "Chairman of Departmental Advisory Committee\nProf. CHAN, H. H. Samuel\t\nDepartmental Academic Advisor\nProf. BRENNAN, Patrick C\t\nProf. McKENNA, Patrick Gerald\t\nAdjunct Associate Professor\nAU, Kam Ming\t\nCHEUNG, Ho Yin Anson\t\nHO, Sin Yee Stella\t\nLAI, Siu Kin\t\nLEUNG, Chi Man Eddie\t\nLEUNG, Yee Fong Vivian\t\nLIT, Man Wai\t\nLIU, Kin Hung Eric\t\nTO, Shing Shun Tony\t\nTONG, Ka Shun Carrison\t\nWU, W. C. Vincent\t\nYAN, Kin Fan Tony\t\nYAU, Chong Yee Miranda\t\nAdjunct Assistant Professor\nCHAN, Chi Kwan Alfred\t\nCHAN, King Kwong\t\nCHEUNG, Lai Yin Andy\t\nCHU, Sin Yee Monica\t\nKWOK, Ping Fai Stephen\t\nLEE, Chi Hang Michael\t\nYIP, Kai Chiu\t\nYUAN, Jing\t\nHonorary Clinical Associate\nCHAN, Ka Wai Rachel\t\nCHAN, Po Ling\t\nCHAN, Wing Wah Anita\t\nCHEUNG, Tai Yin\t\nCHUNG, Chi Kit\t\nKWONG, Hoi Yin\t\nLEE, Tak Wai Alan\t\nLEE, Wai Hang\t\nLEE, Wing Yiu\t\nLIU, Yuen Wai Clarie\t\nNG, Sau Ha\t\nNGAN, So Han\t\nTANG, Pik Kei\t\nTSANG, Wei Chi\t\nTSANG, Wing Wah\t\nWAN, Shiu Bun\t\nWONG, Fei Tsui\t\nWONG, Ka Wai\t\nWONG, Pik Wa Linda\t\nYANG, Zhining",
  "url": "https://www.polyu.edu.hk/hti/people/external-advisors-and-honorary--adjunct-staff"
 },
 {
  "text": "People \nDepartment and Programme Leadership ",
  "url": "https://www.polyu.edu.hk/hti/people/department-and-programme-leadership"
 },
 {
  "text": "HTI in the Media \nDate Headline Media \n20 Dec, 2022\t理大推斷深水埗類鼻疽傳播徑為吸入性感染\tNow TV\t\n4 Jun, 2022\t防疫速遞 : 便攜式新冠抗體檢測儀\tRTHK\t\n26 May, 2022\t理大研便攜式新冠抗體檢測儀 過程6分鐘成本10元 最快2年面世\tHK01\t\n24 May, 2022\tOmicron不斷突變 專家：新變種BA.2.12.1傳播力更強 未見引重症\tHK01\t\n19 Apr, 2022\t防疫速遞 ： 便攜式病毒檢測儀\tRTHK\t\n12 Apr, 2022\t理大研發便攜新冠病毒檢測儀 可實驗室外即時檢測\tNow 新聞\t\n12 Apr, 2022\tCovid Update\tRTHK\t\n12 Apr, 2022\tHong Kong researchers develop device that can detect coronavirus in people and the environment, results ready on the spot in 40 minutes\tSCMP\t\n12 Apr, 2022\tPolyU's mobile Covid test machine gives results in 25 minutes\tThe Standard\t\n12 Apr, 2022\t教育要聞|理大研便攜式新冠檢測儀 即場採樣半小時有結果\t星島網\t",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/hti-in-the-media"
 },
 {
  "text": "People \nResearch Staff \nPostdoctoral Fellow\nResearch / Project Associate\nResearch / Project Assistant",
  "url": "https://www.polyu.edu.hk/hti/people/research-staff"
 },
 {
  "text": "Study \nProgrammes \nProgrammes ",
  "url": "https://www.polyu.edu.hk/hti/study/programmes"
 },
 {
  "text": "Study \nProgrammes \nUndergraduate Programmes \nUndergraduate Programmes ",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list"
 },
 {
  "text": "Study \nTeaching and Learning \nPostgraduate Studies \nResearch Postgraduate Student \nGuidance for Current Research Postgraduate Students \nTo encourage exchange of ideas between research postgraduate students and researchers, HTI holds series of research seminars. ALL full-time research postgraduate students, irrespective of discipline, are required to attend the seminars.\n− Schedule of Research Seminars in HTI\nTo promote the culture of publishing research data, all research postgraduate students has to fulfill the below publication requirement before taking thesis examination.\n− PhD student: At least 1 Journal Paper published or submitted.\n− MPhil student: At least 1 Journal Paper submitted or prepared for submission. \n(This guideline applies to all research postgraduate students admitted on or after 1 September 2010.)\nProgramme Document\nCurrent student profiles",
  "url": "https://www.polyu.edu.hk/hti/study/teaching-and-learning/postgraduate-studies/research-postgraduate-student"
 },
 {
  "text": "Experience and Opportunities \nCareer Opportunities \nDate Position Project Title Supervisor Closing Date \n28 Jan, 2022\tPostdoctoral Fellow / Research Associate / Research Assistant\tIntegrative genome medicine\tProf. Zhang Weixiong\tUntil the positions are filled\t\n28 Jan, 2022\tPostdoctoral Fellow / Research Associate / Research Assistant\tIntegrative genome medicine\tProf. Zhang Weixiong\tUntil the positions are filled\t\n26 Nov, 2021\tResearch Assistant\tArtificial intelligence-assisted CT-to-Perfusion mapping for functional lung avoidance radiation therapy in lung cancer patients\tDr Gary Ren Ge\tUntil the position is filled\t\n23 Sep, 2021\tResearch Assistant\tDevelopment of precision prognostic and diagnostic biomarkers for the personalised treatment and monitoring of COVID\u000219 patients\tDr Chien-Ling Huang\tUntil the positions are filled\t\n5 May, 2021\tResearch Assistant and Part-time Research Assistant\tIntelligent management of chemo-radiotherapy-induced clinical and social effects of locoregionally advanced nasopharyngeal carcinoma cancer patients\tDr Shara LEE\tUntil the positions are filled\t\n4 May, 2021\tProject Assistant\tDevelopment of structured simulation-based online training and assessment platform for radiography students\tDr Shara LEE\tUntil the positions are filled\t\n4 May, 2021\tResearch Associate / Research Assistant\tA low-cost handheld device for decentralized detection of SARS-CoV-2 and host response in COVID-19 patients: development and evaluation\tProf. Shea-ping YIP\tUntil the positions are filled\t\n28 Apr, 2021\tResearch Assistant\tQuantitative four-dimensional magnetic resonance imaging via deep learning and time-resolved magnetic resonance fingerprinting for abdominal radiotherapy\tDr Tian LI\tConsideration of applications will commence on 5 May 2021 until the position is filled\t\n19 Apr, 2021\tResearch Assistant\tBioinformatics and network analysis of sequencing data to identify the genetic variants in patients with chronic myeloid leukaemia\tDr Chien-Ling HUANG\tUntil the position is filled\t\n1 Apr, 2021\tSenior Research Fellow / Senior Project Fellow (Full-time/Half-time/Part-time)\tDeveloping a novel liquid biopsy-based molecular assay for the diagnosis of tuberculosis\tProf. Shea-ping YIP\tUntil the position is filled\t",
  "url": "https://www.polyu.edu.hk/hti/experience-and-opportunities/career-opportunities"
 },
 {
  "text": "Experience and Opportunities \nOpportunities of Research Studies ",
  "url": "https://www.polyu.edu.hk/hti/experience-and-opportunities/opportunities-of-research-studies"
 },
 {
  "text": "Organiser\nDate & Time:\n12 October 2021 (Tuesday) at 8:00 p.m.- 9:00 p.m. - Hong Kong Time \n12 October 2021 (Tuesday) at 7:00 a.m. - 8:00a.m. - Chicago Time \nMode: Online via Zoom\nGuest Speaker: Professor Maryellen Giger \nTopic: Radiomics & Machine Intelligence in Medical Imaging of Breast Cancer and COVID-19\nLanguage: English\n› Poster\n› Details",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2021/10/12-oct-2021?sc_lang=en"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code JS3478 \nFund Type Government-Funded \nCredits Required for Graduation \n125 (plus 10 clinical/field credits)\nProgramme Leaders \nProgramme Leader\nDr Polly Leung\nPhD\nRemarks\nStudents will be awarded the following award upon successful completion of the graduation requirements:\nBSc (Hons) in Medical Laboratory Science\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nMedical laboratory scientists perform laboratory analysis of clinical samples, which aids in disease diagnosis, treatment, risk assessment and the investigation of underlying disease mechanisms.\nThis programme aims to equip graduates to become medical laboratory scientists who practice competently and with integrity. Graduates of the programme posses the knowledge, skills, reasoning abilities and professional attitudes necessary to provide qualified healthcare services to the public.\nProgramme Characteristics\nThis programme is the first full-time government-funded undergraduate programme in medical laboratory science in Hong Kong.\nThe programme curriculum is comprised of university-based education and medical laboratory science-specific subjects, which are integrated with clinical training in medical laboratories in Hong Kong.\nIn order to nurture students’ global perspectives, programme also provides students with the opportunities to engage in overseas exchange activities and undertake clinical attachment at overseas hospital laboratories.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/international-students/bachelor-of-science-honours-in-medical-laboratory-science/"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code JS3478 \nProgramme Intake 60 \nFund Type Government-Funded \nCredits Required for Graduation \n125 (plus 10 clinical/field credits)\nProgramme Leaders \nProgramme Leader\nDr Polly Leung\nPhD\nRemarks\nStudents will be awarded the following award upon successful completion of the graduation requirements:\nBSc (Hons) in Medical Laboratory Science\nAims and Characteristics\nProgramme Aims & Learning Outcomes\nMedical laboratory scientists perform laboratory analysis of clinical samples, which aids in disease diagnosis, treatment, risk assessment and the investigation of underlying disease mechanisms.\nThis programme aims to equip graduates to become medical laboratory scientists who practice competently and with integrity. Graduates of the programme possess the knowledge, skills, reasoning abilities and professional attitudes necessary to provide qualified healthcare services to the public.\nProgramme Characteristics\nThis programme is the first full-time government-funded undergraduate programme in medical laboratory science in Hong Kong.\nThe programme curriculum is comprised of university-based education and medical laboratory science-specific subjects, which are integrated with clinical training in medical laboratories in Hong Kong.\nIn order to nurture students’ global perspectives, programme also provides students with the opportunities to engage in overseas exchange activities and undertake clinical attachment at overseas hospital laboratories.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/jupas-applicants/bachelor-of-science-honours-in-medical-laboratory-science/"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 55005 \nStream Code \nFMM (Full-time)\nPMM (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time) \n3 years (Part-time)\nFund Type Self-Financed \nCredits Required for Graduation \n30\nInitial Registration Credits \nFor local students\n6 (Full-time)\n3 (Part-time)\nFor non-local students\n6 (Full-time)\nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nTuition Fees \nHK$5,500 per credit for local students\nHK$5,700 per credit for non-local students\nProgramme Leaders \nProgramme Leader\nDr Chien-Ling Huang\nPhD, MSc (Research), BSc (MLS)\nDeputy Programme Leader\nMr Kam Ming Au\nMSc (CUHK)\nRemarks\nThis programme is offered within the Postgraduate Scheme in Health Technology.\nWe have a limited quota for admissions. Early applications are strongly encouraged.\nAims and Characteristics\nProgramme Aims\nThis award is offered within the Postgraduate Scheme in Health Technology, which aims to provide professionals in Medical Imaging, Radiotherapy, Medical Laboratory Science, Health Technology, as well as others interested in health technology, with an opportunity to develop advanced levels of knowledge and skills.\nA. Advancement in Knowledge and Skill\n​To develop specialists in their respective professional disciplines to enhance their career paths;\nTo broaden students' exposure to health science and technology to enable them to cope with the ever-changing demands of work; and\nTo provide a laboratory environment for testing problems encountered at work.\nStudents develop intellectually, professionally and personally while advancing their knowledge and skills in Medical Laboratory Science. The specific aims of this award are:\n​To broaden and deepen students' knowledge and expertise in Medical Laboratory Science;\nTo introduce students to advances in selected areas of diagnostic laboratory techniques;\nTo develop in students an integrative and collaborative team approach to the investigation of common diseases;\nTo foster an understanding of the management concepts that are relevant to clinical laboratories; and\nTo develop students' skills in communication, critical analysis and problem solving.\nB. Professional Development\n​To develop students' ability in critical analysis and evaluation in their professional practices;\nTo cultivate within healthcare professionals the qualities and attributes that are expected of them;\nTo acquire a higher level of awareness and reflection within the profession and the healthcare industry to improve the quality of healthcare services; and\nTo develop students' ability to assume a managerial or scientific level of practice.\nC. Evidence-based Practice\n​To equip students with the necessary research skills to enable them to perform evidence-based practice in the delivery of healthcare service.\nD. Personal Development\n​To provide channels for practising professionals to continuously develop themselves while at work; and\nTo allow graduates to develop themselves further after graduation.\nCharacteristics\nOur laboratories are well-equipped to support students in their studies, research and dissertations. Our specialised equipment includes a flow cytometer, cell culture facilities; basic and advanced instruments for molecular biology research (including thermal cyclers, DNA sequencers, real-time PCR systems and an automatic mutation detection system), microplate systems for ELISA work, HPLC, FPLC, LCMSMS, ICPMS, tissue processors, automatic cell analysers, a preparative ultracentrifuge, automated Access Immuno-analyzer and Roche I400 automated analyzer.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/taught-postgraduate-programmes_list/master-of-science-in-medical-laboratory-science/"
 },
 {
  "text": "Entrance Year Sept 2023 \nProgramme Code 55005 \nStream Code \nMSF (Full-time)\nMSP (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time)\n3 years (Part-time)\nFund Type Self-Financed \nCredits Required for Graduation \n30\nInitial Registration Credits \nFor local students\n6 (Full-time)\n3 (Part-time)\nFor non-local students\n6 (Full-time)\nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nTuition Fees \nHK$5,500 per credit for local students\n​HK$5,700 per credit for non-local students\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 4 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the fellowship at any time. In case of any dispute/disagreement, PolyU’s decision is final.\nProgramme Leaders \nProgramme Leader\nProf. Jing CAI\nPhD, DABR, FAAPM\nDeputy Programme Leader\nDr Jung Sun YOO\nPhD, BSc\nRemarks\nThis programme is offered within the Postgraduate Scheme in Health Technology.\nWe have a limited quota for admissions. Early applications are strongly encouraged.\nAims and Characteristics\nProgramme Aims\nThis award is offered within the Postgraduate Scheme in Health Technology, which aims to provide students with a background in physics, engineering and/or health technology, as well as those interested in medical physics, with the opportunity to develop knowledge of and skills in medical physics.\nA. Advancement in Knowledge and Skills\nTo introduce students to core knowledge of medical physics, including radiation therapy, diagnosing imaging, nuclear medicine and radiation safety physics;\nTo expose students to the field of health science and technology;\nTo provide an appropriate learning environment for the exchange of knowledge and ideas between students, teachers and professionals;\nTo equip students with the knowledge of and skills in clinical medical physics necessary to become clinical medical physics professionals; and\nTo help students to develop the critical and analytical abilities and skills needed to pursue further studies and solve challenging clinical problems.\nB. Professional Development\nTo develop students' critical analysis and evaluation ability;\nTo cultivate in students the qualities and attributes that are expected of healthcare professionals;\nTo promote greater awareness and reflection within the profession and the healthcare industry to improve the quality of healthcare services; and\nTo develop students' leadership ability.\nC. Evidence-based Practice\nTo equip students with the necessary research skills to enable them to engage in evidence-based practice regarding the delivery of healthcare services.\nD. Personal Development\nTo allow graduates to develop themselves further after graduation.\nCharacteristics\nThe scope of the programme includes radiation therapy, diagnostic imaging, nuclear medicine and medical health physics, and thus fulfils the educational requirements of a medical physicist. The curriculum is aligned with the international standards of medical physics graduate education. The teaching faculty include a large number of experienced clinical professionals, including clinical medical physicists, oncologists and radiologists. The programme prepares students for careers in clinical medical physics, medical technology research and development, academia, government regulation, the healthcare industry, entrepreneurship, etc.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/taught-postgraduate-programmes_list/master-of-science-in-medical-physics/"
 },
 {
  "text": "Programme Code JS3612 \nProgramme Intake 115 (JUPAS and non-JUPAS) \nFund Type Government-Funded \n115 (plus 26 clinical/field credits)\nDr Helen Law\nPhD (Physiol), MSc (IT Ed), BSc(Physiol), PDDR\nStudents will be awarded the following upon successful completion of the graduation requirements:\nBSc (Hons) in Radiography\nProgramme Aims & Learning Outcomes\nWe provide a challenging and relevant education in radiography that encompasses medical imaging and radiation therapy.\nAn enquiring, analytical and creative approach to learning is encouraged so that students develop the clinical reasoning skills that they need to become competent and responsible professionals.\nOur programme produces ethical and caring practitioners who are keen to pursue professional development and take on wider community responsibilities.\nOur student-centred learning approach encourages independence in learning, enabling our graduates to keep abreast of developments in a dynamic profession.\nProgramme Characteristics\nThis programme comprises academic and clinical components.\n\nCollaborations with universities in the Chinese mainland and overseas provide student exchange opportunities.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/non-jupas-applicants-year-1/bachelor-of-science-honours-in-radiography/"
 },
 {
  "text": "People \nAcademic Staff \nProf. CAI, Jing \nY921 \n+852 3400 8645 \njing.cai@polyu.edu.hk \nDiscipline: Radiography \nPersonal Profile \nEducation and Academic Qualifications\nBachelor of Science, Lanzhou University\nMaster of Science, University of Georgia\nDoctor of Philosophy, University of Virginia\nProfessional Qualifications\nCertificate in Therapeutic Radiologic Physics\nResearch Interests:\nMRI‐guided Radiation Therapy, 4D Imaging and Radiation Therapy, Stereotactic‐Body Radiation Therapy, Radiomics, and Brachytherapy.",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/prof-cai-jing/"
 },
 {
  "text": "Event Name:Outstanding Alumni Award Ceremony 2023”\nDate and time: 25 May 2023 (Thursday) 13:00-14:00\nVenue: Y908 \nFormat: Hybrid \nSummary: 13:00pm – 14:00pm Award Ceremony \n14:00pm – 15:00pm Seminar “From Small Molecules to Gene Therapy - \nthe Growing Arsenal to Tackle the Unmet Medical Needs of Patients with Rare Genetic Diseases”\nby Prof Kent Lai (One of the Awardee)",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/5/25-may-2023?sc_lang=en"
 },
 {
  "text": "People \nResearch Staff \nMs ADESANYA, Adenike E \nEducation and Academic Qualifications\nMSc. Medical and Pharmaceutical Biotechnology (IMC Fachhochschule Krems, University of Applied Sciences)\nBSc. Medical and Pharmaceutical Biotechnology (IMC Fachhochschule Krems, University of Applied Sciences)\nResearch Interests:\nMolecular pathways, gene, somatic and recurrent mutations, and chromosomal aberrations involved in myeloid malignancies",
  "url": "https://www.polyu.edu.hk/hti/people/research-staff/ms-adesanya-adenike-e"
 },
 {
  "text": "Academic Staff \nProf. YIP, Shea-ping \nEducation and Academic Qualifications\nDiploma in Medical Laboratory Science, Hong Kong Polytechnic\nHigher Certificate in Medical Laboratory Technology, University of Hong Kong (Department of Extra-Mural Studies )\nMaster of Philosophy, Hong Kong Polytechnic\nDoctor of Philosophy, University of London\nProfessional Qualifications\nFellow of the Royal Society of Biology\nRegistered medical laboratory Technologist ( Part I )\nResearch Interests\nMolecular genetic analysis of complex diseases (myopia, blood cancers, infectious diseases, etc.)\nMolecular diagnostics",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/prof-yip-shea-ping"
 },
 {
  "text": "Academic Staff \nProf. YING, Tin Cheung Michael \nEducation and Academic Qualifications\nProfessional Diploma in Diagnostic Radiography, Hong Kong Polytechnic\nMaster of Philosophy, The Hong Kong Polytechnic University\nDoctor of Philosophy, The Hong Kong Polytechnic University\nProfessional Qualifications\nFellow of the Hong Kong College of Radiographers and Radiation Therapists\nResearch Interests:\nUltrasound imaging diagnosis and monitoring of thyroid cancer, malignant neck lymph nodes and carotid atherosclerosis",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/prof-ying-michael-tc"
 },
 {
  "text": "Academic Staff \nProf. LEUNG, Hang Mei Polly \nBachelor of Science, The University of New South Wales\nMaster of Philosophy, The University of Hong Kong\nDoctor of Philosophy, The University of Hong Kong\nProfessional Qualifications\nRegistered Medical Laboratory Technologist (Part I)\nResearch Interests:\nMolecular detection of infectious agents\nMicrobial pathogenesis",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-leung-polly-hm"
 },
 {
  "text": "Dr LAW, Ka Wai Helen \nY909 \n+852 3400 8562 \nhelen.law@polyu.edu.hk \nDiscipline: Radiography \nPersonal Profile \nProfessional Diploma in Diagnostic Radiography, Hong Kong Polytechnic\nPostgraduate Certificate in Advanced Educational Studies, University of Hong Kong\nBachelor of Science, The University of British Columbia\nMaster of Science in Information Technology in Education, University of Hong Kong\nDoctor of Philosophy, University of Melbourne\nRegistered Radiographer (Part I)\nImmunology\nInfection (Emerging infectious diseases)\nKidney pathologies\nPancreas imaging\nFlow cytometry and high content imaging",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-law-helen-kw"
 },
 {
  "text": "Ms LEE, Oi Chun Jan \nPgDip (CUHK)\nBSc (PolyU)\nRegistered (Part I ) MLT (HK)\nHigher Dip (PolyU)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/ms-lee-jan-oc"
 },
 {
  "text": "Dr LIN, Liang-ting \nY904 \n+852 3400 8569 \nlt.lin@polyu.edu.hk \nDiscipline: Radiography \nPersonal Profile \nBachelor of Science, National Yang-Ming University\nDoctor of Philosophy, National Yang-Ming University\nRadiaition-induced long non-coding RNA in epigenetic modification\nCell-to-cell communication via extracellular vesicles (EVs)\nMolecular imaging of biological events",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-lin-liang-ting"
 },
 {
  "text": "Dr LEE, Wee Yee Shara \nY910 \n+852 3400 8592 \nshara.lee@polyu.edu.hk \nDiscipline: Radiography \nPersonal Profile \nBachelor of Science in Radiography, The Hong Kong Polytechnic University\nMaster of Science, The Chinese University of Hong Kong\nDoctor of Philosophy, The Chinese University of Hong Kong\nResuscitation Medicine\nObstetric Anaesthesia\nPhysiological (non-invasive haemodynamic) monitoring\nof non-invasive Intra-operative monitoring & Goal-directed fluid therapy\nVascular imaging & flow assessment using ultrasound",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-lee-shara-wy"
 },
 {
  "text": "Dr HUANG, Chien-ling \nY931 \n+852 3400 8602 \ncl.huang@polyu.edu.hk \nDiscipline: Medical Laboratory Science \nBachelor of Science, Chang Gung University\nMaster of Science, Chang Gung University\nDoctor of Science, Chang Gung University\nLicense of Medical Examiner\nHaematology & Molecular diagnostics: non-coding RNAs in blood malignancy; high-throughput sequencing (i.e. scRNA-seq and clinical WGS)\nStem cell technology & Gene regulation: stem cell differentiation and reprogramming; gene regulation in complex diseases (i.e. vascular disease and myopia)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-huang-chien-ling"
 },
 {
  "text": "Dr CHAN, Wing Chi Lawrence \nY907 \n+852 3400 8561 \nwing.chi.chan@polyu.edu.hk \nBachelor of Engineering, The University of Hong Kong\nDoctor of Philosophy, The University of Hong Kong\nBioinformatics, imaging informatics and clinical decision support",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-chan-lawrence-wc"
 },
 {
  "text": "Dr YOO, Jung Sun \nY905 \n+852 3400 8654 \njungsun.yoo@polyu.edu.hk \nBachelor of Science, Seoul National University\nDoctor of Philosophy, Seoul National University\nSeoul Science Fellowship\nMember for the Korean Physical Society\nMember for World Molecular Imaging Society\nFluorescence molecular imaging\nMultimodality imaging\nIntraoperative/Intravital imaging\nNanomedicine\nArtificial Intelligence in biomedical imaging",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-yoo-jung-sun"
 },
 {
  "text": "Prof. ZHANG, Weixiong \nProf. ZHANG, Weixiong\nChair Professor in Bioinformatics and Integrative Genomics, Hong Kong Global STEM Scholar \n講座教授 : 章偉雄教授\nY922 \n+852 3400 8567 \nweixiong.zhang@polyu.edu.hk \nDiscipline: Medical Laboratory Science \nDoctor of Philosophy, University of California, Los Angeles\nMaster of Science of Computer Science, University of California, Los Angeles\nBachelor of Engineering, Tsinghua University\nGenetics/Genomics: Genetic architectures underlying complex traits and diseases\nNoncoding RNA: Biogenesis and function of (small) noncoding transcripts\nMedical imaging: Segmentation of tumor and organs at risk\nDisease study: Etiology and biomarker (e.g., cancer, neuronal and psychiatric disorders)\nBig data analytics: Novel algorithms for massive (biological) data analysis\nArtificial intelligence: Heuristic search, constraint satisfaction, and combinatorial optimization",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/prof-zhang-weixiong"
 },
 {
  "text": "Prof. ZOU, Xiang \nY926 \n+852 3400 8574 \nxiang.y.zou@polyu.edu.hk \nDiscipline: Medical Laboratory Science \nPhD (Uppsala University)\nMMed (Chinese Academy of Preventive Medicine)\nBSc (Nankai University)\nMast cell biology\nFc-gamma receptors\nallergy\nvaccination",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-zou-xiang"
 },
 {
  "text": "Dr CHENG, King Yip Kenneth \nY948 \n+852 3400 8912 \nkenneth.ky.cheng@polyu.edu.hk \nDiscipline: Medical Laboratory Science \nBachelor of Science in Biochemistry, Hong Kong University of Science and Technology\nDoctor of Philosophy, The University of Hong Kong\nObesity and its related metabolic disorders including diabetes and cardiovascular diseases\nMechanism underlying insulin action and secretion\nAdipose tissue and metabolic health",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-cheng-kenneth-ky"
 },
 {
  "text": "Dr MA, Chun Hang Alvin \nY928 \n+852 3400 8913 \nalvin.ma@polyu.edu.hk \nDoctor of Philosophy, The University of Hong Kong\nHematology: basic and translational research areas including gene regulation in normal vertebrate hematopoiesis, molecular basis of human blood diseases\nZebrafish Disease Modeling: develop zebrafish (Danio rerio) into a comprehensive in vivo modeling platform for translational medicine, from functional evaluation of disease-related genes to large-scale chemical screening for novel therapeutic agents",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-ma-alvin-ch"
 },
 {
  "text": "Dr SIU, Kit Hang Gilman \nY930 \n+852 3400 8598 \ngilman.siu@polyu.edu.hk \nBachelor of Science in Biomedical Science, The Hong Kong Polytechnic University\nRegistered Medical Laboratory Technologist (Part I)\nMember of Society of Biology\nInternational Technologist in Molecular Biology\nDevelopment of molecular assays for diagnosis of infectious disease\nMolecular epidemiology, virulence and drug resistance mechanisms of Mycobacterium tuberculosis",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-siu-gilman-kh"
 },
 {
  "text": "Dr JIN, Ling Nathanael \nBiography\nDr. Jin has been working actively in the inter-disciplinary research fields between environmental chemistry, toxicology, and microbiology. His ongoing research includes air pollution and human health, airborne and foodborne transmission of antimicrobial resistance and pathogens, and pollution-induced immunosuppression in marine megafauna. His development of novel passive sampling and bioanalytical tools to assess combined effects of chemical mixtures in dugongs and marine turtles won him Society of Environmental Toxicology and Chemistry/Procter & Gamble Global Doctoral Fellowship for Environmental Research in 2014. His recent work on mixture toxicity assessment of airborne fine particulate matter attracted the attention from Nature, where he contributed an invited comment on global disparities of air-pollution health effects. His study on airborne transmission of antibiotic resistance genes was recognized as one of the best papers in Environmental Science and Technology Letters in 2018. Jin was an Editorial Board Member of Environmental Toxicology and Chemistry. He is currently an Editorial Board Member of ACS Environmental Au and The Innovation. He also serves as a Guest Editor for Environmental Science and Technology for the special issue on urban air pollution and human health.\nBachelor of Science, City University of Hong Kong\nMaster of Philosophy, City University of Hong Kong\nDoctor of Philosophy, The University of Queensland\nEnvironmental health, Air pollution, Antimicrobial resistance, Environmental microbiome, Ecotoxicology",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-jin-ling"
 },
 {
  "text": "Dr TSE, Kai Hei Franki \nY949 \n+852 3400 8565 \nkh-franki.tse@polyu.edu.hk \nBachelor of Science, The Hong Kong Polytechnic University\nMaster of Research, The University of Manchester\nLicentiate of Medicine, Umea University\nDoctor of Philosophy, The Chinese University of Hong Kong\nRegistered Medical Laboratory Technologist (Part II)\nFellow of the Institute of Biomedical Science\nNeuropathology\nOligodendrocytes\nAge-related myelin degradation\nDNA damage and repair in myelinating cells",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-tse-franki-kh"
 },
 {
  "text": "Dr WONG, Chi Ming \nY945 \n+852 3400 8564 \nchi-ming.cm.wong@polyu.edu.hk \nBachelor of Science in Biochemistry, Hong Kong University of Science and Technology\nMaster of Science in Biotechnology, Hong Kong University of Science and Technology\nThe mechanism of action of novel metabolic factors and their roles in the treatment of obesity, diabetes and other related metabolic disorders\nThe mechanism of transcription termination and its link in mRNA surveillance\nThe role of peroxiredoxin in oxidative stress and maintaining genomic stability",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-wong-chi-ming"
 },
 {
  "text": "Dr CAI, Yin David \nY938 \n+852 3400 8653 \ndavid-yin.cai@polyu.edu.hk \nAcademic and Professional Experiences\nPhD (HKU)\nMSc (China Pharmaceutical University)\nBSc (China Pharmaceutical University)\nUnderstanding the energy metabolism and reactive oxygen species signaling in the heart\nThe new biomarker discovery for early detection of diabetic cardiomyopathy using Omics techniques",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-cai-david-yin"
 },
 {
  "text": "Dr CHOW, Wang Ngai Franklin \nPhD (Microbiology), The University of Hong Kon\nMPhil (Reproductive Medicine), The University of Hong Kong\nBSc (Hons) in Biochemistry, The University of Hong Kong\nEmerging infectious diseases\nHost-pathogen interactions\nExtracellular vesicles\nSmall RNA \nPathogen genomics and evolution",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-chow-franklin-wn"
 },
 {
  "text": "Dr LI, Hoi Yee Gloria \nY938 \n+852 3400 8603 \ngloria-hy.li@polyu.edu.hk \nAcademic and Professional Experiences\nPhD (HKU)\nMPhil (HKU)\nBSc (HKU)\nBioinformatics\nGenetics\nIdentification of biomarkers and development of risk prediction algorithms for early diagnosis of diseases\nIdentification of therapeutic targets for intervention of diseases",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-li-hoi-yee"
 },
 {
  "text": "Dr LI, Tian \nPhD (PolyU)\nMSc in Medical Physics (Duke University)\nBSc in Chemical Biology (Peking University)\nMRI and radiation therapy (RT)\nMR Imaging, MR Fingerprinting\n4D Imaging and Motion Management\nImage postprocessing, Radiomics\nAI in imaging, and Image-guided RT",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-li-tian"
 },
 {
  "text": "Dr YEUNG, Ho Yin Martin \nDoctor of Philosophy, The Hong Kong Polytechnic University \nMaster of Science in Biochemical and Biomedical Sciences, The Chinese University of Hong Kong \nBachelor of Science in Biomedical Science, University of Keele, United Kingdom (IBMS accredited degree)\nMedical Laboratory Technologist (MLT) Board Part I Registration, Hong Kong (Reg: MT103057)\nFull Member of the Hong Kong Society of Mass Spectrometry\nAssociate Member of the International Society of Nephrology\nAssociate Member of the Institute of Biomedical Science\nChronic Kidney Disease, Lipotoxicity and Diabetic Nephropathy\nHistopathology, Whole-slide imaging, Digital Pathology, Computational Pathology and Clinical Cancer Diagnostics \nLipidomics and Metabolomics\nArtificial Intelligence\nAchievements, Patents:\nYeung HYM, Wong NNA, Yoo JS, Chan CKR and To KF. US Provisional Patent Application (No. 63/366,019) for \" Systems, methods and workflow for processing whole slide imaging for disease detection\", Filed on 8 June 2022",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-yeung-martin-hy"
 },
 {
  "text": "Dr TAM, Shing Yau Marco \nBachelor of Science in Radiography, The Hong Kong Polytechnic University\nPhD\nTumor microenvironment (Autophagy, Epithelial-mesenchymal transition, Hypoxia, Metastasis, Stemness maintenance)\nColorectal cancer\nPersonalized radiotherapy",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-tam-shing-yau"
 },
 {
  "text": "Dr WU, Ka Lok Kelvin \nPhD (PolyU)\nMPhil (HKU)\nBSc (PolyU)\nImmunometabolism in macrophages, molecular mechanisms of obesity-induced adipose tissue inflammation and its metabolic complications",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/dr-wu-kelvin-kl"
 },
 {
  "text": "Ms LEE, Wai Man Michelle \nMSc (University of Sydney)\nBSc (PolyU)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/ms-lee-michelle-wm"
 },
 {
  "text": "Ms CHEUNG, Sze Man Gisele \nMSc (University of Sydney)\nPgD (PolyU)\nRed Dot Radiographer (Prince of Wale Hospital)\nBSc (PolyU)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/ms-cheung-gisele-sm"
 },
 {
  "text": "Mr POH, Kwun Yin Dave \nMaster of science in health service management (HKPU)\nMaster of science in medical imaging (HKPU)\nProfessional diploma in diagnostic radiography (HKPU)\nRegistered Part I Diagnostic Radiographer (Hong Kong Radiographers Board)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/mr-poh-dave-ky"
 },
 {
  "text": "Dr LEUNG, Wan Shun Vincent \nBachelor of Science in Radiography, The Hong Kong Polytechnic University\nDoctor of Philosophy, The Hong Kong Polytechnic University\nRegistered Radiographer Part I (Category T)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/mr-leung-vincent-ws"
 },
 {
  "text": "Mr WONG, Wui Wing Harry \nMSc (PolyU) \nMRes (Genetics), University of Leicester\nBSc (University of Leicester) \nRegistered (Part I) MLT (HK)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/mr-wong-harry-ww"
 },
 {
  "text": "Ms SO, Kit Ming Moon \nMA (HKBU)\nBA (CUHK)",
  "url": "https://www.polyu.edu.hk/hti/people/academic-staff/ms-so-moon-km"
 },
 {
  "text": "Research Postgraduate Student \nMr ABIL, Olifan Zewdie \nMSc in Medical Microbiology (Addis Ababa University, School of Medicine)\nBSc in Medical Laboratory Technology (Jimma University, College of Medical and Health Science)\nAntimicrobial resistance pathogens, vaccination and Molecular Epidemiology of infectious disease",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-abil-olifan-zewdie"
 },
 {
  "text": "Research Postgraduate Student \nMiss AMOANING, Regina Elorm \nBSc in Medical Laboratory Science (University of Cape Coast, Ghana)\nMy research interests lie in the use of genetics, genomics and molecular techniques to find solutions to complex diseases/traits such as myopia.",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-amoaning-regina-elorm"
 },
 {
  "text": "Research Postgraduate Student \nMr BIMEREW, Lealem Gedefaw \nMSc in Clinical Laboratory Sciences specialty in Hematology and Immunohematology (Jimma University)\nBSc in Medical Laboratory Sciences (Hawassa University)\nBlood Cancer, Functional role of platelets, Infectious Diseases, Nutritional Anemia",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-bimerew-lealem-gedefaw"
 },
 {
  "text": "Miss CHAN, Ka Ying \nMSc in Microbiological and Biochemical Pharmacy (Sun Yat-sen University)\nBSc in Pharmaceutical Sciences (Sun Yat-sen University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-chan-ka-ying"
 },
 {
  "text": "Miss CHEN, XI \nMSc in Food Quality and Safety (Huazhong Agricultural University) \nBSc in Food Science (Beijing Technology and Business University)\nMechanisms and metabolic pathway of chronic diseases like obesity via metabonomics",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-chen-xi"
 },
 {
  "text": "Mr CHEN, Zhi \nMSc in Biomedical Engineering (Fudan University) \nBSc in Physics (Fudan University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-chen-zhi"
 },
 {
  "text": "Mr CHENG, Wai Yeung \nMRes in Biomedical Science (University of Glasgow, UK)\nBSc in Biological Science (University of Georgia, USA)\nNeuropathology, Alzheimer’s disease, Myelination, DNA damage",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-cheng-wai-yeung"
 },
 {
  "text": "Atrial fibrillation: Epidemiology, prognosis;\nRegenerative medicine and tissue engineering;\nNon-invasive assessment of cardiovascular systems, such as vascular ultrasound, CT scan and MRI;\nNon-invasive ultrasound evaluation of vascular endothelial function and circulating endothelial progenitor cells in patients with liver cancer;\nSpot tracking strain technology for ultrasound evaluation of dilated cardiomyopathy;",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-cheng-yangyang"
 },
 {
  "text": "Miss CHEUNG, Hoi Yan \nBSc in Chemistry (The University of Hong Kong) \nHaematology and the molecular basis of human blood diseases, in particular acute myeloid leukemia (AML)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-cheung-hoi-yan"
 },
 {
  "text": "Miss DENG, Chujun \nMSc in Jinan University\nBSc in Foshan University\nClinical research and molecular mechanisms of metabolic diseases",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-deng-chujun"
 },
 {
  "text": "Mr DU, Heng \nMSc (Shanghai Jiao Tong University)\nBSc (Shanghai Jiao Tong University)\nCerebral vascular disease",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-du-heng"
 },
 {
  "text": "Miss DONG, Yanjing \nMSc in Clinical Medicine (Southern Medical University) \nBSc in Clinical Imaging (Southern Medical University)\nDevelopment of cancer treatment approaches",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-dong-yanjing"
 },
 {
  "text": "Mr ESKEZIA, Zegeye Getaneh \nMSc in Clinical Hematology and Immunohematology \nBSc in Medical laboratory technology\nHematological Malignancies\nGeneration of zebrafish model of hematological malignancies is aiming to establish a comprehensive zebrafish platform for high throughput disease modeling as well as large-scale screening of novel therapeutic agents to achieve translational medicine",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-eskezia-zegeye-getaneh"
 },
 {
  "text": "Miss GANAPATHY, Thashma Pemmanda \nMaster of Technology (Molecular Medicine Centre for Nanoscience and Molecular Medicine) \nBachelor of Engineering, Biotechnology (Visveswaraya Technological University)\nAdipose tissue dysfunction and metabolic disorders in obesity and ageing",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-ganapathy-thashma-pemmanda"
 },
 {
  "text": "Mr GEBRELIBANOS, Daniel Kahase \nMSc in Diagnostic and public health microbiology \nBSc in Medical laboratory technology\nBacterial virulence mechanism, drug resistance, sRNA, Nosocomial infections",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-gebrelibanos-daniel-kahase"
 },
 {
  "text": "Mr HE, Zebang \nMSc in Computer Science (City University of Hong Kong) \nBSc in Computer Science (Central South University)\nDeep Learning application in Radiology Imaging",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-he-zebang"
 },
 {
  "text": "Mr HOQUE, Md Moinul \nMSc in Biomedical Science (Chonnam National University) \nBSc in Biotechnology and Genetic Engineering (Khulna University)\nRNA Therapeutics in Non-Alcoholic Fatty Liver Disease (NAFLD)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-hoque-md-moinul"
 },
 {
  "text": "Mr HUANG, Yu-hua \nBSc in Nuclear Physics (Beihang University, School of Physics) \nLung function imaging for disease diagnosis and radiation therapy",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-huang-yu-hua"
 },
 {
  "text": "Miss KONG, Mengjie \nMSc in (Guangdong Pharmaceutical University)\nBSc in Clinical Pharmacy (Xuzhou medical University)\nThe role of pancreatic beta cell and adipose tissue dysfunction in metabolic diseases: Molecular Mechanisms & Clinical Investigation",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-kong-mengjie"
 },
 {
  "text": "Miss LAM, Alison Yee Ting \nMSc in Science (University of Toronto) \nBSc in Biochemistry and Cell Biology (Hong Kong University of Science and Technology)\nMycobacterium tuberculosis drug resistance detection; Urban metagenomics",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-lam-yee-ting-alison"
 },
 {
  "text": "Miss LAO, Hiu Yin \nBSc in Biochemistry (Hong Kong University of Science and Technology)\nFast bacterial identification and drug resistance detection by nanopore sequencing",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-lao-hiu-yin"
 },
 {
  "text": "Mr LEUNG, Siu Lun \nBSc in Medical Laboratory Science (The Hong Kong Polytechnic University)\nBioinfomatics in whole genome sequencing ",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-leung-siu-lun"
 },
 {
  "text": "Mr LEE, Lam Kwong \nBSc (Hons) in Medical Laboratory Science (The Hong Kong Polytechnic University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-lee-lam-kwong"
 },
 {
  "text": "Mr LI, Wen \nM.E. in Computer Technology (University of Chinese Academy of Sciences)\nB.S. in Biomedical Engineering (Southwest Medical University)\nDeep learning based MR image synthesis",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-li-wen"
 },
 {
  "text": "Miss LI, Yue \nMSc in Pediatrics(Shanghai Jiao Tong University School of Medicine)\nBSc in Clinical Medicine (Soochow University)\nImmunity, infection, immunodeficiency",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-li-yue"
 },
 {
  "text": "Mr LIU, Chen Yang \nMSc in Medical Physics (Duke Kunshan University)\nBSc in Resources Prospecting Engineering (China University of Geoscience)\nImage-Guided Radiotherapy",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-liu-chenyang"
 },
 {
  "text": "Miss LIU, Anran \nMSc in Xi'an Jiaotong University \nBSc in Harbin Institute of Technology (Weihai)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-liu-anran"
 },
 {
  "text": "Miss LIU, Xian \nMSc in Pharmaceutical Engineering (China Pharmaceutical University)\nBE in Biomedical Science (China Pharmaceutical University)\nSignaling pathways in major cellular processes, Biomarkers with diagnostic and prognostic significance in common cancers, From functional evaluation of disease-related genes to large-scale screening for novel therapeutic agents, Drug Development ",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-liu-xian"
 },
 {
  "text": "Mr LO, Tak Ho \nBSc in Human Nutrition (Ulster University)\nMolecular Genetics and Metabolism",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-lo-tak-ho"
 },
 {
  "text": "Mr LU, Jingzhan \nMSc in Health Data Science (University College London) \nBSc in Medical Informatics (Tzu Chi University)\nBiomedical Data Science; Computational Genetics; Drug Discovery",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-lu-jingzhan"
 },
 {
  "text": "Miss LIU, Pujie \nMSc in Biotechnology (The University of Edinburg) \nBSc in Food science and technology (The northwestern agricultural and forestry University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-liu-pujie"
 },
 {
  "text": "Miss MA, Wai Ting \nMPhil in Cancer Biology (The University of Hong Kong) \nBSc in Biotechnology (The Hong Kong University of Science and Technology)\nNeuroscience, neuropathology, cancer biology",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-ma-wai-ting"
 },
 {
  "text": "Mr MA, Zongrui \nBSc in Engineering Physics (The Hong Kong Polytechnic University) \nRadiomics, big data aynalytics",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-ma-zongrui"
 },
 {
  "text": "Mr MAHANTY, Arpan \nMSc in Pharmaceutics (MS in Pharmaceutics) (China Pharmaceutical University Nanjing, Jiangsu, P. R. China)\nBachelor of Pharmacy (Maulana Abul Kalam Azad University of Technology, Kolkata, West Bengal, India)\nDiploma in Pharmacy (Odisha State Board of Pharmacy, Bhubaneswar, Odisha, India)\nFluorescence molecular imaging, Multimodality imaging, Intraoperative/Intravital imaging, Nanomedicine, Biomedical optics",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-mahanty-arpan"
 },
 {
  "text": "Mr MOLLA, Abiye Tigabu \nMSc in Medical Microbiology (University of Gondar) \nBSc in Medical Laboratory Sciences (University of Gondar)\nMolecular Microbiology, Microbial pathogenesis, Immunology",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-molla-abiye-tigabu"
 },
 {
  "text": "Mr MORILLA, Lordjie Marr Otamias \nMSc in Dentistry - Oral Diagnostic Sciences (Khon Kaen University)\nDoctor of Dental Medicine (University of the Philippines - Manila)\nCancer (Molecular and Genetic Mechanisms; Pathophysiology of Head and Neck Malignancies), Salivaomics, Non-invasive Biomarkers and Disease Pathogenesis of Head and Neck Tumours",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-morilla-lordjie-marr-otamias"
 },
 {
  "text": "Mr NG, Ting Leung Timothy \nMSc in Biotechnology (Hong Kong University of Science and Technology)\nBSc in Biochemistry (Hong Kong University of Science and Technology)\nFast detection of mycobacterium tuberculosis drug resistance with next-generation sequencing and long-read nanopore sequencing.",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-ng-ting-leung-timothy"
 },
 {
  "text": "Mr NI, Yimin \nMSc in Duke University \nBSc in Hunan University\nImage-guided Radiation Therapy (IGRT)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-ni-yimin"
 },
 {
  "text": "Mr NICOL, Alexander James \nMSc in Physics (University of Sussex) (MPhys – integrated masters) \nBSc in Physics (University of Sussex)\nRadiomics, deep learning and medical image analysis",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-nicol-alexander-james"
 },
 {
  "text": "Miss SHAMA \nMSc in Biotechnology (University of Hyderabad)\nBSc (Hons) in Biochemistry (University of Delhi)\nTo understand the metabolic pathways of Type 2 diabetes (T 2D) and obesity",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-shama-shama"
 },
 {
  "text": "Miss SHENG, Jiabao \nMSc in Software Engineering (XinJiang University) \nBSc in Software Engineering (XinJiang University)\nMultimodal Medical Data Analysis",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-sheng-jiabao"
 },
 {
  "text": "Miss SHAO, Huiling \nMSc in Data Mining (Sorbonne University, France)\nBSc in Computer Science (Sorbonne University, France)\nBioinformatics, Big Data for Medical Applications",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-shao-huiling"
 },
 {
  "text": "Mr SONG, Liming \nMSc in Biomedical Engineering (Hebei University of Technology) \nBSc in Biomedical Engineering (Weifang Medical University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-song-liming"
 },
 {
  "text": "Mr SUN, Jiahong \nBsc in Bioinformatics (Southern University of Science and Technology)\nSingle cell sequencing data analysis, Tumor evolution, CRISPR Cas9",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-sun-jiahong"
 },
 {
  "text": "Mr TAM, Chi Wing \nPgD in Public Health (CUHK)\nBSc (Hons) in Radiography (PolyU)\nSupportive care in Radiation Oncology; Health education and promotion in cancer and HIV/AIDS",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-tam-chi-wing"
 },
 {
  "text": "Mr WANG, Weixu \nMSc in Computer Science (Northeastern University) \nBSc in Computer Science (Heilongjiang University of Science and Technology)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-wang-weixu"
 },
 {
  "text": "Mr TENG, Xinzhi \nMSc in Medical Physics (Duke University)\nBSc in Physics (University of Hong Kong)\nRadiation Oncology, Medical Imaging, Radiomics",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-teng-xinzhi"
 },
 {
  "text": "Miss WU, Mengyao \nMSc in The University of Leeds\nBSc in South China Agricultural University\nMechanism of obesity and its related metabolic disorders such as diabetes and cancers",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-wu-mengyao"
 },
 {
  "text": "Miss WU, Yuyao \nMSc in Medical Physics (Duke Kunshan University) \nBSc in Physics (Southern University of Science and Technology)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-wu-yuyao"
 },
 {
  "text": "Miss YANG, Minfeng \nMSc in Biomedical Engineering (The Hong Kong Polytechnic University)\nBSc in Medical Laboratory (Nantong University)\nNon-invasive biomarkers, cancer diagnosis and prognosis, immunology, Glioma",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-yang-minfeng"
 },
 {
  "text": "Mr XU, Xiaofan \nMSc in Animal Nutrition and Feed Science (Huazhong Agricultural University) \nBSc in Biotechnology (Huazhong Agricultural University)\nMetabolic Disease and gut microbiota",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-wu-xiaofan"
 },
 {
  "text": "Mr YAO, Mian Zhi \nBachelor of Applied Microbiology (The Auckland University of Technology)\nMaster of Public Health (HKU)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-yao-mian-zhi"
 },
 {
  "text": "Miss YI, Zhenni \nBSc in Biomedical Science (China Agricultural University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-yi-zhenni"
 },
 {
  "text": "Miss ZHANG, Fei \nMSc in Biostatistics and Data Science (Cornell University) \nBSc in Statistics (The Central South University)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/miss-zhang-fei"
 },
 {
  "text": "Miss YEH, Yu-wen \nMSc in Molecular Biology (National Chung Hsing University)\nBSc in Biotechnology (Chia Nan University)\nMolecular biology, mast cell biology, vaccine development",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-yeh-yu-wen"
 },
 {
  "text": "Mr YEUNG, Hoi Sang \nBSc in Biochemistry (Hong Kong University of Science and Technology)\nNeuroplasticity, neurodegenerative disease, blood brain barrier, myelination",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-yeung-hoi-sang"
 },
 {
  "text": "Miss ZHANG, Shijing \nBSc in Bioinformatics (Southern University of Science and Technology)",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-zhang-shijing"
 },
 {
  "text": "Ms ZHOU, Tongxi \nMSc in Medicinal Chemistry (South-central University for Nationalities) \nBSc in Pharmacy (Jianghan University)\nMechanisms of Traditional Chinese\nMedicine on metabolic disease",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/ms-zhou-tongxi"
 },
 {
  "text": "Mr ZHANG, Jiang \nMSc in Medical Physics (Duke Kunshan University)\nBSc in Physics(Biophysics) (Nanjing University)\nRadiomics, Knowledge-based radiotherapy treatment planning",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-zhang-jiang"
 },
 {
  "text": "Mr ZHU, Jiarui \nMSc in Medical Physics (The Hong Kong Polytechnic University) \nBSc in Biomedical Engineering (Northeastern University)\nMedical Imaging Processing, Computer Vision, Deep learning",
  "url": "https://www.polyu.edu.hk/hti/people/research-postgraduate-student/mr-zhu-jiarui"
 },
 {
  "text": "Programme Code 55005 \nStream Code \nFRM (Full-time)\nPRM (Part-time)\nMode of Study Mixed Mode \nNormal Duration \n1.5 years (Full-time)\n3 years (Part-time)\nFund Type Self-Financed \n30\nInitial Registration Credits \nFor local students\n3 (Part-time)\nFor non-local students\nLocal Application Deadline 30 Apr 2023 \nNon-Local Application Deadline 30 Apr 2023 \nTuition Fees \nHK$5,500 per credit for local students\n​HK$5,700 per credit for non-local students\nTargeted Taught Postgraduate Programmes Fellowships Scheme\nA total of 9 fellowships shall be awarded to local students. Please click here for details.\nPolyU reserves the right to change or withdraw the fellowship at any time. In case of any dispute/disagreement, PolyU’s decision is final.\nDr Lawrence Chan\nPhD\nDeputy Programme Leader\nDr Liang-ting Lin\nThis programme is offered within the Postgraduate Scheme in Health Technology.\nWe have a limited quota for admissions. Early applications are strongly encouraged.\nProgramme Aims\nThis award is offered within the Postgraduate Scheme in Health Technology, which aims to provide professionals in Medical Imaging, Radiotherapy, Medical Laboratory Science, Health Technology, as well as others interested in health technology, with an opportunity to develop advanced levels of knowledge and skills.\nThe award in Medical Imaging and Radiation Science (MIRS) is specially designed for professionals in medical imaging and radiotherapy and has the following aims:\nA. Advancement in Knowledge and Skill\nTo provide professionals in Medical Imaging and Radiotherapy, as well as others interested in health technology, with the opportunity to develop advanced levels of knowledge and skills;\nTo develop specialists in their respective professional disciplines and enhance their career paths;\nTo broaden students' exposure to a wider field of health science and technology to enable them to cope with the ever-changing demands of work;\nTo provide a laboratory environment for testing problems encountered at work;\nTo equip students with an advanced knowledge base in a chosen area of specialisation in medical imaging or radiotherapy to enable them to meet the changing needs of their disciplines and contribute to the development of medical imaging or radiation oncology practice in Hong Kong; and\nTo develop critical and analytical abilities and skills in the areas of specialisation that are relevant to the professional discipline to improve professional competence.\nB. Professional Development\nTo develop students' ability in critical analysis and evaluation in their professional practices;\nTo cultivate within healthcare professionals the qualities and attributes that are expected of them;\nTo acquire a higher level of awareness and reflection within the profession and the healthcare industry to improve the quality of healthcare services; and\nTo develop students' ability to assume a managerial level of practice.\nC. Evidence-based Practice\nTo equip students with the necessary skill in research to enable them to perform evidence-based practice in the delivery of healthcare service and industry.\nD. Personal Development\nTo provide channels through which practising professionals can continuously develop themselves while at work; and\nTo allow graduates to develop themselves further after graduation.\nCharacteristics\nThe Medical Imaging and Radiation Science award offers channels for specialisation and the broadening of knowledge for professionals in medical imaging and radiotherapy. It will appeal to students who are eager to become specialists or managers in their areas of practice. Clinical experience and practice in medical imaging and radiotherapy are integrated into the curriculum to encourage more reflective observation and active experimentation.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/taught-postgraduate-programmes_list/master-of-science-in-medical-imaging-and-radiation-science"
 },
 {
  "text": "Programme Code JS3612 \nFund Type Government-Funded \n115 (plus 26 clinical/field credits)\nDr Helen Law\nPhD (Physiol), MSc (IT Ed), BSc (Physiol), PDDR\nStudents will be awarded the following upon successful completion of the graduation requirements: BSc (Hons) in Radiography\nProgramme Aims & Learning Outcomes\nWe provide a challenging and relevant education in radiography that encompasses medical imaging and radiation therapy.\nAn enquiring, analytical, and creative approach to learning is encouraged to ensure that students develop clinical reasoning skills needed to become competent and responsible professionals.\nOur programme produces ethical and caring practitioners who are keen to pursue professional development and take on wider community responsibilities.\nOur student-centred learning approach encourages independence in learning, enabling our graduates to keep abreast of developments in a dynamic profession.\nProgramme Characteristics\nThis programme comprises academic and clinical components.\nCollaboration with universities in mainland China and overseas provide student exchange opportunities.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/international-students/bachelor-of-science-honours-in-radiography"
 },
 {
  "text": "Programme Code JS3612 \nProgramme Intake 115 \n115 (plus 26 clinical/field credits)\nDr Helen Law\nPhD (Physiol), MSc (IT Ed), BSc (Physiol), PDDR\nStudents will be awarded the following upon successful completion of the graduation requirements:\nBSc (Hons) in Radiography\nWe provide a challenging and relevant education in radiography that encompasses medical imaging and radiation therapy.\nAn enquiring, analytical and creative approach to learning is encouraged so that students develop the clinical reasoning skills that they need to become competent and responsible professionals.\nOur programme produces ethical and caring practitioners who are keen to pursue professional development and take on wider community responsibilities.\nOur student-centred learning approach encourages independence in learning, enabling our graduates to keep abreast of developments in a dynamic profession.\nThis programme comprises academic and clinical components.\nCollaborations with universities in the Chinese mainland and overseas provide student exchange opportunities.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/jupas-applicants/bachelor-of-science-honours-in-radiography"
 },
 {
  "text": "Programme Code JS3478 \nProgramme Intake 60 (JUPAS and non-JUPAS) \n125 (plus 10 clinical/field credits)\nDr Polly Leung\nStudents will be awarded the following award upon successful completion of the graduation requirements: \nBSc (Hons) in Medical Laboratory Science\nMedical laboratory scientists perform laboratory analysis of clinical samples, which aids in disease diagnosis, treatment, risk assessment and the investigation of underlying disease mechanisms.\nThis programme aims to equip graduates to become medical laboratory scientists who practice competently and with integrity. Graduates of the programme possess the knowledge, skills, reasoning abilities and professional attitudes necessary to provide qualified healthcare services to the public.\nThis programme is the first full-time government-funded undergraduate programme in medical laboratory science in Hong Kong.\nThe programme curriculum is comprised of university-based education and medical laboratory science-specific subjects, which are integrated with clinical training in medical laboratories in Hong Kong.\nIn order to nurture students’ global perspectives, programme also provides students with the opportunities to engage in overseas exchange activities and undertake clinical attachment at overseas hospital laboratories.",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/non-jupas-applicants-year-1/bachelor-of-science-honours-in-medical-laboratory-science"
 },
 {
  "text": "Study \nProgrammes \nUndergraduate Programmes \nMainland Students \nBachelor of Science (Honours) in Medical Laboratory Science \nProgramme Code JS3478 \n125 (另加10个clinical/field学分)\n梁杏媚博士\n此组合课程提供以下学位课程： \n医疗化验科学(荣誉)理学士\n选择本课程为第二志愿的申请者，本系不予考虑。\n课程宗旨及学习成果\n本课程旨在培养学生及毕业生成为一名具备专业知识、技能、推理能力和专业态度的医务化验师。医疗化验师对临床样本进行化验分析，有助于疾病诊断、治疗、风险评估和潜在疾病机制的调查。\n课程特色\n这是香港第一个由大学资助委员会资助的全日制医疗化验科学理学士学位课程。\n课程包括大学的基础教育和医疗化验科学相关的科目，并结合临床培训以达致教学目的。\n课程简介\n本课程提供全面的相关训练，使学生具备良好的专业知识、技巧及思考能力，毕业后能成为合资格的医疗化验科学人员。\n毕业生在不同的实验室工作岗位上，尤其在医院病理部化验室，将会面对很多挑战，而他们凭借自己对临床样本的专业精确分析技能，能有效地协助医生对病人作出准确的诊断及适切的治疗。此外，学员完成课程并取得认可资格后，更可进一步深造，从事医疗生物科研工作或攻读与此相关的研究生课程。\nProgramme Leaflet\nEnquiries\nFor further information, please contact:\nFor more details of the programme, please visit Study@PolyU website",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/mainland-students/bachelor-of-science-honours-in-medical-laboratory-science"
 },
 {
  "text": "Undergraduate Programmes \nMainland Students \nBachelor of Science (Honours) in Radiography \nProgramme Code JS3612 \n115 (另加26个clinical/field学分)\n罗嘉慧博士\nPhD (Physiol), MSc (IT Ed), BSc (Physiol), PDDR\n此组合课程提供以下学位课程： \n放射学(荣誉)理学士\n选择本课程为第二志愿的申请者，本系不予考虑。\n申请人需同时递交附加文件。\n课程宗旨及学习成果\n本课程旨在培养优秀的放射学科专才。通过系统的理论学习和实习培训，毕业生不但能开阔视野，并可获得专业知识，更能提升独立思考和分析的能力。\n课程特色\n这是香港唯一一个由大学资助委员会资助的全日制放射学课程，为期四年，包括医疗影像和放射治疗两个专业。学生可于第二年选定其中一个专业。本课程着重医疗资讯和数码影像处理，让学生掌握学科最新的科技发展动态。此外，课程采用「活动式」教学法，学生通过小组研习、工作坊等不同形式，主动学习。\n课程简介\n放射学提供富挑战性的专业培训，内容主要包括医疗影像 (Medical Imaging) 及放射治疗 (Radiation Therapy) 。本课程采用具启发性、分析性及富创意的学习模式，藉以培养学生成为有能力、负责任、具备临床推理技巧的专业人士。修毕课程的学生，将会成为富有专业道德及技能，时刻对人抱有关怀的态度，懂得推动专业发展，以及乐意肩负更大社会责任的专业人士。课程采用以学生为本的教学方法，以训练学生的独立性，使他们在毕业后能应付专业上的各种挑战。\nProgramme Leaflet\nEnquiries\nFor further information, please contact:\nFor more details of the programme, please visit Study@PolyU website",
  "url": "https://www.polyu.edu.hk/hti/study/programmes/undergraduate-programmes_list/mainland-students/bachelor-of-science-honours-in-radiography"
 },
 {
  "text": "Event Name: Medical Laboratory Science Career Talk 2023\nDate and time: 13 May 2023 (Saturday) 14:30 - 16:30\nVenue: Y302\nFormat: Face-to-face\nFee: Free\nSpeaker: Public sector: Mr Watson Wong \n(Department Manager, Department of Pathology, Hong Kong Children’s Hospital)\nPrivate sector: Mr Stephen Yeong” \n(Senior Medical Technologist, Department of Clinical Laboratory, Gleneagles Hospital Hong Kong)\nPostgraduate study: Dr Gilman Siu; \n(Associate Professor, Department of Health Technology and Informatics, \nThe Hong Kong Polytechnic University)\nRegistration link: https://forms.office.com/r/fhLgBDicfk\nRegistration deadline: 11 May 2023",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/5/13may2023-2?sc_lang=en"
 },
 {
  "text": "Event name: Distinguished Guest Lecture Series in Medical Physics - Transfer Learning in EEG-based Brain-Computer Interfaces\nDate: 10 Jan 2023 (Tuesday)\nTime: 9:00AM - 10:00AM \nMode: Online via Zoom \nLanguage: English \n› Poster",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/1/10-jan-2023?sc_lang=en"
 },
 {
  "text": "Event name: “PolyU Info Day for Taught Postgraduate Programmes 2023”\nDate: 7 Jan 2023 (Saturday)\nTime: 1:00pm – 6:00pm \nVenue: Online via Zoom ",
  "url": "https://www.polyu.edu.hk/hti/news-and-events/event/2023/1/07-jan-2023?sc_lang=en"
 }
]